{
    "course_code": "THEA 190",
    "course_title": "Fresh Seminar: Moliere at 400",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Freshmen Seminar - Limited to First Year Students Only)\n\n\nJean-Baptiste Poquelin, aka Molière, was born January 15, 1622, 400 years ago.  Molière was an actor and playwright who transformed the French theatre by borrowing concepts from Italian, commedia dell'arte troupes and breaking down neo-classical genre boundaries.  Molière wrote serious comedies, sometimes in verse, comedy ballets, and short farces. Many of these works seem strangely relevant to our own age despite the four centuries that have passed.\nThis class explores the life and craft of Molière. We will read five of Molière's plays and some work that influenced him. We will read some scenarios of the Italian Comedy that influenced his style and also examine the music of composers Lully and Charpentier who collaborated with Molière, Tirso de Molina who influenced him and Mozart who adapted Don Juan into the opera Don Giovanni. \nPlays we will all read will include: The Flying Doctor, Sganarelle or The Imaginary Cuckold, The Bourgeois Gentleman, School for Wives, Tartuffe, and Don Juan.\nWe will watch the operas Don Giovanni (available through the Emory Library Met on Demand collection) and Molière & Lully's Bourgeois Gentleman (available through Emory Library's medici.tv collection)",
    "course_description": "An introductory seminar on a special topic in theater studies.",
    "prerequisites": null,
    "instructors": "Donald McManus - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Rich Building 201",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 1429, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 1-2:15p, Instructor: D. McManus, Status: Wait List",
    "date_accessed": "2024-03-30"
}