{
    "course_code": "GRAD 700R",
    "course_title": "Interdisciplinary Seminar: Living Through Change",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 8",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-01-10 through 2022-04-25",
    "class_notes": "The Covid pandemic that altered our lives with such astonishing rapidity has confronted us with new challenges both individually and collectively. Even the most fortunate have been faced with anxiety, isolation, precarity, and loss; economic devastation, mass illness, and death have dramatically exposed social, cultural, economic, and political faultlines in the US and in the entire world. These changes helped catalyze new movements for racial and economic justice and raise awareness of the need to address historic legacies of conflict, suffering, trauma, and disenfranchisement even as catastrophic weather events have underlined the urgency of addressing global climate change and its social and political consequences, including mass trauma and displacement.\nInviting students and experts from multiple fields and schools to join in collaborative, interdisciplinary exploration of divergent understandings of change, resilience, conflict, and transformation, this course aims to cultivate our individual and collective resources for creatively engaging the challenges of an era of global change.  Visit this link for more information and application to participate: https://docs.google.com/forms/d/e/1FAIpQLSdAcHQleIXuriNVu-MdxQYitt-lo45pDDSI-6YCifS7GMp1ZA/viewform  \nSponsored by the Center for Faculty Development and Excellence (CFDE):\nhttps://climate.nasa.gov/images-of-change?id=763#763-great-migration%22-back-to-atlanta,-georgia\nPlease direct any questions you have about these courses to Dr. Donna Troka: dtroka@emory.edu",
    "course_description": null,
    "prerequisites": null,
    "instructors": "Elizabeth Goodstein - Primary Instructor",
    "schedule_location": "W 2:30pm-5:30pm in Callaway Center S102",
    "course_resources": null,
    "sections": "Class Nbr: 4519, Section #: 3, Type: SEM, Campus: ATL, Meets: W 2:30-5:30p, Instructor: E. Goodstein, Status: Open",
    "date_accessed": "2024-03-30"
}