{
    "course_code": "AAS 285W",
    "course_title": "Special Topics in African American Studies: Reading Comparatively",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 2",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Same as CPLT 201W 2, REL 270W 1)\n\"The Mystical Poetics of Anarchy\" | Arche: is an Ancient Greek word variously meaning \"beginning,\" \"origin,\"  \"first principle,\" or \"element,\" \"method of government,\" \"empire,\" \"authority,\" and \"command\". In contradistinction, an-archy means \"without\" origin, first principle, authority, government, or command. It is thus no surprise that public discourse and popular culture almost always cast anarchy as an undesireable condition deserving of discipline and punishment. However, what if anarchy is in fact a more fundamental dimension of shared existence and experience? If so, is it perhaps the imposition of any and every arche, that makes coexistence impossible? This course is inspired by mystical writers whose poetic thought bears witness to the anarchic rhythm of existence. These writers also offer us testimony to how we are conditioned to forget and disavow this anarchic potential by the powers that be.\n\n\nIn the wake of racial slavery and colonialism as the ongoing arche, of our modernity, this course will ask: what is the relationship between the disavowal of anarchy and anti-Blackness? How does the modern creation of racialized Blackness function to demonize and police anarchic ways of coexistence? We will thus begin by reading some contemporary figures from the \"Black Radical Mystical Tradition\" (Ashon Crawley) in order to understand how Black mystical poetics are necessary for breaking free from modernity's governing principle and command to reject Blackness.\n\n\nThis approach will then allow us to read some earlier radical Christian European thinkers as supplementary resources for imagining how to break free from our modern arche, by reading them as allegories of anti-/Blackness. Informed by the Black Radical Mystical Tradition, we will contemplate how the poetics of \"becoming nothing\" (Meister Eckhart), \"decreation\" (Simone Weil), and \"suspending the ethical\" (Søren Kierkegaard) can come to reveal anarchy as a more faithful and desireable mode of existence.\n\n\nAll readings will be provided via Canvas; writers will include Meister Eckhart, Søren Kierkegaard, Simone Weil, Reiner Schürmann, Jacques Derrida, Saidiya Hartman, Alexis Pauline Gumbs, Ashon Crawley, and Jayna Brown.\n\n\nParticulars: weekly participation (25%); bi-weekly discussion posts (15%); 5-8pg mid-term essay (25%); 8-10pg final essay (25%) that revises and expands the mid-term essay; ~10min final essay presentation (10%).",
    "course_description": "Wide range of topics pertinent to the African American experience.",
    "prerequisites": null,
    "instructors": "Andrew Kaplan - Primary Instructor",
    "schedule_location": "MWF 11:30am-12:20pm in Rich Building 108",
    "course_resources": null,
    "sections": "Class Nbr: 4716, Section #: 1, Type: LEC, Campus: ATL, Meets: MWF 11:30a-12:20p, Instructor: A. Kaplan, Status: Open",
    "date_accessed": "2024-03-30"
}