{
    "course_code": "AAS 385",
    "course_title": "Topics in Afr American Studies: Mass Incarceration, Policing",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Same as PHIL 385 7 and WGS 385 2)\nThis course offers an introduction and general overview of the history of imprisonment specifically in its relation to the regimes of racial slavery and slavery's afterlife in the United States. It tracks a genealogy of the prison and practices of policing in the present to its historical underpinnings to lynching, the convict labor system, and the reproduction of the plantation system among other formations. While the course is attentive to the sociological literature on mass incarceration past and present, the objective of the course is to think conceptually and historically about the ways in which racial slavery operates as foundational to the systemic and institutionalized forms of inequality in the United States. For example, how might we draw the connections between recent protests against police brutality and extra-judicial practices of anti-black murder with a broader history of slavery and lynching in the US? How might we also consider the racial health inequities presented by the pandemic as a signal of the lack of medical care and clinical services made unavailable to African Americans as a longer extension and historical problematic of slavery and the prison industrial complex?",
    "course_description": "This course explores one of a wide range of topics pertaining to the African American experience in the fields of human and civil rights, social and literary texts, and the social sciences.",
    "prerequisites": null,
    "instructors": "Linette Park - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in Callaway Center S105",
    "course_resources": null,
    "sections": "Class Nbr: 2096, Section #: 2, Type: LEC, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: L. Park, Status: Open",
    "date_accessed": "2024-03-30"
}