{
    "course_code": "REL 354RW",
    "course_title": "Ethics: Human Goodness",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 12Waitlist Total: 0, Auto-Enroll",
    "waitlist_total": ": 0, Auto-Enroll",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2024-05-17 through 2024-06-26",
    "class_notes": "This course satisfies the new Religion major requirement: - Theme.\nOur seminar will explore a single, though not a simple, question:  \nWhat is human goodness?  What sorts of lives are good lives?  How might goodness relate to our flourishing?  \n- Our approach will be broadly philosophical. We will read and discuss together a range of texts as we pursue our questions about goodness, ethics, and forms of life.  Some texts will be philosophical and theological, some biographical, some literary, some filmic.   \n- We will consider philosophical representations of what a good life is and some historical figures who may teach us about how to make a life impactful and positive.  We will also consider practices that can sustain us in leading a good life, as well as ethics and college, ethics and the professions, and ethics in relation to major life experiences.  \nThis is a discussion class: we are in this together.  We learn from one another as well as from our readings, so your attendance and participation are essential to the success of this course and to its learning goals.  We build these conversations together, as an activity in community.",
    "course_description": "Analysis of methods and/or texts pertaining to ethical decision-making for individual and social problems such as race, sex/marriage, justice, war, biomedical technology, and environmental pollution. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Pamela M Hall - Primary Instructor",
    "schedule_location": "MTWThF 10am-11:20am in Callaway S107",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_REL_354RW_1_A24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 1347, Section #: 1, Type: SEM, Campus: ATL, Meets: MTWThF 10-11:20a, Instructor: P. Hall, Status: Open",
    "date_accessed": "2024-03-29"
}