{
    "course_code": "EHS 799R",
    "course_title": "Dissertation Research",
    "credit_hours": "1-9",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Varies by section",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-01-10 through 2022-04-25",
    "class_notes": "EHS PhD students only",
    "course_description": "EHS doctoral students engage in research after entering candidacy; research must contribute to students' overall training and allow them to make progress in the program. Examples of typical student research activities include: writing a dissertation proposal, writing a dissertation chapter, or preparing a grant proposal.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: This section is full 1012, Section #: 1, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: B. Caruso, Status: Closed\nClass Nbr: This section is full 1013, Section #: 10, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. Liang, Status: Closed\nClass Nbr: This section is full 1014, Section #: 11, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Q. Zhang, Status: Closed\nClass Nbr: 1016, Section #: 3, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: T. CLASEN, Status: Open\nClass Nbr: 1017, Section #: 4, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Freeman, Status: Open\nClass Nbr: This section is full 1018, Section #: 5, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Leon, Status: Closed\nClass Nbr: 1019, Section #: 6, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Y. Liu, Status: Open\nClass Nbr: This section is full 1020, Section #: 7, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: B. Lopman, Status: Closed\nClass Nbr: 1021, Section #: 8, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: C. Marsit, Status: Open\nClass Nbr: This section is full 1022, Section #: 9, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: W. Caudle, Status: Closed",
    "date_accessed": "2024-03-30"
}