{
    "course_code": "ENG 210W",
    "course_title": "Topics in Literature: Major Authors: Louisa May Alcott&George Eliot",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 18Waitlist Total: 0, Auto-Enroll",
    "waitlist_total": ": 0, Auto-Enroll",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities and Arts with Cont.Communication(*)",
    "permission": null,
    "dates": "2024-05-17 through 2024-06-26",
    "class_notes": "Title: Major Authors: Louisa May Alcott and George Eliot\nThis course will explore the literary relationship between two of the most famous female authors of the nineteenth century: Louisa May Alcott and George Eliot. As we read through one major novel from each author, Little Women and Middlemarch, we will consider how both contend with historical conditions related to the nineteenth century femininity and female authorship. This exploration will include analysis of their use of the marriage plot, in addition to discussions related to courtship, family, morality, and religion. Further, these readings will be supplemented by other writings by the authors, noting their fluid use of multi-genre writing, including their forays into sensation fiction and poetry. We will ground this entire exploration in critical readings that explore the national differences that produced the authors and texts. Along the way, we will produce a set of discussion posts, close reading analysis, as well as a long-form podcast episode that places the authors, and their texts, in conversation with each other, collapsing the transatlantic divide that has so often kept these two authors separated.\n\n\nThis is an online course. Emory College Online summer courses have required synchronous/live sessions every week. Students must be available to sign into and virtually attend the course online during those times (noted as the course meeting times- all times listed are local to Atlanta). Each course will also involve significant asynchronous material that you access on your own time in addition to standard amounts of readings and course assignments. Students should plan to spend 15-20 hours/week on this course. Please also be aware that faculty will begin corresponding with students during Week Zero of the course (one week before the official start date of the course), and that some interaction with the course may be required at that time. Students should begin checking the Canvas course site regularly one week prior to the official start of the term.",
    "course_description": "An introduction to one or more major authors in English literature, with an emphasis on literary merit and its determination, canon formation, literary movements, and reading strategies.",
    "prerequisites": null,
    "instructors": "Christian Gallichio - Primary Instructor",
    "schedule_location": "TTh 9:45am-11:15am in ONLINE",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ENG_210W_2_A24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 1608, Section #: 2, Type: LEC, Campus: ATL, Meets: TTh 9:45-11:15a, Instructor: C. Gallichio, Status: Open",
    "date_accessed": "2024-03-29"
}