{
    "course_code": "ENG 389W",
    "course_title": "Special Topics:Literature: WhenLess is More:Eng.ShortFic.",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 14Waitlist Total: 0, Auto-Enroll",
    "waitlist_total": ": 0, Auto-Enroll",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2024-07-01 through 2024-08-07",
    "class_notes": "What happens when we look at short stories not as workshops for lengthier accomplishments, but rather as artistic achievements that can only be realized in this economical and exciting form? We will read a few stories by a new writer every day, moving from the turn of the twentieth century to works written in the last few years. As we explore the modernist and contemporary short story in Britain and beyond, we'll keep two objectives in mind: 1) to familiarize ourselves with some of the genre's important critical vocabulary; and 2) to see how modernist and contemporary writers of global English literature stretched the limits of what stories can do, deliberately complicating their epiphanies through abstraction, ambiguity, subversion, and provocation. The stories we read will touch upon the major currents of 20th- and 21st-century history and life, bridging the everyday and the extraordinary. We will read a diverse set of writers, including some (not all) of the following: Thomas Hardy, Oscar Wilde, Katherine Mansfield, Virginia Woolf, James Joyce, E. M. Forster, D. H. Lawrence, Muriel Spark, Alan Sillitoe, Sam Selvon, Angela Carter, Ali Smith, Zadie Smith, Kazuo Ishiguro, Jackie Kay, and Hanif Kureishi.\nThe course will require participation in online class discussions, regular short reflection writing, and a paper that synthesizes the work of several writers we have studied.\n\n\nThis is an online course. Emory College Online summer courses have required synchronous/live sessions every week. Students must be available to sign into and virtually attend the course online during those times (noted as the course meeting times- all times listed are local to Atlanta). Each course will also involve significant asynchronous material that you access on your own time in addition to standard amounts of readings and course assignments. Students should plan to spend 15-20 hours/week on this course. Please also be aware that faculty will begin corresponding with students during Week Zero of the course (one week before the official start date of the course), and that some interaction with the course may be required at that time. Students should begin checking the Canvas course site regularly one week prior to the official start of the term.",
    "course_description": "Literary topics vary. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Erwin Rosinberg - Primary Instructor",
    "schedule_location": "TTh 9:45am-11:15am in ONLINE",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ENG_389W_2_A24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 1616, Section #: 2, Type: LEC, Campus: ATL, Meets: TTh 9:45-11:15a, Instructor: E. Rosinberg, Status: Open",
    "date_accessed": "2024-03-29"
}