{
    "course_code": "DANC 212R",
    "course_title": "Topics in Dance Technique: Javanese Dance",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 12",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Physical Education(*)",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "Javanese Dance is designed to introduce students to the rich traditions of Central Javanese dance practice as well as cultural practices, aesthetics, philosophies and history that surround the tradition. The course will begin with the basic movement vocabulary of Central Javanese dance styles, and proceed to the study of dance repertoire. The course largely focuses on techniques and practice of Javanese court dance repertoires, supplemented with short lectures which will provide the sociocultural, historical and contemporary contexts. Students in the course will perform with live music provided by Emory University¿s Javanese Ensemble at the end of the semester concert. Evaluation will be based on attendance and participation, class journals, midterm on techniques of dance forms and their performance at final concerts. No previous experience in dance required.",
    "course_description": "Students will study a technique dance form learning the basic techniques and style of the form. The material may be further explored through historical, cultural and political perspectives. This course culminates in a performance or lecture demonstration.",
    "prerequisites": null,
    "instructors": "Maho Ishiguro - Primary Instructor",
    "schedule_location": "MW 4pm-5:15pm in Rich Building 117-Dance Studio",
    "course_resources": "https://emory.bncollege.com/course-material/course-finder?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_DANC_212R_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 5384, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 4-5:15p, Instructor: M. Ishiguro, Status: Open",
    "date_accessed": "2024-03-28"
}