{
    "course_code": "CHN 375W",
    "course_title": "Topics in Chinese Studies: Virtue and its Discontents",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 2",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "Atlas description:\nIn this course we will explore the moral universe in traditional (pre-twentieth century) Chinese literature. We will focus on the ways that Confucian virtues are represented in literary, philosophical, and religious texts, including essays, records of conversation, short stories, novels, and plays. We will consider how moral questions and the varied answers offered by Chinese traditions might be relevant to our present lives. The materials we will discuss are organized around major keywords such as ritual, sincerity, filiality, chastity, brotherhood, and transcendence, in the spirit of Raymond Williams' exploration of keywords as sites that engage \"both continuity and discontinuity, and also deep conflicts of value and belief.\" \nThere are no textbooks required for this course. All readings will be available through Course Reserves and/or Canvas. Readings may include selections from Analects, The Orphan of Zhao, The Three Kingdoms, The Investiture of the Gods, Plum in the Golden Vase, and others.\n \nThe course fulfills the GER requirements for continuing writing.",
    "course_description": "Study of Chinese language, literature, thought or culture, alone or in conjunction with other literary or cultural trends. Topics to be announced in advance.",
    "prerequisites": null,
    "instructors": "Maria Franca Sibau - Primary Instructor",
    "schedule_location": "TTh 8:30am-9:45am in Candler Library 124",
    "course_resources": null,
    "sections": "Class Nbr: 1407, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 8:30-9:45a, Instructor: M. Sibau, Status: Open",
    "date_accessed": "2024-03-30"
}