{
    "course_code": "ENGCW 271W",
    "course_title": "Introduction to Poetry Writing",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2023-05-12 through 2023-06-21",
    "class_notes": "Contemporary Lineages\n \nThis class is an opportunity to generate new creative work in a collaborative, critical setting. In order to develop the relationship between creative reading practices and creative writing practices, we will read and discuss books by a number of 20th and 21st century poets whose work will guide our discussion of poetic techniques and aesthetic practices. We will study these poets in order to study our own interests, intentions, and practices as writers. In particular, we will explore and critique the concept of other lineages, of the various micro-traditions and aesthetic affiliations that exist between poets. Students should expect to devote themselves to a practice of reading and writing and be prepared for mature discussions of complex material. We will write new poems in correspondence with the material we read, recite poems, engage with poets' archival materials in Emory's Rose Library, create a poetics statement, and produce chapbooks of our own poetry.\n \nTexts:\nThe Sonnets, Ted Berrigan (Penguin Books, 2000)\nISBN 9780140589276\n \nThe Past, Wendy Xu (Wesleyan University Press, 2021)\nISBN 9780819580467\nBefore Whiteness, D.S. Marriott (City Lights Publishers, 2022)\nISBN 9780872868847\n \nProvided as PDFs: selections from the work of Amiri Baraka, Alice Notley, James Schuyler, and others",
    "course_description": "Every semester. Introductory workshop in poetry writing. Counts as a prerequisite for 300-level intermediate workshops but not for Advanced Fiction, Advanced Poetry, or Advanced Playwriting. May not be repeated for credit.",
    "prerequisites": null,
    "instructors": "Nick Sturm - Primary Instructor",
    "schedule_location": "TTh 9:45am-11:15am in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 1280, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 9:45-11:15a, Instructor: N. Sturm, Status: Wait List",
    "date_accessed": "2024-03-30"
}