{
    "course_code": "ENGCW 272W",
    "course_title": "Introduction to Fiction Writing",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 3Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2023-06-26 through 2023-08-02",
    "class_notes": "Course Description & Learning Objectives\nFor Intro to Fiction Writing, students will be asked to read short stories by writers such as James Baldwin, Grace Paley, Sidonie-Gabrielle Colette, Anton Chekhov and Ernest Hemingway, as well as the seminal book on fiction-writing, The Art of Fiction by John Gardner. Our additional textbook will be Flash Fiction International.\nThere are short writing assignments tied to these readings. Each student in the class will be asked to write two short original works of fiction as well as a handful of flash fiction stories.\nAll student stories will be treated in a workshop setting. The workshop is designed to both acknowledge the positive attributes of a story as well as identify areas of a story that might be improved. A traditional-length short story written for this class should run from 5-12 pages (typed, double-spaced), though said story might also be a little shorter or a little longer. No novel excerpts, please.\nHopefully, by the end of the term, students will wind up with a meaningful understanding of the art of short story writing.\n \nTexts/eBooks\n*The Art of Fiction, by John Gardner (ISBN: 978-0679734031)\n*Flash Fiction International, edited by James Thomas, Robert Shapard and Christopher Merrill (ISBN: 978-0393346077)\n*Additional reading assignments will be posted on Canvas.",
    "course_description": "Every semester. Introductory workshop in fiction writing. Counts as a prerequisite for 300-level intermediate workshops but not for Advanced Fiction, Advanced Poetry, or Advanced Playwriting. May not be repeated for credit.",
    "prerequisites": null,
    "instructors": "Andrew Plattner - Primary Instructor",
    "schedule_location": "TTh 1:15pm-2:45pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 1281, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 1:15-2:45p, Instructor: A. Plattner, Status: Open",
    "date_accessed": "2024-03-30"
}