{
    "course_code": "ENG_OX 185",
    "course_title": "Writing and Inquiry in the Liberal Arts: Human Rights",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 0Waitlist Total: 0 of 6",
    "waitlist_total": ": 0 of 6",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Writing(*)",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Placement Exam Required\n\n\nIn the last 220 years, the Supreme Court has invoked the word \"dignity\" in more than nine hundred opinions, including the landmark 2011 case mandating prison population reduction in California (Brown v Plata). The concept of dignity undergirds mandates to respect people's legal personhood, their equality, their liberty, and their personal integrity. The way we understand human dignity informs how we think about people's fundamental rights: How do we punish people? How do we distribute goods and services? How do we treat those with limited political, cultural, or socioeconomic power? This writing course will examine how human dignity, the fundamental and innate value of a person, is explored in literature, law, and philosophy.",
    "course_description": "Introduction to writing and inquiry in the liberal arts, with attention to variations across disciplines and rhetorical situations. Intensive practice in academic reading, writing, and research. Guidance in writing strategies and processes for diverse purposes and genres. First-year writing requirement.",
    "prerequisites": null,
    "instructors": "Sarah Higinbotham - Primary Instructor",
    "schedule_location": "MW 4pm-5:15pm in Pierce Hall 237",
    "course_resources": null,
    "sections": "Class Nbr: 4355, Section #: 6, Type: LEC, Campus: OXF, Meets: MW 4-5:15p, Instructor: S. Higinbotham, Status: Wait List",
    "date_accessed": "2024-03-30"
}