{
    "course_code": "ENG_OX 185",
    "course_title": "Writing and Inquiry in the Liberal Arts: Writing as Resistance",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 0Waitlist Total: 0 of 6",
    "waitlist_total": ": 0 of 6",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Writing(*)",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Placement exam required\n\n\n\"I write to record what others erase when I speak,\" the poet-activist Gloria Anzaldúa writes. \"I write because I would like to live forever,\" poet Reginald Shepherd writes. Writing \"must also bear witness,\" performance artist Assotto Saint writes. \"It is our duty to share [our] writings with others.\" How have writers thought about their craft as an act of resistance and responsibility?\nTo answer this question, we will examine the connection between writing, inquiry, testimony, and transgression across a range of disciplines, including disciplines in the humanities, social sciences, and natural sciences. Beyond shared readings of texts about writing from authors such as Anzaldúa, Shepherd, and Saint, students will develop meaningful writing projects in collaboration with peers and the instructor. Students will be free to propose research topics based upon their own experiences, passions, ethics, and future aspirations. They will receive guided instruction on pursuing effective independent inquiry and writing on their chosen topics.",
    "course_description": "Introduction to writing and inquiry in the liberal arts, with attention to variations across disciplines and rhetorical situations. Intensive practice in academic reading, writing, and research. Guidance in writing strategies and processes for diverse purposes and genres. First-year writing requirement.",
    "prerequisites": null,
    "instructors": "Eric Solomon - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Seney Hall 209",
    "course_resources": null,
    "sections": "Class Nbr: 4479, Section #: 2, Type: LEC, Campus: OXF, Meets: TTh 10-11:15a, Instructor: E. Solomon, Status: Wait List",
    "date_accessed": "2024-03-30"
}