{
    "course_code": "ENG_OX 185",
    "course_title": "Writing and Inquiry in the Liberal Arts: Resisting the Attention Econ.",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Writing(*)",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Placement Exam Required\n\n\nIf the theme for this course, Amusing Ourselves to Death, captured your attention, then you've just had a lesson in the importance of rhetorical appeals. What does effective communication look like across a range of media platforms? In this first-year writing class, you will bring communication scholar Neil Postman's classic text into conversation with contemporary scholars and thinkers to explore how we use writing to communicate effectively in a world dominated by screen images designed to entertain. You will develop rhetorical awareness and build the skills you need to write and communicate effectively across academic disciplines. Your final researched writing project will invite you to examine how Postman's theories can be applied to today's print and digital landscapes.",
    "course_description": "Introduction to writing and inquiry in the liberal arts, with attention to variations across disciplines and rhetorical situations. Intensive practice in academic reading, writing, and research. Guidance in writing strategies and processes for diverse purposes and genres. First-year writing requirement.",
    "prerequisites": null,
    "instructors": "Stacy A McQuaide - Primary Instructor",
    "schedule_location": "TTh 4pm-5:15pm in Johnson Hall 102",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 4478, Section #: 12, Type: LEC, Campus: OXF, Meets: TTh 4-5:15p, Instructor: S. McQuaide, Status: Closed",
    "date_accessed": "2024-03-30"
}