{
    "course_code": "ENG_OX 389RQW",
    "course_title": "Special Topics In Literature: James Baldwin's America",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 0Waitlist Total: 0 of 6",
    "waitlist_total": ": 0 of 6",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Irregularly",
    "requirement_designation": "HAPW w/Race & Ethnicity Req.",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "\"I love America more than any other country in this world, and, exactly for this reason, I insist on the right to criticize her perpetually.\"  James Baldwin, \"Autobiographical Notes\"            How can the equally indicting and aspirational words of James Baldwin be instructive for our present crises? How can Baldwin's work and guidance shape our own ethical commitments? In this course, we will explore the idea of America through looking back at the writing of James Baldwin. While we will primarily read Baldwin's essays, we will also explore Baldwin's ideas as depicted in poetry, fiction, and drama as well as approach an understanding of Baldwin as a public intellectual and activist through published interviews, speeches, debates, and his frequent appearances on television. Finally, we will explore Baldwin's legacy through the thinkers, writers, and cultural critics who have written about him and the movements that have cited his words and ideas as inspiration. This course fulfills continuing communication, pathways of inquiry, and race and ethnicity requirements.",
    "course_description": "Individual literary topics and problems vary. May be repeated for credit when topic changes.",
    "prerequisites": null,
    "instructors": "Eric Solomon - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Seney Hall 209",
    "course_resources": null,
    "sections": "Class Nbr: 4586, Section #: 1, Type: LEC, Campus: OXF, Meets: TTh 11:30a-12:45p, Instructor: E. Solomon, Status: Wait List",
    "date_accessed": "2024-03-30"
}