{
    "course_code": "ENG_OX 381RW",
    "course_title": "Topics In Women's Literature: Women in the South (WITS)",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 12Waitlist Total: 0 of 6",
    "waitlist_total": ": 0 of 6",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Irregularly",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "In Our South, Jennifer Greeson writes that South is \"a term of the imagination\" that \"points beyond national borders\" (1, 4). Greeson's expansive understanding of the South invites inquiry beyond what or where the South \"is\" to what and for whom it may be \"good for\" (2). This special topics in literature course, Women in the South (WITS), explores the writing of women who have imagined inclusive, diverse, and expansive Souths. Writers studied may include Kate Chopin, Zora Neale Hurston, Carson McCullers, Lillian Smith, Gayl Jones, Alice Walker, Imani Perry, Minnie Bruce Pratt, Jesmyn Ward, Natasha Trethewey, Kacen Callender, and more. Our readings will include both women who were born in the U.S. South and those who participate in an expansive southern imaginary, such as Callender, Toni Morrison, Edwidge Danticat, and more. Additionally, WITS may include film viewings and other multimedia texts.  This course fulfills the continuing communication requirement.",
    "course_description": "Topics and perspectives vary, but may include the political novel or feminist poetics. May be repeated for credit when topic varies. This course will be accepted toward a major or minor in women's studies.",
    "prerequisites": null,
    "instructors": "Eric Solomon - Primary Instructor",
    "schedule_location": "TTh 4pm-5:15pm in Seney Hall 209",
    "course_resources": null,
    "sections": "Class Nbr: 4262, Section #: 1, Type: LEC, Campus: OXF, Meets: TTh 4-5:15p, Instructor: E. Solomon, Status: Open",
    "date_accessed": "2024-03-30"
}