{
    "course_code": "IDS 290R",
    "course_title": "Interdisciplinary Sidecar: Emergency Poetry",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "Meeting Times: Friday, 1:30-4pm on Jan. 27, Feb. 10, Feb. 24, March 24, and April 14. All class meetings at Grady Hospital - room tba. Shuttle leaves main campus at 12:40; returns to main campus at 4:40 each Friday.\nMedical residents speak of the \"hidden curriculum\" of medical school's beyond the physiological and therapeutic knowledge they learn, they also learn how the medical system works - how little time for human connection, compassion, and meaning overworked doctors share with their patients. Poetry, literature, art cultivate a profound encounter with another individual human being in ways that show the importance of community, sharing, love, and vulnerability. We will meet in a series of three-hour sessions (see schedule), each of which will be self-contained. Instructors will bring meaningful works of literature, art and poetry to share and understand, then students will work in small groups to share, discuss, and present their own examples of \"emergency poetry\" - the poetry and other art that they consult when they really need it emotionally and intellectually. The five sessions will take place at Grady; timing of the sessions will be planned around the EUH-Grady shuttle, so that undergraduate students have easy transportation. The final output, beyond the collaboration and community established by the class, will be a collection of poetic, literary, and artistic works that will be available to Grady residents in future years.",
    "course_description": "A side-car course brings together a subset of students from two courses that overlap in methodologies, topics, etc., to create a short interdisciplinary course that runs simultaneously with its two sponsoring courses. One credit, S/U only. Schedule and format arranged by sponsoring professors.",
    "prerequisites": null,
    "instructors": "James O'Shea - Primary Instructor",
    "schedule_location": "F 1:30pm-4pm in Callaway Center S420",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 6333, Section #: 2, Type: SEM, Campus: ATL, Meets: F 1:30-4p, Instructor: Team, Status: Closed",
    "date_accessed": "2024-03-30"
}