{
    "course_code": "IDS 385W",
    "course_title": "Special Topics: Translation: Who, What, How",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Continuing Writing Requirement",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "This seminar examines the realities of translation in multiple settings and contexts. Translation is embedded into our everyday lives, central to newsfeeds, religious texts, politics, Netflix and literature. Often, however, the phenomenon is unremarked, rendered invisible. Yet embedded within it are decisions with cultural, ethical and political ramifications. This course aims to make visible the people, issues and products involved: translators, subtitlers and interpreters; theories, strategies and methodologies; and the written and visual texts they produce. To that end, we will examine the history of translation via the Bible; study current issues in the field; and read work by several translators. Topics to include: translation and gender; bible translation; translation and race; LGBTQ issues in translation; subtitling; translators as social and political actors. Readings span fiction, theory, methodology, history, and journalism. Classes are discussion and workshop based and include translation activities: comparing multiple versions of the same work, translating genre and style, and Oulipo activities. The course is taught in English, with no foreign language proficiency required. As part of the LINC (Learning through Inclusive Collaboration) initiative, IDS 385W will have three shared classes with Prof Jinho Choi's course on Natural Language Processing.",
    "course_description": "Highly focused courses, drawing on multiple disciplines of the humanities and social sciences; may be repeated for credit when topics vary.",
    "prerequisites": null,
    "instructors": "Lisa Dillman - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in Callaway Center S420",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3724, Section #: 2, Type: LEC, Campus: ATL, Meets: MW 10-11:15a, Instructor: L. Dillman, Status: Wait List",
    "date_accessed": "2024-03-30"
}