{
    "course_code": "IDS 385W",
    "course_title": "Special Topics: How We Reconstruct the Past",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Continuing Writing Requirement",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Same as ARTHIST 385W 1)\nHow, and using what evidence, do we reconstruct past events, beliefs, practices, and people? What is the history of how narratives and arguments about the past came to be? How are these narratives communicated to a broad audience? In this course, we will explore answers to these questions through case studies from ancient Egypt. We will discuss how scholars in various disciplines, including those from archaeology, history, art history, anthropology, philology, and biomedicine, have interpreted a variety of evidence to form narratives and arguments.  \n \nWe will explore topics like the famous king Tutankhamun, and popular narratives of his death in a chariot crash, and ask questions of how we got this story of the famous king's death? Why is his cause of death interesting to different disciplines and audiences? What was the historical context that birthed such narratives and what continues to drive them today? By the end of this class, we will be able to critique the different approaches to reconstructing the past, evaluate narratives, and craft our own.",
    "course_description": "Highly focused courses, drawing on multiple disciplines of the humanities and social sciences; may be repeated for credit when topics vary.",
    "prerequisites": null,
    "instructors": "Emily Whitehead - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in Callaway Center S420",
    "course_resources": null,
    "sections": "Class Nbr: 3722, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 1-2:15p, Instructor: E. Whitehead, Status: Open",
    "date_accessed": "2024-03-30"
}