{
    "course_code": "IDS 385W",
    "course_title": "Special Topics: The Poetic Image and its Media",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 19 / Seats Avail: 2Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Continuing Writing Requirement",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "This is a course about images: specifically how poetic images relate to images of other sorts (paintings, photographs, television broadcasts, video game graphics), and how all of these images relate to their own materiality. Broadly concerned with how the text-based nature of the image in poetry might illuminate the text-based conditions of the digital image environment, we will be approaching poetry as one image-making practice among others, and one that is especially well-equipped to reflect upon the ontological ambiguities of images writ large. The fields of art history and media and cultural studies offer particular ways of understanding the materiality of the aesthetic and pop-culture images with which they are concerned from the physical properties of stretched canvas to the evolving hardware of the gaming console. The poetic image, however, has traditionally been conceived as the very antithesis of materiality: an image, summoned by figure and analogy, that takes shape only in the mind of a reader. What is it exactly that poems give us to see? Reading works of 20th- and 21st-century poetry alongside media theory, we will consider a range of efforts (from Apollinaire's early 20th-century concrete poems to Claudia Rankine's intermedial lyric), that bring to light, by verbal-visual means, the ramifications for perception, imagination, the social construction of self, the politics of desire of life in the age of technical images.",
    "course_description": "Highly focused courses, drawing on multiple disciplines of the humanities and social sciences; may be repeated for credit when topics vary.",
    "prerequisites": null,
    "instructors": "Victoria Bergstrom - Primary Instructor",
    "schedule_location": "MW 4pm-5:15pm in Callaway Center C203",
    "course_resources": null,
    "sections": "Class Nbr: 3728, Section #: 4, Type: LEC, Campus: ATL, Meets: MW 4-5:15p, Instructor: V. Bergstrom, Status: Open",
    "date_accessed": "2024-03-30"
}