{
    "course_code": "IDS 290R",
    "course_title": "Interdisciplinary Sidecar: Practices for Self-Exploration",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 11 / Seats Avail: 2",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "Throughout our lives, many of us search for ways to become the best versions of ourselves and to live with authenticity and integrity. To approach this, we engage in philosophical and intellectual conversations, listen and learn from others, and deeply question our nature and values. However, coming into our own self-understanding through these approaches can be difficult. Sometimes academic theories about life's \"big questions\" can be abstract and esoteric, leaving us to wonder: how do I put this into practice? In this one-credit class, we will explore how we command agency through academic, personal, or leisurely pursuits. We will ask questions like: How do we imagine ourselves as individuals? How do we negotiate our individuality while belonging to society and specific communities? Do we have an essential nature as individuals? Or, do we deny ourselves? If we deny ourselves, how? How do daily practices, media, interests, conversations, or people in our lives shape our narrative arcs and life pursuits? This course will combine reading and reaction with embodied practices for self-exploration. Each week, students will have the opportunity to share a practice that has helped them gain self-knowledge or bring their values and practices into alignment.",
    "course_description": "A side-car course brings together a subset of students from two courses that overlap in methodologies, topics, etc., to create a short interdisciplinary course that runs simultaneously with its two sponsoring courses. One credit, S/U only. Schedule and format arranged by sponsoring professors.",
    "prerequisites": null,
    "instructors": "Rose Deighton - Primary Instructor",
    "schedule_location": "F 1pm-2pm in MODERN LANGUAGE_128",
    "course_resources": null,
    "sections": "Class Nbr: 6336, Section #: 4, Type: SEM, Campus: ATL, Meets: F 1-2p, Instructor: Team, Status: Open",
    "date_accessed": "2024-03-30"
}