{
    "course_code": "MESAS 370",
    "course_title": "Special Topics MESAS-300 Level: MedievalEgypt:Hist.Every.Life",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 8 / Seats Avail: 6",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "(Same as JS 371 1, HIST 396 3)\nHistory of Everyday Life This course asks students to imagine a day in the life of a resident in Cairo, one of the greatest political, cultural, and commercial centers of the High Middle Ages. In the absence of a medieval survival guide, this thought experiment requires that we study what at first glance appear to be a set of basic questions: Where do you sleep? What do you eat and how do you get food? How do you make a living? How do you get married? And divorced? Finally, when you want to relax and enjoy yourself, where do you turn for entertainment? It turns out that answering these questions will require a great deal of resourceful, creative, and careful sleuthing using the methods of archaeology, art history, history, and literature. Our class will have both traditional classroom components as well as hands-on experiments with making medieval crafts and food. By combining these experiential approaches with intellectual inquiry, we will open up a larger investigation into the nature of the pre-modern world that will inform our how we think about our own present and future societies.",
    "course_description": "Special topics in Middle Eastern and South Asian Studies, at the 300 level; may be repeated when content varies.",
    "prerequisites": null,
    "instructors": "Craig Perry - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Modern Language 201",
    "course_resources": null,
    "sections": "Class Nbr: 5365, Section #: 6, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: C. Perry, Status: Open",
    "date_accessed": "2024-03-30"
}