{
    "course_code": "MUS 190",
    "course_title": "Fresh Sem: Music: Dance as Cultural Knowledge",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 14 / Seats Avail: 3Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First Year Seminar",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(This course offers students to explore Indonesia's history, politics, religion, and aesthetics through the practice of traditional and contemporary Javanese and Acehnese dance repertoires. No pre-requisite. Possibility for final performance with Emory gamelan ensemble.\nThis course introduces students to the practice of Javanese court dance and Acehnese dance, and cultural studies around these dance traditions. Throughout the semester, students will combine the practice of embodiment, reading literatures and class discussions as a way to examine and contextualize the cultural practice of Javanese and Acehnese dance repertoires. Literatures explored in this course come from dance studies, anthropology, and history, theatre studies, and ethnomusicology. Assignments include journals, dance practice and final performance as part of the Emory Javanese Gamelan ensemble concert.)",
    "course_description": "Fulfills the freshman seminar requirement of the General Education Requirements. A variety of courses covering a wide range of topics in music. Refer to the Music Department website for a listing of classes currently offered.",
    "prerequisites": null,
    "instructors": "Maho Ishiguro - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Rich Building 117-Dance Studio",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_MUS_190_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3272, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 10-11:15a, Instructor: M. Ishiguro, Status: Open",
    "date_accessed": "2024-03-31"
}