{
    "course_code": "MUS 270W",
    "course_title": "Special Topics in Music: Performing Arts and Devotion",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Continuing Communication with Race & Ethnicity(*)",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Can you imagine a church service be the same without music? How would we express our gratitude for our countless blessings without poetry and song? When we dance together as a community, Have you felt your heart beat faster, and your connection to the divine grow closer? Have you ever felt your soul touched by a piece of music? And what does it do to us when our songs are taken away? In this course, we will investigate the diverse meanings and cultural practices of the performing arts in religious contexts and spiritual communities. Focus areas include some of the major religions, such as Islam, Christianity and Hinduism, as well as less widely practiced religions and spiritual practices, including Javanese Kejawen, animism in Central Asia, Haitian vodou ceremonies and Inuit traditions. The interdisciplinary design of this course offers students opportunities to practice and examine the art forms through the lens of performance studies, ethnomusicology, anthropology, dance and religious studies. Students are expected to participate in both hands-on experiential engagement of the art forms as well as intellectual engagement through reading, writing and class discussions. Music Majors: This counts as a Category B or C.",
    "course_description": "Seminar or lecture series of topics in music. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Maho Ishiguro - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Burlington Road Building 108",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_MUS_270W_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: This section is full 5320, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: M. Ishiguro, Status: Closed",
    "date_accessed": "2024-03-31"
}