{
    "course_code": "CPLT 190",
    "course_title": "Fresh Sem: Literature: Nonhuman Flourishing",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Freshmen Seminar - Limited to First Year Students Only)\nThis course forms part of a series of first-year seminar classes that are broadly focused on the theme of human flourishing. In our class, we will focus on the theme of nonhuman flourishing in particular by tracing the historical emergence of the contemporary ecological or environmental movement. We will read some of the most important texts that galvanized this movement from the late nineteenth century to the present including Aldo Leopold's A Sand County Almanac, Rachel Carson's Silent Spring, and selected essays by John Muir and Arne Naess. Students will also have the opportunity to present their own work on current ecological issues in our class.\nOur close reading of these texts will thus broach the following questions in relation to the theme of human flourishing: What place does the nonhuman or \"more-than-human\" world hold in the project of human flourishing? How is the act of flourishing different from the act of living, existing, or surviving? If the term \"flourishing\" is derived from the Latin term flos (\"flower\"), then why is it used to describe what is presumably a specifically human endeavor?\n\n\nTexts:\n- John Muir, Wilderness Essays, rev. ed. (Layton, Utah: Gibbs Smith, 2015), ISBN 978-1423607120;\n- Aldo Leopold, A Sand County Almanac and Sketches Here and There, rev. ed. (New York: Oxford University Press, 2020), ISBN 978-0197500262;\n- Rachel Carson, Silent Spring, rev. ed. (Boston, MA: Mariner Books, 2002), ISBN 978-0618249060;\n- Alan Drengson and Yuichi Inoue (eds.), The Deep Ecology Movement: An Introductory Anthology (Berkeley, CA: North Atlantic Books, 1995), ISBN 978-1556431982;\n- Emma Marris, Wild Souls: Freedom and Flourishing in the Non-Human World (New York: Bloomsbury Publishing, 2021), ISBN 978-1635574944.\n\n\nAssessment:\n- First short essay (2-3 pp, 15%);\n- Second short essay (2-3 pp, 15%);\n- Topic proposal (1-2 pp, 10%);\n- Digital story (2-3 min, 10%);\n- Research essay (6-8 pp, 30%);\n- Attendance and participation (20%).",
    "course_description": "Freshman-only seminar designed to engage students in various aspects of inquiry and research with the close guidance of a faculty member.",
    "prerequisites": null,
    "instructors": "Sean Meighoo - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in Candler Library 212",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2699, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 10-11:15a, Instructor: S. Meighoo, Status: Closed",
    "date_accessed": "2024-03-30"
}