{
    "course_code": "CPLT 301W",
    "course_title": "Methods of Literary Interpretation",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 6",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "\"Américas Queer: Art and Literature\" | This course explores how North and South have understood (and misunderstood) each other on issues relating to gender and sexuality, while it also seeks to give students an introduction to the rich literature and art of Queer Latinx Americans. Particular attention will be paid to how the AIDS crisis of the 1980s brought to light conflicts between sexual identity, and identity politics. While issues of race, class and sexuality impacted Latinx populations in the US, activists and writers in Latin America confronted issues relating to imperialism and sexuality.\n\n\nAuthors include: Mario Bellatin, William Burroughs, Rita Indiana Hernandez, Salvador Novo, Manuel Ramos Otero, Achy Obejas, Nestor Perlongher, Gloria Anzaldua, Cherrie Moraga, Reinaldo Arenas, and others\n\n\nRequirements:: Three short papers, midterm, oral reports.\nGrading: Papers: 15% each \nMidterm: 20%\nWritten Commentaries , 20%, \nAttendance and participation, 15%",
    "course_description": "An introduction to different methods of literary criticism and textual interpretation, applying a variety of theoretical approaches to selected literary texts.  Readings include essays, fiction, poetry, and drama. *Note: This course is non-repeatable.",
    "prerequisites": null,
    "instructors": "Jose Quiroga - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in Callaway Center S109",
    "course_resources": null,
    "sections": "Class Nbr: 2710, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 1-2:15p, Instructor: J. Quiroga, Status: Open",
    "date_accessed": "2024-03-30"
}