{
    "course_code": "CPLT 490",
    "course_title": "Literature Proseminar for Majors",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 9 / Seats Avail: 4",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Same as REL 472 1)\n\"Interpretation Theory: Augustine Unconfessed\" | \"I have become a question to myself,\" confesses Augustine in Book X of The Confessions, following an investigation of the workings of memory and a realization that he has reached the limit of his reflections. Here selfhood is not cognitive, but a lived experience. Augustine's existential perspective comes to the fore in Book X, where, having established the absolute reality of inner experience, Augustine expects from God is an answer to the question, \"Who am I?\"A second prominent instance of \"becoming a question to oneself\" occurs in Book IV, in Augustine's confession of grief following the death of his friend. Here the ethical and political consequences of Augustine's understanding of the order of love with regard to God and the neighbor become legible. This seminar juxtaposes Augustine's introspective philosophy with 20th century philosophies about what it means to be a self and what it means to be a self in relation to the other by Heidegger, Arendt and Levinas. How does \"becoming a question to oneself\" become, under pressure from the other, a putting into question of the self?\n\n\nRequired Texts:\n- Peter Brown, Augustine of Hippo: A Biography (Berkeley: University of California) 978-0-520-22757-6\n- The Confessions of Augustine, trans. Rex Warner (Signet Classics) 978-0-451-53121-6\n- James J. O'Donnell, Augustine: A New Biography (Harper Perennial)\n- Hannah Arendt, The Life of the Mind (Harcourt) 0-15-651992-5\n\n\nRequirements: Two six-to-eight page papers",
    "course_description": "A study of literary works and the literary imagination in their relationships to the social and cultural world in which they function. *Note: This course is non-repeatable.",
    "prerequisites": null,
    "instructors": "Jill Robbins - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Callaway Center S109",
    "course_resources": null,
    "sections": "Class Nbr: 2722, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: J. Robbins, Status: Open",
    "date_accessed": "2024-03-30"
}