{
    "course_code": "CPLT 389W",
    "course_title": "Special Topics: Literature: Histories of the Voice",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 14",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "\"Histories of the Voice\" Our voices are central to our existence: they allow us to communicate and to form communities, to express ourselves in story and song, to inquire and inform. But for being so intimate, our voices also remain strangely outside our conscious control: they break, they falter, they deceive and betray us. How does such a fraught and elusive phenomenon as the voice inform a culture? What can we learn from studying our voices through the lenses of literature and philosophy? How does our relationship to the voice manifest differently across time? These are the questions that will inform this course, which will challenge students to think critically about what the poet Kamau Brathwaite called a history of the voice. Beginning with its representations in myth and oral tradition, our course will examine how the voice has been variously used and understood in the histories of literature, philosophy, music, and media, as well as cultural practices like podcasting and ventriloquism.\n\n\nReadings will include works by writers such as Plato, Ovid, Walter Ong, Jacques Derrida, Fred Moten, Adriana Cavarero, Kamau Brathwaite,",
    "course_description": "Lively topical or theoretical approaches to a given set of literary texts or problems. May be repeated for credit when subject varies. Fulfills the post-freshman writing requirement.",
    "prerequisites": null,
    "instructors": "Andrew Kingston - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Math & Science Center - W307C",
    "course_resources": null,
    "sections": "Class Nbr: 5955, Section #: 2, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: A. Kingston, Status: Open",
    "date_accessed": "2024-03-30"
}