{
    "course_code": "CPLT 751R",
    "course_title": "Spec Topics: Comparative Literature: Primal Scenes: Psychoanalysis",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 4 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Same as FREN 775 1, PSP 789 3)\n\"Primal Scenes: Literature & Psychoanalysis\" | In this course, we shall examine how psychoanalysis both establishes and challenges the boundaries of the human. Beginning with a close reading of Freud's The Interpretation of Dreams, we shall explore how Freud's derives the specificity of the human unconscious (via the complex operations of the dream-work) by turning to literary language, theatrical spaces and events, and technological operations. Throughout the course, we will focus on the Freudian conception of the `primal scene' as a way of examining how psychoanalytic theory challenges traditional conceptions of temporality, repetition, sexuality and desire, writing, mourning, cruelty, and the status of the historical event.\n\n\nTexts: The Interpretation of Dreams (Freud); Freud's case histories (including `Dora,' `The Wolf-Man', `The Rat-Man,' `Little Hans', and `Schreber') Phèdre (Racine); Le Ravissment de Lol V. Stein (Duras); Moderato cantabile (Duras); La Chambre claire (Barthes); Selections from: Combray and A l'ombre des jeunes filles en fleurs (Proust); La Bête humaine (Zola); To the Lighthouse (Woolf) Muriel (dir. Alain Resnais).  Additional readings may include works by: Jacques Derrida, Gilles Deleuze, Avital Ronell, Samuel Weber, Nicolas Abraham and Maria Torok, Hélène Cixous, & Sarah Kofman.",
    "course_description": "This course focuses on a specific body of literary texts, critical approach, or theoretical problem in the area of Comparative Literature.  Students may repeat this course for credit if the subject matter varies.",
    "prerequisites": null,
    "instructors": "Elissa Marder - Primary Instructor",
    "schedule_location": "T 1pm-3:45pm in Callaway Center C202",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3819, Section #: 1, Type: LEC, Campus: ATL, Meets: T 1-3:45p, Instructor: E. Marder, Status: Closed",
    "date_accessed": "2024-03-30"
}