{
    "course_code": "CPLT 752R",
    "course_title": "Studies in History: Thinking Wth Montaigne Córdova",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 4 / Seats Avail: 3Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Same as FREN 780 1, PHIL 525 )\nContent:  Michel de Montaigne (1533-92) has emerged in recent decades as a radical contemporary in ways comparable to the rereading of Descartes in 20th-century phenomenology and French existentialism. This seminar interrogates the reasons and implications of Montaigne's contemporaneity by rereading the Essais (1580-95) in critical dialogue with seminal figures from the history of Western philosophy and theory, such as Plato, Aristotle, Augustine, Bovelles, Descartes, Pascal, Hegel, Nietzsche, Freud, Husserl, Adorno, Heidegger, Foucault, Deleuze, Agamben, Derrida, and Haraway. While studying Montaigne's anachronic place in intellectual history, we will also examine related problems and modes in the visual arts and explore how the unprecedented (anti)philosophical gesture of the Essais resonates with recent posthumanist methods and questions in literature, philosophy, aesthetics, politics, and ecology. *French highly recommended; German desirable.*",
    "course_description": "This course focuses on a specific body of literary texts by taking a historical approach to the study of Comparative Literature.  Students may repeat this course for credit if the subject matter varies.",
    "prerequisites": null,
    "instructors": "Chad Cordova - Primary Instructor",
    "schedule_location": "W 1pm-4pm in Callaway Center C202",
    "course_resources": null,
    "sections": "Class Nbr: 5380, Section #: 2, Type: SEM, Campus: ATL, Meets: W 1-4p, Instructor: C. Cordova, Status: Open",
    "date_accessed": "2024-03-30"
}