{
    "course_code": "CPLT 751R",
    "course_title": "Spec Topics: Comparative Literature: From Simmel to Adorno",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 8 / Seats Avail: 5",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Same as PHIL 789 3)\n\"From Simmel to Adorno\" | During his lifetime, Georg Simmel (1858-1918) was an internationally renowned philosopher. A riveting speaker whose lectures on Kant, Nietzsche, and Schopenhauer helped shape their reception and a prolific, best-selling author who published on everything from metaphysics to fashion to the arts, Simmel was a pioneering cultural theorist whose explorations of unconventional topics-money, space, secrecy, gender, metropolitan life, the aesthetics of the everyday-forged new philosophical possibilities. His innovative, emphatically modernist style of thought was widely influential, and it resonates in the writings of the better-known philosophers and cultural critics who were his students and readers. Yet a century later, his name has been largely erased from our disciplinary narratives, and Simmel is remembered today, if at all, as a sociologist.",
    "course_description": "This course focuses on a specific body of literary texts, critical approach, or theoretical problem in the area of Comparative Literature.  Students may repeat this course for credit if the subject matter varies.",
    "prerequisites": null,
    "instructors": "Geoffrey Bennington - Primary Instructor",
    "schedule_location": "W 1pm-4pm in Woodruff Library 422",
    "course_resources": null,
    "sections": "Class Nbr: 5827, Section #: 3, Type: LEC, Campus: ATL, Meets: W 1-4p, Instructor: Goodstein/Bennington, Status: Open",
    "date_accessed": "2024-03-30"
}