{
    "course_code": "CPLT 751R",
    "course_title": "Spec Topics: Comparative Literature: Surrealism and Psychoanalysis",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 2 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Same as ENG 789 3, PSPS 79 2, and WGS 730R 1)\n(This interdisciplinary seminar will explore literary and pictorial surrealism with particular attention to surrealism's ongoing dialogue with Freudian and Lacanian psychoanalysis in transnational contexts. In addition, the seminar will consider the affinities between the surrealist \"found object\" (l'objet trouvé) and the object relations theory of Melanie Klein and D. W. Winnicott in discerning fantasies of race and gender difference in the surrealist imaginary. Readings and discussions will begin with surrealist manifestoes of the modern interwar period, Salvador Dalí's early dialogue with Jacques Lacan, Georges Bataille's writings for the journal and secret society Acéphale, and particular attention will be devoted to the gender and sexual politics of women's place within and beyond surrealism by examining the feminist writing, visual art, and occult practices of Leonora Carrington, Remedios Varo, Mina Loy, and Ithell Colquhoun. In addition, the seminar will study postcolonial surrealist aesthetics in figures such as Frida Kahlo, Suzanne Cesaire, Alejo Carpentier, and Wifredo Lam as well as contemporary Afrosurrealism.\nWe will explore the archive of the Raymond Danowski Poetry Library and investigate surrealism's migration at mid-century from Europe to London and finally New York City in little magazines such as Minotaure,,VVV, and View, Charles Henri Ford's avant-garde journal of the 1940s.)",
    "course_description": "This course focuses on a specific body of literary texts, critical approach, or theoretical problem in the area of Comparative Literature.  Students may repeat this course for credit if the subject matter varies.",
    "prerequisites": null,
    "instructors": "Walter Kalaidjian - Primary Instructor",
    "schedule_location": "W 1pm-4pm in Callaway Center C201",
    "course_resources": null,
    "sections": "Class Nbr: 4388, Section #: 2, Type: LEC, Campus: ATL, Meets: W 1-4p, Instructor: W. Kalaidjian, Status: Open",
    "date_accessed": "2024-03-30"
}