{
    "course_code": "ENGCW 190",
    "course_title": "Freshman Seminar:Creative Writing: Writing in the Garden",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 14 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "NO APPLICATION REQUIRED\n\n\nComplete course atlas information (including texts and grading) available at http://creativewriting.emory.edu/home/academics/spring-2022-course-atlas.html\n\n\nThe title of this course is literal. We will frequently gather outside, and course requirements will include an hour of work each month in Emory's Educational Gardens. (No prior experience is necessary and the nature of the work will be adaptable/accessible to all.) We will additionally welcome guest lecturers from various disciplines, attend events during Jamaica Kincaid's visit to campus on February 10, and make excursions to sites beyond Emory to explore their gardens and histories. Throughout, students will collect language and compose observations drawn from their reading and experiences in an informal notebook, which they will make use of when completing weekly writing assignments. These assignments will periodically be shared and discussed in class, and students will be expected to offer one another insightful, generative feedback. As the semester approaches its culmination, students will each choose a short excerpt from our reading to appear in one of Emory's garden sites, and then write an essay reflecting upon that choice.",
    "course_description": "Topics/genres vary. Emphasizes writing and reading as elements in intellectual exploration. Does not satisfy first-year writing requirement.",
    "prerequisites": null,
    "instructors": "Heather Christle - Primary Instructor",
    "schedule_location": "W 2:30pm-5:30pm in Ignatius Few Building_129",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2847, Section #: 1, Type: SEM, Campus: ATL, Meets: W 2:30-5:30p, Instructor: H. Christle, Status: Wait List",
    "date_accessed": "2024-03-30"
}