{
    "course_code": "ENGCW 374RW",
    "course_title": "Creative Writing: Advanced Poetry",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": "Department Consent Required",
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "(Permission Required Prior to Enrollment)\n\n\nApplication required. Complete course atlas (including texts and grading) and application information available at http://creativewriting.emory.edu/home/academics/spring-2022-course-atlas.html\n\n\nPre-requisite: ENGCW 371RW Intermediate Poetry   \nStudents (including students on the waiting list) MUST attend the first class session or they will not be permitted to take the class.\n\n\nThe goal of this intensive advanced poetry workshop seminar is to create and revise new poetry while becoming further engaged in contemporary poetics: as writers, readers, and lively participants in a thriving literary community. As we ponder what makes our poems urgent, ambitious, and accomplished in the 21st century, we will study how the poets of the past have shaped literary community through their efforts as generous literary citizens who edit, mentor, and make space for other poets. This is a course about how friendship, cooperation, and generosity have sustained the art of poetry over time, and in addition to our goal of becoming more excellent poets, we will actively work toward being generous literary citizens whose dedication to artistry includes the support of other poets. This is a course for poets with experience and ambition who are hoping to sustain the thrill of their craft and the fulfillment of community far beyond graduation.",
    "course_description": "Spring semester. Admittance by assessment of readiness for advanced work by intermediate level instructor in genre. Intensive workshop in the writing of poetry for advanced students. May be repeated for a maximum of eight hours credit.",
    "prerequisites": null,
    "instructors": "Robyn Schiff - Primary Instructor",
    "schedule_location": "W 2:30pm-5:30pm in Callaway Center C201",
    "course_resources": null,
    "sections": "Class Nbr: 2877, Section #: 1, Type: SEM, Campus: ATL, Meets: W 2:30-5:30p, Instructor: R. Schiff, Status: Open",
    "date_accessed": "2024-03-30"
}