{
    "course_code": "JS 271",
    "course_title": "Topics in Jewish History: History of Antisemitism",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 10Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Same as HIST 285 4) \nThis course is in the Arts and Social Justice Fellows program for the Fall 2022 semester. Students will have the opportunity to work with an Atlanta artist and explore social justice issues relevant to the course topic. \nThis course will explore the global history of antisemitism from antiquity to the present. Antisemitism is a modern term, but it has been used to describe a centuries-old fear that Jews somehow pose a threat to an existing social order. It constitutes the oldest continuous global tradition of prejudice towards any single group defined as the \"Other.\" We will examine anti-Jewish prejudice in the realm of ideas and behaviors, attuned to changes in quality and intensity over time, and Jewish responses to violence and discrimination. We will explore the current rise of antisemitism, legal and definitional attempts to combat it, and the relationship of antisemitism to other forms of racism and anti-Zionism.",
    "course_description": "Special Topics in Jewish History: Variety of subjects emphasizing Jewish History. Content will vary. May be repeated when the topic changes.",
    "prerequisites": null,
    "instructors": "Ellie Schainker - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Rich Building 108",
    "course_resources": null,
    "sections": "Class Nbr: 4725, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: E. Schainker, Status: Open",
    "date_accessed": "2024-03-30"
}