{
    "course_code": "JS 271",
    "course_title": "Topics in Jewish History: The Holocaust:History & Memory",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 5",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "HSC w/Race & Ethnicity Req.",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Same as HIST 296 5, REL 270 5)\nThe Holocaust: History & Memory\nThis is an introductory course on the Holocaust: its origins, implementation, and aftermath. Situating the genocide of European Jews in a broader history and as a global event, the course concentrates on the 20th century and has three geographical focuses: Germany as a birthplace of Nazi ideology, Eastern Europe as the epicenter of genocide, and the United States as an example of world reaction. \nWe will investigate the experience of understudied and underrepresented groups such as women, queer people, youth, workers, and people of color. Through the evolution of Nazi policy from discrimination and exclusion to mass killing, we will examine how ideology both motivates and legitimizes racialized violence. Looking at a wide range of groups and individuals, we will examine the choices they confronted, their motivations, the pressures they faced, and the actions they took. While considering the conditions of perpetrators, victims, and bystanders, we will also address instances in which those roles blurred and overlapped. \nChallenging popular myths and oversimplified explanations, we will view the Holocaust as a historical event 'neither inevitable nor inexplicable' and consider its implications for the present. To do so, we will utilize primary sources such as survivors' testimonies, historical artifacts (art, everyday objects, etc.), diaries and letters, and visual material.",
    "course_description": "Special Topics in Jewish History: Variety of subjects emphasizing Jewish History. Content will vary. May be repeated when the topic changes.",
    "prerequisites": null,
    "instructors": "Alicja Podbielska - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in Rich Building 108",
    "course_resources": null,
    "sections": "Class Nbr: 5498, Section #: 2, Type: LEC, Campus: ATL, Meets: MW 10-11:15a, Instructor: A. Podbielska, Status: Open",
    "date_accessed": "2024-03-30"
}