{
    "course_code": "IDS_OX 290R",
    "course_title": "Interdisciplinary Sidecar: Indigenous Science & Sustain",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 12",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Title: The Role of Indigenous Knowledge in Science and Sustainability\n\n\nENVS 230 introduces students to the study of Earth, its history, its composition and structure, the physical processes that shape the planet, and the interconnectedness between the various physiochemical spheres that influence all aspects of earth system processes. While the class is grounded in Western scientific knowledge, indigenous knowledge is incorporated throughout the semester. ANTH 101 enhances student awareness of cultural diversity by positioning the nature/culture divide inherent in Western thought as but one epistemological grounding. An overarching objective is a heightened appreciation for different ways of knowing and being in the world that structure different ways of engaging with the world. With these disciplinary perspectives, this sidecar invites students into an environmental humanities perspective questioning the ways we can (re)shape our awareness of what it means to act sustainably in relationship to the bio-physical world. We will explore traditional ecological knowledge through the reading, discussion, and evaluation of Braiding Sweetgrass: Indigenous Wisdom, Scientific Knowledge, and the Teachings of Plants, a book that explores human-environment relationships as demonstrative of a complementariness between Western and indigenous knowledge. By the end of this course students will be equipped to generate and participate in pluralistic dialogues focused on resolving complex socio-ecological problems in ways that are more holistic, just, and joyous.",
    "course_description": "A side-car course brings together a subset of students from two courses that overlap in methodologies, topics, etc., to create a short interdisciplinary course that runs simultaneously with its two sponsoring courses. One credit, S/U only. Schedule and format arranged by sponsoring professors.",
    "prerequisites": null,
    "instructors": "Melissa Hage - Primary Instructor",
    "schedule_location": "Th 2:30pm-3:20pm in Pierce Hall 227",
    "course_resources": null,
    "sections": "Class Nbr: 6144, Section #: 1, Type: SEM, Campus: OXF, Meets: Th 2:30-3:20p, Instructor: Hage/Ham, Status: Open",
    "date_accessed": "2024-03-30"
}