{
    "course_code": "GER 303",
    "course_title": "German Views of the World",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 18",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "Intercultural Communication w. Race & Ethnicity(*)",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "GER 303 examines the portrayal of the U.S. in the German-speaking world over the past 250 years. Following a chronological approach, the course highlights the degree to which the German-speaking world resisted or conformed to American political, societal, and/or cultural practices and products over the years. We will focus on what these often contrasting responses reveal about the social, cultural, political, and economic conditions in the German-speaking world at that time. The exercise of learning about a culture through its portrayal of another will serve as a central premise of the course and will inform class discussions and assignments. \nGER 303 fulfills the Race and Ethnicity requirement and places particular attention on the German-speaking world's portrayal of Native American and African-American populations, beginning with German-speaking colonizers' reports about their interactions with Native Americans in Georgia in the 18th century and continuing up until German appropriations of American hip-hop music in the 21st century. We will interrogate the terminology and imagery that was and, in some cases, is still used to portray race and ethnicity in the German-speaking world, focusing specifically on how the portrayals coincide, contrast, and conflict with current representational practices in the U.S.",
    "course_description": "An examination of how the German-speaking world has portrayed different nations, nationalities, and peoples in its history. Focus will be on the significance of these portrayals for understanding the social, cultural, political, and economic conditions in the German-speaking world at the time.",
    "prerequisites": "GER 202 or GER_OX 202 or equivalent transfer credit as prerequisite.",
    "instructors": "Hiram Maxim - Primary Instructor",
    "schedule_location": "TTh 4pm-5:15pm in MODERN LANGUAGE_128",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_GER_303_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 4474, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 4-5:15p, Instructor: H. Maxim, Status: Open",
    "date_accessed": "2024-03-28"
}