{
    "course_code": "NBB 201",
    "course_title": "Foundations of Behavior",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 175 / Seats Avail: 10Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Natural Sciences(*)",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Same as ANT 200 1)\n(This course investigates evolutionary and biological explanations for animal behavior, including humans. In this course, we will draw from fundamental principles in anthropology, animal behavior, biology, neuroscience, and psychology, to broadly examine: 1) primate evolution and behavior, 2) the principles of evolution and how they relate to animal behavior, 3) basic functional neuroanatomy, and 4) neural and neuroendocrine mechanisms of behavior, with an emphasis on social behavior. By drawing on examples from humans and nonhuman primates, this course places human behavior in the context of that of other species, to better understand why we behave the way we do.)",
    "course_description": "This course presents an introduction to evolutionary processes and biological bases of behavior. Lectures and readings will be organized around a developmental and life history perspective and will emphasize the importance of context in biological mechanisms and the interaction of social life, behavior, and cognition. Examples drawn especially from humans and nonhuman primates will be used to place human behavior in the Context of other species and to illustrate the dual inheritance of biology and culture in our species. Topics covered will include evolutionary mechanisms, adaptation, phylogenetic constraints, neural and neuroendocrine mechanisms of behavior, life history theory, developmental programs, principles of allometry, sexual selection and alternative reproductive strategies, social bonds and socialization, and the cognitive bases of social interaction in humans and nonhumans.",
    "prerequisites": null,
    "instructors": "Elizabeth Lonsdorf - Primary Instructor",
    "schedule_location": "TTh 8:30am-9:45am in White Hall 208",
    "course_resources": null,
    "sections": "Class Nbr: 4085, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 8:30-9:45a, Instructor: Lonsdorf/Rilling, Status: Open",
    "date_accessed": "2024-03-30"
}