{
    "course_code": "NBB 370",
    "course_title": "Special Topics in NBB: Neurodiversity",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Course Title:  Neurodiversity\nCourse Description \nIn this largely discussion-based course, we will explore what the concept of neurodiversity means, particularly after changes associated with the COVID-19 pandemic. Discussions will stem from readings, talks, and other multimedia presentations (some of which may be student-selected), that are taken from those with lived experiences and/or from researchers, clinicians, and journalists covering a range of scientific disciplines, especially those of neuroscience, psychology, and psychiatry (among others), as well as across broader sociocultural realms (e.g. clinical, educational, and societal). Furthermore, we will explore the concepts of neurodivergence as a social identity vs. treatable medical condition as we also consider the ethical implications of how neurodivergence and neurodivergent conditions (such as autism, ADHD, dyslexia, dyspraxia, dyscalculia, sensory processing disorder, and more) are diagnosed, labeled, and/or ascribed. Finally, we will review these neurodivergent conditions with intentional focus on the intersecting challenges facing many sub-populations, for example those of marginalized race, gender, and socioeconomic statuses, as well as those with comorbidities, high intelligence and ability (e.g. 2e/twice exceptional\" , high functioning) and more.",
    "course_description": "Study of variable topics of special interest in neuroscience and behavioral biology. May be repeated for credit when topics vary.",
    "prerequisites": null,
    "instructors": "J. Alex Grizzell - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in 1462 Clifton Rd 126",
    "course_resources": null,
    "sections": "Class Nbr: 2401, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 10-11:15a, Instructor: J. Grizzell, Status: Wait List",
    "date_accessed": "2024-03-30"
}