{
    "course_code": "CPLT 301W",
    "course_title": "Methods of Literary Interpretation",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 14Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "\"Americas Queer: North and South\" | How can \"queerness\" be understood in a pan-American framework? Do the Americas have a common \"queerness\"? And if not, what changes in terms of the definitions, practices, inflections are incidental to the term and which render the term into a constitutively different one? Can we talk on the one hand, about queerness as practice versus queerness as identity? \nThe course moves in a general historical framework, as we examine different moments of what can perhaps be understood as a common history. The course starts in the 1880s, with Oscar Wilde's celebrity tour of the United States, at the height of his popularity when, as a member of the audience, the Cuban patriot and revolutionary Jose Marti wrote an account of what he saw that was reprinted all over Latin America. Other readings include: Feferico Garcia Lorca in New York, Hart Crane in Havana, Elizabeth Bishop in Brazil, William Burroughs in Mexico, etc.\n\n\nOther authors / texts include: Gabriela Mistral, Manuel Puig, Gabriela Cabezon Camara, Nestor Perlomngher, Alejandra Pizarnik, Rita Indiana Hernandez, Yolanda Arroyo Pizarro, and others.\n\n\nFilms include: The Kiss of the Spider Woman, Doña Herlinda and her Son, Mala Mala, Brincando el Charco, and others.\n\n\nRequirements: Three short papers (60%), Midterm, (15%), Oral presentation (10%) Written reactions, participation and attendance (15%)",
    "course_description": "An introduction to different methods of literary criticism and textual interpretation, applying a variety of theoretical approaches to selected literary texts.  Readings include essays, fiction, poetry, and drama. *Note: This course is non-repeatable.",
    "prerequisites": null,
    "instructors": "Jose Quiroga - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Callaway Center S109",
    "course_resources": null,
    "sections": "Class Nbr: 2708, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: J. Quiroga, Status: Open",
    "date_accessed": "2024-03-30"
}