{
    "course_code": "CPLT 101",
    "course_title": "Rhetorical Composition/Critical Reading",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Writing Requirement",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "\"The Internet as Rhetorical Space\" | What kind of rhetorical space is the Internet? How does its omnipresence in our lives affect the way we construct narratives? In this writing-intensive class, we will read, analyze, and write about 'texts' of different genres: hypertexts, journalistic articles, video essays, google translate results, tiktoks, and films. In the process, we will explore the history of the Internet. Throughout the course, students will hone their own writing styles by producing texts of different modalities both in and outside of class. These modalities will include: a journalistic-style article, a film criticism essay, and a video essay, as well as a final portfolio and written reflection on the class.\n\n\nTEXT: Course materials will be made available through canvas.",
    "course_description": "Instruction in rhetorical composition, critical reading, reflection, and writing as recursive process. Across themed sections, students engage with diverse genres. Courses share some common assignments including research writing and final student-curated portfolio with reflection project.",
    "prerequisites": null,
    "instructors": "Dez Miller - Primary Instructor",
    "schedule_location": "MW 8:30am-9:45am in Bowden Hall 118",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2730, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 8:30-9:45a, Instructor: D. Miller, Status: Wait List",
    "date_accessed": "2024-03-30"
}