{
    "course_code": "CPLT 389W",
    "course_title": "Special Topics: Literature: Dostoevsky in English Translation",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 3",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "(Same as RUSS 360W 1, IDS 385W 8)\n\n\nOf all Russian writers, Dostoevsky most deeply influenced world literature and opened new horizons for spiritual search and artistic imagination. This course will be an intensive introduction to the best known works of Dostoevsky: Notes from Underground,  Crime and Punishment and The Brothers Karamazov. The writer will be approached as a founder of modern intellectual trends such as existentialism and anti-utopianism, as a creator of new literary forms, and as an artist who wore the mantle of a religious prophet. Topics for discussion include: Christianity and atheism, the overman, the sources of evil, and freedom and suffering as moral and psychological categories. Master interpretations of Dostoevsky's works, belonging to outstanding Russian and Western thinkers, will amplify our reading experience and outline the topics for discussion.\nNo prerequisites. Knowledge of Russian is not required.",
    "course_description": "Lively topical or theoretical approaches to a given set of literary texts or problems. May be repeated for credit when subject varies. Fulfills the post-freshman writing requirement.",
    "prerequisites": null,
    "instructors": "Mikhail Epstein - Primary Instructor",
    "schedule_location": "TTh 7pm-8:15pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 4025, Section #: 2, Type: LEC, Campus: ATL, Meets: TTh 7-8:15p, Instructor: M. Epstein, Status: Open",
    "date_accessed": "2024-03-30"
}