{
    "course_code": "CPLT 389W",
    "course_title": "Special Topics: Literature: Intro to Postcolonial Theory",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "\"Introduction to Postcolonial Theory\" | Postcolonial theory is an interdisciplinary field of scholarly study that addresses the relations between race, ethnicity, culture, and power after the global decline of European colonialism over the course of the nineteenth and twentieth centuries. As its name suggests, postcolonial theory is indebted both to anticolonial thought and to poststructuralist theory. Although some knowledge of either anticolonial thought or poststructuralist theory would be welcome, it is not required for this course.\n\n\nIn this course, we will read selected texts by the postcolonial scholars Edward W. Said, Gayatri Chakravorty Spivak, Homi K. Bhabha, Ranajit Guha, Partha Chatterjee, Trinh T. Minh-ha, Chandra Talpade Mohanty, V.Y. Mudimbe, Kwame Anthony Appiah, Cornel West, bell hooks, Gloria Anzaldúa, Coco Fusco, Stuart Hall, Hazel V. Carby, Paul Gilroy, Arjun Appadurai, Lisa Lowe, Rey Chow, Dipesh Chakrabarty, Pheng Cheah, and Achille Mbembe. Although our class discussions will be based on our assigned reading, we may also draw from literature, art, film, and music from outside our course in addressing the issues of colonialism, race, gender, language, culture, and representation.\n\n\nFour (4) response papers (40% total); Long Essay (40%); Attendance and Participation (20%)",
    "course_description": "Lively topical or theoretical approaches to a given set of literary texts or problems. May be repeated for credit when subject varies. Fulfills the post-freshman writing requirement.",
    "prerequisites": null,
    "instructors": "Sean Meighoo - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Callaway Center N118",
    "course_resources": null,
    "sections": "Class Nbr: 2726, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: S. Meighoo, Status: Open",
    "date_accessed": "2024-03-30"
}