{
    "course_code": "CPLT 751R",
    "course_title": "Spec Topics: Comparative Literature",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 8 / Seats Avail: 3",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-01-10 through 2022-04-25",
    "class_notes": "(Same as PSP 789 2)\nThis course surveys the film theory canon that spans from the emergence of cinema in the late 1800s to the present. Proceeding more or less chronologically, we will touch on a variety of topics, such as: medium specificity and the debate between formalist and realist camps; the semiotic, textual, and psychoanalytic \"turns\" that marked the field during the 1960s, 70s, and 80s; issues of representation and counter cinemas; philosophical approaches to film; and the impact of digital technologies relative to photographic indexicality as well as the futures of cinema and its academic study. Authors we'll encounter include: Béla Balázs, Germaine Dulac, Sergei Eisenstein, Walter Benjamin, Siegfried Kracauer, André Bazin, Christian Metz, Laura Mulvey, Jean-Louis Comolli, Julio García Espinosa, Mary Ann Doane, Kaja Silverman, D.N. Rodowick, Jacques Derrida, and Jean-Luc Nancy, among numerous others. Class sessions will be supplemented by weekly film screenings in a traditional, collective (i.e. theatrical) setting.\n\n\nDesigned for those with and without a background in film studies, the seminar provides students the opportunity to engage some of the key themes/figures populating film theory, while setting the stage for further research in the field.",
    "course_description": "This course focuses on a specific body of literary texts, critical approach, or theoretical problem in the area of Comparative Literature.  Students may repeat this course for credit if the subject matter varies.",
    "prerequisites": null,
    "instructors": "Timothy Holland - Primary Instructor",
    "schedule_location": "W 4pm-6:45pm in Modern Language 201\nM 8pm-10pm",
    "course_resources": null,
    "sections": "Class Nbr: 3063, Section #: 1, Type: LEC, Campus: ATL, Meets: M 8-10p; W 4-6:45p, Instructor: T. Holland, Status: Open",
    "date_accessed": "2024-03-30"
}