{
    "course_code": "CPLT 751R",
    "course_title": "Spec Topics: Comparative Literature: Violence and Vulnerability",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 3 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-01-10 through 2022-04-25",
    "class_notes": "(Same as WGS 586R 1, ANT 585 7, PHIL 789 2)\nCourse Description:\nIn this course, we will explore logics of violence and vulnerability in relation to race as the war underlying the polity, as Michel Foucault defines it. How does violence manifest itself institutionally? How does vulnerability become imposed through various logics and techniques: of law, of class, of race? Philosophers and sociologists have considered technology in its multiple dimensions: legal, political, social, and phenomenological, to name a few. Each epoch brings with it either new logics by which technology functions for societal management. Power, violence, vulnerability can be inflicted and challenged through technologies, understood conceptually as instruments by which to accomplish certain ends. We will look beyond immediate/concrete forms of technology to understand their implicit foundations origins in sovereignty and order, and their purposes; for management, vulnerability, and resistance. Readings will include texts by Ida Wells, Chandan Reddy, Stephanie Jones-Rogers, James Baldwin, Frantz Fanon, Michel Foucault, Elaine Scarry, and others.",
    "course_description": "This course focuses on a specific body of literary texts, critical approach, or theoretical problem in the area of Comparative Literature.  Students may repeat this course for credit if the subject matter varies.",
    "prerequisites": null,
    "instructors": "Falguni Sheth - Primary Instructor",
    "schedule_location": "T 2:30pm-5:15pm in Candler Library 125",
    "course_resources": null,
    "sections": "Class Nbr: 4053, Section #: 3, Type: LEC, Campus: ATL, Meets: T 2:30-5:15p, Instructor: F. Sheth, Status: Open",
    "date_accessed": "2024-03-30"
}