{
    "course_code": "ENG 250W",
    "course_title": "American Literature:Beginnings to 1865",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 10Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "You must have permission to enroll in-person.\n(This course is a survey of American writing from its colonial origins through the Civil War. We will track how early writers in what would become the territorial U.S. developed hybrid identities forged out of the clash of European, Native, and African cultures in a bewildering new environment, and how these developments related to later conflicting ideas about American national identity in the years between the American Revolution and the Civil War. In literary terms, we will track how an early focus on New World subjects - the strange landscape, the contacts and conflicts between settlers and original inhabitants, and life under an economic system propelled by slavery - related to ideas about the role of literature in American society. Throughout the semester, we will also be considering some contemporary poems, essays, and a novel that pick up the unfinished business of the early works we will be reading. I will be asking you to reflect, through your writing and discussion, on how the historical voices we will be listening to can help us think about the challenges and possibilities we all face today.)",
    "course_description": "Readings in American literature, with attention to cultural and historical backgrounds.",
    "prerequisites": null,
    "instructors": "Benjamin Reiss - Primary Instructor",
    "schedule_location": "TTh 9:40am-10:55am in Atwood Chemistry Bldg. 260",
    "course_resources": null,
    "sections": "Class Nbr: 2716, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 9:40-10:55a, Instructor: B. Reiss, Status: Open",
    "date_accessed": "2024-03-30"
}