{
    "course_code": "ENG 206W",
    "course_title": "Introduction to Narrative",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Course Topic: Introduction to Narrative: Literary Nonfiction)\n(This course will only meet synchronously Wednesdays from 8:00am to 9:15am. The other course content will be delivered asynchronously)\n(\"Literary nonfiction\" describes written works that 1) tell stories about places, people, and events that are \"true\" to some extent and 2) use techniques typically associated with poetry, novels, and short fiction to tell these stories. Our goal in this course will be to closely examine works of literary nonfiction in order to try and understand how they work-how things like structure, point of view, dialogue, ambiguity, and imagery shape the content, themes, and meanings of a narrative. We will explore a variety of nonfiction genres-including essays, speeches, science writing, and true crime-and, as we study language, style, and theme, we will consider issues like veracity, interpretation, sensationalism, and the relationships between writers, subjects, and readers in nonfiction narratives)",
    "course_description": "An introduction to the study of narrative, with an emphasis on narrative fiction and the critical vocabulary used to describe it. Readings will vary by semester, and may include examples from other disciplines.",
    "prerequisites": null,
    "instructors": "Sophia Falvey - Primary Instructor",
    "schedule_location": "W 8am-9:15am in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2758, Section #: 1, Type: LEC, Campus: ATL, Meets: W 8-9:15a, Instructor: S. Falvey, Status: Closed",
    "date_accessed": "2024-03-30"
}