{
    "course_code": "ENG 256W",
    "course_title": "British Literature Since 1660",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Spring",
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(This course is designed with both non-majors and English majors in mind. For students who feel strongly that they just can't graduate from Emory without taking some classes in English, this class is for you. This class is also for you if you are considering majoring in English or have already declared your English major; specifically, this course will give you an excellent foundation for the rest of your coursework in the English department by introducing you to the \"big picture\" of British literature. In ENG 256W, we will survey more than 350 years of British literature, and we will read some of the most exciting, challenging, and inspiring poetry, fiction, and drama written in the English language. As we move through the centuries, we will study the distinctive literary innovations and achievements of the major periods of British literary history, after 1660: the Restoration, the Eighteenth Century (i.e., the Enlightenment), Romanticism, the Victorian age, and the Twentieth Century (i.e., Modernism and Postmodernism). Although many aesthetic, philosophical, and historical issues will require our careful attention, our main task will be to trace the relationships among literature, society, and politics, focusing especially on how notions of authority, tradition, freedom, and self-expression are represented through a variety of literary texts.)",
    "course_description": "Readings in English literature written from 1660 to the early twentieth century, with attention to cultural and historical backgrounds.",
    "prerequisites": null,
    "instructors": "Paul Kelleher - Primary Instructor",
    "schedule_location": "MW 2:40pm-3:55pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 2717, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 2:40-3:55p, Instructor: P. Kelleher, Status: Open",
    "date_accessed": "2024-03-30"
}