{
    "course_code": "ENG 290W",
    "course_title": "Topics in Literary History: Southern Women Writers",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 24 / Seats Avail: 7",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "You must have permission to enroll in-person.\nCourse Topic: Southern Women Writers-\nThis course will explore works by major women writers of the American South. Through readings from the late-nineteenth century through the contemporary era, we will familiarize ourselves with the thematic and formal elements that characterize southern women's literature, while thinking about ways these authors challenge assumptions of southern identity in their representations of gender, sexuality, and race. We will consider, as well, how the novels we'll read reflect women's experiences of coming of age in the South as affected by the particular constraints and ideals of southern culture. Required texts will include novels by Kate Chopin, Carson McCullers, Ellen Glasgow, and Zora Neale Hurston. We will practice responding to literature with critical and creative writing assignments, including a close reading, a comparative analysis, a short story or memoir, and a research paper.",
    "course_description": "Long historical surveys of national, regional, or ethnic traditions; or of genres or subgenres. Examples: History of African Literature, History of Latinx Literature, History of Science Fiction, History of the Sonnet, History of Southern U.S. Literature, History of Drama.",
    "prerequisites": null,
    "instructors": "Emily Banks - Primary Instructor",
    "schedule_location": "TTh 11:20am-12:35pm in New Psyc Bldg 290 (36 Eagle Ro",
    "course_resources": null,
    "sections": "Class Nbr: 5535, Section #: 3, Type: LEC, Campus: ATL, Meets: TTh 11:20a-12:35p, Instructor: E. Banks, Status: Open",
    "date_accessed": "2024-03-30"
}