{
    "course_code": "ENG 304W",
    "course_title": "Chaucer",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 13",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(This course will only meet synchronously Wednesdays from 9:40am to 10:55am. The other course content will be delivered asynchronously.)\n(Content: This course covers the full range of Geoffrey Chaucer's poetry, from his dream visions to Troilus and Criseyde and selected Canterbury Tales.  Early in the class we learn to read Chaucer's fourteenth-century London dialect.  Subsequent classes consist of discussion and close-readings of the texts Chaucer synthesizes and adapts: classical (e.g. Ovid's Metamorphoses and Virgil's Aeneid), vernacular (e.g. those by Dante, Boccaccio, and Guillaume de Lorris) and biblical.  He thus redefines the medieval traditions of epic, romance, fabliau, Breton lay, saint's life, and exemplum.  We shall explore at least three of the great mysteries of Chaucer's life and work: how such a prolific poet could also be a soldier, diplomat and court official; how his poetic persona consistently veils and deprecates his genius; and how his complicated relationships with women find poetic expression.)\n(Requirements: three five-page papers, manuscript project, final examination.)",
    "course_description": "Readings in The Canterbury Tales, Troilus and Criseyde, and selected other works.",
    "prerequisites": null,
    "instructors": "James Morey - Primary Instructor",
    "schedule_location": "W 9:40am-10:55am in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 2718, Section #: 1, Type: LEC, Campus: ATL, Meets: W 9:40-10:55a, Instructor: J. Morey, Status: Open",
    "date_accessed": "2024-03-30"
}