{
    "course_code": "ENG 290W",
    "course_title": "Topics in Literary History: English Epic Poetry",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 22",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "You must have permission to enroll in-person. \n(This course dives into epic poetry composed in the English language from John Milton (1608-1674) to Derek Walcott (1930-2017), to discover and work through epic poetic technique while exploring verse-based storytelling over a long span of time and space. Reading completely, or in part, poems written by the likes of Pope, Blake, Browning, Southey, Chesterton, Benet, Longfellow, H.D., Tighe, Morris, Brooks, Byron and those aforementioned, plus more-as time allows-will provide an historical and literary overview that stands apart from lyric poetry and proves challenging and rewarding in equal measure.)\n(Note: Although not required, being familiar with other epic or heroic-style poems (particularly, the Iliad, Odyssey, Aeneid, Metamorphoses, Commedia, and Faery Queene) will be helpful since the poems we will read are based in no small part on significant aspects of these earlier works.)",
    "course_description": "Long historical surveys of national, regional, or ethnic traditions; or of genres or subgenres. Examples: History of African Literature, History of Latinx Literature, History of Science Fiction, History of the Sonnet, History of Southern U.S. Literature, History of Drama.",
    "prerequisites": null,
    "instructors": "Dustin Mengelkoch - Primary Instructor",
    "schedule_location": "MW 9:40am-10:55am in New Psyc Bldg 230 (36 Eagle Ro",
    "course_resources": null,
    "sections": "Class Nbr: 2761, Section #: 2, Type: LEC, Campus: ATL, Meets: MW 9:40-10:55a, Instructor: D. Mengelkoch, Status: Open",
    "date_accessed": "2024-03-30"
}