{
    "course_code": "ENG 311RW",
    "course_title": "Shakespeare: Shakespearean Comedy",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(This course will only meet synchronously Thursdays from 11:20am to 12:35pm. The other course content will be delivered asynchronously.)\n(Complete Topic:  Shakespearean Comedy, or What's So Funny about Misogyny?)\n(In this class, we will explore a range of Shakespearean comedies while thinking about what feminist philosopher Kate Manne has recently described as the \"logic of misogyny.\" The plays we will explore run the gamut from seemingly light, romantic narratives to more obviously fraught works, often known as \"problem plays.\" Over the course of the semester, we'll discuss scholarly arguments about gender and Shakespeare's stage, noting that the word \"misogynist\" itself dates from the early modern period. But our focus will be on how Shakespearean comedies may resonate in the present as they invite us to consider gender, power, and sexual violence. We will thus explore matters ranging from gaslighting and mansplaining to sexual consent and sexual assault. Moving between Shakespeare's texts and present-day American culture, we will aim to be attuned to the complexities of Shakespeare's language and to the plays' cultural and theatrical contexts.)",
    "course_description": "Selected major plays from the histories, comedies, tragedies, and romances. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Patricia Cahill - Primary Instructor",
    "schedule_location": "Th 11:20am-12:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2719, Section #: 1, Type: LEC, Campus: ATL, Meets: Th 11:20a-12:35p, Instructor: P. Cahill, Status: Closed",
    "date_accessed": "2024-03-30"
}