{
    "course_code": "ENG 359W",
    "course_title": "Studies in African American Literature: 1900 to Present",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 9",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(This course will only meet synchronously Wednesdays from 2:40pm to 3:55pm. The other course content will be delivered asynchronously.)\n(It's impossible to cover 120 years of African American Literature in one semester, so this course first focuses on those texts that arrived with a bang, unique and contrary, yet became canonical within a few short years. We then finish with a text that just came out in March of this year, yet its author, after having been awarded an unprecedented three Hugo awards for her Broken Earth trilogy, was awarded a MacArthur \"Genius\" Grant this October. As we move through those shattering works of W.E.B. Du Bois, Nella Larsen, Richard Wright, and Audre Lorde, to name just a few, we'll study and debate the complexity of the Black experience and what appears to be its increasing diversity as we embark on its third decade in the 21st century. )\n(Grading will be based on weekly 'reader responses,' midterm and final papers, attendance and participation. No previous knowledge required.)",
    "course_description": "A topics course dealing with major traditions and issues in African American literature from 1900 to the present. Possible topics include passing and miscegenation, black novels since 1950, Afrofuturism, and black theater.",
    "prerequisites": null,
    "instructors": "Michelle Wright - Primary Instructor",
    "schedule_location": "W 2:40pm-3:55pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 2725, Section #: 1, Type: LEC, Campus: ATL, Meets: W 2:40-3:55p, Instructor: M. Wright, Status: Open",
    "date_accessed": "2024-03-30"
}