{
    "course_code": "ENG 336W",
    "course_title": "The English Victorian Novel",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "Distance Learning",
    "typically_offered": "Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(This course will introduce students to the intricate, wisdom-rich fiction of the British Victorian period, 1837-1901. The class will focus on ways that Victorian writers represented sensory experiences in changing urban and rural environments, but this approach will open many related issues. Students will examine some extraordinary novels in light of social developments such as colonialism, rapid urban and industrial growth, labor movements, changing understandings of masculinity and femininity, and the shifting roles of science and religion. At the same time, students will analyze the ways that novels function as works of art and learn how artworks can shape the societies that produce them. Students will be required to complete analytical and creative assignments to be chosen from a range of topics. These assignments will emphasize the ways that critical and creative thinking can work together to build literary knowledge. No expertise in literary or creative writing will be assumed, and this is not a creative writing course. The class is recommended for students who passionately love to read. The reading assignments will be demanding, but the course offers the opportunity to read fascinating, unforgettable stories. Among the authors whose works we will analyze are Emily Brontë, Charles Dickens, George Eliot, Thomas Hardy, Robert Louis Stevenson, Anthony Trollope, and H. G. Wells. There will be no midterm or final exam.)",
    "course_description": "The development of the British novel during the Victorian period, with representative works by novelists such as the Brontes, Dickens, Eliot, Meredith, Hardy, and Conrad.",
    "prerequisites": null,
    "instructors": "Laura Christine Otis - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2722, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: L. Otis, Status: Wait List",
    "date_accessed": "2024-03-30"
}