{
    "course_code": "ENG 330",
    "course_title": "Romanticism",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 8",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Reading a wide array of texts including lyric poetry, literary manifestos, closet dramas, slave narratives, and travel journals this course addresses poetry and prose of the romantic era with attention to themes of freedom, imagination, and autobiography. The romantic era - roughly from the 1780's through the 1830's - was a time of highly charged and self-conscious debates about the role of literature in an increasingly modern society; the texts we will read explore different ways in which key writers of the time addressed the role of literature amidst the pressures of both economic and political upheaval. We will consider how these debates transformed the very language of literature and who and what counted as literary subjects. Figures an earlier literature might not have recognized as having a place in high literature enter romantic literature both as objects of representation and as the subjects of their own self-representation. And literature 'itself' makes a radical claim for its creative and sustaining powers.)",
    "course_description": "Selected works of Romantic literature with an emphasis on poetry, including poets such as Smith, Blake, Wordsworth, Coleridge, Byron, Shelley, and Keats, as well as selections from prose writers such as Hazlitt and DeQuincey.",
    "prerequisites": null,
    "instructors": "Deborah Elise White - Primary Instructor",
    "schedule_location": "MW 6pm-7:15pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 2748, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 6-7:15p, Instructor: D. White, Status: Open",
    "date_accessed": "2024-03-30"
}