{
    "course_code": "ENG 389W",
    "course_title": "Special Topics:Literature: The Roaring Twenties",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 8",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Complete Topic: The Roaring Twenties: Literature of the American Jazz Age)\n(Content: \"It was an age of miracles, it was an age of art, it was an age of excess, and it was an age of satire,\" F. Scott Fitzgerald wrote in his 1931 retrospective, \"Echoes of the Jazz Age.\" In this course we will look closely at the writing of the 1920s in the context of its art, publishing, music, film, fads, and fashion--with the objective of developing a deeper understanding of its most distinctive achievements in literature, its legacies, and the worlds in which American writers lived at the time.\nTexts: to be determined but likely to include F. Scott Fitzgerald's This Side of Paradise or The Beautiful and Damned and selected stories; T.S. Eliot, 'The Waste Land'; Jean Toomer, Cane; Langston Hughes, The Weary Blues; Hemingway, selected stories; Anita Loos, Gentlemen Prefer Blondes and Gentlemen Marry Brunettes; Edna Ferber, Show Boat; Nella Larsen, Passing and Quicksand; Faulkner, Sanctuary. Other poems, essays, and short stories tba.\nWork:  written reflections; a short paper; a major in-class essay; a presentation paper and presentation; expansion of the presentation paper. Research required.)",
    "course_description": "Literary topics vary. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Barbara Ladd - Primary Instructor",
    "schedule_location": "TTh 6pm-7:15pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 2730, Section #: 4, Type: LEC, Campus: ATL, Meets: TTh 6-7:15p, Instructor: B. Ladd, Status: Open",
    "date_accessed": "2024-03-30"
}