{
    "course_code": "ENG 389W",
    "course_title": "Special Topics:Literature: Inter. Appr. Econ.Inequality",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 2Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Complete Topic: Interdisciplinary Approaches to Economic Inequality)\n(This course will focus on the central problem of economic inequality, from Victorian Britain to today. Nineteenth-century authors witnessed the growing wealth disparities that accompanied the rise of industrialism; their commentary bears remarkable relevance for us now as we face our own pandemic-era economic recession and the systemic class inequalities it has exposed. Our main course texts will be drawn from the literature of the Industrial Revolution, including authors such as Thomas Carlyle, John Ruskin, William Morris, Elizabeth Barrett Browning, Friedrich Engels, Karl Marx, Charles Dickens, and Elizabeth Gaskell. We'll also engage with major working-class movements of the nineteenth century, such as Chartism. Throughout the term, we'll put these texts and ideas in conversation with crucial debates in our own moment, drawing from disciplinary perspectives in literature, history, anthropology, and science and technology studies. Our ultimate goal will be to consider how an understanding of historical texts might impact the way that we approach current issues, including job security and unemployment, affordable housing, universal basic income, technology and labor, strikes and unionization, student loans and educational access, environmental justice, international development, racial and gendered wage gaps, banks and lending discrimination, and the future of work.)",
    "course_description": "Literary topics vary. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Abigail Droge - Primary Instructor",
    "schedule_location": "MW 4:20pm-5:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 2728, Section #: 2, Type: LEC, Campus: ATL, Meets: MW 4:20-5:35p, Instructor: A. Droge, Status: Open",
    "date_accessed": "2024-03-30"
}