{
    "course_code": "ENG 385W",
    "course_title": "Methods for Literary Research: The Contemporary Novel",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 7",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(This seminar teaches students how to conduct research and participate in ongoing critical conversations. Among the issues these courses take up are how to determine a salient research question; how to distinguish and evaluate various current methods; how to collect and evaluate relevant studies and contextual materials; and how to find and express the stakes of one's argument.  \nWe focus on contemporary novels. As case studies, we will read on Kazuo Ishiguro's Never Let Me Go and Toni Morrison's A Mercy. For each novel, we will study the scholarly debates about them and the theory that informs those debates, which includes affect theory, post-critique, and critical race theory. Students will conduct independent research under the professor's guidance toward intervening in a debate of their choice.)",
    "course_description": "This course introduces students to the methods and materials of academic literary research and criticism. Focusing on a small body of literature and scholarship within one area of study, the course will teach students to engage with secondary sources, including contextual and/or archival material.",
    "prerequisites": null,
    "instructors": "Dan Sinykin - Primary Instructor",
    "schedule_location": "TTh 2:40pm-3:55pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 2763, Section #: 2, Type: LEC, Campus: ATL, Meets: TTh 2:40-3:55p, Instructor: D. Sinykin, Status: Open",
    "date_accessed": "2024-03-30"
}