{
    "course_code": "ENG 386",
    "course_title": "Literature and Science",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 50 / Seats Avail: 5Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Course Topic: Literature and Science Before 1900)\n(This lecture-style course with some discussion will investigate the ways that scientific and literary writers shaped each other's thinking before science assumed the prominence it did in the twentieth century. The class will focus on how literary and scientific writers have explored the world in many senses, and how they have influenced one another with their different ways of observing, describing, and narrating. Students majoring in science, literature, creative writing, or any other field are encouraged to take this class, and no expertise in literary analysis or the natural sciences will be presumed. The readings will include works by Samuel Butler, Charles Darwin, Edgar Allan Poe, Santiago Ramón y Cajal, Mary Shelley, Robert Louis Stevenson, Jules Verne, and H. G. Wells. Three short essays will be required, and there will be a final exam. Please note that this course does not fulfill the continuing writing requirement.)",
    "course_description": "Exploration of the ways in which literary writers have developed scientific ideas and scientists have expressed themselves through creative writing.",
    "prerequisites": null,
    "instructors": "Laura Christine Otis - Primary Instructor",
    "schedule_location": "MW 9:40am-10:55am in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 2749, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 9:40-10:55a, Instructor: L. Otis, Status: Open",
    "date_accessed": "2024-03-30"
}