{
    "course_code": "ENG 385W",
    "course_title": "Methods for Literary Research: Primary Matters",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 10",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Course Topic: Methods for Literary Research: Shakespeare's Primary Matters)\n(This course will only meet synchronously Tuesdays from 11:20am to 12:35pm. The other course content will be delivered asynchronously.)\n(In this seminar, you will read six dramas by Shakespeare and his contemporaries, while also learning about digital archives and carrying out independent research with primary sources.) \nThe plays we read together center on women and are full of animal metaphor and matter--works such as Shakespeare's Two Gentlemen of Verona, Jonson's Bartholomew Fair, and Webster's The White Devil, which variously consider unruly pets, female appetites for roasted pig, and violent men with stag's horns sprouting from their heads.\nAs we investigate how such dramas tell stories about women, we will turn to digital archives of early modern primary sources, which range from literary texts to true crime reportage to cookbooks. With my guidance, you will decide which research topics to pursue to illuminate the plays - historical contexts and the cultural meanings of animal-made-objects used on stage. Ideally, then, this seminar will not only enable you to become a better close reader, but also provide you with a sense of the joys of primary source research, so that you can recognize yourself as a creator (rather than merely a consumer) of knowledge. Written work includes short papers and a scaffolded project.)",
    "course_description": "This course introduces students to the methods and materials of academic literary research and criticism. Focusing on a small body of literature and scholarship within one area of study, the course will teach students to engage with secondary sources, including contextual and/or archival material.",
    "prerequisites": null,
    "instructors": "Patricia Cahill - Primary Instructor",
    "schedule_location": "T 11:20am-12:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 2762, Section #: 1, Type: LEC, Campus: ATL, Meets: T 11:20a-12:35p, Instructor: P. Cahill, Status: Open",
    "date_accessed": "2024-03-30"
}