{
    "course_code": "ENG 389W",
    "course_title": "Special Topics:Literature: Neuro-Fiction",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 3",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Whereas in the 20th century most fiction writers have been interested in the \"psychology\" of their characters, their minds or psyches, in the 21th century we have seen a distinctive turn of interest on the part of a number of important fiction writers to their characters' brains. As Marco Roth, the literary critic who first noticed this trend, puts it: there has been \"a shift away from environmental and relational theories of personality back to the study of brains themselves, as the source of who we are.\" In this course we will explore a selection of what I call \"neuro-fiction,\" which reflects this new interest. Because there have also been a number of contemporary fiction films that reflect this same thematic turn, we will have a 'film week' in which we discuss two films, The Butterfly Effect and Pi.  \nPlease note: No coursework in or special familiarity with cognitive psychology or neuroscience is required for this course.\nRequired Reading: A Box of Birds (2012), by Charles Fernyhough; Neuropath (2009), by R. Scott Bakker; The Echo Maker (2007), by Richard Powers; Saturday (2005), by Ian McEwan; Lowboy (2012), by John Wray; Atmospheric Disturbances (2009), by Rivka Galchen; and A Calculated Life (2013), by Anne Charnock\nCourse requirements: regular participation in class discussion (2 unexcused absences will be permitted), 3 essays and a final exam.)",
    "course_description": "Literary topics vary. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "John H Johnston - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 2729, Section #: 3, Type: LEC, Campus: ATL, Meets: TTh 1-2:15p, Instructor: J. Johnston, Status: Open",
    "date_accessed": "2024-03-30"
}