{
    "course_code": "ENG 389W",
    "course_title": "Special Topics:Literature: Nonbinary Narratives",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 2",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Complete Topic: Nonbinary Narratives: LGBTQ+ Comics and Graphic Novels) \n(Comics and sexuality have a long, entangled history. From the illicitly circulated Eight-Pagers of the 1930s to social justice-oriented trans* webcomics today, comics and graphic novels provide a rich archive from which to track changing notions of gender and sexuality in American culture. In this course, we will consider how comics and graphic memoirs visualize queer and trans* experiences. After introducing historical and theoretical frameworks to ground our approach, we will encounter comics and graphic novels that span genres from autobiography to science fiction. To better understand how comics are created, we will welcome cartoonists into our classroom for discussions about their work and artistic processes.) \n(Throughout this course, students will engage in public scholarship through a variety of assignments and activities. Strengthening their analytic, visual, and compositional skills along the way, students will create infographics, publish book reviews online, compose scholarly comics, and collaborate on a digital exhibition of their chosen research project. Together we will think critically about knowledge production at the university level by partnering with the library to learn how graphic novels and comics are acquired and explore ways to expand collections. This course is being taught with the support of the Mellon Humanities PhD Interventions Project.)",
    "course_description": "Literary topics vary. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Tesla Cariani - Primary Instructor",
    "schedule_location": "TTh 2:40pm-3:55pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 2727, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 2:40-3:55p, Instructor: T. Cariani, Status: Open",
    "date_accessed": "2024-03-30"
}