{
    "course_code": "ENG 489",
    "course_title": "Special Topic Adv. Study: English: Exhibiting Yeats and Heaney",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 13",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Course will meet on Mondays from 9:40am-12:35pm) New Topic: Exhibiting Yeats and Heaney-Focusing on the life and works of Ireland's two poet laureates, W.B. Yeats and Seamus Heaney, this course examines the process and politics of public exhibitions. There have been countless comparisons made between Ireland's two Nobel prize-winning poets (including the fact that Heaney was born in 1939, the year that Yeats died). Both poets wrestled with the responsibilities of the artist to the demands of violent conflict, both resisted the call of propaganda and both became spokesmen for a civic and cultural agenda in public life. Yet Yeats and Heaney responded in significantly different ways to their personal, historical and political circumstances. \nTopics for discussion will include physical and digital exhibitions, poetry in the public sphere, historical contexts, and archival research. For the Yeats component of the course, students will use the online exhibition, 'The Life and Works of William Butler Yeats' at http://www.nli.ie/yeats/. For the Heaney component of the course, we will look at Emory's 2014 exhibition 'Seamus Heaney: The Music of What Happens' as well as the National Library of Ireland's Dublin exhibition 'Seamus Heaney: Listen Now Again.'\nThis class meets concurrently with 'ENG789 Exhibiting Yeats and Heaney.'\nAssignments: Weekly discussion posts, two short papers and a final digital project.",
    "course_description": "Intensive study of specific literary topics, e.g., questions of form or history, or concentrations on one or more authors or literary movements. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Geraldine Higgins - Primary Instructor",
    "schedule_location": "M 9:40am-12:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 5876, Section #: 4, Type: SEM, Campus: ATL, Meets: M 9:40a-12:35p, Instructor: G. Higgins, Status: Open",
    "date_accessed": "2024-03-30"
}