{
    "course_code": "ENG 489",
    "course_title": "Special Topic Adv. Study: English: No Time to Think!",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 9",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as CPLT 489 1 and HIST 496 1)\n(Complete Topic - No Time to Think! Boredom, Distraction, and Modern Life)\n(Since Covid upended all plans, seemingly putting the future itself on hold, boredom, stress, and anxiety have also taken on pandemic proportions. Physical distancing and social isolation have sharpened awareness of the passage of time and fostered transgressive longings for escape and amusement. As we catapult from boredom to distraction and back again, scrolling restlessly for something to hold our attention, we rarely stop to reflect. But thinking together about boredom and attention opens new perspectives on desire and identity, history and temporality and reveals how individual malaise is embedded in socio-cultural, economic, and technological dynamics and processes that shape modern life as a whole. After an interdisciplinary inquiry into the literary, historical, and cultural genealogy of an experience mistakenly regarded as a timeless feature of the human condition, we will examine how boredom and distraction are represented and understood in the humanities and social sciences, in modern art and popular culture today. Thinking together about phenomena that isolate us and seem to bring thinking to a halt will open new perspectives, and in the final part of the class, you will bring theory into practice, using new technologies to develop projects that identify creative possibilities in experiences of boredom and loss of purpose. Readings: Adorno, Barthes, Baudelaire, Benjamin, Beckett, Flaubert, Kafka, Ngai, Sontag)",
    "course_description": "Intensive study of specific literary topics, e.g., questions of form or history, or concentrations on one or more authors or literary movements. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Elizabeth Goodstein - Primary Instructor",
    "schedule_location": "TTh 4:20pm-5:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 2750, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 4:20-5:35p, Instructor: E. Goodstein, Status: Open",
    "date_accessed": "2024-03-30"
}