{
    "course_code": "ENG 789",
    "course_title": "Special Topics In Literature: Lit. &Justice:Writers On Trial",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 4 / Seats Avail: 4",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as CPLT 751R 1) Content: History has put on trial a series of creative thinkers. At the dawn of philosophy, Socrates drinks the cup of poison to which he is condemned by the Athenians for his influential teaching, charged with atheism, and corruption of the youth. Centuries later, in modernity, similarly influential (similarly charismatic and ironically subversive) Oscar Wilde is condemned by the English for his homosexuality, as well as for his provocative artistic style. In France, the most outstanding writers-- Flaubert and Baudelaire -- are both indicted as criminals for their first (shockingly innovative) literary works; Emile Zola is condemned for defending a Jew against the state which has convicted him, and flees from France to England to escape imprisonment.\n\n\nHowever different, all these accused have come to stand for something greater than themselves: something that was symbolized -- and challenged - by their trials. Through the examination of a series of historical and literary legal dramas, this course will ask: Why are literary writers, artists and philosophers, repetitively put on trial, and how in turn do they challenge culture and society? What is the role of art and literature as political actors in the struggles over ethics, and the struggles over meaning?\n\n\nTexts: Texts selected among: Plato's Dialogues; Molière's plays; Shakespeare's plays; Oscar Wilde (Plays, Autobiography, Critical writings); Gustave Flaubert (novels, letters); Charles Baudelaire (poems, criticism, theory of art); Emile Zola (political writings); Herman Melville (novellas); Bertolt Brecht (plays)); Hannah Arendt (Essays, Interviews); Spinoza (Ethics); Sigmund Freud (Psychoanalytic Writings); Jacques Lacan (psychoanalytic seminar); E. M. Forster (novel); Virginia Woolf (novel); Franz Kafka (short stories, parables).\n\n\nParticulars: Regular attendance; Two short papers distributed throughout the course of the semester; Brief oral presentations; Intensive weekly reading assignment (weekly one-page reading reports) and active preparation of texts for class discussion; ongoing participation.\n***NOTE: In some cases, recommended advanced undergraduates might be able take the class (by permission).",
    "course_description": "Various topics, such as theoretical, generic, or cultural studies of literature.",
    "prerequisites": null,
    "instructors": "Shoshana Felman - Primary Instructor",
    "schedule_location": "M 1pm-4pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 5354, Section #: 7, Type: SEM, Campus: ATL, Meets: M 1-4p, Instructor: S. Felman, Status: Open",
    "date_accessed": "2024-03-30"
}