{
    "course_code": "ENG 789",
    "course_title": "Special Topics In Literature: Digital Humanities & Literary",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 7",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "This course has two goals: to introduce students to institutional criticism and to provide a foundation in computational methods. Prizes, creative writing programs, and publishing are the three central contemporary literary institutions. James English and Mark McGurl, with The Economy of Prestige and The Program Era, have written two of the most celebrated contributions to literary studies in recent decades. English emphasizes how prizes, like the Booker and the Pulitzer, organize how readers and writers value literature. McGurl observes that maybe the biggest change in how Americans wrote novels after 1945 was that they wrote them on college campuses. \nWe will focus on contemporary literature. Contemporists studying institutions face a challenge: how to account for the vastness of the domain? In the last few years, the expansion of digital libraries and developments in modeling have made new computational methods possible. Working from ground zero, with no expectation of any background, we will introduce students to these new methods. Students will have access to unprecedented data on prizes, programs, and publishing through ECDS and the Post45 Data Collective. We might read literature by Percival Everett, Toni Morrison, Helen DeWitt, Sandra Cisneros, and N. Scott Momaday. We might read theory and criticism by Kinohi Nishikawa, Richard Jean So, Janice Radway, Kalyan Nadiminti, Sarah Brouillette, and Jacqueline Goldsby.",
    "course_description": "Various topics, such as theoretical, generic, or cultural studies of literature.",
    "prerequisites": null,
    "instructors": "Dan Sinykin - Primary Instructor",
    "schedule_location": "T 4:20pm-7:15pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 5200, Section #: 6, Type: SEM, Campus: ATL, Meets: T 4:20-7:15p, Instructor: D. Sinykin, Status: Open",
    "date_accessed": "2024-03-30"
}