{
    "course_code": "ENG 798R",
    "course_title": "Seminar in Pedagogy and Professionalization",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 10",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Topic: Seminar in Pedagogy and Professionalization)\nThe course prepares students for teaching a literature section in the fall or spring of their fifth year. Students will gain experience in preparing documents for fellowship applications and the job market, such as cover letters, curriculum vitae, teaching, diversity statements, writing samples, and interpretations of job and postdoctoral ads. The seminar will also investigate careers beyond academia, in coordination with the LGS Asst. Dean for Prof. Dev and Career Planning, allied Ph.D. pgms, the Alumni Office, the CFD, and another relevant programming.",
    "course_description": "The course prepares students for teaching a literature section in the fall or spring of their fifth year. Students will gain experience in preparing documents for fellowship applications and the job market, such as cover letters, curriculum vitae, teaching, diversity statements, writing samples, and interpretations of job and postdoctoral ads. The seminar will also investigate careers beyond academia, in coordination with the LGS Asst. Dean for Prof. Dev and Career Planning, allied PhD pgms, the Alumni Office, the CFDE, and other relevant programming.",
    "prerequisites": null,
    "instructors": "Paul Kelleher - Primary Instructor",
    "schedule_location": "W 4:20pm-7:15pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 2741, Section #: 1, Type: LEC, Campus: ATL, Meets: W 4:20-7:15p, Instructor: Kelleher/Nickerson, Status: Open",
    "date_accessed": "2024-03-30"
}