{
    "course_code": "ENG 789",
    "course_title": "Special Topics In Literature: Exhibiting Yeats and Heaney",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 12",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Class is open to advanced undergraduates [permission required]):\nThis course requires students to research the life and works of Ireland's two poet laureates before considering the process and politics of exhibitions. There have been countless comparisons made between Ireland's two Nobel prize-winning poets (including the fact that Heaney was born in 1939, the year that Yeats died).  Both poets wrestled with the responsibilities of the artist to the demands of violent conflict, both resisted the call of propaganda and both became spokesmen for a civic and cultural agenda in public life. Yet Yeats and Heaney responded in significantly different ways to their personal, historical and political circumstances. \nTopics for discussion will include archival research, digital humanities, poetry in the public sphere, and the role of the curator.  For the Yeats component of the course, students will use the online exhibition, 'The Life and Works of William Butler Yeats' at http://www.nli.ie/yeats/. For the Heaney component of the course, we will study elements of Emory's 2014 exhibition 'Seamus Heaney: The Music of What Happens' as well as the National Library of Ireland's Dublin exhibition \"Seamus Heaney: Listen Now Again.\")",
    "course_description": "Various topics, such as theoretical, generic, or cultural studies of literature.",
    "prerequisites": null,
    "instructors": "Geraldine Higgins - Primary Instructor",
    "schedule_location": "M 9:40am-12:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 2739, Section #: 2, Type: SEM, Campus: ATL, Meets: M 9:40a-12:35p, Instructor: G. Higgins, Status: Open",
    "date_accessed": "2024-03-30"
}