{
    "course_code": "TATT 605PSYC",
    "course_title": "Teaching Assistantship",
    "credit_hours": "2",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Varies by section",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "Varies by section",
    "course_description": "The nature of a teaching assistantship varies from department to department. The defining characteristic of this position across all departments and programs is a controlled, carefully monitored initial teaching opportunity. A teaching assistant may be responsible for 10 to 12 hours per week of discussion or laboratory supervision.",
    "prerequisites": "TATT 600 or equivalent transfer credit as prerequisite.",
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 3531, Section #: 1, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: D. Edwards, Status: Open\nClass Nbr: This section is full 3540, Section #: 10, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: E. Walker, Status: Closed\nClass Nbr: This section is full 3541, Section #: 11, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: P. Kragel, Status: Closed\nClass Nbr: This section is full 3542, Section #: 12, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: E. Emory, Status: Closed\nClass Nbr: 3543, Section #: 13, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: S. Hamann, Status: Open\nClass Nbr: 3544, Section #: 14, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: P. Wolff, Status: Open\nClass Nbr: This section is full 3545, Section #: 15, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: S. Lourenco, Status: Closed\nClass Nbr: 3546, Section #: 16, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: H. Gouzoules, Status: Open\nClass Nbr: This section is full 5815, Section #: 17, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: D. Ren, Status: Closed\nClass Nbr: This section is full 5816, Section #: 18, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: A. Cohen, Status: Closed\nClass Nbr: 5817, Section #: 19, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: I. Waldman, Status: Open\nClass Nbr: This section is full 3532, Section #: 2, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: R. Hampton, Status: Closed\nClass Nbr: This section is full 5820, Section #: 20, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: E. Respress, Status: Closed\nClass Nbr: This section is full 5821, Section #: 21, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: B. Yamasaki, Status: Closed\nClass Nbr: 3533, Section #: 3, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Dugan, Status: Open\nClass Nbr: This section is full 3534, Section #: 4, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: P. Moon, Status: Closed\nClass Nbr: 3535, Section #: 5, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: S. Botto, Status: Open\nClass Nbr: This section is full 3536, Section #: 6, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: E. Kim, Status: Closed\nClass Nbr: 3537, Section #: 7, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: A. Tasimi, Status: Open\nClass Nbr: 3539, Section #: 9, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: A. Kazama, Status: Open",
    "date_accessed": "2024-03-30"
}