{
    "course_code": "WGS 285",
    "course_title": "Variable Topics in Women, Gender & Sexuality Studies: Intro.Feminist Science Studies",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 5Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "How do cultural and social beliefs about sex, gender, race and sexuality affect the way these subjects are studied in the life sciences, and vice versa? Are there really only two sexes? Is gender innate and biologically determined, or a product our of our cultural and social practices? Can there ever be a \"feminist science,\" and if so, what would it look like? We are typically taught that science is an objective, unbiased pursuit. However, the field of Feminist Science Studies has challenged this idea by highlighting how the development of scientific knowledge is shaped by, and in turn shapes our values, politics, and assumptions about the world. Feminist Science Studies has also challenged us to think beyond the binaries (culture/nature, male/female, subject/object, etc.) that have historically served as the foundation for western sciences. This course will introduce students to canonical and contemporary texts in Feminist Science Studies and will familiarize students with key theories and concepts that drive the field.",
    "course_description": "Offerings vary each semester.",
    "prerequisites": null,
    "instructors": "Caroline Warren - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Candler Library 123",
    "course_resources": null,
    "sections": "Class Nbr: 5291, Section #: 4, Type: SEM, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: C. Warren, Status: Open",
    "date_accessed": "2024-03-30"
}