{
    "course_code": "WGS 385",
    "course_title": "Spec Topics: Women, Gender, & Sexuality Studies: Psychic Life Anti-black Viol.",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 3 / Seats Avail: 3Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Same as AAS 385 8 and CPLT 389 2)\n(Complete Topic: The Psychic Life of Anti-black Violence)\n(Psychoanalytic theory continues to be a powerfully productive discourse for queer theory, critical race theory, Post-Colonial Studies, and Black Studies. Yet, while psychoanalysis has had a lot to say about subject formation, desire, resistance, and anti-social forms of belonging, they have had very little to say on the conditions which allow access to such conceptual models. Critical black theories, particularly in the last decade, have interrogated such conditions and have questioned the function of blackness as constitutive in the production of gender and sexual difference, formations of the human, and the uncertainty of (non-)being. In addition to offering a general overview into these insights and debates, the course provides a basic, but fundamental, introduction to key concepts and themes in psychoanalytic theory and Black Studies/ critical black theories to meditate and question on the very terms that make up the course tite: the psyche, anti-blackness, violence, and life. The course will also explore visual artwork and film including, but not limited to: Kara Walker; Ellen Gallagher; Wangechi Mutu; Noah Davis; Barry Jenkin's Moonlight; Cheryl Dunye's Watermelon Woman; Sean Baker's Tangerine; and Sebastian Lelio's A Fantastic Woman.)",
    "course_description": "Offerings vary each semester.",
    "prerequisites": null,
    "instructors": "Linette Park - Primary Instructor",
    "schedule_location": "MW 6pm-7:15pm in Callaway Center C101",
    "course_resources": null,
    "sections": "Class Nbr: 4422, Section #: 2, Type: SEM, Campus: ATL, Meets: MW 6-7:15p, Instructor: L. Park, Status: Open",
    "date_accessed": "2024-03-30"
}