{
    "course_code": "WGS 385",
    "course_title": "Spec Topics: Women, Gender, & Sexuality Studies: Gender, Science and Health",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "The 'science' of gender slowly and unevenly moves from the lab to the clinic. Healthcare access, effective diagnosis, and treatment depends on clinicians, use of masculinity, femininity, and forms of non-binary gender identity. This class examines the experiences of patients as they navigate illness and health. By studying how healthcare providers and researchers seek to understand gender and deploy gender identity in delivering care, students explore the life and death stakes of cultural investments in gender and health. Readings and course material will juxtapose health systems across a range of historical periods and geographic settings so that students may compare and contrast gender normalization from one setting to the next. The class focuses on patient advocacy for increasing quality of care. Cases show that gender is always moderated by other aspects of identity, such as age, class and race, which together impact the ways in which patients are able to access healthcare. Topics include the history of pediatric practice with intersex children; pregnancy and medicalization of the gestating body; race and gender in the Neonatal Intensive Care Unit (NICU); medicalizing obesity and fat bodies; mental health; aging and sexual health; and experiences of transphobia within healthcare systems. Students will develop a theory of gender as it relates to the practice of healthcare, identifying how gender is mobilized as a meaning making practice within clinical settings.",
    "course_description": "Offerings vary each semester.",
    "prerequisites": null,
    "instructors": "Sameena Mulla - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in Callaway Center C203",
    "course_resources": null,
    "sections": "Class Nbr: 5285, Section #: 3, Type: SEM, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: S. Mulla, Status: Open",
    "date_accessed": "2024-03-30"
}