{
    "course_code": "WGS 385",
    "course_title": "Spec Topics: Women, Gender, & Sexuality Studies: Mass Incarceration, Policing",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Same as AAS 385 7)\nThis course offers an introduction to and a general overview of the history of imprisonment in relation to the struggles for Black political freedom in the United States. It tracks a genealogy of the prison and practices of policing from the regimes of racial slavery. While the course is attentive to the sociological literature on mass incarceration past and present, the objective of the course is to think conceptually about the abstraction of racial slavery and anti-blackness as they continue to undercut systemic and institutionalized forms of inequality, punitive practices, and carcerality in the United States. For example, how might we draw the connections between the present-day protests against police brutality and extra-judicial practices of anti-black murder with a broader history of slavery and lynching in the US? How might we also consider the racial health inequities presented by the pandemic as both a signal of the lack of medical care and clinical services for African Americans and as a longer historical pandemic of medical violence that stems from the collusion between slavery, the prison, and the clinic? The course, thus, presents a broader view of imprisonment and policing beyond the brick and mortar site of the prison with a particular focus on Black feminist activism and radical practices of resistance to imprisonment and policing.",
    "course_description": "Offerings vary each semester.",
    "prerequisites": null,
    "instructors": "Linette Park - Primary Instructor",
    "schedule_location": "MW 4pm-5:15pm in Candler Library 101",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 4420, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 4-5:15p, Instructor: L. Park, Status: Wait List",
    "date_accessed": "2024-03-30"
}