{
    "course_code": "WGS 585",
    "course_title": "Special Topics: Women, Gender, & Sexuality Studies: Black Feminist Epistemologies",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 3",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "This course will examine the knowledge structures and modes of being that constitute Black feminist theory and praxis.  How do Black feminism's radical epistemologies offer ways to theorize and imagine beyond the structures of violence that have been central to western modernity?  How does Black feminism offer new ways of thinking about captivity, political struggle, intellectual production, social life, interiority, embodiment, and refusal? In answering these and other questions, we will explore the ways in which Black feminist analytics, ethics, and methodologies have shaped an interdisciplinary body of literature that has interrogated the violence of racialized gender and the possibilities of Black life. Our goal in this class will be to think about Black feminism as a field of knowledge, and as a way of seeing, thinking, and knowing the world. We will also explore the ways in which Black feminist thought has been shaped by transnational knowledge production, focusing in particular on Latin America and the Caribbean. Ultimately our goal will be to complicate, rethink, and collectively examine what the term \"Black feminism\" means, and what the field itself has produced and enabled.",
    "course_description": null,
    "prerequisites": null,
    "instructors": "Aisha Finch - Primary Instructor",
    "schedule_location": "M 2:30pm-5:30pm in Candler Library 125",
    "course_resources": null,
    "sections": "Class Nbr: 3763, Section #: 3, Type: LEC, Campus: ATL, Meets: M 2:30-5:30p, Instructor: A. Finch, Status: Open",
    "date_accessed": "2024-03-30"
}