{
    "course_code": "WGS 490RW",
    "course_title": "Senior Sem in Women, Gender, & Sexuality Studies",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 5Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": "Department Consent Required",
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "This course explores the conceptual and political importance of intersectionality.  We will begin with a close examination of the Combahee River Collective Statement (1977) and the early and influential essay by Kimberlé Crenshaw who formalized intersectionality as an analytic framework for scholarship in Women's, Gender, and Sexuality Studies (WGSS).  What problems were the Combahee River Collective and Crenshaw trying to address?  We will then look at later uses of intersectionality in feminist theory, especially its use by black feminist theorists.  How has the theory of intersectionality been modified and what critiques have been offered of it?  The course will be taught as a discussion-based, writing-intensive seminar.  The course will encourage you to think about how a body of theoretical work is constructed, how it can be read, and how it can be used in a number of different contexts. In the second half of the course you will write a research paper; emphasis will be on developing the skills necessary for writing about complex theoretical material, and on encouraging you to build an independent and nuanced critical position about contemporary theoretical issues in feminist theory.  Research papers from this course will be showcased in the WGSS Undergraduate Senior Symposium.",
    "course_description": "Exploration of selected topics pertaining to women, gender, and feminist theory. Each year the seminar has a specific theme that is designed to integrate central questions, topics, and problems of method. This course is offered only in the fall and is open to seniors who are Women's, Gender, and Sexuality Studies majors or minors.",
    "prerequisites": null,
    "instructors": "Lynne R Huffer - Primary Instructor",
    "schedule_location": "W 1pm-3:45pm in Candler Library 125",
    "course_resources": null,
    "sections": "Class Nbr: 1665, Section #: 1, Type: SEM, Campus: ATL, Meets: W 1-3:45p, Instructor: L. Huffer, Status: Open",
    "date_accessed": "2024-03-30"
}