{
    "course_code": "WGS 585",
    "course_title": "Special Topics: Women, Gender, & Sexuality Studies: Whither Trans Studies?",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 4",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "Special Topics: Whither Trans Studies? \nWhat is the future of Trans Studies? Although it emerged at around the same time as queer theory, Trans Studies has struggled to gain an institutional foothold, plagued by a lack of jobs, personnel, and cultural capital. As a result, fundamental intellectual problems and glaring gaps in research remain unaddressed. This seminar will center underthematized fissures and tensions in Trans Studies, asking students to think creatively about how future scholarship might carry the field forward.  \n \nThe course will begin by studying how the institutionalization first of transsexuality, then transgender in North America promoted a new idea of gender as a fixed internal identity. With this background in mind, we will then go on to study fissures and contradictions within Trans Studies as a field. We will examine the vexed relation between queer theory and Trans Studies, between the specific violence faced by Black trans women and the possibility that Blackness itself might be trans; the turn to materiality as ontologically trans; the tension between understandings of gendered selfhood in the West and in the Global South; and the divide between transmasculinity and transfemininity. Such tensions constitute generative sites for future scholarship.  \nNote: Master and Undergraduate students require Instructor approval to enroll; please contact Dr. Kadji Amin at kadji.amin@emory.edu in advance.",
    "course_description": null,
    "prerequisites": null,
    "instructors": "Kadji Amin - Primary Instructor",
    "schedule_location": "Th 2:30pm-5:30pm in Candler Library 125",
    "course_resources": null,
    "sections": "Class Nbr: 1662, Section #: 2, Type: LEC, Campus: ATL, Meets: Th 2:30-5:30p, Instructor: K. Amin, Status: Open",
    "date_accessed": "2024-03-30"
}