{
    "course_code": "WGS 754",
    "course_title": "Foucault",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 4 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Same as CPLT 751R 6, PHIL 789 1)\nThis course will explore the writings of the French philosopher Michel Foucault. We will focus in particular on Foucault's analysis of the rise of sexuality, the power of normalization, the disciplinary and biopolitical specification of bodies, and the production of deviance in the modern era. The course's primary purpose is to provide an opportunity to read Foucault's work in depth, rather than to examine how his work has been used by others. That said, the aim of the course is give students a solid foundation for assessing how Foucault has contributed to the elaboration of queer and feminist understandings of sexuality.\nNote:  Master and Undergraduate Students must obtain permission from Dr. Lynne Huffer prior to enrolling in this course.  Please email Dr. Huffer at: lhuffer@emory.edu",
    "course_description": "This course will explore the writings of the French philosopher Michel Foucault. We will focus in particular on Foucault's historical analysis of madness, the rise of sexuality, the power of normalization, the disciplinary production of delinquency and deviance, and the biopolitical specification of bodies and populations in the modern era. We will also pay special attention to Foucault's discursive style and genealogical method. Our main objective will be to read Foucault's work in depth rather than to examine how his work has been used by others.",
    "prerequisites": null,
    "instructors": "Lynne R Huffer - Primary Instructor",
    "schedule_location": "W 6pm-9pm in Candler Library 125",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3129, Section #: 1, Type: LEC, Campus: ATL, Meets: W 6-9p, Instructor: L. Huffer, Status: Closed",
    "date_accessed": "2024-03-30"
}