{
    "course_code": "HLTH 323",
    "course_title": "Nutrition for Exercise and Sport",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 32 / Seats Avail: 3Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Proper nutrition supports the physiological processes that make it possible for the body to respond and adapt to exercise. All individuals, from the occasional exerciser to the elite athlete, can benefit from optimal nutrition strategies to prepare for exercise, meet increased metabolic demands during exercise, and facilitate recovery following exercise. This course addresses the roles of nutrition in meeting exercise goals and achieving optimal performance and good health. Students will be introduced to the basic principles of exercise physiology and exercise training. We will explore the functional roles of macronutrients and micronutrients in the body, with emphasis on how they participate in exercise-associated processes. We will also examine dietary recommendations for individuals and athletes and discuss both conventional and contemporary fueling strategies for optimizing exercise training and athletic performance.",
    "course_description": "This course addresses how nutrition helps individuals meet exercise goals, promote health, and achieve optimal performance through examination of the physiological roles of nutrients and dietary components, basic principles of exercise science, and conventional and contemporary fueling strategies.",
    "prerequisites": null,
    "instructors": "Dan Benardot - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Tarbutton Hall 105",
    "course_resources": null,
    "sections": "Class Nbr: 3499, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 10-11:15a, Instructor: Benardot/Fyneface, Status: Open",
    "date_accessed": "2024-03-30"
}