{
    "course_code": "LAW 901",
    "course_title": "Supervised Research",
    "credit_hours": "1-3",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Varies by section",
    "instruction_method": "Varies by section",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2021-05-17 through 2021-08-04",
    "class_notes": null,
    "course_description": "Students will work one-on-one with an individual faculty member on projects related to the faculty member's scholarly research. Students will receive general research training at the start of the semester. The course will general draw on and develop students' legal research, analysis, writing, communication, and overall professionalism skills. Students will submit periodic reports to the professor, in writing or orally, as appropriate, on their research and analysis and receive specific feedback and guidance from the professor as relevant and appropriate to the particular research project.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 1276, Section #: ALRD, Type: RSC, Campus: ATL, Meets: Meets Online, Instructor: S. Allard, Status: Open\nClass Nbr: 1293, Section #: BAGL, Type: RSC, Campus: ATL, Meets: Meets Online, Instructor: M. Bagley, Status: Open\nClass Nbr: This section is full 1285, Section #: BROY, Type: RSC, Campus: ATL, Meets: Meets Online, Instructor: M. Broyde, Status: Closed\nClass Nbr: This section is full 2449, Section #: CARS, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: C. Carson, Status: Closed\nClass Nbr: 1302, Section #: COOP, Type: RSC, Campus: ATL, Meets: Meets Online, Instructor: K. Cooper, Status: Open\nClass Nbr: 1280, Section #: DUDZ, Type: RSC, Campus: ATL, Meets: Meets Online, Instructor: M. Dudziak, Status: Open\nClass Nbr: 1272, Section #: JSHP, Type: RSC, Campus: ATL, Meets: Meets Online, Instructor: J. Shepherd, Status: Open\nClass Nbr: This section is full 1275, Section #: KOST, Type: RSC, Campus: ATL, Meets: Meets Online, Instructor: P. Koster, Status: Closed\nClass Nbr: 1270, Section #: LEVI, Type: RSC, Campus: ATL, Meets: Meets Online, Instructor: K. Levine, Status: Open\nClass Nbr: 1296, Section #: NASH, Type: RSC, Campus: ATL, Meets: Meets Online, Instructor: J. Nash, Status: Open\nClass Nbr: 1295, Section #: PART, Type: RSC, Campus: ATL, Meets: Meets Online, Instructor: D'Souza/Partlett, Status: Open\nClass Nbr: This section is full 1265, Section #: PILL, Type: RSC, Campus: ATL, Meets: Meets Online, Instructor: S. Pill, Status: Closed\nClass Nbr: 1274, Section #: SATZ, Type: RSC, Campus: ATL, Meets: Meets Online, Instructor: A. Satz, Status: Open\nClass Nbr: This section is full 1286, Section #: SHEP, Type: RSC, Campus: ATL, Meets: Meets Online, Instructor: G. Shepherd, Status: Closed\nClass Nbr: This section is full 1284, Section #: SYBB, Type: RSC, Campus: ATL, Meets: Meets Online, Instructor: M. Sybblis, Status: Closed\nClass Nbr: 1292, Section #: WITT, Type: RSC, Campus: ATL, Meets: Meets Online, Instructor: J. Witte Jr., Status: Open",
    "date_accessed": "2024-03-30"
}