{
    "course_code": "DANC 226",
    "course_title": "Topics in Somatic Practices: Connecting the Mind",
    "credit_hours": "1",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Varies by section",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Physical Education(*)",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Connecting the Mind to the Moving Body will present an experiential overview of different somatic practices (i.e. Alexander, Ideokinesis, Bartenieff Fundamentals, and core support techniques). All of these somatic forms require attention to breathing, alignment, proprioception, core support, sequencing and flexibility. Students will explore the interconnectedness of body and mind while focusing on the ways that somatic practices inform and intertwine with one's intellectual life, cultural identity, and embodied life experiences. Body knowledge will expand from guest movement teachers, readings, discussions, and journaling.",
    "course_description": "Somatic movement education builds a relationship between the body and mind by guiding the mover through a process of full body integration. A variety of somatic practices may be covered, including Bartenieff Fundamentals, Iyengar-based yoga, and core movement training. Somatic practices can be applied to everyday activities and performance, affecting levels of confidence and encouraging authenticity.",
    "prerequisites": null,
    "instructors": "Sally A Radell - Primary Instructor",
    "schedule_location": "Varies by section",
    "course_resources": null,
    "sections": "Class Nbr: 3439, Section #: 2, Type: LEC, Campus: ATL, Meets: TTh 1-2:15p, Instructor: S. Radell, Status: Open\nClass Nbr: This section is full 3440, Section #: 3, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: S. Radell, Status: Closed",
    "date_accessed": "2024-03-30"
}