{
    "course_code": "LAW 897A",
    "course_title": "Dir. Research: Specific Topics: Practicum Research",
    "credit_hours": "1-12",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2021-08-16 through 2021-11-22",
    "class_notes": "Varies by section",
    "course_description": null,
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 4782, Section #: BOBI, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: M. Bobinski, Status: Open\nClass Nbr: 4785, Section #: BROY, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: M. Broyde, Status: Open\nClass Nbr: 4933, Section #: COOP, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: K. Cooper, Status: Open\nClass Nbr: 4888, Section #: KOST, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: P. Koster, Status: Open\nClass Nbr: 4787, Section #: PAYN, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: S. Payne, Status: Open\nClass Nbr: 4889, Section #: PENN, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Pennell, Status: Open\nClass Nbr: 4843, Section #: PIND, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: K. Pinder, Status: Open\nClass Nbr: 4952, Section #: PRCE, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: P. Price, Status: Open\nClass Nbr: 4846, Section #: SEAM, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Seaman, Status: Open\nClass Nbr: 4779, Section #: SHEP, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: G. Shepherd, Status: Open\nClass Nbr: 4934, Section #: SYBB, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: M. Sybblis, Status: Open\nClass Nbr: 4930, Section #: VOLK, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: A. Volokh, Status: Open\nClass Nbr: 4931, Section #: WALD, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: R. Waldman, Status: Open",
    "date_accessed": "2024-03-30"
}