{
    "course_code": "LACS 270",
    "course_title": "Topics: Latin Americn Issues: Resistance in Afro-Latin Amer.",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 7Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Same as HIST 285 3)\n(People of African descent have been present in Latin America for as long as Europeans have, and they continue to be an important part of the racial composition of the region. Millions of enslaved Africans were brought to the Spanish and Portuguese Americas through the  transatlantic slave trade, and their descendants make up a sizable portion of the population in modern Latin America. This course will explore the forms of resistance African people and their descendants have used across Latin America history. By tracing the complicated history of race and ethnicity from colonial times to the present, students will gain a greater understanding of African presence in Latin America and the ways in which people of African descent have sought upward mobility and challenged systems of exploitation, oppression, and racism.  Students will gain a deeper understanding of different forms of resistance, a vocabulary and framework from which to question ideas of race and ethnicity in the Latin America, and a cursory understanding of the history of African and Afro-descended people in Latin America from Iberian conquest to the present day. Additionally, students will develop skills in the critical reading of primary sources, presentations, and historical writing.)",
    "course_description": "Topics: Latin Americn Issues. Topics vary.",
    "prerequisites": null,
    "instructors": "Ursula Rall - Primary Instructor",
    "schedule_location": "MW 5:30pm-6:45pm in Math & Science Center - W307C",
    "course_resources": null,
    "sections": "Class Nbr: 3809, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 5:30-6:45p, Instructor: U. Rall, Status: Open",
    "date_accessed": "2024-03-30"
}