{
    "course_code": "LACS 270",
    "course_title": "Topics: Latin Americn Issues: African Gods in Popular Cult.",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 2 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Same as REL 270 8, AAS 285 3, and AFS 270 3)\n(This course satisfies the Religion major requirement:- Theme.)\n(The African continent is full of deities whose stories continue to provide inspiration for producers of popular culture. While historically sensationalized or decontextualized, the myths and symbols of African deities have more recently been used as enduring and powerful conveyors of beauty and resistance. In this course, we will examine the ways deities from different African religious traditions are used in popular media by exploring their myths and mythic legacies. We will also pay attention to how African deities serve as perennial figures in art, television, films, fiction, and music. Some of the materials we will analyze include visual albums by Beyoncé, shows and films from the Marvel Comic Universe, and music videos from Ibeji. In addition to obtaining an understanding of African deities and their myths, we will consider some of the persistent misconceptions about the religions from which they emanate.)",
    "course_description": "Topics: Latin Americn Issues. Topics vary.",
    "prerequisites": null,
    "instructors": "Elaine Penagos - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in Woodruff Library 214",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3880, Section #: 5, Type: LEC, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: E. Penagos, Status: Wait List",
    "date_accessed": "2024-03-30"
}