{
    "course_code": "LACS 385",
    "course_title": "Special Topics in Latin American and Caribbean Studies: Genocide in World History",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 3Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Same as HIST 385 2 and AMST 385 1)\n(In 1944, Raphael Lemkin coined the term `genocide by bringing together the Greek word genos (a single people) and the Latin word cide (killing). Genocide was made a legal term a few years later when the United Nations ratified the Genocide Convention on December 9, 1948, which criminalized `acts committed with intent to destroy in whole or in part a national, ethnical, racial or religious group. Despite the fact that `genocide is a 20th century term, acts have been committed throughout human history that fit into this legal definition. The purpose of this course is to historicize genocide by exploring examples of genocide before the existence of this term. We will examine instances of genocide from Ancient times to the present that took place all over the world: in the Americas, Europe, Asia, Africa, and Australia. We will also discuss different forms of genocide: cultural, religious, political, and racial. By the end of the course students will have a greater understanding of what defines genocide and how this modern term can be applied to events of the past. \nGrading structure: Participation: 20%; Short writing assignments: 30%; Two exams: 20%; Final research project & presentation: 30%\nThis course is appropriate for first year students.)",
    "course_description": "Special Topics in Latin American and Caribbean Studies. Topics vary.",
    "prerequisites": null,
    "instructors": "Samantha Billing - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in Rich Building 104",
    "course_resources": null,
    "sections": "Class Nbr: 3815, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: S. Billing, Status: Open",
    "date_accessed": "2024-03-30"
}