{
    "course_code": "MESAS 268",
    "course_title": "Israeli-Palestinian Conflict",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "Humanities and Arts with Race & Ethnicity(*)",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(Same as JS 268 1, HIST 268 1, and POLS 268 1)\n(This course gives students an overview of Israeli-Palestinian conflict from the 1880s on through today. It introduces students to early Zionist debates and the late Ottoman context before moving on to discuss violence during the British Mandate period, the rise of the State of Israel, and the reappearance of the Palestinian cause on the world stage after the 1967 war. The course will include sessions that\nexamine previous bouts of armed conflict as well as various attempts at peace, but war and politics will not be the course's only foci; the lived experiences of Palestinians and Israelis will also receive significant  attention, from historical times through the present day. These voices include a young Jewish female spy who helped the British defeat the Ottoman Empire; an Islamist rebel whose death inspired the Great Arab Revolt of the 1930s; a Holocaust survivor who fought in the 1948 war before becoming Israel's leading poet; girls whose families fled from Jerusalem and Libya, and grew up amidst poverty and war; a U.S.-trained heart surgeon-turned-PLO militant who was assassinated in his quest for peace, and many others.)",
    "course_description": "Covers the history of the Israeli-Palestinian conflict from the 1880s to today. It will introduce students to early Zionist debates and the late Ottoman context before discussing the British Mandate period, the State of Israel, and the Palestinian cause on the world stage after the 1967 war.",
    "prerequisites": null,
    "instructors": "Geoffrey Levin - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in White Hall 208",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_MESAS_268_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 5564, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 10-11:15a, Instructor: Levin/Tan, Status: Open",
    "date_accessed": "2024-03-31"
}