{
    "course_code": "IDS 290R",
    "course_title": "Interdisciplinary Sidecar: Coffee from the Grounds Up",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "Complete Topic: Coffee from the Grounds Up. \nIn this course, students will learn how local coffee-related businesses and non-profit organizations seek to integrate sustainable, human-centered business models. We will explore the coffee supply chain, which begins with indigenous growers and winds through roasters, distributors, and finally, consumers. Traditional business models benefit the 'middlemen' of roasters and distributors. Global consumers sip the final product without knowing that the indigenous growers receive profit only in pennies, with which they struggle to feed their families while facing the grim threat of climate change, deforestation, and land appropriation.  \nIn contrast to traditional exploitative models, we will learn about indigenous growers who have gained the means of production and distribution of coffee. We will start with learning about the Tzeltal cooperative, Yomol A'tel, formed by Indigenous families in Chiapas, Mexico. We will then explore the work of Atlanta companies and organizations that strive to implement business models that benefit the growers, as well as the environment.",
    "course_description": "A side-car course brings together a subset of students from two courses that overlap in methodologies, topics, etc., to create a short interdisciplinary course that runs simultaneously with its two sponsoring courses. One credit, S/U only. Schedule and format arranged by sponsoring professors.",
    "prerequisites": null,
    "instructors": "Nikki Graves - Primary Instructor",
    "schedule_location": "F 2:30pm-3:45pm in Callaway Center N118",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 6097, Section #: 2, Type: SEM, Campus: ATL, Meets: F 2:30-3:45p, Instructor: Team, Status: Closed",
    "date_accessed": "2024-03-30"
}