{
    "course_code": "IDS 290R",
    "course_title": "Interdisciplinary Sidecar: Inquisitions and Intersection",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 5",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "Complete Topic: Inquisitions and Intersections: Religion, Gender, and Authoritarianism in the Modern World. What does it mean to be a Catholic woman? A Jewish woman? What about a non-binary member of either faith? In recent years, both religions have confronted their intersections with gender and ideology in increasingly direct terms. But those intersections are not a new discovery; they have shaped religious and political experience for millennia. Spain, for example, has borne witness to women's changing experiences within Judaism, Catholicism, and Islam through many different political environments. This one-credit, pass-fail sidecar course will seek to understand how gender and authoritarianism have conditioned women's experiences within religion, with a particular emphasis on Judaism and Catholicism in Spain. We'll spend the semester discussing films, memoirs, academic articles, primary sources, and more as we move through history and between identities. The course will conclude with a capstone, which may involve writing Scholar Blogs posts as individuals, organizing a speaker event as a class, or another such project.",
    "course_description": "A side-car course brings together a subset of students from two courses that overlap in methodologies, topics, etc., to create a short interdisciplinary course that runs simultaneously with its two sponsoring courses. One credit, S/U only. Schedule and format arranged by sponsoring professors.",
    "prerequisites": null,
    "instructors": "María Carrión - Primary Instructor",
    "schedule_location": "T 2:30pm-3:45pm in Callaway Center N118",
    "course_resources": null,
    "sections": "Class Nbr: 6096, Section #: 1, Type: SEM, Campus: ATL, Meets: T 2:30-3:45p, Instructor: Team, Status: Open",
    "date_accessed": "2024-03-30"
}