{
    "course_code": "IDS 290R",
    "course_title": "Interdisciplinary Sidecar: Rewarding Ecstasies",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 4Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "Complete Topic: Rewarding Ecstasies: Desire, Free Will, and Religion \nThis course will only meet for 10 weeks.\nThis Sidecar course will draw from Hue's course \"Advanced Neuroethics\" (featuring Free Will and Neurotechnology) and Laderman's course, \"Religion and Sexuality,\" and provide students with a focused scholarly exploration of the power of ecstatic experiences. What role do ecstatic experiences play in human life, and how can we best understand them? From the human orgasm and forms of euphoric intimacy; to highly pleasurable if not earth-shaking aftereffects of ingesting certain psychoactive substances; to mystical states that bring individuals into contact with the divine, the drive for ecstatic experience is a ubiquitous feature of human societies. The course will examine these and other issues, with particular interest in the interface between individual and neurochemical experiences of ecstasy, and the larger cultural context that helps make sense of, and finds ways to regulate, these experiences.",
    "course_description": "A side-car course brings together a subset of students from two courses that overlap in methodologies, topics, etc., to create a short interdisciplinary course that runs simultaneously with its two sponsoring courses. One credit, S/U only. Schedule and format arranged by sponsoring professors.",
    "prerequisites": null,
    "instructors": "Gillian Hue - Primary Instructor",
    "schedule_location": "F 1pm-2:15pm in 1462 Clifton Rd 113",
    "course_resources": null,
    "sections": "Class Nbr: 6105, Section #: 4, Type: SEM, Campus: ATL, Meets: F 1-2:15p, Instructor: Team, Status: Open",
    "date_accessed": "2024-03-30"
}