{
    "course_code": "IDS 290R",
    "course_title": "Interdisciplinary Sidecar: Body Switching",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 3",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "Complete Topic: Body Switching\nThe content of \"Religion and the Body\" and \"Chaucer\" intersect most directly with the study of Christianity, though monastic traditions in Buddhism and Taoism are also promising points of contact. This IDS sidecar course will feature two of Chaucer's most famous pilgrims: the Wife of Bath and the Pardoner. The Wife of Bath is a woman who acts like a man, and her \"jolly body\" progresses from the young woman in the Miller's Tale to the old, experienced woman who has been married five times. The Pardoner is a eunuch who represents his bodily status in the form of a zombie in his tale of three rioters who seek, and find, Death. There are instances of sex switching and gender bending across the readings in both courses. We will also look at a Buddhist and Taoist narratives related to sex and gender, such as the chapter from the Vimalakirti Sutra wherein an enlightened goddess and a sanctimonious monk switch bodies, and a popular story of the kind called \"the Chinese female vampire story\" (except that the female seeks not blood but semen from her victims). Other areas for discussion include questions about salvation and impiety, the use of irony in narratives, and issues of literary genre (especially regarding the fantastic).",
    "course_description": "A side-car course brings together a subset of students from two courses that overlap in methodologies, topics, etc., to create a short interdisciplinary course that runs simultaneously with its two sponsoring courses. One credit, S/U only. Schedule and format arranged by sponsoring professors.",
    "prerequisites": null,
    "instructors": "James Morey - Primary Instructor",
    "schedule_location": "Th 1pm-1:50pm in Callaway Center S101",
    "course_resources": null,
    "sections": "Class Nbr: 6106, Section #: 5, Type: SEM, Campus: ATL, Meets: Th 1-1:50p, Instructor: Team, Status: Open",
    "date_accessed": "2024-03-30"
}