{
    "course_code": "IDS 385W",
    "course_title": "Special Topics: Women in Linguistic Philosophy",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 19 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Continuing Writing Requirement",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "This course focuses on the historical impact that Alice Ambrose, Susan Stebbing, and Margaret MacDonald had in the creation of what is currently known as the Philosophy of language's pragmatic tradition. Ambrose, Stebbing, and MacDonald were prominent intellectual figures in the 1930-1960s. They were amazing teachers and prolific writers. Nevertheless, their careers were slowed by paternalistic and sexist institutions and their scholarly success was overshadowed by academia's patriarchal nature. In a few words, these women philosophers have been silenced, and have practically been erased from the history of philosophy. \nThe course has two different but related aims. First, we will do justice to these three philosophers by analyzing why their contributions were ignored until recently. This is a new genealogy of linguistic philosophy. Second, employing new feminist methods, we will delve into their influential and pioneering works. In reading and assessing primary sources, students will produce original writing analyzing different aspects of their academic lives.",
    "course_description": "Highly focused courses, drawing on multiple disciplines of the humanities and social sciences; may be repeated for credit when topics vary.",
    "prerequisites": null,
    "instructors": "Juan Colomina Alminana - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in Carlos Hall 212",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2974, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 10-11:15a, Instructor: J. Colomina Alminana, Status: Wait List",
    "date_accessed": "2024-03-30"
}