{
    "course_code": "IDS 385W",
    "course_title": "Special Topics: Hurricanes,Wildfires,Pandemics",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 19 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Continuing Writing Requirement",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "Hurricanes, Wildfires, & Pandemics: A Global History of Catastrophe, Death, & Social Change. During the 1st wave of coronavirus, the institutions and processes to manage the dead were overwhelmed across the world. Officials scrambled to find solutions--from morgues in ice rinks to mass burials. Families were devastated when they could not perform the ritual acts of mourning and burial. Mass death events, from antiquity to today, disrupt the social contract in unexpected ways with unexpected outcomes.  \nIn this course, students will develop the tools to contextualize catastrophic events in a global framework. Together, we will analyze a variety of case studies; from the Bronze Age Collapse and the Justinian Plague to more contemporary events like Hurricane Katrina, the Australian wildfires, and COVID-19. The course takes an interdisciplinary approach, with texts from a range of disciplines, including history, economics, anthropology, public policy, and medicine.  \nAt the end of this course, students will be able to critically discuss how catastrophic events impact human society. They will be able to identify and explain disciplinary specific approaches to analyzing and understanding these events. Finally, they will demonstrate the ability to contextualize case studies--from history and the present--to engage larger social and cultural impacts. This course is designed to offer a broad introduction accessible to students from all academic disciplines.",
    "course_description": "Highly focused courses, drawing on multiple disciplines of the humanities and social sciences; may be repeated for credit when topics vary.",
    "prerequisites": null,
    "instructors": "Bethany Wade - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in Callaway Center S103",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2977, Section #: 2, Type: LEC, Campus: ATL, Meets: TTh 1-2:15p, Instructor: B. Wade, Status: Wait List",
    "date_accessed": "2024-03-30"
}