{
    "course_code": "IDS 385W",
    "course_title": "Special Topics: Science and Race",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 19 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Continuing Writing Requirement",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "This course will explore how race figures in contemporary science.  Twentieth century concepts of race were shaped by nineteenth century science, which took race to be a biological division that explained social and cultural differences.  By the middle of the twentieth century, the biological basis for race had been rejected.  However, race continues to be an important independent variable in social scientific and medical studies.  Our exploration of contemporary science will begin by looking at the history of the race concept in the sciences and at the different possible ways of conceptualizing 'race,' once we know there is no biological basis for the idea.  After working through some of the history and philosophy of race, we will turn to case studies in the social sciences and medicine.  For example, in studies of residential segregation, 'race' must be measured.  Or again, medical research has correlated race with different health. About these examples and others, we will ask: How is race being conceptualized in these different scientific inquiries?  What do these measurements or studies tell us, if anything?  To what extent are they promulgating inappropriate conceptions of race, and to what extent are they combating such conceptions?  How are they influencing the way we think about ourselves?    For the latter part of the semester, classes will be student-led and we will discuss examples of scientific research involving race or racial variables.",
    "course_description": "Highly focused courses, drawing on multiple disciplines of the humanities and social sciences; may be repeated for credit when topics vary.",
    "prerequisites": null,
    "instructors": "Mark Risjord - Primary Instructor",
    "schedule_location": "MW 4pm-5:15pm in Callaway Center S420",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3074, Section #: 3, Type: LEC, Campus: ATL, Meets: MW 4-5:15p, Instructor: M. Risjord, Status: Wait List",
    "date_accessed": "2024-03-30"
}