{
    "course_code": "IDS 385W",
    "course_title": "Special Topics: Bioethical Issues 21st Century",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Continuing Writing Requirement",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "Bioethical Issues of the 21st Century. Following the atrocities committed during WWII with human experimentation, an awakening of sorts took place, spurring the creation of our modern conceptions of bioethics. These ideas have helped shape our current regulations regarding clinical research and the implementation of certain techniques but have also shined light on age old conversations. As technology continues to advance new possibilities are unlocked, and new ethical issues will emerge and undoubtedly come to the forefront of the public conscious. For instance, during the latter half of the 20thcentury bioethics wrestled with questions related to cloning, invitro fertilization, and end of life care in a world where machines can keep humans alive past the point of brain death. What issues will we face post 2021? In this class, we will cover contemporary and future issues in bioethics, with an eye toward those which are likely to play a major role in healthcare. Topics will include biomedical enhancement, \"designer\" babies, privacy in the age of big data, and regulating research in a global society. This will be accomplished through a series of short papers and a group research project, which will be shared at an open symposium with faculty from the Center for Ethics and the Institute for Liberal Arts.",
    "course_description": "Highly focused courses, drawing on multiple disciplines of the humanities and social sciences; may be repeated for credit when topics vary.",
    "prerequisites": null,
    "instructors": "Jordan Lewis - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Callaway Center S420",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3013, Section #: 4, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: J. Lewis, Status: Wait List",
    "date_accessed": "2024-03-30"
}