{
    "course_code": "IDS 385W",
    "course_title": "Special Topics: Trans and Nonbinary Poetry",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 19 / Seats Avail: 4Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Continuing Writing Requirement",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "This course explores poetry written by trans (genderqueer, nonbinary, transsexual) authors writing in English from the mid 20th century through the early 21st century. We'll be investigating questions such as: What is the documented history of this poetry so far? What is the relationship between form and content for poetry written by trans authors? Do trans poets, experiences lead to commonalities in subject matter or narrative in poems? Do their experiences lead to similarities in the use of formal poetic elements? What does reading work by trans poets mean in a political context that frames trans identities as \"fake news,\" or that celebrates us superficially but without advocating for structural change? Can we read trans poetry without reference to biography, or is knowing specifics of authors, identities essential to understanding their work? Do trans poets stay strictly within poetry as a genre? How might frames such as trans history, critical race studies, decoloniality, feminism, transfeminism, disability studies, or class struggle help us read trans poetry? By the end of a semester reading widely in this literature and talking with visiting trans poets in person, we'll collaboratively build a picture of what trans poetry is for us today, generating our own texts and a final research project in conversation with it.",
    "course_description": "Highly focused courses, drawing on multiple disciplines of the humanities and social sciences; may be repeated for credit when topics vary.",
    "prerequisites": null,
    "instructors": "Trace Peterson - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in Callaway Center S103",
    "course_resources": null,
    "sections": "Class Nbr: 3017, Section #: 5, Type: LEC, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: T. Peterson, Status: Open",
    "date_accessed": "2024-03-30"
}