{
    "course_code": "IDS 385W",
    "course_title": "Special Topics: Friendship and Islam",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 19 / Seats Avail: 2",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Continuing Writing Requirement",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "What do the poet Rumi, bureaucrat Sari Mehmed Pasha, and comics author G. Willow Wilson have in common? They are all Muslim theorists of friendship. In this class we will explore the relationship between Islam and friendship across time and space. We begin with the poetry of Rumi and others to understand how Islamic mystics define friendship with God. We will then look to Islamic political theorists, past and present, to determine how friendship is deployed in international relations. Comparing Ottoman imperial handbooks and speeches from figures like Ayatollah Khomeini we will ask: how is friendship a limiting or liberating construct in international relations? We end with a focus on personal friendship(s). With an eye to anthropological theories, we will look at friendship across religious divides in Palestine, representations in graphic novels, and female kinship in Muslim quarters of Mumbai. \nWeekly readings will range from 50-75 pages. Class time will be split between discussion of primary texts and `practicum' sessions, where students work individually or in groups on activities such as object analyses, digital galleries, or debates. Three main assignments will include a presentation, op-ed, and capstone project of the student's choice (i.e.: research paper, podcast, graphic novel, creative essay, digital art gallery, StoryMap, etc.).",
    "course_description": "Highly focused courses, drawing on multiple disciplines of the humanities and social sciences; may be repeated for credit when topics vary.",
    "prerequisites": null,
    "instructors": "Peter Kitlas - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Callaway Center S103",
    "course_resources": null,
    "sections": "Class Nbr: 3026, Section #: 6, Type: LEC, Campus: ATL, Meets: TTh 10-11:15a, Instructor: P. Kitlas, Status: Open",
    "date_accessed": "2024-03-30"
}