{
    "course_code": "ELSP 520",
    "course_title": "Seminar in Professional Communication",
    "credit_hours": "2",
    "seats": "Seats: Maximum Enrollment: 8 / Seats Avail: 2",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "Flexible/Hyflex",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(S/U Only)\n\n\nAudience: International graduate students who speak English as an additional language at the level of Advanced High2 \nMeeting times: Once per week in person for 100 minutes; day and time TBD based on enrolled students' availability \nELSP 520 is designed to refine the academic and professional speaking performance of Advanced High and Superior level students (OPI (Oral Proficiency Interview) Levels 3.7-4.0). ELSP 520 provides an environment in which students practice self-selected professional and academic speaking tasks. This course will help participants improve performance when completing complex, linguistic tasks over a variety of topics; advance their ability to use explanation and exemplification to construct coherent arguments and hypotheses; and attend to and self-correct pronunciation or grammatical errors that are patterned. Participants meet as a group for discussions, presentations, and classroom activities, and also with the course instructor for one-on-one consultations.  \nContact: Heather Boldt, hboldt@emory.edu, Director, LGS English Language Support,",
    "course_description": "Designed to improve the academic and professional speaking performance of the Advanced and Superior level students (OPI Levels 3.7-4.0)1. ELSP 520 provides an environment in which students practice professional and academic speaking tasks with self-confidence. Students meet as a group for discussions, presentations, and classroom activities, as well as individually for one-on-one consultations with the instructor in which they receive feedback on activities and practice with presentations, lectures, and discussions.",
    "prerequisites": null,
    "instructors": "Grace Song - Primary Instructor",
    "schedule_location": "Th 4pm-5:40pm in North Decatur Bldg 101D",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ELSP_520_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 5979, Section #: 1, Type: LEC, Campus: ATL, Meets: Th 4-5:40p, Instructor: G. Song, Status: Open",
    "date_accessed": "2024-03-30"
}