{
    "course_code": "ELSP 510",
    "course_title": "ESL 510: Fundamentals of Graduate Writing I",
    "credit_hours": "2",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "Varies by section",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(S/U Only)\n\n\nAudience: \nLGS graduate students who use English as an additional language; 510 is designed and required for intermediate writers of English ; students in the advanced-low range can elect to take this course \nMeeting times: \nOnce per week for 75 minutes with an additional 30-minute online lab; days/times TBD based on enrolled students' availability\nDescription:\nFew skills will be as important to you as a graduate student and professional scholar as writing. ELSP 510 sets priorities for learning to help you build a solid foundation of writing standards, strategies, and skills to begin to position yourself as a successful writer in the academic community. To be recognized as a member of an academic community, you must write purposefully and accurately with a particular audience in mind, which requires effort. ELSP 510 emphasizes the importance of continuous practice, revising, and editing as participants further develop the important skill of writing. \nContact: \nHeather Boldt, hboldt@emory.edu, Director, LGS English Language Support Program",
    "course_description": "Few skills will be as important to you as a graduate student and professional scholar as writing. ELSP 510 sets priorities for learning to help you build a solid foundation of writing standards, strategies, and skills to position yourself as a successful writer in the academic community. To be recognized as a member of an academic community, you must write purposefully and correctly, which requires effort. ELSP 510 emphasizes the importance of continuous practice, revising, and editing in developing this skill.",
    "prerequisites": null,
    "instructors": "Grace Song - Primary Instructor",
    "schedule_location": "Varies by section",
    "course_resources": null,
    "sections": "Class Nbr: 5973, Section #: 1, Type: LEC, Campus: ATL, Meets: T 9:30-10:45a, Instructor: G. Song, Status: Open\nClass Nbr: 6091, Section #: 2, Type: LEC, Campus: ATL, Meets: W 9:30-10:45a, Instructor: G. Song, Status: Open",
    "date_accessed": "2024-03-30"
}