{
    "course_code": "ELSP 521",
    "course_title": "Laboratory in Graduate and Professional Writing",
    "credit_hours": "2",
    "seats": "Seats: Maximum Enrollment: 8 / Seats Avail: 8",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "Blended/Hybrid",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(S/U Only)\n\n\nAudience: \nMultilingual graduate students who are currently working on a specific text \nMeeting times: \nOnce per week for 100 minutes; day and time TBD based on enrolled students' availability \nThis elective course is designed to support students who need to make significant progress on a particular graduate or professional writing. The text could be a research article for publication, a second- or third-year paper, a research proposal, or any other text focused on research broadly defined. Participants will work on designing a writing plan, crafting strong arguments, analyzing their subgenre for common moves and language, writing effectively at both the paragraph and sentence level, and revising drafts of the text as it progresses. Participants will be asked to submit a brief description of the target text before enrollment to ensure its appropriateness. \nContact: Heather Boldt, hboldt@emory.edu, Director, LGS English Language Support Program.",
    "course_description": "ELSP 521 an intensive analysis of the principles and revision practices of research article writing. Tools such as rhetorical, genre, and corpus analysis may be used to analyze published literature in their own field and then apply conclusions to an original piece of writing. Course content focuses on the central role of rhetorical organization, development of identifying an argument, a research gap, construction of logical arguments, data interpretation, as well other important concepts including reader-oriented writing, style, and tone.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ELSP_521_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 5976, Section #: 1, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: Staff, Status: Open",
    "date_accessed": "2024-03-30"
}