{
    "course_code": "FREN 391R",
    "course_title": "Francophone Studies",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 9Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "Intercultural Communication w. Race & Ethnicity(*)",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Mediterranean Ecologies in French-speaking Literature and Media \nIn La Désirante, Malika Mokeddem writes: \"Sur cette Méditerranée, j'apprends le sens de la disparition. Mes traversées sont celles d'un Ulysse sans Ithaque. Ulysse, quand les cris de milliers de naufragés remplacent le chant des sirènes\" (155). In comparing Odysseus' itinerary to her female character in exile, Mokeddem pictures the Mediterranean sea as a space of erasure and disappearance in a context marked by North African and Sub-Saharan migration. What is the Mediterranean today ? What can Mediterranean ecologies tell us, regarding our context of ecological and migratory crises ?\nIn this class, students will examine the different roles of Mediterranean ecologies in three French-speaking areas around the Mediterranean Sea: Morocco, Algeria, and Southern France. But more than focusing on national borders, students will focus on Mediterranean landscapes, like the sea or the desert, to investigate how these ecosystems challenge the idea of borders. \nWith discussions encompassing genders, migrations, environmental and social justice, students will think critically about ecosystems in Mediterranean literary and cultural productions.\n\n\nA selection of texts, photographs, films and documentaries will help us to adopt pluri-disciplinary visions of the environment. This class will also engage with the work of NGOs advocating for environmental justice in the region. \nBook to purchase:\nMur Méditerranée, Louis-Philippe Dalembert 978-2757882757\nPrerequisites:  FREN 310W and FREN 314.",
    "course_description": "A survey of literary and cultural creations from the Francophone world, with a special emphasis on Africa, the Caribbean, and South East Asia.",
    "prerequisites": "FREN 310 or FREN_OX 310 and FREN 314 or FREN_OX 314 or equivalent transfer credit as prerequisite.",
    "instructors": "Ninon VESSIER - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Candler Library 124",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_FREN_391R_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2403, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: N. VESSIER, Status: Open",
    "date_accessed": "2024-03-30"
}