{
    "course_code": "REL 358R",
    "course_title": "Religion and Healing",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 8 / Seats Avail: 4Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-05-17 through 2021-06-23",
    "class_notes": "(Same as JS 370 1, ANT 385 1)\nReligion and Healing: Bioethics and Assistant Reproductive Technologies\nThis online seminar explores how different cultures and religious traditions make sense of new medical technologies and their potential limitations. Case studies include cloning, surrogacy, abortion and transplants. Our primary focus will be on how science is adapted in different cultural and religious settings, through both ethnographic, religious and medical ethics writings. No prior background necessary but this course is best for upper level undergraduates, especially those with an interest in religion, anthropology and health sciences. Special focus on Judaism and Catholicism with material on Islam, Hinduism and Buddhism as well. Come, and challenge your assumptions about life, death, human reproduction and faith!\n\n\nThis is an online course. Emory College Online summer courses have required synchronous/live sessions every week. Students must be available to sign into and virtually attend the course online during those times (noted as the course meeting times- all times listed are local to Atlanta). Each course will also involve significant asynchronous material that you access on your own time in addition to standard amounts of readings and course assignments. Students should plan to spend 15-20 hours/week on this course. Please also be aware that faculty will begin corresponding with students during Week Zero of the course (one week before the official start date of the course), and that some interaction with the course may be required at that time. Students should begin checking the Canvas course site regularly one week prior to the official start of the term.\n\n\nThis course satisfies the new Religion major requirement: - Theme.",
    "course_description": "Designed to explore the mind/body connection as a paradigm to understand religion and healing. Will examine the role of faith, ritual, prayer, and meditation in various models of healing.",
    "prerequisites": null,
    "instructors": "Don Seeman - Primary Instructor",
    "schedule_location": "TTh 9:45am-11:15am in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 1532, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 9:45-11:15a, Instructor: D. Seeman, Status: Open",
    "date_accessed": "2024-03-30"
}