{
    "course_code": "REL 369R",
    "course_title": "Religion, Film & Media: Finding the Good Life",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 12Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-06-28 through 2021-08-04",
    "class_notes": "This course draws from contemporary cinema, television, and social media to contemplate exactly what is the \"good life\" and, equally important, how to go about finding it. Diverse filmmakers, screenwriters, and animators explore themes of virtue, success, and personal transformation, many drawing explicitly on religious and philosophical schools around the world that have offered various answers to such questions. Drawing from a range of films and media representations around the world, this course explores what it means to be human, what the good life might look like, and how one might pursue it.\n\n\nThis is an online course. Emory College Online summer courses have required synchronous/live sessions every week. Students must be available to sign into and virtually attend the course online during those times (noted as the course meeting times- all times listed are local to Atlanta). Each course will also involve significant asynchronous material that you access on your own time in addition to standard amounts of readings and course assignments. Students should plan to spend 15-20 hours/week on this course. Please also be aware that faculty will begin corresponding with students during Week Zero of the course (one week before the official start date of the course), and that some interaction with the course may be required at that time. Students should begin checking the Canvas course site regularly one week prior to the official start of the term.\n\n\nThis course satisfies the new Religion major requirement: - Theme.",
    "course_description": "Narrative films concerned with religious issues and experience; commonalities between the film medium and the performative religious imagination.",
    "prerequisites": null,
    "instructors": "James Hoesterey - Primary Instructor",
    "schedule_location": "TTh 4:45pm-6:15pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 1531, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 4:45-6:15p, Instructor: J. Hoesterey, Status: Open",
    "date_accessed": "2024-03-30"
}