{
    "course_code": "THM 650",
    "course_title": "ThM Project",
    "credit_hours": "2",
    "seats": "Seats: Maximum Enrollment: 1 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Varies by section",
    "dates": "2024-01-16 through 2024-04-29",
    "class_notes": null,
    "course_description": "In the spring semester following completion of ThM501, ThM students sign up for two hours of ThM project with the faculty adviser who will direct the ThM final writing project. The grade for this course and the project seminar (three credits total) are assigned upon completion of the final writing project.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: This section is full 6239, Section #: 1, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: N. Phillips, Status: Closed\nClass Nbr: This section is full 6240, Section #: 2, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: R. Nam, Status: Closed\nClass Nbr: This section is full 6241, Section #: 3, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. LeMon, Status: Closed\nClass Nbr: This section is full 6335, Section #: 4, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: L. Little, Status: Closed\nClass Nbr: This section is full 6441, Section #: 5, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: S. Higginbotham, Status: Closed\nClass Nbr: This section is full 6442, Section #: 6, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: S. Loesel, Status: Closed\nClass Nbr: This section is full 6477, Section #: 7, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: R. Soulen, Status: Closed\nClass Nbr: This section is full 6588, Section #: 8, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: N. Erskine, Status: Closed",
    "date_accessed": "2024-03-31"
}