{
    "course_code": "POLS 385",
    "course_title": "Special Topics: Political Science: Voting,Elections,PublicOpinion",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 60 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "> Democracy is generally understood to be the basis of the American political system, with elections serving as the primary link between citizens and the representation they receive. Yet many of us stay home on election day, casual observers decry partisan politics, and polling reveals few Americans feel well represented by Congress. In this course, we will explore features of American electoral politics through three central questions, each addressing the points made above: \\textit{Why do we vote? What drives us to vote for one candidate over another? When do our political opinions impact candidate and officeholder positions?} While we will emphasize the many answers political science provides, we will also pay attention to the way campaigns perceive voters, and how data journalism and quantitative analysis can help us understand election results. Most of the course will focus on recent presidential and congressional elections, including the elections of Donald Trump, Joe Biden, and the 2022 midterm elections. The end goal of the course is to move beyond an us vs. them understanding of elections, and instead see how a scientific understanding of the electoral process can help explain the politics of today.",
    "course_description": "Selected topics and problems in political science. Content will vary in successive offerings of this course. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Bernard Fraga - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in New Psyc Bldg 290 (36 Eagle Ro",
    "course_resources": null,
    "sections": "Class Nbr: 5288, Section #: 3, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: B. Fraga, Status: Open",
    "date_accessed": "2024-03-30"
}