{
    "course_code": "POLS 490R",
    "course_title": "Advanced Seminar: Elections in Developing World",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 8",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "Elections have the potential to enhance public officials' accountability and responsiveness to citizens demands. Yet, in many countries where leaders are popularly elected, objective measures of their performance, as well as the citizens' perception about the quality of government, suggest that these\nbenefits are not being realized. In this course, we study why this is the case. We focus on developing countries drawing on examples from Africa, Asia, and Latin America. The course is divided into four modules. The first starts with an overview of the differences between elections in industrialized countries and developing ones. We continue with a module on the accountability-enhancing role of elections. The third deals with common forms of electoral manipulation. The last module touches on the role of the international community in promoting democracy, the effects of these interventions, and the challenges faced by election monitors. POLS208 is a prerequisite.",
    "course_description": "Open only to senior and junior majors and others by permission of instructor. Selected topics in political science.",
    "prerequisites": null,
    "instructors": "Miguel Rueda Robayo - Primary Instructor",
    "schedule_location": "F 2:30pm-5:15pm in Candler Library 122",
    "course_resources": null,
    "sections": "Class Nbr: 2726, Section #: 3, Type: SEM, Campus: ATL, Meets: F 2:30-5:15p, Instructor: M. Rueda Robayo, Status: Open",
    "date_accessed": "2024-03-30"
}