{
    "course_code": "POLS 494W",
    "course_title": "Research Topics Seminar in Political Sciences: New Black Political Leadership",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 5",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "HSCW w/Race & Ethnicity Req.",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Same as AAS 485W 1)\n(\"Is there a crisis or dearth of political leadership in the African American community? Who are the up-and-coming leaders in African American politics, and how are they ascending to national prominence? What is the implication of the ascent of these \\\"\"leaders\\\"\" for the advancement of African American political interests? In this course, students will examine contemporary African American politics to determine whether and how the new generation of African American leaders, (i.e. Kamala Harris, Cory Booker, Hakeem Jeffries, etc.) promote an African American agenda in a post-Obama environment. Students will apply their knowledge to an in-depth research project which probes the relationship between the leadership styles of individual African American politicians or political groups and the substantive representation that these leaders provide on important policy issues.",
    "course_description": "Research Seminar on selected topics and problems in political science. Class will fulfill the \"research\" requirement for the political science major. May be repeated for credit when the topic varies.",
    "prerequisites": "POLS 208 or POLS_OX 208 or equivalent transfer credit as prerequisite.",
    "instructors": "Andra Gillespie - Primary Instructor",
    "schedule_location": "M 4pm-6:45pm in Bowden Hall 116",
    "course_resources": null,
    "sections": "Class Nbr: 2703, Section #: 2, Type: LEC, Campus: ATL, Meets: M 4-6:45p, Instructor: A. Gillespie, Status: Open",
    "date_accessed": "2024-03-30"
}