{
    "course_code": "PSP 760",
    "course_title": "Introduction to Psychoanalytic Studies",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 8",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "Description: This seminar will introduce students and candidates to basic concepts in Freudian theory; the various schools of thought and techniques that have proliferated in the 100-plus years since, including ego psychology, object relations theory, contemporary relational theory, Lacanian psychoanalysis, psychoanalytic feminism; and clinical technique associated with each school of thought. For most sessions, we will devote the first half of each class to the close reading and interrogation of psychoanalytic theory. The last half  of each class will be an opportunity to observe the ways in which clinical material demonstrates the theories discussed. Most sessions will feature guest speakers, about half of whom are practicing analysts and the other half being scholars of the various psychoanalytic schools. Some are both. The goals of the seminar are (1) to introduce students to basic psychoanalytic concepts, (2) to familiarize them with the plurality of approaches that have been developed and employed since Freud, (3) to help them peer into the clinic of each of the various approaches, and (4) to help students find and develop their own psychoanalytic point of view. While this is a required course for the certificate in the Psychoanalytic Studies Program and for first year candidates in the Emory University Psychoanalytic Institute, all PhD students in the Laney Graduate School, including those not pursuing the certificate, are welcome.",
    "course_description": null,
    "prerequisites": null,
    "instructors": "Robert A Paul - Primary Instructor",
    "schedule_location": "Th 6:15pm-8:45pm in New Psyc Bldg 225 (36 Eagle Ro",
    "course_resources": null,
    "sections": "Class Nbr: 4874, Section #: 1, Type: SEM, Campus: ATL, Meets: Th 6:15-8:45p, Instructor: Paul/Speanburg, Status: Open",
    "date_accessed": "2024-03-30"
}