{
    "course_code": "PSP 789",
    "course_title": "Special Topics in Psychoanalytical Studies: Feminist and Queer Freud",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 4 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Same as WGS 756 1)\n(Course Description: Penis envy?  Castration?  Narcissism?  Perversion?  Repression?  Disavowal?  What do all these Freudian terms mean, and what is their relevance for contemporary life?  The aim of this course is two-fold: (i) to introduce students to the core concepts of Freudian psychoanalysis, and (ii) to track these concepts in feminist and queer theory. The course presumes no prior knowledge of psychoanalysis and will provide the foundations for students who have interests in post-Freudian thinkers like Lacan, Klein, Winnicott etc. The course will begin with the central theoretical concepts in Freud's metapsychology: drives, repression, the unconscious, dream interpretation, the symptom.  We will be particularly interested in how psychoanalysis challenges the notion of a unified, conscious subject. In the second half of semester, the course will focus on the perverse and corporeal nature of infantile sexuality, and use this to investigate psychoanalytic accounts of adult sexuality and gender. In the final weeks of the course, we will survey some influential feminist and queer uses of Freud.)",
    "course_description": "Special Topics in Psychoanalytical Studies",
    "prerequisites": null,
    "instructors": "Elizabeth Wilson - Primary Instructor",
    "schedule_location": "M 4pm-6:45pm in Candler Library 125",
    "course_resources": null,
    "sections": "Class Nbr: 4354, Section #: 1, Type: LEC, Campus: ATL, Meets: M 4-6:45p, Instructor: E. Wilson, Status: Open",
    "date_accessed": "2024-03-30"
}