{
    "course_code": "PHIL 117",
    "course_title": "Nature/Envrnmnt/Sustainability",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(This class will meet on Mondays at 9:40 AM - 10:55 AM, with additional asynchronous content.)\nHi Debbie,\nHow is this for PHIL 117?\nThis course will introduce students to a number of seminal thinkers and important concepts from within environmental philosophy, pressing students to consider not only the value of the environment to human projects and our responsibility to various facets of this environment (environmental ethics), but the fundamental relationship between humans and the non-human environment and to what extent our guiding assumptions and distinctions are genuine and coherent (philosophy of nature). Students will then apply these ideas to case studies through the lens of sustainability, which, far more than simply 'green rhetoric,' will be shown to be capable of capturing a robust account of relationships and obligations in pursuit of an inclusive vision of 'the good' for ourselves, the planet, and our co-inhabitants. \nTextbooks:\nCallicott, J. Baird, and Michael P. Nelson. The Wilderness Debate Rages On: Continuing the Great Wilderness Debate. Athens: University of Georgia Press, 2008. ISBN-13: 978-0820331713.\nLight, Andrew, and Holmes Rolston III. Environmental Ethics: An Anthology. Malden: Blackwell Publishing, 2003. ISBN-13: 978-0631222941.",
    "course_description": "This course should encourage you to uncover and explore assumptions and evaluations concerning the so-called \"natural world\" or \"environment\". Each individual and society exists within an environment, and the character of this relation not only influences the relations of human and non-human creatures, but also lies at the heart of human self-understanding. Through reflection upon these and related issues, this course will develop critical reading, writing, and thinking skills by way of an introduction to and encounter with contemporary issues in environmental philosophy.",
    "prerequisites": null,
    "instructors": "Sadie Warren - Primary Instructor",
    "schedule_location": "M 9:40am-10:55am in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3384, Section #: 1, Type: LEC, Campus: ATL, Meets: M 9:40-10:55a, Instructor: S. Warren, Status: Closed",
    "date_accessed": "2024-03-30"
}