{
    "course_code": "PHIL 190",
    "course_title": "Fresh Sem: Philosophy: Thoreau's Walden",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "You must have permission to enroll in-person.\n(Freshmen Seminar - Limited to First-Year Students Only)\nFor my PHIL 190: Thoreau's Walden\nCourse Description: Thoreau's Walden tries to reimagine what life could be like under conditions of increasing industrialization and commercialization. Convinced that his peers lead lives of \"quiet desperation,\" living only to work to pay bills, he experiments with a simplified economy that leaves room for the pursuit of an ecologically oriented cosmopolitanism. We will read the whole of Walden, focusing on the various positions it develops, and how, as a rhetorical whole, it pursues moral reform. \nRequired Texts: There is one book for the course, the third edition of the Norton Critical Edition of Walden. Students must use this edition. \nHenry David Thoreau. Walden, Civil Disobedience, and Other Writings. 3rd Edition. Ed. William Rossi. W.W. Norton & Company. ISB# 9780393930900.\nGrading Details: Students will: (a) write short, one-page, weekly papers, graded P/NP; (b) an expository paper, 4-5 pages graded A, B, etc.; (c) a 6-8 page term paper exploring a chapter of your choice, which will be written in stages, including a full draft and ensuing revision; and (d) participate in a group presentation to be delivered during the second part of the semester. Finally, attendance is required.",
    "course_description": "Study and analysis of the thought of one major philosopher or the study of a special problem or set of related problems in philosophy.",
    "prerequisites": null,
    "instructors": "John Lysaker - Primary Instructor",
    "schedule_location": "TTh 11:20am-12:35pm in Atwood Chemistry Bldg. 215",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3354, Section #: 2, Type: SEM, Campus: ATL, Meets: TTh 11:20a-12:35p, Instructor: J. Lysaker, Status: Closed",
    "date_accessed": "2024-03-30"
}