{
    "course_code": "PHIL 385W",
    "course_title": "Special Topics in Philosophy: Philosophy in a Time of Plague",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 3",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "TOPIC: Philosophy in a Time of Plague\nPlagues have been around for millennia and this course provides an overview of theoretical and literary responses to them in the western world. Materials range from Ancient Athens and Rome (Thucydides, Lucretius) to Renaissance Italy (Boccaccio), modern 17th century London (De Foe), 20th century Algiers (Camus), and into the 21st century United States. Theoretical considerations will include Nietzsche's aesthetic opposition between Apollo and Dionysus, Susan Sontag's notion of illness as metaphor, Foucault's conception of plague as provoking a new stage in the history of state power and surveillance, Zizek's connection of the pandemic with communism, and contemporary discussions of racial disparities in COVID-19 treatment access and patient outcomes in the U.S.. We will see that while much has changed over the centuries, much has also eerily stayed the same. A final project will invite students to use course authors and ideas to address the current COVID-19 pandemic as well.",
    "course_description": "Selected topics and problems in philosophy. Content will vary in successive offerings of this course. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Andrew J Mitchell - Primary Instructor",
    "schedule_location": "TTh 11:20am-12:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 3387, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 11:20a-12:35p, Instructor: A. Mitchell, Status: Open",
    "date_accessed": "2024-03-30"
}