{
    "course_code": "PHIL 480RW",
    "course_title": "Seminar on Individual Philosophers",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 8",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "TOPIC: Hannah Arendt\nThis seminar will focus on the work of Hannah Arendt, one of the most original and influential thinkers of the twentieth century. Deeply schooled in the history of politics and philosophy, she was a penetrating observer and critic of twentieth century culture, attitudes, and failings. But she also always held out hope that, even in dark times, people could create something new and illuminating.  This seminar will work through Hannah Arendt's major concerns, from \"the space of appearance\" (the political) to the life of the mind (thinking, willing, judging).  We will also delve into literature around some of the more controversial aspects of her work. \nThe class will meet synchronously, with the professor lecturing one day a week and the other day featuring student presentations and group discussion.\nTexts:\nHannah Arendt, The Portable Hannah Arendt ISBN 978-0142437568\nHannah Arendt, Crises of the Republic ISBN 978-0156232005\nOther readings will be available on Canvas\nThe course is writing intensive. Students will write three short (750-word) papers and one final paper of about 3,000 words. The final paper should include revised material from at least one of the earlier papers. Students will also present their work in class and provide constructive commentary on other students' work.",
    "course_description": "Intensive study and analysis of the thought of one major philosopher. May be repeated for credit when the subject varies.",
    "prerequisites": "Two PHIL courses or equivalent transfer credit as prerequisite.",
    "instructors": "Noelle C McAfee - Primary Instructor",
    "schedule_location": "MW 2:40pm-3:55pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 5203, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 2:40-3:55p, Instructor: N. McAfee, Status: Open",
    "date_accessed": "2024-03-30"
}