{
    "course_code": "PHIL 423W",
    "course_title": "Feminist Philosophies",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 17 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "Course will meet once per week on Tuesdays.\n(Same as WGS 475RW 2)\nFeminist Philosophies: On Race within Latinx Feminisms \nCourse Description: \nThis course will explore race in Latinx feminisms, focusing on blackness and anti-blackness within the Latinx, Latin American, and Caribbean context. Readings will provide occasion to explore the construction as well as critique of the very category of Latinx and Latin-American; critiques and reappropriations of the language of mestizaje; the notion of amefricanidade and afro-latinamerican feminisms; and the challenges and possibilities of coalitional politics. The course will also discuss Latinx, Latin-American, and Caribbean feminisms' debt to black feminism.  \n \nTexts by: Sojourner Truth, Combahee River Collective, Audre Lorde, Frances Beale, Gloria Anzaldúa, María Lugones, Chela Sandoval, Lélia González, Betty Ruth Lozano, Yuderkys Espinosa Miñoso, Ochy Curiel, Yulexis Almedia Juncos, Yomaira Figueroa, and La Colectiva Feminista en Construcción",
    "course_description": "This course explores the central issues in feminist philosophies.",
    "prerequisites": "Two PHIL courses or equivalent transfer credit as prerequisite.",
    "instructors": "Rocio Zambrana - Primary Instructor",
    "schedule_location": "T 2:40pm-3:55pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 5204, Section #: 1, Type: LEC, Campus: ATL, Meets: T 2:40-3:55p, Instructor: R. Zambrana, Status: Closed",
    "date_accessed": "2024-03-30"
}