{
    "course_code": "PHIL 488W",
    "course_title": "Capstone Seminar",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 4",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": "Continuing Writing Requirement",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "This capstone seminar for students majoring in Philosophy, Politics, and Law will focus on populism and conspiracy theories, taking up their political, legal, and philosophical dimensions as well as their challenges for ethics and democracy.  \nThe class will meet synchronously, with the professor lecturing one day a week and the other day featuring student presentations and group discussion.\nThe course is writing intensive. Students will write three short (750-word) papers and one final paper of about 3,000 words. The final paper should include revised material from at least one of the earlier papers. Students will also present their work in class and provide constructive commentary on other students' work.\nTexts:\nPopulisms: A Quick Immersion, Carlos de la Torre, Tibidabo Press. 2019 ISBN 978-1-949-845-03-07\nConspiracy Theories, Quassim Cassam, Polity Press, 2019 ISBN 978-1509535835\nOther readings will be available on Canvas",
    "course_description": "A seminar reserved for senior PPL majors. It integrates each of the majors areas: the politics, law, and some subfield of philosophy such as ethics, epistemology, metaphysics, etc. The course is writing intensive and culminates in a final paper.",
    "prerequisites": "Two PHIL courses or equivalent transfer credit as prerequisite.",
    "instructors": "Noelle C McAfee - Primary Instructor",
    "schedule_location": "MW 11:20am-12:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 3394, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 11:20a-12:35p, Instructor: N. McAfee, Status: Open",
    "date_accessed": "2024-03-30"
}