{
    "course_code": "PHIL 789",
    "course_title": "Topics In Philosophy: Cynicism: Ancient and Modern",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 4",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "\"The Philosophy and Literature of Cynicism: Ancient and Modern\" | The purpose of this seminar is to investigate the origins and nature of the Cynic movement in antiquity and its reception in Renaissance and modern Europe. We will focus initially on the primary sources for the Dog- philosophers (e.g., Diogenes Laertius, Lucian, Plutarch, Dio Chrysostom, et al.), the most influential figures in the movement (Antisthenes, Diogenes, Crates, Menippus) and the peculiar place of the Cynics within Greek culture (including its role in the invention of Stoicism). The rest of the course will be devoted to exploring the ideological, literary and cultural ramifications of Cynicism in a variety of contexts from the Renaissance to the twentieth century: 1) the response to Cynicism in the works of the Renaissance Humanists, Diderot, Nietzsche and Foucault; 2)Cynic literary forms such as Menippean satire, satiric dialogue and aphorism; and 3) the Cynic philosophy of laughter will provide central points of reference. In general we will be asking: What made Cynicism the most influential branch of the Socratic tradition in antiquity? Why has it become an object of contemporary interest in Nietzsche, Sloterdijk and Foucault?\n\n\nNo previous knowledge of Greek philosophy is required. Greek, Latin, French, German or Italian is useful, but the basic texts are available in bilingual editions. D. R. Dudley's A History of Cynicism (recently re-issued in paperback by Ariel) provides a good introduction to the ancient traditions.\nD. R. Dudley, A History of Cynicism (Cambridge 1937) rpt. Ares Pub. Chicago 0890053650; R. B. Branham and M. O. Goulet-Caze, eds., The Cynics: The Cynic Movement in Antiquity and Its Legacy (Berkeley 1996) 0520216458; and Diogenes Laertius, Loeb Classical Library vol. II (Cambridge, Mass. 1970) 0674992040; Diogenes Laertius, Lives of the Eminent Philosophers (ed. J. Miller; trans. P. Mensch; Oxford 2018) 9780190862176; L. Shea, The Cynic Enlightenment: Diogenes in the Salon (Johns Hopkins 2010) 0801893852.\n*Requirements for the course are active participation in the seminar and seminar reports; a paper is optional.\n\n\n*ONLINE MONDAY 2-5PM 3HR BLOCK SYNC",
    "course_description": null,
    "prerequisites": null,
    "instructors": "Bracht Branham - Primary Instructor",
    "schedule_location": "M 2pm-5pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 5147, Section #: 5, Type: LEC, Campus: ATL, Meets: M 2-5p, Instructor: B. Branham, Status: Open",
    "date_accessed": "2024-03-30"
}