{
    "course_code": "BIOL 385",
    "course_title": "Special Topics in Biology: Found. Ecological Forecasting",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Same as ENVS 385 1)\nFULL TITLE:  Foundations of Ecological Forecasting:  Predicting Nature Under Human Influence.  \nCourse Description:  Ecological forecasters have an important job:  predicting nature in what seems like an unpredictable world.  Ecosystems face pressures like natural disasters, anthropogenic destruction, and climate change.  Beyond conservation goals, humans also depend on ecosystem services for our way of life.  Thus, ecologists often want to predict how ecosystems will change in response to these pressures, with some degree of accuracy.  For example:  how many north Atlantic fish can be stably harvested this year?  Is there a brewing outbreak of harmful algal blooms in the Great Lakes? Predictions aren't just modeling exercises; they must be thoughtfully communicated to people and communities who make decisions about environmental management, human safety, wildlife conservation, and others.  The goal of this course is to (1) familiarize students with predictive ecological modeling, (2) identify the stakes for ecological prediction, and (3) communicate model findings to a broader audience.  This course is designed for students to learn basics; it is not meant to be mathematically advanced or include intimidating computer coding.  If you are a person with a stake in ecological outcomes (i.e., everyone), then this class is for you!",
    "course_description": "A course on topics of special biological interest, designed for Biology majors elective credit. This course is repeatable when the topic varies.",
    "prerequisites": "(BIOL 142 and BIOL 142L) or BIOL_OX 142WE or equivalent transfer credit as a prerequisite.",
    "instructors": "LM Bradley - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in Math & Science Center - W501",
    "course_resources": null,
    "sections": "Class Nbr: 3751, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: L. Bradley, Status: Wait List",
    "date_accessed": "2024-03-30"
}