{
    "course_code": "BIOL 497R",
    "course_title": "Supervised Reading",
    "credit_hours": "1-4",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Varies by section",
    "course_description": "Credit, one to four hours per semester. Prerequisite: permission of instructor.",
    "prerequisites": "(BIOL 142 and BIOL 142L) or BIOL_OX 142WE or equivalent transfer credit as a prerequisite.",
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 3756, Section #: 1, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: E. Abreu, Status: Open\nClass Nbr: 3854, Section #: 11, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Cole, Status: Open\nClass Nbr: 3856, Section #: 12, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: S. Comstra, Status: Open\nClass Nbr: 3874, Section #: 16, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Devineni, Status: Open\nClass Nbr: 3877, Section #: 17, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Eisen, Status: Open\nClass Nbr: 3878, Section #: 18, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Escobar, Status: Open\nClass Nbr: 3881, Section #: 19, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Fritz, Status: Open\nClass Nbr: 3903, Section #: 22, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. Jaeger, Status: Open\nClass Nbr: 3909, Section #: 23, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: W. Kelly, Status: Open\nClass Nbr: 3920, Section #: 28, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: L. Morran, Status: Open\nClass Nbr: 3925, Section #: 30, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: E. Nam, Status: Open\nClass Nbr: 3927, Section #: 31, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: K. O'Toole, Status: Open\nClass Nbr: 3931, Section #: 33, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Reyes, Status: Open\nClass Nbr: 3932, Section #: 34, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: L. Rieder, Status: Open\nClass Nbr: 3933, Section #: 35, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: I. Shepherd, Status: Open\nClass Nbr: 3934, Section #: 36, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: S. Sober, Status: Open\nClass Nbr: 3841, Section #: 4, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: E. Battaglioli, Status: Open\nClass Nbr: 3850, Section #: 8, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: K. Campbell, Status: Open\nClass Nbr: 3852, Section #: 9, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: L. Catano, Status: Open",
    "date_accessed": "2024-03-30"
}