{
    "course_code": "INTERN 497R",
    "course_title": "Advanced Practicum for Major",
    "credit_hours": "0-1",
    "seats": "Seats: Maximum Enrollment: 300 / Seats Avail: 300Waitlist Total: 0, Auto-Enroll",
    "waitlist_total": ": 0, Auto-Enroll",
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2024-05-17 through 2024-08-07",
    "class_notes": "(Permission Required Prior to Enrollment)\n\n\n(S/U Only)\n\n\nThis course, which builds on INTERN 496, is designed to enhance each student's internship, research, or applied arts experience while also advancing their level of career discernment and preparation. This course can be taken for zero-credits (9 assignments) or for one-credit (12 assignments), depending on the needs of the student. To be enrolled in this course, students must have an offer letter for an internship, research, or applied arts experience. Students receiving Pathways funding awards are automatically enrolled in the zero-credit version of the course and do not need to apply separately. For students who need the course for Curricular Practical Training (CPT), as a condition of their internship (i.e. an employer requires they enroll in an Emory internship course), or for personal enrichment, please submit an enrollment application on College Connect. The zero-credit version of the course is adequate for the purposes of CPT and internship credit and will not incur additional charges. If a student chooses to take the course for one-credit, however, standard fees and tuition for summer school will be charged to their OPUS account.",
    "course_description": "The Advanced Practicum provides an opportunity to further explore career interests while applying knowledge and skills learned in the classroom to a professional setting. Pre-and post-internship assignments help students think intentionally about their internship, goals, professional development.",
    "prerequisites": "INTERN 496R as prerequisite",
    "instructors": "Edmund Goode - Primary Instructor",
    "schedule_location": null,
    "course_resources": "https://emory.bncollege.com/course-material/course-finder?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_INTERN_497R_1_A24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 1999, Section #: 1, Type: IND, Campus: ATL, Meets: Meets Online, Instructor: E. Goode, Status: Open",
    "date_accessed": "2024-03-29"
}