{
    "course_code": "GRAD 700R",
    "course_title": "Interdisciplinary Seminar: Ethics in Literature",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 30 / Seats Avail: 23",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "Ethics in Literature: Representing Responsibility and Care with Dr. Laura Otis & Dr. Paul Root Wolpe: \nTogether we will examine how the ethics of responsibility and care, especially the caregiving/caretaking of other people, intersect with the creation and reading of literature. Is there a connection between caring in the creative act and caring for another human being? What have we learned about caregiving from the academic disciplines, with a focus on writings in bioethics, and how is that reflected in literary depictions of caregiving? And as readers and interpreters of literature, what can we learn about caregiving and responsibility from stories that represent situations of caregiving-or refusal to provide care? The course will highlight racial and ethnic disparities in caregiving resources and burdens, as well as cultural variations in the nature of caregiving. We will also look into emerging technologies in caregiving, and the changes that AI and robotics have made in caregiving. The course is designed to be hybrid so that the discussions can benefit from the different perspectives of graduate and undergraduate students across Emory's departments and schools.\nReadings will include Mary Shelley's Frankenstein, Toni Morrison's Beloved, Leo Tolstov's The Death of Ivan Ilyich, stories from Margaret Atwood's Moral Disorder and Lauren Groff's Florida.\nAppy for the course here: https://forms.gle/25s3ebRiroSDpe1LA",
    "course_description": null,
    "prerequisites": null,
    "instructors": "Laura Christine Otis - Primary Instructor",
    "schedule_location": "W 1pm-4pm in Ethics Center - RARB_162",
    "course_resources": null,
    "sections": "Class Nbr: 1518, Section #: 2, Type: SEM, Campus: ATL, Meets: W 1-4p, Instructor: Wolpe/Otis, Status: Open",
    "date_accessed": "2024-03-30"
}