{
    "course_code": "GH 500D",
    "course_title": "Addressing Key Issues in  Global Health",
    "credit_hours": "2",
    "seats": "Seats: Maximum Enrollment: 35 / Seats Avail: 8",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "SPRSUMMER",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2023-05-12 through 2023-07-30",
    "class_notes": "Permission Only - Program Approval to Take Courses Required.",
    "course_description": "The goal of the course is to equip students with critical perspectives to address current and future global health challenges and opportunities as public health professionals and global citizens in this increasingly interdependent world.  The course explores historical milestones, actors, assumptions, context and theories driving selected global health priorities in policy, programs and research. To do this, the course will enhance the skills of critical thinking, assessment of evidence from multiple perspectives and application of evidence in formulation of policies, programs and research priorities. A recurring theme throughout the course is that there are common global drivers influencing the health of populations in high, middle and low-income countries and cross-cutting issues such as inequality that transcend settings.",
    "prerequisites": "Prereq. for AEPI Students: AEPI 530D, AEPI 534D, AEPI 536D, AEPI 538D, BIOS 516D, BIOS 517D, BIOS 518D, or by special permission to enroll.\nPrereq. for PRS Students: PRS 505D, PRS 535D, PRS 542D, as prerequisites or by special permission to enroll.",
    "instructors": "Juan Leon - Primary Instructor",
    "schedule_location": "F 4pm-7pm in R. Randall Rollins Bldg. R201\nSu 8:30am-11:30am in R. Randall Rollins Bldg. R201",
    "course_resources": null,
    "sections": "Class Nbr: 1018, Section #: 901, Type: SEM, Campus: ATL, Meets: F 4-7p; Su 8:30-11:30a, Instructor: J. Leon, Status: Open",
    "date_accessed": "2024-03-30"
}