{
    "course_code": "BUS 480",
    "course_title": "Senior Seminar: Real Estate Topics",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 45 / Seats Avail: 2",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "Meets Tuesdays 6:00-8:00 pm on the following dates: 2/2, 2/9, 3/2, 3/23, 3/30, alternate dates:  4/6, 4/13. The alternate date will only be used if the instructor or school has an emergency that causes one of the regularly scheduled dates to be cancelled (it is not an additional makeup session for a missed class). \nSeminar Description:  This seminar focuses on giving participants a practical overview into several diverse segments of today's real estate industry.  Areas we will discuss include commercial and residential segments with focus on: consulting and valuation, public sector real estate challenges and opportunities, real estate development and redevelopment opportunities, entrepreneurism, brokerage, investment, leasing, corporate real estate real estate issues, and technology opportunities within the industry.  Our sessions will use the contemporary real estate marketplace as a consistent backdrop and will consist of interactive discussions about \"real world\" applications and issues as well as periodic input from other experienced industry experts and practitioners.   The seminar will include a field trip that illustrates one or more of the above sub-topics within the Atlanta-area real estate market.",
    "course_description": "Senior seminar courses fall outside the scope of traditional academic coursework, and instead allow students to learn from and interact with experienced practitioners, and to develop industry-specific insights, fine-tune career skills, and increase professional exposure.",
    "prerequisites": "This section is reserved for students in the BBA program.",
    "instructors": "Andrea Hershatter - Primary Instructor",
    "schedule_location": "T 6pm-8pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 1560, Section #: 1103, Type: SEM, Campus: ATL, Meets: T 6-8p, Instructor: A. Hershatter, Status: Open",
    "date_accessed": "2024-03-30"
}