{
    "course_code": "BUS 380",
    "course_title": "Professional Development",
    "credit_hours": "2",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Varies by section",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": null,
    "course_description": "Professional Development is composed of a series of sessions and assignments intended to help you prepare for your career and position you for success at Goizueta and beyond.  Professional Development incorporates career education and exploration with tools you'll use to successfully navigate your internship search.  You will learn about different industries and functions, you will explore how your personal interests align with potential careers, you will develop and refine your personal brand, and you will sharpen your interview skills.  After you complete this course, you will have a list of target companies, you will have started to build your professional network, and you will have laid the foundation for a successful internship and full-time search at Goizueta.  You will have a better understanding of yourself and your interests, and you'll be able to articulate your experiences through your personal brand materials, networking, and interviews.",
    "prerequisites": "This section is reserved for students in the BBA program.",
    "instructors": "Jane E Hershman - Primary Instructor",
    "schedule_location": "Varies by section",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 1671, Section #: 1101, Type: SEM, Campus: ATL, Meets: F 9:40-10:55a, Instructor: J. Hershman, Status: Wait List\nClass Nbr: This section is full 1672, Section #: 1102, Type: SEM, Campus: ATL, Meets: F 11:20a-12:35p, Instructor: J. Hershman, Status: Wait List\nClass Nbr: 1673, Section #: 1103, Type: SEM, Campus: ATL, Meets: F 1-2:15p, Instructor: J. Hershman, Status: Open",
    "date_accessed": "2024-03-30"
}