{
    "course_code": "BUS 480",
    "course_title": "Senior Seminar: Organ & Admin of NBA Franchise",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 50 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Closed",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "Meets Mondays 6:00-8:00 pm on the following dates: 2/8, 2/15, 2/22, 3/1, 3/8, alternate date: 3/15. The alternate date will only be used if the instructor or school has an emergency that causes one of the regularly scheduled dates to be cancelled (it is not an additional makeup session for a missed class). \nSeminar Description:  The NBA is an ever-changing business, but one constant is the necessity to build a playoff contender on the court. This seminar will examine today's most successful franchises and how they have organized their basketball operations. Class sessions will focus on staffing (coaching, scouting, player personnel, training, medical, etc.); player evaluation and personnel systems; player acquisition (including the NBA draft, trade procedures and free agency); salary cap analysis and overview; contract negotiations; team discipline; and methods to build team chemistry. This seminar will have a unique focus on the athletic side of the franchise, rather than on the marketing and business applications to sports. Anyone interested in owning or running a franchise, or working on the basketball side of the business will benefit from these sessions.",
    "course_description": "Senior seminar courses fall outside the scope of traditional academic coursework, and instead allow students to learn from and interact with experienced practitioners, and to develop industry-specific insights, fine-tune career skills, and increase professional exposure.",
    "prerequisites": "This section is reserved for students in the BBA program.",
    "instructors": "Andrea Hershatter - Primary Instructor",
    "schedule_location": "M 6pm-8pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 1559, Section #: 1102, Type: SEM, Campus: ATL, Meets: M 6-8p, Instructor: A. Hershatter, Status: Closed",
    "date_accessed": "2024-03-30"
}