{
    "course_code": "BUS 480",
    "course_title": "Senior Seminar: Excel for Intermediate Users",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 50 / Seats Avail: 4",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "Meets Tuesdays  6:00-8:00 pm on the following dates: 3/23, 3/30, 4/6, 4/13, 4/20, alternate date: 4/27. The alternate date will only be used if the instructor or school has an emergency that causes one of the regularly scheduled dates to be cancelled (it is not an additional makeup session for a missed class).  Seminar Description:  This seminar covers what is typically learned in the first three months on the job about mastering the building blocks of using Excel to solve business problems. It is an intermediate class, not an advanced one, and students with work experience at an investment bank should not enroll.  The seminar offers an engaging, hands-on format in which 90% of the class consists of students working in small groups, with frequent breaks to review the solution methodology.    The course will cover nuanced data manipulation, pivot table creation, keyboard shortcuts and alt-key techniques for formatting cells, calculation checking techniques such as formula auditing, introduction to vlookup, and forecasting techniques that use conditional parameters. This seminar is recommended for students who have basic Excel experience, and want to improve their comfort.",
    "course_description": "Senior seminar courses fall outside the scope of traditional academic coursework, and instead allow students to learn from and interact with experienced practitioners, and to develop industry-specific insights, fine-tune career skills, and increase professional exposure.",
    "prerequisites": "This section is reserved for students in the BBA program.",
    "instructors": "Andrea Hershatter - Primary Instructor",
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 1563, Section #: 1106, Type: SEM, Campus: ATL, Meets: Meets Online, Instructor: A. Hershatter, Status: Open",
    "date_accessed": "2024-03-30"
}