{
    "course_code": "BUS 480",
    "course_title": "Senior Seminar: Essentials Financial Modeling",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 45 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Closed",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "Meets Tuesdays 6:00-8:00 pm on the following dates: 2/2, 2/9, 2/16, 2/23, 3/2, alternate dates: 3/9, 3/23. The alternate date will only be used if the instructor or school has an emergency that causes one of the regularly scheduled dates to be cancelled (it is not an additional makeup session for a missed class). \nSeminar Description:  As all business areas including operations, marketing, and management become increasingly financially accountable, financial modeling has become a vital skill throughout an organization. Whether your interests range from marketing psychology to investment banking, Essentials of Financial Modeling covers critical analytical tasks particularly regarding financial statement analysis, financial model construction, and financial statement forecasting. Students should be familiar with financial accounting and Excel. This seminar does not cover how Excel works; it covers how to apply Excel when creating and analyzing models.\n     The seminar is entirely hands-on. The student must bring a laptop with Excel (any version) and shadow-model the instructor as he creates each model. The student's model must be turned in at the end of each session for review. Seminar pace and final coverage of models depends entirely on participants' abilities, but a total of 15 models are intended to be created.",
    "course_description": "Senior seminar courses fall outside the scope of traditional academic coursework, and instead allow students to learn from and interact with experienced practitioners, and to develop industry-specific insights, fine-tune career skills, and increase professional exposure.",
    "prerequisites": "This section is reserved for students in the BBA program.",
    "instructors": "Steven Ahn - Primary Instructor",
    "schedule_location": "T 6pm-8pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 1561, Section #: 1104, Type: SEM, Campus: ATL, Meets: T 6-8p, Instructor: S. Ahn, Status: Closed",
    "date_accessed": "2024-03-30"
}