{
    "course_code": "BUS 480",
    "course_title": "Senior Seminar: Strategies for Persuasion in Business",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 45 / Seats Avail: 12",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "Meets Wednesdays 6:00-8:00 pm on the following dates: 3/17, 3/24, 3/31, 4/7, 4/21, alternate date: 4/28. The alternate date will only be used if the instructor or school has an emergency that causes one of the regularly scheduled dates to be cancelled (it is not an additional makeup session for a missed class).  Seminar Description:  Academic debate and advocacy builds listening, research, critical thinking, and public presentation skills, such that 75% of the U.S. Congress, 10 modern U.S. Presidents, and the majority of corporate Chief Executive Officers credit the training with leadership and enhanced policy and decision making skill development.\n     Debate is a vehicle for focusing advocacy decisions and practices to essential elements, critically sorting issues to expose tendencies to privilege short term considerations over long term return on investment. Debate assigns participants randomly to advocate a particular side of a topic, thus removing fear of offending management. Assigned argument has strong applications for workplace advocacy in settings from conferences to meetings to government hearings. Critical thinking is a process. The resulting skill set encourages rapid assessment, synthesis, and persuasive delivery of ideas and programs.\n     This seminar will provide practical strategies for persuasion in business. The class will construct arguments, debate in teams, and develop critical thinking, reading and communication skills.",
    "course_description": "Senior seminar courses fall outside the scope of traditional academic coursework, and instead allow students to learn from and interact with experienced practitioners, and to develop industry-specific insights, fine-tune career skills, and increase professional exposure.",
    "prerequisites": "This section is reserved for students in the BBA program.",
    "instructors": "Andrea Hershatter - Primary Instructor",
    "schedule_location": "W 6pm-8pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 1564, Section #: 1107, Type: SEM, Campus: ATL, Meets: W 6-8p, Instructor: A. Hershatter, Status: Open",
    "date_accessed": "2024-03-30"
}