{
    "course_code": "BUS 480",
    "course_title": "Senior Seminar: Innovative Mkt Approaches",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 45 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Closed",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "Meets Wednesdays 6:00-8:00 pm on the following dates: 2/10, 2/24, 3/3, 3/17, 3/24,  alternate date: 3/31. The alternate date will only be used if the instructor or school has an emergency that causes one of the regularly scheduled dates to be cancelled (it is not an additional makeup session for a missed class).  Seminar Description:  This seminar focuses on the tools and innovative marketing tactics that can be employed to build \"brand love\" amongst target consumers.  From mining consumer insights, to building a brand vision and positioning, to leveraging marketing assets and partnerships, students will get an understanding of the steps that can be taken to build loyal consumer adoption of a brand.  Topics will include a discussion of how consumer insights lead to compelling brand vision and positioning, how to develop and articulate a core creative idea and integrated marketing communication brief, and how to leverage external partnerships and other tactics to build consumer loyalty.  The course will examine several brands that are using traditional and non-traditional methods to build brand love and win in today's marketplace.  Over the course of the session, the class members will develop a plan to build brand love for a brand of choice, as well as participate in an exercise to develop a brand vision and positioning for their personal brand.",
    "course_description": "Senior seminar courses fall outside the scope of traditional academic coursework, and instead allow students to learn from and interact with experienced practitioners, and to develop industry-specific insights, fine-tune career skills, and increase professional exposure.",
    "prerequisites": "This section is reserved for students in the BBA program.",
    "instructors": "Andrea Hershatter - Primary Instructor",
    "schedule_location": "W 6pm-8pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 1565, Section #: 1108, Type: SEM, Campus: ATL, Meets: W 6-8p, Instructor: A. Hershatter, Status: Closed",
    "date_accessed": "2024-03-30"
}