{
    "course_code": "BIOL 141",
    "course_title": "Foundations of Modern Biol I",
    "credit_hours": "3",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Varies by section",
    "instruction_method": "Varies by section",
    "typically_offered": "Fall",
    "requirement_designation": "Science, Nature, Technology",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "This is the first semester of a two-semester introductory biology course that is required for all Biology majors.  Students must also register for a BIOLOGY 141 Laboratory (Biol 141L).  These courses will provide a topic-driven overview of molecular and cellular biology, genetics, evolution, genomics, molecular, developmental, and cancer genetics.  The topics covered in class will address major issues in human biology and medicine.  The integrated lecture and lab will emphasize the basic principles and critical thinking involved in modern biological discovery.  In lab, students will design and perform experiments using several important model systems.   These courses include classical and molecular genetics and meet the biology premedical requirements.  Some exams may be administered in the evening.  AP Biology scores of 4 or 5 count for the Biology 141 LECTURE ONLY.  Co-requisite:  Biology 141L.",
    "course_description": "Major topics include: biomolecules, cell structure and function, energy metabolism, and cell reproduction. Fulfills biology major and pre-health requirements. Note: students receiving credit for Biol 141 must still take Biol 141L.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": "Varies by section",
    "course_resources": null,
    "sections": "Class Nbr: 1700, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 8:30-9:45a, Instructor: M. Reyes, Status: Open\nClass Nbr: 1701, Section #: 2, Type: LEC, Campus: ATL, Meets: MW 10-11:15a, Instructor: M. Reyes, Status: Open\nClass Nbr: 1702, Section #: 3, Type: LEC, Campus: ATL, Meets: MW 4-5:15p, Instructor: K. O'Toole, Status: Open\nClass Nbr: This section is full 1703, Section #: 4, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: E. Abreu, Status: Wait List\nClass Nbr: This section is full 1704, Section #: 5, Type: LEC, Campus: ATL, Meets: TTh 1-2:15p, Instructor: E. Abreu, Status: Wait List\nClass Nbr: This section is full 1705, Section #: 6, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: E. Nam, Status: Wait List\nClass Nbr: This section is full 1706, Section #: 7, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: Staff, Status: Closed",
    "date_accessed": "2024-03-30"
}