{
    "course_code": "BIOL 250",
    "course_title": "Cell Biology",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 60 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "The field of cell biology seeks to understand the structure, function, and dynamics of cellular systems, and how the interactions of these components underpin emergent properties such as cell physiology, proliferation, and motility.  We will delve more deeply into the structure and dynamics of eukaryotic cellular membrane systems and compartments, cell signaling, the cytoskeleton and cellular motility, as well as control of the cell cycle.  We will also practice critical thinking and analytical skills through problem solving and analysis of primary scientific literature.  Throughout the course, we will discuss how various aspects of cell biology relate to current medicine and biotechnology.  Prerequisites:  Biology 142 + 142L.  This course will fulfill the Column A (or elective) credit for the Biology major.",
    "course_description": "We will explore cells at the molecular level. Major themes include membrane organization and transport, protein trafficking, cytoskeleton structure and cell motility, cell adhesion, cell signaling, and the cell cycle. Key medical issues associated with cellular dysfunction will be presented.",
    "prerequisites": "(BIOL 142 and BIOL 142L) or BIOL_OX 142 or equivalent transfer credit as a prerequisite.",
    "instructors": "Jasmine Miller-Kleinhenz - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Atwood Chemistry Bldg. 215",
    "course_resources": null,
    "sections": "Class Nbr: 1720, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 10-11:15a, Instructor: Miller-Kleinhenz/Najmi, Status: Open",
    "date_accessed": "2024-03-30"
}