{
    "course_code": "BIOL 370LW",
    "course_title": "Intro.to Microbiology Lab",
    "credit_hours": "3",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Continuing Writing Requirement",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "This is the 2-credit hour OPTIONAL laboratory to accompany Biology 370 (Introduction to Microbiology) and will introduce students to some of the basic techniques used in the study of physiology, biochemistry, and genetics of microorganisms.  Students will isolate a soil microorganism at the beginning of the term and study its properties in subsequent periods.  The organisms will also be examined for the presence of plasmids and for their susceptibility to bacterial viruses.  Students will be graded on their performance in the lab, on two quizzes, and on a major report of their analysis of the organisms they isolate that will be due at the end of the term.  This course will fulfill elective and upper-level laboratory credit for the Biology major, as well as a Writing Requirement for the GERs.  There is no textbook for this course.  Prerequisites:  Biol 142/142L; pre- or co-requisite:  Biol 370.",
    "course_description": "Introduction to basic laboratory techniques in microbiology. Experiments dealing with the physiology, biochemistry, genetics, and molecular biology of microbes will be included. (This course meets the upper-level laboratory requirement and will count as elective credit for the Biology major.)",
    "prerequisites": "[(BIOL 142 and BIOL 142L) or BIOL_OX 142] as prerequisite and BIOL 370 as pre/co-requisite or equivalent transfer credit.",
    "instructors": "Kathleen Campbell - Primary Instructor",
    "schedule_location": "Varies by section",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 1809, Section #: 1, Type: LAB, Campus: ATL, Meets: W 2:30-5:30p, Instructor: K. Campbell, Status: Wait List\nClass Nbr: This section is full 4964, Section #: 2, Type: LAB, Campus: ATL, Meets: Th 2:30-5:30p, Instructor: K. Campbell, Status: Closed",
    "date_accessed": "2024-03-30"
}