{
    "course_code": "EH 587",
    "course_title": "Intro.to Satellite Remote Sensing of the Environment and its Applications in PH",
    "credit_hours": "2",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 7",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-16 through 2024-04-29",
    "class_notes": "May enroll in optional lab EH 587L.",
    "course_description": "Prerequisites: at least one GIS class (INFO 530) or equivalent.  Geospatial information collected from satellite remote sensing has become a powerful tool in environmental and public health science and policy making. However, public health researchers usually lack training to benefit from this rapidly evolving technology. This computer lab-based course provides students with the theoretical basis and refined understanding of satellite remote sensing technologies, and tools for geospatial data analysis. Students will learn (1) the history, terminology and data structure of both land and atmospheric remote sensing such as those from MODIS and Landsat, and (2) the strategies and techniques to analyze geospatial data in advanced software packages. Various case studies and lab exercises help students overcome the initial hurdle to the effective use of satellite data in land use change and air pollution characterization, climate change and other areas related to public health. The final project allows the students to apply satellite data together with other information to solve a problem of their interest.",
    "prerequisites": null,
    "instructors": "Yang Liu - Primary Instructor",
    "schedule_location": "M 8am-9:50am in Grace Crum Rollins TBA",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_EH_587_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2053, Section #: 1, Type: LEC, Campus: ATL, Meets: M 8-9:50a, Instructor: Liu/Pu, Status: Open",
    "date_accessed": "2023-10-31"
}