{
    "course_code": "EH 590R",
    "course_title": "Environmental Health Seminar: Planetary Health",
    "credit_hours": "2",
    "seats": "Seats: Maximum Enrollment: 30 / Seats Avail: 23",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-16 through 2024-04-29",
    "class_notes": "Topic: Planetary Health.  The Planetary Health Alliance defines planetary health as a \"solutions-oriented, transdisciplinary field and social movement focused on analyzing and addressing the impacts of human disruptions to Earth's natural systems on human health and all life on Earth.\" In this course, we will explore threats to human health that stem from anthropogenic changes to our environment using this lens of planetary health. Understanding the intersection of both the upstream harms inflicted by humans on the planet (i.e. climate change, ecosystem degradation, environmental pollution) and the downstream consequences on human health (i.e. emerging infectious diseases, food insecurity, chronic disease) is critical to building better and more sustainable responses to public health threats. Course sessions will include lectures from experts from various disciplines working in this sphere as well as case-based learning where students can practice using a planetary health lens to tackle real-world problems.",
    "course_description": "Various topics by GDEH faculty. Check OPUS/Atlas for current topics and descriptions.",
    "prerequisites": null,
    "instructors": "Jessica Fairley - Primary Instructor",
    "schedule_location": "Th 1pm-2:50pm in R. Randall Rollins Bldg. R100",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_EH_590R_2_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 1178, Section #: 2, Type: SEM, Campus: ATL, Meets: Th 1-2:50p, Instructor: J. Fairley, Status: Open",
    "date_accessed": "2024-03-30"
}