{
    "course_code": "EH 590R",
    "course_title": "Environmental Health Seminar: Design,Deliv,AssessWASH School",
    "credit_hours": "2",
    "seats": "Seats: Maximum Enrollment: 99 / Seats Avail: 87",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-16 through 2024-04-29",
    "class_notes": "Topic:  Design, delivery, and assessment of WASH in school programs. Online with both synchronous and asynchronous sessions. S/U grading basis only. Topic: Design, delivery, and assessment of WASH in school programs. This course is designed to help students, as future public health practitioners, develop the knowledge and skills necessary to be and engage with water, sanitation, and hygiene (WASH) champions, program managers, researchers, policymakers, and donors. More specifically, the course supports applied learning on developing, executing, and evaluating sustainable and inclusive WASH in Schools interventions in collaboration with local, sub-national, and national stakeholders. The course addresses core areas of WASH in Schools programming within 9 modules that will help students identify areas of intervention, articulate what the program will do to bring about change, and how program success can be measured. We will cover recent WASH in Schools initiatives, introduce key evidence from literature, and discuss lessons learned to help maximize program impact and sustainability. Students will have the opportunity to interact with development professionals and policy makers from countries around the world and hear from speakers from organizations such as UNICEF, CARE, Save the Children, GIZ and others.",
    "course_description": "Various topics by GDEH faculty. Check OPUS/Atlas for current topics and descriptions.",
    "prerequisites": null,
    "instructors": "Matthew Freeman - Primary Instructor",
    "schedule_location": "W 8am-8:50am in ONLINE",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_EH_590R_3_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 1184, Section #: 3, Type: SEM, Campus: ATL, Meets: W 8-8:50a, Instructor: M. Freeman, Status: Open",
    "date_accessed": "2024-03-30"
}