{
    "course_code": "REL 190",
    "course_title": "Fresh Sem: Religion: Fortune-telling and Fate",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "This course satisfies the new Religion major requirement:- Theme.\nFlip a coin. Pick out Tarot cards. Cast the Yijing (I-Ching). Look to the stars. Read your palms. Spirits who speak through us. In search of secret knowledge, we interpret dreams, clouds, earthquakes, eclipses, needles, dung, dead bodies, birds, the tea leaves in the bottom of our cups, the number of petals on a flower.\n \nWe want to see the future, we want to know what choices to make, we want to understand hidden realities, we want to see what is hidden in our own minds. Is today my lucky day? Who should I love? When should we get married? Where should I dig a grave? Which med school to apply to? We want to know our fate. But what is fate? What is luck? What exactly is 'unscientific' about divination?\n \nWe will be looking at divination practices from various countries and times, with a focus on the Yijing, the Tarot, and horoscopes (Chinese, Indian, Western). Students taking this class will be expected to actually practice some (not all) of these divination techniques, and to create their own divination system. Students are not required to either believe or disbelieve.",
    "course_description": "Dynamics of inquiry on a focused research topic. Will include discussion, debate, oral and written presentations. Topic varies.",
    "prerequisites": null,
    "instructors": "Eric Reinders - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Candler Library 124",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2940, Section #: 3, Type: SEM, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: E. Reinders, Status: Wait List",
    "date_accessed": "2024-03-30"
}