{
    "course_code": "REL 190",
    "course_title": "Fresh Sem: Religion: Religion and Everyday Life",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "This course satisfies the new Religion major requirement: - Theme.\nIn this seminar, we learn to look beyond and beneath elite, official, and authoritative perspectives in order to understand how religion operates in the everyday lives of ordinary people. While sacred scriptures and belief systems tell us a great deal about religion, so too do bodies, practices, and things. Yet here a challenge arises: how to appreciate the doing of religion, as distinct from the thinking of religion, when religion-as-lived is rarely expressible in written form? To help us, we need methods that get us learning with our bodies as much as with our minds. Besides introducing students to the study of religion and, more generally, of human existence in its stunning complexity, this seminar also introduces students to ethnography participant-observation research and narrative-based writing as a portal into the practice of everyday life.",
    "course_description": "Dynamics of inquiry on a focused research topic. Will include discussion, debate, oral and written presentations. Topic varies.",
    "prerequisites": null,
    "instructors": "Devaka Premawardhana - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in New Psyc Bldg 235 (36 Eagle Ro",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 5900, Section #: 5, Type: SEM, Campus: ATL, Meets: TTh 1-2:15p, Instructor: Premawardhana/Fredsell, Status: Closed",
    "date_accessed": "2024-03-30"
}