{
    "course_code": "REL 170",
    "course_title": "Special Topics in Religion: Studying Religion at Emory",
    "credit_hours": "2",
    "seats": "Seats: Maximum Enrollment: 96 / Seats Avail: 11Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "This two-credit course will be taught online. It meets for one synchronous session per week on Wednesdays. \nThis course satisfies the new Religion major requirement:- Theme.\nThis two-credit course is designed to introduce students to the wide range of course topics, themes, and approaches to the study of religion at Emory. The course meets weekly for an hour and forty minutes, during which time students will be treated to a presentation by one of Emory University's many scholars of religion. Students will get a taste of the great variety of methods used by these scholars in their investigation of religion, including literary, historical, philosophical, anthropological, art historical, cultural, and sociological approaches. Topics may cover major religious traditions such as Buddhism, Judaism, Christianity, Islam, Hinduism, Jainism, and Taoism. Themes will introduces particular lenses such as gender, sexuality, race, ethics, or media. \nPrior to class, students will read an accessible article or chapter provided by the guest speaker, and will post a response to this reading along with a question. Subsequent to class, students will post a second response, this time responding to the speaker's lecture and the ensuing discussion. There are no exams and no final project. Passing the course requires attending the classes and doing the postings.",
    "course_description": "Variety of subjects pertaining to religion at an introductory level. Content will vary in successive offerings. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Sara L McClintock - Primary Instructor",
    "schedule_location": "W 7pm-8:40pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 2297, Section #: 1, Type: LEC, Campus: ATL, Meets: W 7-8:40p, Instructor: Team, Status: Open",
    "date_accessed": "2024-03-30"
}