{
    "course_code": "REL 190",
    "course_title": "Fresh Sem: Religion: Religion and Ecology",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "This course satisfies the new Religion major requirement: - Theme.\nThe course examines environmental ethics in various religious traditions in relation to their world views and practices. The course introduces cosmology in Jewish, Christian, Islamic, Daoist, and Buddhist traditions in order to establish a common foundation of knowledge to appreciate other subjects. The course will also discuss how the natural world is conceptualized in different religious philosophical frameworks. It will then address the moral implications of human actions in effecting changes in social, natural, and cultural contexts in the modern world. The students will learn to analyze manifestations of religious themes in environmental movements and explore the relevance of religion to sustainability issues. The course also introduces freshmen to the basic skills required for research in the humanities. In addition to analyzing a variety of reading materials, students will also learn to use library resources and databases, write research papers, and present their findings in classroom.",
    "course_description": "Dynamics of inquiry on a focused research topic. Will include discussion, debate, oral and written presentations. Topic varies.",
    "prerequisites": null,
    "instructors": "Wei Wu - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in Math & Science Center - W307C",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2939, Section #: 2, Type: SEM, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: W. Wu, Status: Wait List",
    "date_accessed": "2024-03-30"
}