{
    "course_code": "REL 200R",
    "course_title": "Religion & Contemporary Experience: Religion,Prisons,Soc.Justice",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 2Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "This course satisfies the new Religion major requirement: - Theme, Region.\nAlthough mass incarceration has gained significant public attention in recent years, the role of religion, in both enabling modern forms of incarceration and in fostering resistance to them, is often overlooked. Combining traditional academic methods with public scholarship and community-based learning, this class will examine how religion is intertwined with several key facets of incarceration in the United States: the origins of contemporary prisons, racial inequity, economic exploitation, the daily lives of those inside, and movements for both abolition and reform. Going beyond cursory understandings of religion as something that is 'used' by any given actor in the criminal legal system, the course will aid students in developing their own nuanced perspectives on the ways that religious faith functions in, through, and against incarceration in the US. In particular, the class will accomplish these goals by learning in collaboration with local community partners who are working actively at the intersection of religion and prisons.",
    "course_description": "Religion and contemporary issues of human existence, the role of religion in politics and international conflicts, or the nature of contemporary religious movements such as fundamentalism.",
    "prerequisites": null,
    "instructors": "Cara Curtis - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in Candler Library 124",
    "course_resources": null,
    "sections": "Class Nbr: 2942, Section #: 2, Type: LEC, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: C. Curtis, Status: Open",
    "date_accessed": "2024-03-30"
}