{
    "course_code": "REL 200R",
    "course_title": "Religion & Contemporary Experience: LGBTQ Religion & Spirituality",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 2Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Same as WGS 285 3)\nThis course satisfies the new Religion major requirement: - Theme.\nRather than ask what religious texts, teachers, and traditions say about sexuality and gender, this course will focus on what LGBTQ-identified people have had to say about religion and spirituality, exploring their cultural agency, creativity, and power. Here are some examples of topics we will explore: lesbian feminist embodied goddess spirituality; representation and veneration of queer and transgender people as sacred figures (\"saints\"); the Radical Faeries movement; the Sisters of Perpetual Indulgence order of \"queer nuns\"; spiritual dimensions of Native American and First Nations \"Two-Spirit\" identities; LGBTQ-affirming expressions of Pentecostal Christianity; hijra and kinnar identities in South Asia and their connections with Hinduism and Islam; the Taoist deity Tu'er Shen and his worship in Taiwan; queer and transgender interpretations of scriptures and myths.",
    "course_description": "Religion and contemporary issues of human existence, the role of religion in politics and international conflicts, or the nature of contemporary religious movements such as fundamentalism.",
    "prerequisites": null,
    "instructors": "William K Gilders - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in Tarbutton Hall 218",
    "course_resources": null,
    "sections": "Class Nbr: 2943, Section #: 3, Type: LEC, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: W. Gilders, Status: Open",
    "date_accessed": "2024-03-30"
}