{
    "course_code": "REL 300",
    "course_title": "Interpreting Religion",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 6",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "How do we talk about religion? The oldest distinction is probably true/false (or us/them); we can also speak of religion as positive and negative, liberating and oppressive; sociologically, psychologically, ethically; as text, as performance, as identity, as well as in terms of traditions (Buddhism, Christianity, etc.) and regions (Asia, America, etc.) and themes (death, sexuality, etc.) But how do you want to speak of religion? What audiences do you want to reach? This class is designed to explore and expand the possibilities of your own voice(s). There is an academic voice; there is an advocacy or `op-ed' voice; there is a neutral, journalistic voice; there is your creative, artistic or poetic voice. This course aims to expand the range of your ways of talking about religion. In the course of the semester, we will consider the history of the concept 'religion,' some definitional debates and different approaches, and the so-called margins of the category",
    "course_description": "Critical exploration of philosophical, theological, ethical, and social science theories of religions and methods for the interpretation of religious phenomena.",
    "prerequisites": null,
    "instructors": "Eric Reinders - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Candler Library 124",
    "course_resources": null,
    "sections": "Class Nbr: 2287, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 10-11:15a, Instructor: E. Reinders, Status: Open",
    "date_accessed": "2024-03-30"
}