{
    "course_code": "REL 307",
    "course_title": "East Asian Buddhism",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 3Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Same as EAS 317 1)\nThis course satisfies the new Religion major requirement: Tradition-Buddhism, Region.\nThe course will examine the major themes, practices, and institutions in East Asian Buddhism. We will explore the history of Buddhism in a cross-cultural context and investigate a variety of distinct forms and cultural expressions that Buddhism took in China and Japan. We will use primary sources in translation, secondary sources of Buddhist Studies, and films to guide our class discussion. We will discuss the fundamental thought and practice in Buddhism, and the developments in various cultural settings in East Asia. We will also look at Buddhism in a global context and examine the new forms of practices to adapt to the contemporary world. Methodological issues in the study of Buddhism will also be introduced. At the end of the class, the students will be expected to have attained a satisfactory level of competence in understanding the Buddhist thought and practice. They should also be able to reflect on continuity and transformation of Buddhism in specific historical and cultural settings.",
    "course_description": "The development of Buddhism in China and Japan, including examination of monasticism, ritual, ideas of Buddhahood, Zen, Pure Land, and Buddhist relations to the state and to other religions.",
    "prerequisites": null,
    "instructors": "Wei Wu - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in Math & Science Center - N302",
    "course_resources": null,
    "sections": "Class Nbr: 2291, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: W. Wu, Status: Open",
    "date_accessed": "2024-03-30"
}