{
    "course_code": "REL 358R",
    "course_title": "Religion and Healing: Buddhist Meditation",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Same as HLTH 385 9)\n(This course satisfies the new Religion major requirement: - Theme, Tradition-Buddhism.\nInterest in meditation has grown increasingly as research suggests that certain styles of meditation may positively enhance health and well-being. To date, much of the scientific and clinical research on meditation has focused on secularized forms of practice drawn from various Buddhist traditions. The Tibetan Buddhist lojong tradition in particular offers highly systematized methods for training and transforming the mind. This course is designed to offer students an introduction to the theory and practice of various popular styles of practice drawn from the lojong tradition, including shamatha, vipassana and compassion meditation. This course is designed as a theory-practice course. The goal of this course is for students to gain both an intellectual understanding of the philosophical and psychological models that underlie various contemplative practices, and also to gain an experiential understanding of these various secular meditation styles through actual practice. Students will be guided through meditation and experiential activities during our weekly 'meditation lab' sessions and will be encouraged to observe what effects, if any, such practices have upon one's thoughts, emotions, behaviors and overall quality of life.)",
    "course_description": "Designed to explore the mind/body connection as a paradigm to understand religion and healing. Will examine the role of faith, ritual, prayer, and meditation in various models of healing.",
    "prerequisites": null,
    "instructors": "Geshe Lobsang Tenzin Negi - Primary Instructor",
    "schedule_location": "TTh 4pm-5:15pm in Atwood Chemistry Bldg. 215",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2295, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 4-5:15p, Instructor: Negi/Liberman, Status: Wait List",
    "date_accessed": "2024-03-30"
}