{
    "course_code": "MESAS 202",
    "course_title": "South Asian Civilizations",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 7",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Same as HIST 296 1 and REL XXX X)\n(Complete topic - South Asian Civilizations: Historical & Cultural Debates)\n(Did you know that the history of the Indian subcontinent is closely linked with other regions in Asia and Africa? And with Great Britain that colonized the subcontinent for several centuries? The idea of an introductory class is to bring together a group of interested students to converse closely on this subject. In Introduction to South Asian Civilizations, we shall collectively trace the history of the Indian India subcontinent and examine different interpretations of the history and conditions of peoples of South Asia. By looking at histories, films, fiction, and slides, we will investigate the `activities - of people - set in different historical times and places. We shall consider the diverse kinds of communities that live in South Asia, their relationships, and how religions, nationalism and `politics forms them. Part of our effort is also to trace changeability - of peoples and of spaces - and with these of the contestable character of politics, history, love, sexuality, filial relationships, and everyday life.?",
    "course_description": "This course examines South Asian civilization from the perspective of the transition from medieval kingdoms to modern republics. It focuses on debates about history, community and identity to ask how South Asian societies conceived of belonging, power and prosperity.",
    "prerequisites": null,
    "instructors": "Ruby Lal - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in Woodruff Library 422",
    "course_resources": null,
    "sections": "Class Nbr: 2450, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: R. Lal, Status: Open",
    "date_accessed": "2024-03-30"
}