{
    "course_code": "MESAS 200W",
    "course_title": "Middle Eastern Civilization",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 3",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Same as HIST 296W 1)\nThe Middle East is often viewed as a \"backward\" region rife with unceasing religious conflict. While the Middle East has, over the past century, had its share of war, from a broader historical perspective, the region can also be said to have had remarkable levels of stability while also maintaining a very diverse population. This course will explore this diversity, and particularly  how various political formulations, empires, colonial regimes, and modern nation-states have grappled with and responded to the region's ethnic and religious heterogeneity, as well as the cultural products that the region's many peoples have produced. \nMESAS 200W is intended for all who wish to deepen their knowledge of Middle Eastern civilizations from the crusades on to today, the region's political, social and cultural history, and some of the ways in which this history has been received and interpreted. It is also a writing-intensive class, meant to hone your writing skills. The subject matter we will cover includes the polities that formed in the aftermath of the Crusades and the Mongol invasions in the late Middle Ages; the interactions of Islamic \"Gunpowder Empires\" in the early modern period; the effects of western imperialism and colonialism in the 19th century; and the shaping of the region's modern political borders and nation states in the 20thcentury and through to the present day.",
    "course_description": "Exploration of themes such as identity, community, religion, and politics in the Middle East from ancient to modern times. Readings include historical and literary texts by various Middle Eastern authors. Required of all Middle East studies majors.",
    "prerequisites": null,
    "instructors": "Geoffrey Levin - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in Candler Library 124",
    "course_resources": null,
    "sections": "Class Nbr: 2526, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 10-11:15a, Instructor: G. Levin, Status: Open",
    "date_accessed": "2024-03-30"
}