{
    "course_code": "MESAS 190",
    "course_title": "Freshmen Seminar in MESAS: The World's First Cities",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Freshmen Seminar - Limited to First Year Students Only)\n(From the dawn of modern humans to the current day, the world has been centered upon people living in groups.  Cooperation and cohabitation became hallmarks of humanity, promoting a growth of population unlike the world had seen before.  In the ancient Middle East, over eight thousand years ago, this manifested to its ultimate form: the city.  \nThis seminar looks critically at the development of the very first cities in Mesopotamia and beyond: what led to their existence, how they grew, and how they affected those living within and around them.  Though the concept of \"city\" might seem mundane to us now, its invention was revolutionary in shaping the course of humanity.  We take a look at famous first examples - Jericho, Çatalhoyük, Eridu, Uruk, Ur, Susa, and many more - to understand: what made a city a city?  How did these cities shape human history for millennia to come?  And how were cities invented in the first place?  While these questions form the backbone of the seminar, we will also be discussing the challenges that came along with living in dense urban centers to explore how humans adjusted their environment to meet rising concerns of land use, housing, cleanliness, storage, and subsistence.  As a class, we will explore this new form of living through written sources (both primary and secondary) and archaeology (including brand new discoveries from Iraq, Turkey, Jordan, and Israel).  These will give us a holistic view of the very first cities - a wholly human experiment with challenges all too familiar to our cities of today.)",
    "course_description": "Exclusively for first-year students. Seminar provides introduction to various historical, religious, cultural, and linguistic aspects of the Middle East and South Asia. Topics vary.",
    "prerequisites": null,
    "instructors": "Petra Creamer - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in Callaway Center S103",
    "course_resources": null,
    "sections": "Class Nbr: 2493, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: P. Creamer, Status: Open",
    "date_accessed": "2024-03-30"
}