{
    "course_code": "MESAS 270",
    "course_title": "Special Topics MESAS-200 Level: Introduction to Islam",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 4",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Same as REL 270 9)\n(This course is designed to provide students with an introduction to Islamic history, culture, and intellectual thought throughout the world. The student will build a foundational understanding of the Prophet Muhammad's life and the Quran along with sects and schools that had proceeded after him. Furthermore, reading Hodgson's Venture of Islam will create an understanding of how Muslims developed and interacted with Europe and the Americas. Furthermore, students will study the relationship between the Middle East, and the Western world developed during the modern era. Mastering the course material will enable you to place past and current events in historical perspective. The goal of this course is to enable students to understand how Islam, with its complex history, has become situated in the modern world. Like the Jewish and Christian peoples, Muslims have migrated to the United States, Canada, and Europe and brought their religious traditions and cultures with them. This course will provide an understanding of how Muslims hailing from different cultures have been able to fit into the American fabric. This course will focus on close readings of classical texts, and documentary materials will be combined with examining non-textual sources. Since writing and discussion are essential parts of the intellectual experience, you will be asked to actively participate in class discussions, write a midterm paper, submit four in-class quizzes (after every two units), and a final presentation.)",
    "course_description": "Special topics in Middle Eastern and South Asian Studies, at the 200 level; may be repeated when content varies.",
    "prerequisites": null,
    "instructors": "Syed Zaidi - Primary Instructor",
    "schedule_location": "MW 4pm-5:15pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 3002, Section #: 3, Type: LEC, Campus: ATL, Meets: MW 4-5:15p, Instructor: S. Zaidi, Status: Open",
    "date_accessed": "2024-03-30"
}