{
    "course_code": "MESAS 270W",
    "course_title": "Special Topics MESAS-200 Level: Ancient Iraq",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 8 / Seats Avail: 8",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Same as HIST 296W 2)\nIraq holds the key to many of the world's firsts.  This is where writing first developed, where people thought that the gods wrote down would happen in the future on the lungs and livers of sacrificed sheep, and where people knew how to determine the length of the hypotenuse a thousand years before the Greek Pythagoras was born. During this course, we will learn more about these and other matters and discover their place in the cultures and civilizations of that area over the great span of 10,000-323 BCE. \nThis is an interdisciplinary survey of the history, society, and culture of ancient Mesopotamia, utilizing readings from ancient texts in translation (including the Epic of Gilgamesh, one of the great masterpieces of world literature), but also making use of archaeological and art historical materials. The goal of the course is to gain an appreciation of the various ancient cultures inhabiting Iraq, along with its neighbors, to understand some of their great achievements, to become acquainted with some of the fascinating individuals and their legacies (featuring such big names as Hammurabi, Sennacherib, and Nebuchadnezzar), and to appreciate the rich heritage that they have left us. We will be reading a variety of primary sources (e.g., myths, epics, religious literature, letters, and royal inscriptions) and engage with the archaeology/ material culture to inform our understanding of the ancient past.",
    "course_description": "Special topics in Middle Eastern and South Asian Studies, at the 200 level; may be repeated when content varies.",
    "prerequisites": null,
    "instructors": "Petra Creamer - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in Emerson Chemistry Bldg. E103",
    "course_resources": null,
    "sections": "Class Nbr: 6527, Section #: 3, Type: LEC, Campus: ATL, Meets: MW 10-11:15a, Instructor: P. Creamer, Status: Open",
    "date_accessed": "2024-03-30"
}