{
    "course_code": "CPLT 190",
    "course_title": "Fresh Sem: Literature: Good Worlds, Bad Worlds",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Freshmen Seminar - Limited to First Year Students Only)\n(\"Good Worlds, Bad Worlds: Imagining Possible Futures\"  Change, by definition, is unsettling. The disruption of familiar ways of doing things often causes anxiety. It can be painful or even traumatic. Yet it can also be a source of hope and creative energies, particularly for those who believe that the current state of things is detrimental to our collective well-being. Speculative fictions whether they take the form of utopian or science fiction invite us to imagine worlds and/or ways of being that we might not (yet) think possible. We might not know, or agree on, whether they are desirable. But they challenge us to engage in critical, speculative thinking: How might the changes we envision come about? How might these changes affect us? What futures might they bring about? This course explores some of the ways that creative writers and critical thinkers have approached some of these questions. We will consider how signs of such futures are already manifest in the here and now, weigh how to assess their potential impact, and consider how to manage their transformative effect.)\n\n\nMargaret Atwood, Oryx & Crake \nPhilip Roth, The Plot Against America\nOctavia Butler, Lilith's Brood (selection from the trilogy)\nUrsula K. Le Guin, The Dispossessed or The Word for World is Forest\nAdditional readings might include selections from the work of Hannah Arendt, Ernst Bloch, Philip K. Dick, W.E.B. DuBois, Donna Haraway, Gil Z. Hochberg, Fredric Jameson, George Orwell.\n\n\nRegular responses to readings in the form of short (200-250 word) critical essays posted on Canvas. Participation in a group-defined and -designed utopian project.",
    "course_description": "Freshman-only seminar designed to engage students in various aspects of inquiry and research with the close guidance of a faculty member.",
    "prerequisites": null,
    "instructors": "Angelika Bammer - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Woodruff Library 214",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3956, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 10-11:15a, Instructor: A. Bammer, Status: Closed",
    "date_accessed": "2024-03-30"
}