{
    "course_code": "CPLT 201W",
    "course_title": "Reading Comparatively",
    "credit_hours": "4",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "\"World Literature & the Idea of Cosmopolitanism\" | Humanity shares a single planet, but on this earth, are we sure that we share a single world? Is there indeed just one world, or are there several? What are the historical and political conditions that shape how we understand the concept of a world in the first place? This course will explore how literature can help us to address some of these difficult questions, by focusing on texts that foreground and interrogate the idea of \"cosmopolitanism.\" Derived from ancient Greek (from kosmos and polis), this word puts forward the idea of a global community that exists beyond or before cultural and national boundaries. Our course will therefore ask how cultural and national identities are formed and reformed to begin with, and how such identities might function (or fail to function) in an increasingly global context. In doing so, we will also investigate the idea of \"world literature,\" whether it is possible, and what it offers us in the twenty-first century.\n\n\nGeographically speaking, this course will focus on Europe, Africa, and North America (especially the US and the West Indies), but the scope of our discussions will remain global. Readings may include novels, essays, and poetry by authors such as Kwame Anthony Appiah, Hélène Cixous, Teju Cole, Jacques Derrida, Immanuel Kant, Jamaica Kincaid, Virgil, Voltaire, and Derek Walcott.",
    "course_description": "This course draws on classical, modern, and contemporary texts to introduce skills required for reading comparatively across national traditions and academic disciplines with an emphasis on close reading, critical interpretation, and the multiplicity of linguistic traditions around the world. *Note: This course is non-repeatable.",
    "prerequisites": null,
    "instructors": "Andrew Kingston - Primary Instructor",
    "schedule_location": "Varies by section",
    "course_resources": null,
    "sections": "Class Nbr: 3957, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: A. Kingston, Status: Open\nClass Nbr: 3958, Section #: 2, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: A. Kingston, Status: Open",
    "date_accessed": "2024-03-30"
}