{
    "course_code": "CPLT 301W",
    "course_title": "Methods of Literary Interpretation",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 9",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Same as ENG 389W 8)\n\"The Caribbean (In Fact and Fiction)\" | he course explores cultural texts - film, literature, essay, performance - from the insular Caribbean (Greater and Lesser Antilles) and its U.S. Diaspora. It is not necessarily meant as a comprehensive historical or literary account of all political and social events in the area but on those that have a direct relation to the present. Particular attention will be paid to the modern era which begins with the Haitian Revolution at the end of the 18th century. Some of the main issues explored will be: To what extent does a common culture define a region divided by different colonial regimes resulting in different forms of language and government? How have colonialism and race affected the history and cultural production of the region? How has the Caribbean diaspora negotiated with the frameworks of race, class and ethnicity in the United States?\n\n\nParticulars: Four short papers (approximately 5 pages each) (60% total, 15% each); Midterm (15%); Various Oral presentations throughout the semester. (10%); Attendance, Participation, Pop Quizzes, etc. (15%)\n\n\nTexts: (Authors, artists and filmakers): Guillermo Cabrera Infante, Aime Cesaire, Edwidge Danticat, Julia de Burgos, Luis Pales Matos, Antonio Jose Ponte, Bad Bunny, Virgilio Piñera, Rita Indiana, Reina Maria Rodriguez, and others.)",
    "course_description": "An introduction to different methods of literary criticism and textual interpretation, applying a variety of theoretical approaches to selected literary texts.  Readings include essays, fiction, poetry, and drama. *Note: This course is non-repeatable.",
    "prerequisites": null,
    "instructors": "Jose Quiroga - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Callaway Center S108",
    "course_resources": null,
    "sections": "Class Nbr: 3975, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: J. Quiroga, Status: Open",
    "date_accessed": "2024-03-30"
}