{
    "course_code": "CPLT 751R",
    "course_title": "Spec Topics: Comparative Literature: Politics in Deconstruction",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 2",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Same as FREN 780 2, PHIL 789 1)\nFREN 780  \"Politics in Deconstruction\"Geoffrey Bennington\nTh 1-4PM\nContent: Taking its lead from some of Derrida's later work, this course will follow the twin threads of sovereignty and democracy through some of the great texts of political philosophy in the Western tradition.  We shall attempt to understand why both of these notions, albeit in rather different ways, pose such problems for that tradition, and give rise to all manner of complications and paradoxes, which are however (or so I shall argue) definitive of the conceptual space of the political as such.  We shall wonder why almost all political philosophies are enamored of sovereignty, while almost none has anything very good to say about democracy.  We shall consider the possibility of a non-trivial affinity among the political, the rhetorical, the literary and the animal in their constant tendency to exceed conceptual grasp, and also compare our deconstructive approach to these political questions with some other modern and postmodern theories.\nTexts: Classical authors to be discussed may include Plato, Aristotle, Machiavelli, Bodin, Hobbes, Spinoza, Rousseau, Kant, Hegel, Tocqueville, and Schmitt; more recent theorists to be considered alongside Derrida may include Agamben, Badiou, Foucault, Hardt and Negri, Lyotard, Mouffe and Rancière.\nParticulars: TBA",
    "course_description": "This course focuses on a specific body of literary texts, critical approach, or theoretical problem in the area of Comparative Literature.  Students may repeat this course for credit if the subject matter varies.",
    "prerequisites": null,
    "instructors": "Geoffrey Bennington - Primary Instructor",
    "schedule_location": "Th 1pm-4pm in Callaway Center C202",
    "course_resources": null,
    "sections": "Class Nbr: 5253, Section #: 5, Type: LEC, Campus: ATL, Meets: Th 1-4p, Instructor: G. Bennington, Status: Open",
    "date_accessed": "2024-03-30"
}