{
    "course_code": "CPLT 751R",
    "course_title": "Spec Topics: Comparative Literature: Pers. Narrative&/as Scholarly",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "\"Personal Narrative and/as Scholarly Work\" | What constitutes the \"scholarly\" in scholarly writing is continually being revisited as methods of inquiry and technologies of representation continue to morph and change. One abiding concern--the focus of both critique and creative experimentation--has been to locate the boundary between the \"scholarly\" and the \"personal.\" Along the way of this debate, many exciting and generative new work has emerged. This seminar will examine some of them and provide a space for seminar participants to explore the range of the possible for their own emerging work.\n\n\nReadings will be chosen from the following works:\nPatricia Williams, The Alchemy of Race and Rights: Diary of a Law Professor\nCarolyn Steedman, Landscape for a Good Woman\nJason de Leon, The Land of Open Graves: Living and Dying on the Migrant Trail\nGeoff Dyer, The Missing of the Somme\nSaidiya Hartman, Wayward Lives, Beautiful Experiments: Intimate Histories of Riotous Black\nGirls, Troublesome Women, and Queer Radicals\nAngelika Bammer, Born After: Reckoning with the German Past\n\n\nA short critical essay that makes the case for a particular form of scholarly work that acknowledges and/or integrates the personal. A short scholarly piece that puts the above theory into practice.",
    "course_description": "This course focuses on a specific body of literary texts, critical approach, or theoretical problem in the area of Comparative Literature.  Students may repeat this course for credit if the subject matter varies.",
    "prerequisites": null,
    "instructors": "Angelika Bammer - Primary Instructor",
    "schedule_location": "T 1pm-4pm in MODERN LANGUAGE_302",
    "course_resources": null,
    "sections": "Class Nbr: 4005, Section #: 1, Type: LEC, Campus: ATL, Meets: T 1-4p, Instructor: A. Bammer, Status: Open",
    "date_accessed": "2024-03-30"
}