{
    "course_code": "CPLT 389",
    "course_title": "Special Topics: Literature",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 6 / Seats Avail: 5",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Same as PHIL 385 4, REL 370 2)\n\"Kierkegaard: Literature/Philosophy/Religion\" | This seminar focuses on the way in which Soren Kierkegaard deploys biblical texts, such as \"the binding of Isaac\" (Gn. 22), the Book of Job, and Ecclesiastes, in developing his philosophy of existence. The \"trembling\" to which the narrator of Fear and Trembling refers is experienced not only by the biblical Abraham, who is in a religious relation to the absolute, and whose orders from God are sealed in secrecy, but also by Kierkegaard's narrator, himself brought to the point of inexpressibility in the face of Abraham's ordeal. In Repetition, the fictional protagonist offers an intensely personal reading of the Book of Job. The book's formulation of the problem of theodicy--the theological justification of suffering--and the example of Job's patience provide the protagonist with a means of making sense of his broken engagement. The disenchanted and ironic voice of Qoheleth may be heard in Either/Or's first-person description of aesthetic existence and Judge William's ethical diagnosis of it.\n In close readings of Fear and Trembling, Repetition, and Either/Or, we will characterize Kierkegaard's specific reading of biblical texts and the hybrid literary/philosophical/religious genre of his writing. We will consider Kierkegaard's immense influence on \"existentialism\"--literary and philosophical and register the affinity of his work with phenomenology, hermeneutics, and deconstructive thought.\n\n\nRequirements: two eight-to-ten page papers\n\n\nRequired Texts: Soren Kierkegaard, Fear and Trembling/Repetition, trans. Hong and Hong (Princeton); Kierkegaard, Either/Or, Part I, trans. Hong and Hong (Princeton); Kierkegaard, Either/Or, Part II, trans. Hong and Hong (Princeton); The Wisdom Books, trans. Robert Alter (Schocken); E. A. Speiser, Genesis",
    "course_description": "Lively topical or theoretical approaches to a given set of literary texts or problems. May be repeated for credit when subject varies..",
    "prerequisites": null,
    "instructors": "Jill Robbins - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Candler Library 121",
    "course_resources": null,
    "sections": "Class Nbr: 3985, Section #: 3, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: J. Robbins, Status: Open",
    "date_accessed": "2024-03-30"
}