{
    "course_code": "CPLT 389W",
    "course_title": "Special Topics: Literature: Affect & the Archive",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 13",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Same as WGS 385W 6, PHIL 385W 2)\n\"Affect and The Archive: Disturbing the Historical Landscape\"  This course brings together literary works and traditions seldomly studied alongside one another. We will create a debate amongst different socio-political commitments and push the limits of comparative analysis by forging connections in opposition and discord. During the course of \"Affect and the Archive\" we will problematize historicist and neo-colonialist readings of literature, visual art, and other media to construct an analysis that does justice to that which history cannot represent. This class begins by looking at the recent destruction of colonial statues and the protestations of the version of history they promote. This sets the stage for a discussion about the telling of history and its guardianship that resonates both in academia and the larger public. We will address this issue through a revaluation of how the \"archive\" is understood. Our semester will be divided into three modules \"Space,\" \"Time,\" and \"Event.\" Each of these modules challenges us to reevaluate different aspects of the concept of the \"archive.\" We will attempt to think critically in a manner that does not speak on behalf of those, and that which history has erased and silenced. Our analytic practice will be attentive to how the violence of the past continues to be felt in the present.\n\n\nDuring the semester we will analyze texts and works of art by Louise Bourgeois, Cecilia Vicuña, and H.D. as well as psychoanalytic and philosophical texts. In our analysis we will address the question \"how is our relationship to the past reflected in our socio-political commitments?\" to consider how to break from a tradition of memorialization that perpetuates violence and injustice.\n\n\nAssignments for this course will include presentations, discussion posts, research papers, and a creative final project.",
    "course_description": "Lively topical or theoretical approaches to a given set of literary texts or problems. May be repeated for credit when subject varies. Fulfills the post-freshman writing requirement.",
    "prerequisites": null,
    "instructors": "Federica Signorini - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Callaway Center S108",
    "course_resources": null,
    "sections": "Class Nbr: 3986, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 10-11:15a, Instructor: F. Signorini, Status: Open",
    "date_accessed": "2024-03-30"
}