{
    "course_code": "ITAL 300",
    "course_title": "Survey of Italian Literature",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 13",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Intercultural Communication(*)",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "ITAL 300 The Baroque and the Marvelous (Prof. Ristaino / MW 10:00-11:15am in person)\n \nContent: This course, taught in Italian, will explore the idea of the marvelous during the 1600s in Italy. The term Baroque is often defined as an oddly shaped pearl that appears to want to blow apart, exaggerated, bizarre, decadent, irregular, sometimes monstrous. The concept of the marvelous, a phenomenon adopted during the Baroque to arouse wonder through extravagant, extended metaphors, startling word plays, and original myths, was often utilized by preachers, artists, museum curators, orators, authors, and scientists to attract followers. Guided by critical readings, we will examine objects created by a baroque sensibility during the era of telescopes, microscopes, museums, carnival, an infinite universe, a solar revival, a same sex model, and sculptures and paintings that extend into the infinite. We will also reflect on modern society and our own identities and cultures to see how the Baroque sensibility has infiltrated into our own consciousness in subtle yet powerful ways.",
    "course_description": "Chronological survey of Italian literature from 13th through 21st centuries that introduces students to representative Italian authors and their significant writings contextualized within genre and literary-historical-cultural background. In Italian. Prereq: Instructor???s approval or Ital 302.",
    "prerequisites": null,
    "instructors": "Christine Ristaino - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in Callaway Center S104",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ITAL_300_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 6226, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 10-11:15a, Instructor: C. Ristaino, Status: Open",
    "date_accessed": "2024-03-30"
}