{
    "course_code": "IDS 190",
    "course_title": "Fresh Sem: IDS: History &Philosophy of Nursing",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Synchronous online both days.) What does it mean to be a nurse?  What is the nursing role in health care? What is the expertise that nurses bring to health care?  Throughout the history of modern nursing, nurses have engaged these philosophical questions.  Their answers shaped how nurses established their educational systems and professional status, influencing both the state of nursing today and the challenges it faces.  In this course,  we will trace the history of nursing and explore how philosophical questions about nursing were answered in the context of the growth of healthcare institutions like hospitals and public health departments, the changing roles of women, and the dynamics of race.  Readings will be drawn from historical studies of nursing and health care, such as Ulrich's A Midwife's Tale and D'Antonio's American Nursing, from historical writings of nurses, such as Nightingale's Notes on Nursing and Henderson's The Nature of Nursing, as well as contemporary work by nursing theorists and philosophers.",
    "course_description": "Variable topics using interdisciplinary approaches from the humanities and social sciences. Topics represent current interests of the instructor.",
    "prerequisites": null,
    "instructors": "Mark Risjord - Primary Instructor",
    "schedule_location": "MW 9:40am-10:55am in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3806, Section #: 2, Type: SEM, Campus: ATL, Meets: MW 9:40-10:55a, Instructor: M. Risjord, Status: Closed",
    "date_accessed": "2024-03-30"
}