{
    "course_code": "IDS 216W",
    "course_title": "Visual Culture",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Synchronous online only on Tuesday with asynchronous material.) (Co-Requisite ENGRD 223, questions contact Pwakefi@emory.edu) We live in a culture that is saturated by visual images. Thus, it is vital to understand what forces shape visual culture and how it shapes our thinking about myriad topics such as politics, race, class, and gender. In this class you will learn the importance and power of the visual as we explore an analyze how the visual is produced, circulated, and consumed. We will begin by understanding the theories behind visual culture and then learn how to apply these theories as we analyze a variety of visual materials including photography, art, advertising, news, and digital media in addition to other forms. You will become adept at \"reading\" visual images in the same way that you would read other texts, and the discussion-based course will give you an ample opportunity to hone this skill. In addition, short visual and textual assignments throughout the semester and a larger final project on a topic of your choosing will offer you more opportunities to apply your skills and knowledge and begin to think how you might incorporate the visual in to future research projects.",
    "course_description": "History of the use of visual images in Western culture. Study of tools necessary to read images, including still and moving images, performance, and display.",
    "prerequisites": "ENGRD 223 or equivalent transfer credit as co-requisite.",
    "instructors": "Katie Schank - Primary Instructor",
    "schedule_location": "T 1pm-2:15pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 3100, Section #: 1, Type: LEC, Campus: ATL, Meets: T 1-2:15p, Instructor: K. Schank, Status: Open",
    "date_accessed": "2024-03-30"
}