{
    "course_code": "IDS 290R",
    "course_title": "Interdisciplinary Sidecar: COVID Stories/how we tell them",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 3",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "Stories, or narratives, are fundamental to the way humans understand and make sense of their experiences. How we tell stories, especially about challenging and stressful events, impacts on both individual well-being and collective social policy.  In this sidecar course, we will explore the ways in which narratives of COVID-19 are emerging in scientific, political, economic, and social contexts starting from the first case in Wuhan and ending with narratives regarding the current vaccine. The course will meet for one hour every week; every other week, we will bring in guest speakers who are experts in the different perspectives around COVID-19. Examples of potential guests include public health experts from the CDC, virologists, an ER doctor from Emory, politicians coordinating the response, and vaccine developers. On the alternate weeks, we will discuss the previous week's speaker, and prepare for the upcoming speaker through short readings.  Throughout the course, we will focus on the emerging narratives of the pandemic as they affect our personal and societal well-being. Priority enrollment for this class is given to students currently enrolled in IDS 220R (What does it mean to be human?), IDS 205 (Science and the Nature of Evidence). Email Instructors for permission.",
    "course_description": "A side-car course brings together a subset of students from two courses that overlap in methodologies, topics, etc., to create a short interdisciplinary course that runs simultaneously with its two sponsoring courses. One credit, S/U only. Schedule and format arranged by sponsoring professors.",
    "prerequisites": null,
    "instructors": "Arri Eisen - Primary Instructor",
    "schedule_location": "F 2pm-2:50pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 5920, Section #: 1, Type: SEM, Campus: ATL, Meets: F 2-2:50p, Instructor: Team, Status: Open",
    "date_accessed": "2024-03-30"
}