{
    "course_code": "IDS 385W",
    "course_title": "Special Topics: Advertising in AmericanCulture",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 9 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Continuing Writing Requirement",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as AMST 385W-1) (Synchronous online only on Thursday with asynchronous material.) Advertising is everywhere, in the magazines we read, on the television we watch, popping up in our Instagram feed, even on the T-shirts we wear. Some estimate that we see as many as 5000 ads every day. Yet we rarely take the time to analyze the ways these ubiquitous ads affect us, as individuals and as a society. This course will do just that. We will examine advertising in American culture through a number of lenses. We will begin with an historical analysis: how did advertising grow from a relatively small industry to the powerhouse it is today? We will analyze advertisements as texts: how does advertising convey its messages in both overt and covert ways? How do ads affect the cultural norms and attitudes of society? We will examine the ways advertising influences and produces our consumer culture, and we will discuss the affects advertising has on cultural change: does it act as a progressive or a conservative force? We will also explore current discontent with consumer culture and recent attempts to disrupt the persuasive force of advertising. Overall, the course will provide an introduction to the critical study of advertising and its role in creating and sustaining cultural attitudes and ideologies.",
    "course_description": "Highly focused courses, drawing on multiple disciplines of the humanities and social sciences; may be repeated for credit when topics vary.",
    "prerequisites": null,
    "instructors": "Kim Loudermilk - Primary Instructor",
    "schedule_location": "Th 11:20am-12:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3809, Section #: 1, Type: LEC, Campus: ATL, Meets: Th 11:20a-12:35p, Instructor: K. Loudermilk, Status: Open",
    "date_accessed": "2024-03-30"
}