{
    "course_code": "IDS 290R",
    "course_title": "Interdisciplinary Sidecar: Art as Activism? Visual Cultur",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "Complete Topic - Art as Activism? Visual Culture of America Social Movements\nWhat is the relationship between art and social justice? Does art inspire people to become more politically engaged? Does the creation of art remove people from other types of political action? This course will survey contemporary American art that engages with activism. Students will learn about art concerning social movements in the U.S., discuss varying visual mediums, and explore the difficulties surrounding art institutions and accessibility. We will cover movements such as the Women's Liberation, Black Power, Chicano, American Indian, and Asian American movements. Adopting an interdisciplinary lens combining history, art history, and visual culture, we will explore the complexities of identity politics concerning race, class, sexuality, and their intersections. Priority enrollment for this class is given to students currently enrolled in IDS 216 Visual Culture. Email Instructors for permission",
    "course_description": "A side-car course brings together a subset of students from two courses that overlap in methodologies, topics, etc., to create a short interdisciplinary course that runs simultaneously with its two sponsoring courses. One credit, S/U only. Schedule and format arranged by sponsoring professors.",
    "prerequisites": null,
    "instructors": "Louis Fagnan - Primary Instructor",
    "schedule_location": "F 1pm-2:15pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 5923, Section #: 2, Type: SEM, Campus: ATL, Meets: F 1-2:15p, Instructor: Team, Status: Open",
    "date_accessed": "2024-03-30"
}