{
    "course_code": "IDS 290R",
    "course_title": "Interdisciplinary Sidecar: Race, Place, and Space: Sci-Fi",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 4",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "Title: Race, Place, and Space: Sci-Fi and Social Inequities. Throughout this course we will examine the concerns of gender, race, sexual orientation, and class that have long lain in the subtext of science fiction. We speculate that sci-fis have always underscored inequities in gender, race, sexual orientations, and class, although more recent work is attempting to subvert these tropes. This sidecar will work on investigating social inequities in sci-fi, and how they can help\nus process different identity conflicts. Together, we will examine the lore behind sci-fi and fantasy works from Frankenstein , Alas Babylon , Hunger Games , Star Trek , the Marvel superhero franchise, and others to see how they challenge or cement the social hierarchies at play. We will examine sci-fi and fantasy works as a metaphor for global\ndisaster and images of heroism, solidarity, and grief. Students will employ intertextual and intercultural analyses to critically think about how the reflexive tendencies of media can hinder or help the fight for social justice, and will be asked to critically consider the media they consume.",
    "course_description": "A side-car course brings together a subset of students from two courses that overlap in methodologies, topics, etc., to create a short interdisciplinary course that runs simultaneously with its two sponsoring courses. One credit, S/U only. Schedule and format arranged by sponsoring professors.",
    "prerequisites": null,
    "instructors": "Marjorie Pak - Primary Instructor",
    "schedule_location": "W 1pm-2:15pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 6048, Section #: 6, Type: SEM, Campus: ATL, Meets: W 1-2:15p, Instructor: Team, Status: Open",
    "date_accessed": "2024-03-30"
}