{
    "course_code": "IDS 290R",
    "course_title": "Interdisciplinary Sidecar: BIPOC & LGBT Anc.Greek Texts",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 8 / Seats Avail: 5",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2021-02-05 through 2021-04-02",
    "class_notes": "Same as CL 290R 1 Complete Topic - BIPOC and LGBT Adaptations of Ancient Greek Texts\n\"The master's tools will never dismantle the master's house.\"-Audre Lorde. Classics, the study of the ancient Greek and Roman worlds, has long been accused of elitism. This claim is far from groundless. Classics comes etymologically from classicus, a Latin word meaning \"of or belonging to the highest class.\" This is telling, for, at least in Europe and North America, people of the \"highest class\" have historically claimed Classics as their own. Classics has thus obtained a reputation as plaything of the white, wealthy elite. Classics might seem like one of the \"master's tools\" tools used by dominant groups to oppress and control others. These are the sort of tools that, according to Lorde, will never dismantle the master's house. However, the growing tide of Classical adaptations centering marginalized identities calls Lorde's conclusion into question. These adaptations suggest that, although Classics might seem like one of the master's tools, it can actually be subversive and even radical. Students will read and watch excerpts from contemporary adaptations of Ancient Grk texts. As students engage with these adaptations, they examine the extent to which Classics is one of the master's tools, and consider how effectively Classics can dismantle the master's house and provide new understanding. Priority to students in IDS 200W or GRK 102. Email Instructors for permission. Meets 2/5-4/2/2021",
    "course_description": "A side-car course brings together a subset of students from two courses that overlap in methodologies, topics, etc., to create a short interdisciplinary course that runs simultaneously with its two sponsoring courses. One credit, S/U only. Schedule and format arranged by sponsoring professors.",
    "prerequisites": null,
    "instructors": "Louise Pratt - Primary Instructor",
    "schedule_location": "F 2:40pm-3:55pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 5924, Section #: 3, Type: SEM, Campus: ATL, Meets: F 2:40-3:55p, Instructor: Team, Status: Open",
    "date_accessed": "2024-03-30"
}