{
    "course_code": "IDS 385",
    "course_title": "Special Topics: Law,Medicine & Bioethics",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 19 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "Title: \"Law, Medicine and Bioethics\" The intersection of law, medicine, ethics and policy are hotly debated in the public space. The academy is useful as a place to calmly consider the implications of the discourse and to decide if a different conclusion is needed. The academy serves as a model, away from the hospital bedside, the court, the prison and the death chamber. Academic review however can also be too bloodless and the conclusion is pulseless at best. The blend of the academy and the street have the best chance of creating public policy that reflects the best of both. This course will consider the most pressing issues of the day related to the intersection of law, medicine, ethics and policy. The curriculum will be pulled from the headlines and also able to adapt to the contemporaneous moment. Under the direction of the professor, students will learn to write, teach and debate difficult subjects. Emphasis will be placed on developing the skills needed to produce brief expository writing and how also to both write and navigate in the academy and in the public space. Students will learn to adopt and defend a position. I am interested in helping you develop your position and not simply adopting mine.",
    "course_description": "Highly focused courses, drawing on multiple disciplines of the humanities and social sciences; may be repeated for credit when topics vary.",
    "prerequisites": null,
    "instructors": "Joel B Zivot - Primary Instructor",
    "schedule_location": "TTh 6pm-7:15pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3813, Section #: 2, Type: LEC, Campus: ATL, Meets: TTh 6-7:15p, Instructor: J. Zivot, Status: Closed",
    "date_accessed": "2024-03-30"
}