{
    "course_code": "IDS 290R",
    "course_title": "Interdisciplinary Sidecar: Reading for Pleasure",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 3",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "Title: Reading for Pleasure. This course is open to students enrolled in one of the following courses: AMST/IDS 385W: Advertising in American Culture and IDS 390: Interdisciplinary Research Design. If you are not enrolled in one of these courses but are interested in taking Reading for Pleasure, please contact one of the instructors to inquire about availability. In a typical college schedule filled with mandatory assignments, reading for pleasure, diving into another world simply for the joy of it, can fall by the wayside. This course will help you to carve out time for literary fiction chosen by your peers Our undergraduate TAs will each suggest potential books for the class to read and will lead a class discussion on the chosen book. Students taking the class will help select the books we read. The first class will be held on February 5, and we will meet for a total of 10 consecutive Fridays over the course of the semester, with the last class held on April 9. Our class format will vary; in addition to the three sessions devoted to group discussion of the books we're reading, we'll have two sessions in which students and faculty briefly present favorite books, while another three will potentially entail more creative endeavors, such an online novel or poetry reading, or the screening of a film adaptation. Students will also attend one or two asynchronous literary events.",
    "course_description": "A side-car course brings together a subset of students from two courses that overlap in methodologies, topics, etc., to create a short interdisciplinary course that runs simultaneously with its two sponsoring courses. One credit, S/U only. Schedule and format arranged by sponsoring professors.",
    "prerequisites": null,
    "instructors": "Cynthia Blakeley - Primary Instructor",
    "schedule_location": "F 1pm-2:15pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 5925, Section #: 4, Type: SEM, Campus: ATL, Meets: F 1-2:15p, Instructor: Team, Status: Open",
    "date_accessed": "2024-03-30"
}