{
    "course_code": "IDS 385W",
    "course_title": "Special Topics: Cooperation Roots of Social",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 2",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Continuing Writing Requirement",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Synchronous online both days.) Title: Cooperation and the Roots of Social Theory. A central problem of social theory is to understand human cooperation and our capacity for joint action.  Compared with other species, humans are hyper-cooperative, and our forms of sociality depend on our ability to act together for the sake of a joint goal.  How are such high levels of cooperation possible?  What forms can human cooperation and joint action take?   How might cooperation and joint action have evolved?  How is cooperation and joint action related to social norms, ethics, and politics?  While these questions have been at the heart of thinking about society and politics throughout the western tradition, recent work has put Aristotle, Rousseau, Smith, and Marx into conversation with empirical research.  The burgeoning economic and sociological literature about cooperation and social norms is nicely complemented by psychological research into the affective basis of cognition and the neurological basis of joint action.  Anthropology has proposed ways in which cultural and biological evolution might have 'bootstrapped' humans into the hyper-cooperative beings that we are.  This course will read classic texts against contemporary scientific literature, and philosophical theories against empirical research, to try to understand the ultimate grounds of human sociality.",
    "course_description": "Highly focused courses, drawing on multiple disciplines of the humanities and social sciences; may be repeated for credit when topics vary.",
    "prerequisites": null,
    "instructors": "Mark Risjord - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 3106, Section #: 2, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: M. Risjord, Status: Open",
    "date_accessed": "2024-03-30"
}