{
    "course_code": "HPM 520",
    "course_title": "Development Economics and Global Health Policy",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 30 / Seats Avail: 23",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "Prerequisites HPM 501 or GH 501, HPM 500 for non HPM students or permission of instructor",
    "course_description": "Prerequisites: HPM 501 or GH 501, HPM 500 for non HPM students, or permission of instructor. This course introduces students to foundational concepts in development economics and relates them to health policy issues around the world. We will study the forces that contribute to economic development, particularly in low- and middle-income countries, and explore the concept and measurement of poverty in these settings. We will also focus on the microeconomic fundamentals of economic development: how individuals, households, communities, and policymakers make decisions that enable and constrain their capabilities. We will focus on topic areas such as fertility, nutrition, health, education, labor markets, savings and credit, and intra-household decision-making. Empirical evidence and theory from low- and middle-income countries will be used, paying special attention to methods, context, and contributions to policy and practice.",
    "prerequisites": null,
    "instructors": "Maria Dieci - Primary Instructor",
    "schedule_location": "W 9am-11:50am in Grace Crum Rollins TBA",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_HPM_520_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2860, Section #: 1, Type: LEC, Campus: ATL, Meets: W 9-11:50a, Instructor: M. Dieci, Status: Open",
    "date_accessed": "2024-03-28"
}