{
    "course_code": "GER 101",
    "course_title": "Elementary German I",
    "credit_hours": "4",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Varies by section",
    "instruction_method": "Varies by section",
    "typically_offered": "Fall",
    "requirement_designation": "Humanities, Arts, Language [Foreign Language]",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "German 101 is the first of the two-course sequence that explores the roles and group affiliations that contribute to the identity formation of young adults in the United States and the German-speaking world. Specifically, students will examine the following three roles in 101, devoting 4-5 weeks to each: The young adult as (1) a student; (2) a hobbyist; and (3) a family member. Students will use a free, online textbook and supplemental materials to acquire the language necessary to communicate meaningfully about each topic. Through this process of examining identity formation, students in this course and in its sequel, German 102, will be introduced to the principles of speaking, writing, reading, and understanding German and to life in German-speaking countries. Texts: Free, online textbook and supplemental materials provided by instructor. Particulars: Participation (10%) Writing assignments (30%) Speaking events (30%) Preparation/homework (30%). Prerequisite: none; students who have had any prior exposure to the German language should take the department's online placement exam.",
    "course_description": "Fall, Summer (Vienna). The first of the two-course sequence (101-102) that introduces students to reading, writing, speaking, and understanding the German language through an exploration of the different identities of young adults in the United States and the German-speaking world.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": "Varies by section",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2532, Section #: 1, Type: SEM, Campus: ATL, Meets: TThF 10-11:15a, Instructor: A. Starcevic, Status: Closed\nClass Nbr: This section is full 2216, Section #: 2, Type: SEM, Campus: ATL, Meets: TThF 11:30a-12:45p, Instructor: F. Voigt, Status: Closed\nClass Nbr: 2218, Section #: 3, Type: SEM, Campus: ATL, Meets: MWF 2:30-3:45p, Instructor: P. Buchholz, Status: Open\nClass Nbr: 2220, Section #: 4, Type: SEM, Campus: ATL, Meets: TThF 1-2:15p, Instructor: C. Schaumann, Status: Open\nClass Nbr: 2534, Section #: 5, Type: SEM, Campus: ATL, Meets: TThF 8:30-9:45a, Instructor: A. Starcevic, Status: Open",
    "date_accessed": "2024-03-30"
}