{
    "course_code": "GER 380",
    "course_title": "Topics in German Studies: Unraveling Berlin 20th & 21st",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 6",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Language [Foreign Language]",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Same as JS 380 1)\nTaught in German. Berlin is a vibrant city that attracts migrants and students from many parts of the world. It also is a city with an extremely diverse history where students often played a crucial part. In this class, conducted in German, students will investigate and discuss crucial moments in the political and cultural history of student life Berlin. Which role did Berlin universities and institutes play in Germany's politics of colonization around 1900? Did you know that the Nazi book burnings in 1933 were not administered by Hitler or Goebbels, but organized by conservative and Nazi students as a pinnacle of an anti-Semitic campaign against `un-German' literature and science? After World War II, how did students in the 1960s discuss Germany's Nazi past and strategies for radical democracy or revolution? How did they relate to the student movement in the US? What was it like to study in the socialist part of Berlin? How do migrant students experience studying in Berlin and participate in German politics after its reunification in 1990 until today? In addition to readings for each class, there will be three types of assignments: one in-class presentation, a paper as the result of a guided research, and a journalistic article OR a short podcast episode. Successful completion of the course will make you eligible for a short study trip to Berlin during winter break in 2021-2022.",
    "course_description": "Taught in German. An interdisciplinary course intended to provide in-depth study of formative elements, influences, and movements in German-speaking culture(s). May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Frank Voigt - Primary Instructor",
    "schedule_location": "TTh 6pm-7:15pm in MODERN LANGUAGE_330",
    "course_resources": null,
    "sections": "Class Nbr: 2559, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 6-7:15p, Instructor: F. Voigt, Status: Open",
    "date_accessed": "2024-03-30"
}