{
    "course_code": "ANT 285",
    "course_title": "Anthropology; Special Topics: Found.-Prim.Behavior/Cognition",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 15Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-05-17 through 2021-06-23",
    "class_notes": "This is an online course. Emory College Online summer courses have required synchronous/live sessions every week. Students must be available to sign into and virtually attend the course online during those times (noted as the course meeting times- all times listed are local to Atlanta). Each course will also involve significant asynchronous material that you access on your own time in addition to standard amounts of readings and course assignments. Students should plan to spend 15-20 hours/week on this course. Please also be aware that faculty will begin corresponding with students during Week Zero of the course (one week before the official start date of the course), and that some interaction with the course may be required at that time. Students should begin checking the Canvas course site regularly one week prior to the official start of the term.\n\n\nThis course will investigate what it means to be a primate by examining the evolution, behavior, and cognition of our closest living relatives. In this course, students will learn the fundamentals of primatology by combining empirical data (what we know), with theory (what we think we know), with the methods we have available to us (how we know it). This course will walk through (1) an overview of the living primates, (2) the problems that primates must solve to survive and reproduce, (3) how primates solve these problems, and (4) how we know how primates solve these problems. While this will be a virtual course, students will learn to critically evaluate primate studies, observe primate behavior through wildlife documentaries and field footage, collect and interpret their own data on animal behavior and cognition, and engage with primatologists through interviews and field narratives.",
    "course_description": "Seminar or lecture series on topics of anthropological interest at an intermediate level. Maybe repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Marcela Benitez - Primary Instructor",
    "schedule_location": "TTh 1:15pm-2:45pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 1396, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 1:15-2:45p, Instructor: M. Benitez, Status: Open",
    "date_accessed": "2024-03-30"
}