{
    "course_code": "WGS 385W",
    "course_title": "Spec Topics: Women, Gender, & Sexuality Studies: Queer Theory: Identity",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 15Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Topic:  Queer Theory: Identity and Its Discontents\nThis course is an introduction to queer theory. Splitting from gay and lesbian studies, queer theory worries the frays and binds of identity. How does queer come to be at the same time an identity and a critique of identity? Taking up central concerns of poststructuralist feminism, queer theory seeks to disarticulate the categories of sex, gender, and sexuality. Drawing on film, literature, poetry, art, and pop culture, we will examine how identity and difference are figured in the production of sexual subjects. As much an inclination as it is an identity, queer connotes a way of reading with our texts. What does it mean to read and write queerly? As a writing-intensive, Continued Communication course, we will focus on the process of writing, with an eye toward funky, counterintuitive modes of thought. Students will engage with different genres of writing through digital scholarship. Assignments include short reading responses, a visually dynamic TikTok responding to course content, and a collaborative final research project connecting course materials to a contemporary queer issue. For the final project, students will create either an interactive, hypertext essay on the digital storytelling platform Twine; a 10-minute YouTube-style video essay; or a 10-minute podcast episode. Queer, from the German quer, meaning oblique, transverse, is cross-disciplinary from the start.",
    "course_description": "Offerings vary each semester.",
    "prerequisites": null,
    "instructors": "Shelley Spenser Feller - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in Tarbutton Hall 218",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_WGS_385W_2_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 5532, Section #: 2, Type: SEM, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: S. Feller, Status: Open",
    "date_accessed": "2023-10-31"
}