{
    "course_code": "WGS 385",
    "course_title": "Spec Topics: Women, Gender, & Sexuality Studies: Crit.ApproachesHeterosexuality",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 3Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Critical Approaches to Heterosexuality examines various elements of heterosexuality from a queer feminist perspective. The course will analyze heterosexuality from a variety of theoretical positions, including psychoanalysis, affect theory, critical theory, and cultural studies. Questions explored will include: What is heterosexuality? What are its boundaries and limitations? How and when did the idea of 'the heterosexual emerge? How flexible is it? What is its social and political function? Through what processes does heterosexuality reproduce itself? How can we trace heterosexuality's effects on other identities? How is heterosexuality complicated by race, class, geography, and time? What is feminism's relationship to heterosexuality? What is heterosexuality's relationship to misogyny? How might we develop a queer feminist analysis of the immense amount of strife around heterosexuality in the current moment, embodied by movements like #MeToo and forms of misogynistic extremism like incel and online masculinist movements? By putting heterosexuality under the microscope, this class will examine the power of sexual norms and how they shape our understanding of the world and ourselves.",
    "course_description": "Offerings vary each semester.",
    "prerequisites": null,
    "instructors": "Samantha Wrisley - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Emerson Chemistry Bldg. E103",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_WGS_385_6_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 5533, Section #: 6, Type: SEM, Campus: ATL, Meets: TTh 10-11:15a, Instructor: S. Wrisley, Status: Open",
    "date_accessed": "2024-03-31"
}