{
    "course_code": "GH 515",
    "course_title": "Transforming Public Health Surveillance",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 50 / Seats Avail: 12",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "Cross-listed with EPI 515. GH MPH Infectious Disease Concentration students enrollment only through March 23.  GH MPH students (all other concentrations) enrollment through March 28.  All others may enroll beginning March 29.",
    "course_description": "Transforming Public Health Surveillance (TPHS) provides a review of the history, purposes, activities, uses, elements, data sources, models, analyses, actions, reports, evaluation, and ethical and legal issues of public health surveillance (PHS). It helps students understand the critical importance of the direct association between PHS and public health action, plus develop skills and competencies with the use of data-information-messages and the information and communication technologies that enable, enhance, and empower them. TPHS describes informatics approaches to enable and enhance data sharing, analytics, and visualization though interoperability that adapts to meet the challenges as PHS moves from analog to digital and demonstrates how PHS core functions (i.e., detection, registration, confirmation, analysis, feedback, communication, and response) will be enabled, enhanced, and empowered by these opportunities. Cross-listed with EPI 515.",
    "prerequisites": null,
    "instructors": "Scott McNabb - Primary Instructor",
    "schedule_location": "ThF 1pm-2:20pm in Claudia Nance Rollins 1000",
    "course_resources": null,
    "sections": "Class Nbr: 3170, Section #: 1, Type: LEC, Campus: ATL, Meets: ThF 1-2:20p, Instructor: Team, Status: Open",
    "date_accessed": "2024-03-30"
}