{
    "course_code": "ANT 332",
    "course_title": "Race in the Age of Genomics",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 26 / Seats Avail: 2Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "HSC w/Race & Ethnicity Req.",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "This is the \"Age of Genomics\" , and yet people who study race, culture, and law often resist integrating biological insights into their understanding of human psychology and behavior. One reason for this resistance is historical: pseudo-biological concepts of race have more often than not played a pernicious role in distorting legal and social policy. The response of many social scientists has been to avoid biological paradigms altogether and suggest that racial concepts reflect social construction. Popular belief in race nevertheless persists and continues to play a major role in many social interactions. In this course, we will examine the historical, ethical, and philosophical foundations of race and push them through a modern scientific lens. We will examine the biological and cultural processes that have shaped human traits and how genomics can help us better understand our \"differences\" in a culture influenced by subjective racial classifications.",
    "course_description": "The course will take a contemporary view on how population genetics has changed our understating of the biological explanation of race.",
    "prerequisites": "Juniors or Seniors only or permission of instructor required for enrollment.",
    "instructors": "John Lindo - Primary Instructor",
    "schedule_location": "W 2:30pm-5:15pm in New Psyc Bldg 290 (36 Eagle Ro",
    "course_resources": null,
    "sections": "Class Nbr: 3653, Section #: 1, Type: LEC, Campus: ATL, Meets: W 2:30-5:15p, Instructor: J. Lindo, Status: Open",
    "date_accessed": "2024-03-30"
}