{
    "course_code": "ANT 305",
    "course_title": "The Human Brain",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 4Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Science, Nature, Technology",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Strongly recommended prerequisite of one of the following: ANT210, NBB201/ANT200, PSYCH103, or PSYCH110, or permission of instructor.) This course is an upper level introduction to the basis of complex human behavior in the brain. We will focus on human brain structure and function with a view toward mastering the anatomy that underlies cognition and emotion. We will give significant attention to the phylogenetic context of human brain evolution, with reference to comparative neuroanatomy of primates, other mammals, and other vertebrates. We will then study the most interesting model of higher brain function, that of behavioral neurologist Albert Damasio. The overall goal is to master the anatomy underlying higher human capacities, but without losing sight of the ways in which our brain's evolutionary past can inform our understanding of how that brain works now. One way to find out if you should stay in this class is to pick up Nolte's The Human Brain (a medical school neuroanatomy textbook) and read some of it, or read the excerpts on Amazon.com. If you are not comfortable reading that, you will not be comfortable in this course. We will spend more than half the course on that book.",
    "course_description": "Upper-level intro to basis of complex human behavior in the brain, focused on human brain structure and function. The overall goal is to master the anatomy underlying higher human capacities, acknowledging how our brain's evolutionary past can inform our understanding of how the brain works now.",
    "prerequisites": null,
    "instructors": "Melvin J Konner - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Anthropology Building 107",
    "course_resources": null,
    "sections": "Class Nbr: 6135, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: Konner/Mohammad, Status: Open",
    "date_accessed": "2024-03-30"
}