{
    "course_code": "ANT 285",
    "course_title": "Anthropology; Special Topics: Nature, Nurture, Sexualities",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 150 / Seats Avail: 25Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "This course will provide a critical and rigorous examination of sex, gender, and sexuality by delving into the biological underpinnings and evolutionary roots of primate sexual behavior, and the historical and contemporary approaches to understanding the nuance of human sexuality. Co-taught by a biological and cultural anthropologist, this unique approach combines expertise on evolution, animal behavior, genetics, queer history,  American society, and global social movements to provide a comprehensive understanding of the roles of nature, nurture, and culture in shaping human sexuality. How has heterosexuality become normative and hegemonic? Are homosexual behavior widespread in animals? How has homosexuality evolved? How has biology been misconstrued to perpetuate homophobia and societal gender roles? How has cultural bias shaped our understanding of the complexity of sexual behavior across primates? Why is an intersectional approach to understanding sexuality essential, particularly as it relates to colonialism, race, religion, class, and ability? How can a better understanding of both the biological and cultural underpinnings of sexuality inform health, pleasure, joy, equality, identity, and social justice?",
    "course_description": "Seminar or lecture series on topics of anthropological interest at an intermediate level. Maybe repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Sa'ed Atshan - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Anthropology Building 303",
    "course_resources": null,
    "sections": "Class Nbr: 3648, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 10-11:15a, Instructor: Team, Status: Open",
    "date_accessed": "2024-03-30"
}