{
    "course_code": "ANT 280R",
    "course_title": "Anthro. Perspectives: New Guinea & US",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "This course expands our understanding & appreciation of radical cultural diversity by comparing & contrasting received practices & beliefs among peoples & cultures of New Guinea with those in American culture.  As such, radically alternative cultural practices in New Guinea are used to throw into stark relief both established & new alternative directions in American culture. \nNew Guinea's area of Melanesia in the South Pacific has included 800 different languages and cultures -- one-sixth of the world's total -- despite a combined population of just 12 million people. In the pre-colonial & early colonial era, which in some places lasted until the 1970s, New Guinea harbored diverse practices & beliefs that seemed extreme, outlandish, or flamboyant to many Westerners, including alternative expressions of sexuality, death & treatment of corpses, gender relations, violence, and power and domination. Some of the most poignant of these practices have declined, while others have morphed or persist in new guises as the region has been influenced by global capitalism, Christianity, & indigenous national government. \n \nThis course compares & contrasts four content areas of New Guinea societies & cultures with contemporary American culture: Sex, Violence, Death, and Power. The larger goal is to understand how practices and beliefs that we find striking from other world areas or that we take for granted closer to home are culturally and historically constructed, and variable over time.",
    "course_description": "Anthropological perspectives on the people and cultures on different regions of the world.  May be repeated for credit when topic varies. HSC, may be repeated when topic changes.",
    "prerequisites": null,
    "instructors": "Bruce M Knauft - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Anthropology Building 105",
    "course_resources": null,
    "sections": "Class Nbr: 3647, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: B. Knauft, Status: Open",
    "date_accessed": "2024-03-30"
}