{
    "course_code": "ANT 385",
    "course_title": "Special Topics: Anthropology: Inequality and Well-Being",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "How do poverty and inequality \"get under the skin and out again\" to shape health disparities worldwide? \nWealth inequality is rising across much of the globe, leading some scholars to deem the current landscape an \"inequality pandemic.\" Competing explanations have been proposed to explain the well-documented associations between poverty and human health. We will evaluate these explanations by assessing the social, cultural, ecological, and biological mechanisms that link poverty, inequality, and human well-being. To do so, we will apply a biocultural anthropological perspective synthesizing evolutionary, developmental, and political-ecological theories to holistically understand health and well-being. \nIn this course, we will explore ways to apply anthropological perspectives to better document, understand, and combat the interconnections between poverty, inequality, and human well-being. We will also consider:\n- How the landscape of disease, illness, and well-being has shifted throughout human evolution.\n- How underlying environmental factors, including social, economic, and political structures, have shaped these changes.\n- Why poverty and inequality continue to drive health disparities \n- How the practice and politics of an anthropological study of health inequalities affect our lives through policy and public discourse.\nUltimately, we will apply these questions to explore how to leverage anthropology to improve health equity and human well-being in the 21st century.",
    "course_description": "Seminar or lecture series of topics of anthropological concern. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Caroline Owens - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in New Psyc Bldg 235 (36 Eagle Ro",
    "course_resources": null,
    "sections": "Class Nbr: 3654, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: C. Owens, Status: Open",
    "date_accessed": "2024-03-30"
}