{
    "course_code": "ANT 385",
    "course_title": "Special Topics: Anthropology: Music, Dance, & Social Brains",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Science, Nature, Technology",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "Instructor: Dr. Bronwyn Tarr\nMusic, Dance, and Social Brains\n\n\nHumans have a profound relationship with music and dance. People in every human culture make, and dance to, music. This may seem unremarkable, but almost no other human behavior is so ubiquitous, and go far enough back in human evolution and we would not even have had the ability to tap our foot to a beat. Then, at least +-50,000 years ago, our ancestors started to do something no other creature has ever done. They took time out from activities crucial to survival, foraging, hunting, and building shelter, to carve the first musical instruments; give voice to the first melodies; and ritually spin, stamp and sway in time with the first music. This constitutes one of the most extraordinary steps in human evolution and one that arguably continues to play a part in navigating the greatest challenge that our species has ever faced: the question of how to navigate the perennial tensions between individuals and groups, between `I' and `we'. \nThis seminar series will explore the theory that music and dance act as a pervasive and effective social glue in human society., i.e. the Music and Social Bonding (MSB) hypothesis. We will draw on inter-species, cross-cultural, and developmental research to better understand how our social brains operate and how music and dance feature in collective human rituals. We will contextualize MSB with other related and competing evolutionary explanations (i.e. why we make music), including coalition-signaling and sexual selection hypotheses.",
    "course_description": "Seminar or lecture series of topics of anthropological concern. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Bronwyn Tarr - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Math & Science Center - N301",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 5634, Section #: 4, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: B. Tarr, Status: Wait List",
    "date_accessed": "2024-03-30"
}