{
    "course_code": "ANT 497R",
    "course_title": "Undergraduate Research",
    "credit_hours": "1-4",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Varies by section",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": "Varies by section",
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": null,
    "course_description": "Consultation with faculty prior to registration required.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 5611, Section #: 1, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: R. Paul, Status: Open\nClass Nbr: 6546, Section #: 10, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Lindo, Status: Open\nClass Nbr: 6587, Section #: 11, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: H. King, Status: Open\nClass Nbr: 6620, Section #: 12, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: D. Stout, Status: Open\nClass Nbr: 6621, Section #: 13, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: M. Konner, Status: Open\nClass Nbr: 6194, Section #: 2, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: S. Atshan, Status: Open\nClass Nbr: 6253, Section #: 3, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: C. Owens, Status: Open\nClass Nbr: 6322, Section #: 4, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: E. Lonsdorf, Status: Open\nClass Nbr: 6324, Section #: 5, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: R. Hall-Clifford, Status: Open\nClass Nbr: 6339, Section #: 6, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: C. Quave, Status: Open\nClass Nbr: 6541, Section #: 7, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: M. Benitez, Status: Open\nClass Nbr: 6542, Section #: 8, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: A. DeNicola, Status: Open\nClass Nbr: 6543, Section #: 9, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: K. Phillips, Status: Open\nClass Nbr: This section is full 6738, Section #: 9000, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: Staff, Status: Closed",
    "date_accessed": "2024-03-30"
}