{
    "course_code": "ANT 585",
    "course_title": "Spec Tops: Anthropology: Development and Change",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "There are few contemporary topics in the social sciences that invoke as many polarizing opinions and debates as that of development.  While it remains a contested field with colonial legacies, it continues to attract considerable scholarly and applied interest in anthropology and other social sciences, including from many scholars and practitioners from the Global South.  This course examines anthropological and social science contributions to understandings of development and underdevelopment and addresses the different theories, critiques, and \"schools\" of development studies; ethnographic research on selected themes of development; and the institutional actors that shape the discourses, policies, and activities of development.  The course is intended to cover both the theoretical and policy aspects of development anthropology and to challenge students to think critically about development problems and the narratives that inform policy and development processes both in the Global South and North.  By focusing on both critiques and development policies, it attempts to provide a somewhat balanced picture of a field that often is characterized by moral polemics and a great deal of miscommunication and stereotyping.\n\n\nPossible books (final list TBD):\nAnand, Nikhil. 2017. Hydraulic City: Water and the Infrastructures of Citizenship in Mumbai. Durham, NC: Duke University Press.\nJaskiran Dhillon, ed. 2022. Indigenous Resurgence: Decolonialization and Movements for Environmental Justice. Berghahn Publishers (available open access).\nFerguson, James. 2015. Give a Man a Fish: Reflections on the New Politics of Distribution. Duke University Press.\nKarim, Lamia.  2011. Microfinance and its Discontents: Women in Debt in Bangladesh.  University of Minnesota Press.  \nLi, Tania Murray.  2007.  The Will to Improve: Governmentality, Development, and the Practice of Politics.  Duke University Press.\nMosse, David. 2004. Cultivating Development: An Ethnography of Aid Policy and Practice.  London: Pluto Press.\nRudnyckyj, Daromir. 2010.  Spiritual economies: Islam, globalization, and the afterlife of development. Cornell U Press.",
    "course_description": null,
    "prerequisites": null,
    "instructors": "Peter Little - Primary Instructor",
    "schedule_location": "T 4pm-6:45pm in Anthropology Bldg 206",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3749, Section #: 2, Type: SEM, Campus: ATL, Meets: T 4-6:45p, Instructor: P. Little, Status: Closed",
    "date_accessed": "2024-03-30"
}