{
    "course_code": "ANT 502",
    "course_title": "Theory and Ethnography in the New Millennium",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 9",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "As the second millennium approached its final years, the field of cultural anthropology was confronted with an existential crisis: its intellectual, political, and ethical premises and foundations came under close scrutiny and critique.  In the post-modern and post-colonial episteme that dominated those years, doubt was cast from several directions on the whole project of cultural anthropology as it is had existed during the twentieth century.  In this seminar, we will examine some responses to these challenges and some attempts to find a path forward in the new millennium.  The authors to be read reflect only a particular slice of the whole emerging literature, but the list includes many whom I regard as of importance and interest as we attempt to find a footing in the dawning era.  Among the authors to be considered are :  Talal Asad; Jean and John Comaroff; Philippe Descola; David Graeber; Joseph Henrich: Tim Ingold, Elizabeth Povinelli, Marshall Sahlins, Anna L. Tsing; and Eduardo Viveiros de Castro, among others.",
    "course_description": "This course examines trends in ethnography and cultural theory in the new millennium, focusing on new developments and continuities since the late 20th century.",
    "prerequisites": null,
    "instructors": "Robert A Paul - Primary Instructor",
    "schedule_location": "W 2:30pm-5:15pm in Emerson Chemistry Bldg. E101",
    "course_resources": null,
    "sections": "Class Nbr: 3746, Section #: 1, Type: LEC, Campus: ATL, Meets: W 2:30-5:15p, Instructor: R. Paul, Status: Open",
    "date_accessed": "2024-03-30"
}