{
    "course_code": "IDS 200W",
    "course_title": "Interdisciplinary Foundations",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 4Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Same as MESAS 270W 2, HIST 296W 2)\nStudents enroll in co-requisite ENGRD 223, one credit, in the same semester as IDS 200W (if you took ENGRD 223 previously, the co-requisite is fulfilled; questions contact pwakefi@emory.edu)\nSame as MESAS 270W-2, HIST 296W-2, WGS 285W-1.\nIDS 200W examines the origins of distinct disciplines in contemporary universities through the lens of evidence in different fields of human knowledge. Recommended for students at any level interested in health sciences, law, business, or future studies at the graduate level. IDS 200W introduces students to the Liberal Arts and supports student's studies in a wide range of majors. Systematic focus on writing essential in any career.\nIDS 200W in fall 2021 will be co-taught by Dr. Ruby Lal, who will be part of the ILA in 2021-22 as the inaugural Interdisciplinary Faculty Fellow, and Dr. Peter W. Wakefield, ILA. Emphasis in this collaborative version of the class will be given to women's power in literature and history. Works studied may include the ancient tragedy Antigone, Plato's Symposium, Toni Morrison's The Bluest Eye, and the lives of women such as Malala Yousafzai, Greta Thunberg, and Nur Jahan. \nShort writing assignments; midterm proposal/essay; final 5000-word research paper; participation in class discussion, and co-requisite ENGRD 223 Rhetorical Grammar.",
    "course_description": "IDS 200 examines the origins and development of distinct disciplines in contemporary universities through the lens of what counts as evidence in different fields of human knowledge.",
    "prerequisites": "ENGRD 223 or equivalent transfer credit as co-requisite.",
    "instructors": "Ruby Lal - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in Callaway Center S420",
    "course_resources": null,
    "sections": "Class Nbr: 1188, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: Wakefield/Lal, Status: Open",
    "date_accessed": "2024-03-30"
}