{
    "course_code": "IDS 290R",
    "course_title": "Interdisciplinary Sidecar: Communicating Social Justice",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "Complete Topic - Communicating Social Justice: Commitment or Woke Washing?\nIn the past few years, we have seen companies rush to tout their corporate social responsibility regarding social justice issues. But, do carefully crafted social solidarity statements equate to equitable internal diversity, equity, and inclusion practices and human-centered, fair methods of production and trade? This course will allow students from Goizueta and Emory College to explore the differences between legitimate corporate social responsibility initiatives and 'woke-washing.' Distinguishing between woke-washing, which occurs when organizations signal advocacy for a marginalized cause but continue to cause harm to vulnerable communities, from ethical corporate practices, is critical for our students as they navigate employment opportunities and consumer choices.",
    "course_description": "A side-car course brings together a subset of students from two courses that overlap in methodologies, topics, etc., to create a short interdisciplinary course that runs simultaneously with its two sponsoring courses. One credit, S/U only. Schedule and format arranged by sponsoring professors.",
    "prerequisites": null,
    "instructors": "Nikki Graves - Primary Instructor",
    "schedule_location": "M 2:30pm-3:45pm in Callaway Center S109",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 5776, Section #: 3, Type: SEM, Campus: ATL, Meets: M 2:30-3:45p, Instructor: Team, Status: Closed",
    "date_accessed": "2024-03-30"
}