{
    "course_code": "IDS 205W",
    "course_title": "Science & the Nature of Evidence",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 19 / Seats Avail: 9Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Science, Nature, Technology with Writing",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Co-Requisite ENGRD 223) For Questions, contact psyrf@emory.edu IDS205W addresses: Why do we believe what we do and what role does science play in this? What is the nature of scientific evidence? What counts as evidence in science versus other disciplines? How do they affect our everyday lives? Each semester, these broad issues are brought to bear on a pressing social issue.  For example, in past years, the focus has been on political elections, environmental justice, and suffering and death. This semester, we will focus on medical uncertainty.  The pandemic has highlighted enduring questions about how scientific progress is made in the context of ongoing research that creates as many questions as it answers, as well as the ways in which individuals experience uncertainty around their own health decisions in the context of inequities and barriers to health care. The course will follow the same basic format of weekly readings and discussions, and a series of short paper across the semester culminating in a final group project/presentation.",
    "course_description": "IDS205 addresses: What is the nature of scientific evidence? How does it compare to other types of evidence? What counts as evidence in science? In other disciplines? What are the histories of the answers to these questions? How do they affect our everyday lives? Co-requisite: ENGRD 223",
    "prerequisites": "ENGRD 223 or equivalent transfer credit as co-requisite.",
    "instructors": "Robyn Fivush - Primary Instructor",
    "schedule_location": "MW 4pm-5:15pm in Callaway Center S420",
    "course_resources": null,
    "sections": "Class Nbr: 1190, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 4-5:15p, Instructor: Fivush/Lewis, Status: Open",
    "date_accessed": "2024-03-30"
}