{
    "course_code": "IDS 190",
    "course_title": "Fresh Sem: IDS: Plato's Republic in Cont.Persp",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "Freshmen Seminar - For First Year Students Only\nComplete Topic: Plato's Republic in Contemporary Perspective \nPlato's most complex and influential dialogue, the Republic, has caused controversy for over 2500 years, surrounding topics such as: authoritarianism, the source of moral action, education, censorship, political deception, the corrupting force of art, the nature of truth and science, and the afterlife. Students will read the Republic in its entirety, then compare this ancient philosophical work to contemporary texts, including films (e.g. Network, The Matrix, The Truman Show and the series Black Mirror), music (e.g. Childish Gambino, This is America), and literature (e.g. selections from Dostoyevsky and Hawthorne). Our goal will be to understand contemporary issues better through the lens offered by Plato. Assignments and Grading: Midterm and Final essays (1000 words, each revised once); 5 Discussion Board posts; final group project and presentation.",
    "course_description": "Variable topics using interdisciplinary approaches from the humanities and social sciences. Topics represent current interests of the instructor.",
    "prerequisites": null,
    "instructors": "Peter W Wakefield - Primary Instructor",
    "schedule_location": "MW 8:30am-9:45am in Callaway Center S420",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 1175, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 8:30-9:45a, Instructor: P. Wakefield, Status: Closed",
    "date_accessed": "2024-03-30"
}