{
    "course_code": "IDS 290R",
    "course_title": "Interdisciplinary Sidecar: Coming of Age in Fiction/Film",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 4",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "Complete Topic: Coming of Age in Fiction and Film. \nThe German \"Bildungsroman\" derives from \"Roman,\" meaning \"novel,\" and \"Bildung,\" meaning \"education\" or \"formation.\" Indeed, the stories we tell about coming of age both center their maturing characters' formative years and reflect the continuous re-formation, the fluidity, of the cultures from which they come. With this power of definition, however, also comes the danger of totalizing the individualized, culturally dependent experience of growing up. This sidecar course will seek to understand how coming of age and its representations depend on cultural, political, aesthetic, and social factors, particularly in the context of hyphenated, transnational, German, and American identities. We will first study the emergence of the Bildungsroman as a German literary genre through foundational works like Johann Wolfgang Goethe's Wilhelm Meister's Apprenticeship. During the rest of the semester, we will explore coming of age as it appears in such literary works as Chimamanda Ngozi Adichie's Americanah, Elif Batuman's The Idiot, Julia Alvarez's How the Garcia Girls Lost Their Accents, and others, as well as through media representations in film and television. The course will conclude with a group podcast project, in which students will produce short episodes on one or more of our texts or media together.",
    "course_description": "A side-car course brings together a subset of students from two courses that overlap in methodologies, topics, etc., to create a short interdisciplinary course that runs simultaneously with its two sponsoring courses. One credit, S/U only. Schedule and format arranged by sponsoring professors.",
    "prerequisites": null,
    "instructors": "Kim Loudermilk - Primary Instructor",
    "schedule_location": "F 2:30pm-3:45pm in Callaway Center S104",
    "course_resources": null,
    "sections": "Class Nbr: 5775, Section #: 2, Type: SEM, Campus: ATL, Meets: F 2:30-3:45p, Instructor: Team, Status: Open",
    "date_accessed": "2024-03-30"
}