{
    "course_code": "IDS 207",
    "course_title": "Foundation Development Studies",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 9 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Same as ANT 207 1, AFS 270 3)\nDevelopment is one of the key topics of the post-World War II era whose significance has become even more important as parts of the world grow closer in time and space.  Indeed, there are few contemporary issues that invoke as many opinions and emotions as the topic of global development.   This course will introduce students to the growing interdisciplinary field of development studies and provide a solid foundation for subsequent course work in the Global Development Studies Minor and, eventually, possible career tracks. Because of the complexity and multi-faceted nature of the topic, the course will include materials from a range of different academic disciplines, but with an emphasis on the social sciences especially anthropology.   It will provide an overview of how scholars and practitioners research and apply their knowledge toward understanding and solving some of the world's most challenging problems.  Through readings and class discussion, students will learn about several key topics related to development, including human rights, gender, environment, poverty and inequality, governance, climate change, and agrarian systems. Because of the current challenges of the COVID Pandemic, Inequality, Racism, and Social Justice in the US and around the world, we also will use the opportunity (\"a teaching moment\") to discuss these topics both in the context of global development, as well as 'development' in high-income countries like the US.  The course has no prerequisites.",
    "course_description": "Introduces students to the growing field of development studies and provides a solid foundation for subsequent course work in the Minor. Key topics include human rights, gender, environment, poverty and inequality, democratic reforms and governance, market reforms, rural development, and conflict.",
    "prerequisites": null,
    "instructors": "Peter Little - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Rich Building 108",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 4409, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 10-11:15a, Instructor: P. Little, Status: Wait List",
    "date_accessed": "2024-03-30"
}