{
    "course_code": "EPI 512",
    "course_title": "Current Topics in Infectious Disease Epidemiology",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 75 / Seats Avail: 69",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "This is a required course for the Infectious Disease Epidemiology certificate. All students interested in the certificate should enroll in EPI 512, ideally in their first MPH/MSPH semester. Other students not interested in the certificate may also enroll in EPI 512.",
    "course_description": "Pre-requisite: Current enrollment in the Infectious Disease Epidemiology Certificate program at RSPH. Non-certificate students may enroll with permission of the instructor. Infectious disease epidemiology incorporates the fundamental principle that a person's risk of infection often depends on the disease status of another person or the disease prevalence at the population level. Therefore, events are not independent, violating a key assumption of classic epidemiological methods and requiring a different set of methods to approach infectious diseases. This course is a requirement of the Infectious Disease Epidemiology Certificate at RSPH. It will provide incoming students an orientation to the breadth of current topics in the field of infectious disease EPI.",
    "prerequisites": null,
    "instructors": "Samuel Jenness - Primary Instructor",
    "schedule_location": "F 1pm-1:50pm",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_EPI_512_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 1478, Section #: 1, Type: LEC, Campus: ATL, Meets: F 1-1:50p, Instructor: S. Jenness, Status: Open",
    "date_accessed": "2024-03-28"
}