{
    "course_code": "EPI 590R",
    "course_title": "EPI Seminar: Syst,Reviews,Meta-AnalysisRsch",
    "credit_hours": "2",
    "seats": "Seats: Maximum Enrollment: 30 / Seats Avail: 21",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "Meta-research, which cuts across all disciplines and relies on a wide range of methodological approaches, is the study of research itself (i.e., research methods, results, reporting, reproducibility, and incentives). The overall goals of meta-research are to accumulate and synthesize evidence, assess key research characteristics, and determine how to improve and inform research practices, evidentiary standards, and policies. While individual systematic reviews and meta-analyses fall under the umbrella of meta-research, this course also introduces a broad range of `review' study designs and data sources (e.g., regulatory documents, registries, and data sharing platforms) that can be utilized to answer questions across different biomedical/public health fields. Key topics covered in this course include: (i) the reproducibility crisis, (ii) systematic review, scoping review, mapping review, and umbrella review methodology, (iii) database characteristics and searches, (iv) meta-analyses and evidence synthesis, (v) scientific biases and risk bias assessments, and (vi) advanced review methodology. Throughout the class, students will design their own meta-research project. Prerequisites:  EPI 530 and BIOS 500.",
    "course_description": "Various topics by Epi faculty. Check OPUS/Atlas for current topics and descriptions.",
    "prerequisites": null,
    "instructors": "Joshua Wallach - Primary Instructor",
    "schedule_location": "M 1pm-2:50pm in Grace Crum Rollins TBA",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_EPI_590R_5_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2694, Section #: 5, Type: SEM, Campus: ATL, Meets: M 1-2:50p, Instructor: J. Wallach, Status: Open",
    "date_accessed": "2024-03-28"
}