{
    "course_code": "CE 551HYBB",
    "course_title": "Hybrid Contextual Education I Integrative Seminar: Food Justice and Hunger",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 9 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Closed",
    "instruction_method": "Distance Learning",
    "typically_offered": "Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-16 through 2024-04-29",
    "class_notes": "(ONLINE INTEGRATIVE SEMINAR) (Prerequisite: CCE 551HYBA 3 Fall 2023)  (All students in Con Ed I will be required to complete additional learning modules during the course of the semester)  (All students in Con Ed I will be required to complete additional learning modules during the course of the semester)",
    "course_description": "For Hybrid Contextual Education 1, first-year MDiv students choose a social service setting within their own area in conversation with the Office of Contextual Education. Four hours of weekly engagement at these sites during the entire academic year give students the opportunity to experience various ministries, contexts, and pastoral relationships. In the first semester, students meet weekly in their 90-minute Contextual Education I site Reflection Group led by their site supervisor. In the second semester, students continue working four hours per week at the same Contextual Education I site. Students meet with a faculty member (usually their academic adviser) and their site supervisor for a weekly, two-hour Integrative Seminar. An evaluation is made at the end of each semester and an in progress (IP) grade is assigned at the end of the first semester if the student is performing satisfactorily. To receive credit, the student must satisfactorily complete two consecutive semesters.",
    "prerequisites": "CE 551HYBA or equivalent transfer credit as prerequisite.",
    "instructors": "Walter Wilson - Primary Instructor",
    "schedule_location": "T 4pm-6pm in ONLINE",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_CE_551HYBB_3_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: This section is full 5469, Section #: 3, Type: PRA, Campus: ONLIN, Meets: T 4-6p, Instructor: Wilson/Campbell, Status: Closed",
    "date_accessed": "2024-03-30"
}