{
    "course_code": "PSYC 385",
    "course_title": "Special Topics in Psychology: Social Development",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-06-28 through 2021-08-04",
    "class_notes": "Topic: Social Development. Course materials will be delivered asynchronously during the week as well.) What shapes our self-concept? Are we born good or evil? What affects our ability to understand others and form relationships? To explore these questions, this course will examine key developmental changes between infancy and adolescence in various social domains, including self-other understanding, moral development, and emotional development. Through lecture, active exercises, and lively discussions, we will contemplate how the social world shapes us throughout the lifespan. The goal is that by the end of this class, students will understand how theories and research of social development enhance our understanding of human psychology. Textbook: Navigating the Social World by Banaji & Gelman. ISBN-13: 9780199361069\n\n\nThis is an online course. Emory College Online summer courses have required synchronous/live sessions every week. Students must be available to sign into and virtually attend the course online during those times (noted as the course meeting times- all times listed are local to Atlanta). Each course will also involve significant asynchronous material that you access on your own time in addition to standard amounts of readings and course assignments. Students should plan to spend 15-20 hours/week on this course. Please also be aware that faculty will begin corresponding with students during Week Zero of the course (one week before the official start date of the course), and that some interaction with the course may be required at that time. Students should begin checking the Canvas course site regularly one week prior to the official start of the term.",
    "course_description": "A series of special topics of concern to the discipline of psychology. Content will vary in successive offerings. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Sara Botto - Primary Instructor",
    "schedule_location": "TTh 1:15pm-2:45pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 1392, Section #: 2, Type: LEC, Campus: ATL, Meets: TTh 1:15-2:45p, Instructor: S. Botto, Status: Wait List",
    "date_accessed": "2024-03-30"
}