{
    "course_code": "EPI 799R",
    "course_title": "Research",
    "credit_hours": "1-12",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-01-10 through 2022-04-25",
    "class_notes": null,
    "course_description": "Dissertation research and preparation for Epidemiology doctoral students in candidacy status.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 3350, Section #: 1, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: T. CLASEN, Status: Open\nClass Nbr: 3351, Section #: 10, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: S. Suglia, Status: Open\nClass Nbr: 3353, Section #: 12, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: S. Jenness, Status: Open\nClass Nbr: 3379, Section #: 13, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: M. Kramer, Status: Open\nClass Nbr: 3380, Section #: 14, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: B. Lopman, Status: Open\nClass Nbr: 5608, Section #: 15, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Guest, Status: Open\nClass Nbr: 5721, Section #: 16, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: L. McCullough, Status: Open\nClass Nbr: 5866, Section #: 17, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: A. Siegler, Status: Open\nClass Nbr: 6223, Section #: 18, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: T. Sanchez, Status: Open\nClass Nbr: 3354, Section #: 2, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: M. Marcus, Status: Open\nClass Nbr: 3355, Section #: 3, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Schildkraut, Status: Open\nClass Nbr: 3358, Section #: 5, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: A. Alonso, Status: Open\nClass Nbr: 3359, Section #: 6, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: T. Lash, Status: Open\nClass Nbr: 3360, Section #: 7, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: N. Gandhi, Status: Open\nClass Nbr: 3361, Section #: 8, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Gazmararian, Status: Open\nClass Nbr: 3362, Section #: 9, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: T. Lewis, Status: Open",
    "date_accessed": "2024-03-30"
}