{
    "course_code": "JS 271",
    "course_title": "Topics in Jewish History: Americans and the Holocaust",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 8",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Same as REL 270-4 and HIST 296-3\n\n\nWhat did Americans know as the Holocaust as it unfolded? Did they help Jewish refugees? This course examines both U.S. responses to the Holocaust and the impact of the Holocaust on American society and culture from the wartime period to the present. We will examine journalism, diaries, film, and other primary sources to analyze how events in Europe affected and were affected by developments in U.S. history. We will begin the course by reading documents from the period from 1933 to 1945 to gain an understanding of how Americans depicted and understood the persecution of European Jews in the pre-war, wartime, and immediate post-war period. We will then move to the postwar decades to examine the impact of the Holocaust on debates about the moral responsibility of individuals and nations, concepts of evil, concepts of race and racism, and controversies in the U.S. regarding the preservation and ownership of Holocaust memory.",
    "course_description": "Special Topics in Jewish History: Variety of subjects emphasizing Jewish History. Content will vary. May be repeated when the topic changes.",
    "prerequisites": null,
    "instructors": "Alicja Podbielska - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Callaway Center S105",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_JS_271_3_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3049, Section #: 3, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: A. Podbielska, Status: Open",
    "date_accessed": "2024-03-30"
}