{
    "course_code": "JS 354R",
    "course_title": "Ethics: Jewish Business Ethics",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 9 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(Same as REL 354R 1)\nThis course satisfies the Religion major requirement:- Tradition-Judaism, Theme.\nWhile the law generally governs the world of business, those who work in it also face dozens of daily decisions on how to behave.  Whether in the office or factory floor, C-suite or marketing department, finance or sales, individuals in business must constantly navigate the often gray areas of ethics.  In this experimental course, we will examine sources within Judaism's ethical tradition, from the Bible to today's religious leaders, to tease out their underlying values, and then apply them to specific cases. In the process, students will learn to articulate and defend their own commitments and priorities in this all-pervasive domain of human interaction. Ideal for current GBS or pre-Business students and those in arts and sciences who are interested in learning how to infuse ethics and values into their own decision-making when entering their careers/professions.",
    "course_description": "Analysis of methods and/or texts pertaining to ethical decision-making for individual and social problems such as race, sex/marriage, justice, war, biomedical technology, and environmental pollution. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Michael Berger - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in Callaway Center C203",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_JS_354R_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 4683, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 1-2:15p, Instructor: M. Berger, Status: Wait List",
    "date_accessed": "2024-03-30"
}