{
    "course_code": "JS 471W",
    "course_title": "Topics in Jewish History: Jewish Legal Cultures",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 6 / Seats Avail: 5",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(Same as HIST 496W 1)\n\"Jewish Legal Cultures\"How have Jewish scholars conceptualized Jewish law vis-à-vis non-Jewish legal systems? Did rabbinic interaction with other legal traditions, institutions, or practitioners shape Jewish jurisprudence and legal practice? Why did lay Jewish women and men engage with non-Jewish legal systems, and how did rabbinic authorities respond? In recent years we witness a new interest in the relationship between Jewish and non-Jewish law and legal practice: from the interrelation between early rabbinic Jewish law (halakha) and Roman law to Jewish law in contemporary Israel and North America. Exploring Jewish communities in Middle Eastern, European, and North American contexts, students engage with ongoing debates in legal studies, historiography, and religion to complicate our understanding of Jewish law and practice. Focusing primarily on 1100-1800, students pursue broader questions about diaspora and law, minority-majority relations, and inter-faith exchanges. In addition to mid-term assignment, short papers, and class presentations, students write a final research paper that examines a particular practice or legal phenomenon that help illuminate legal exchanges across neighboring and interconnected cultures.",
    "course_description": "Special Topics in Jewish History: Variety of subjects emphasizing Jewish history. Content will vary. May be repeated when the topic changes.",
    "prerequisites": null,
    "instructors": "Tamar Menashe - Primary Instructor",
    "schedule_location": "M 2:30pm-5:15pm in Callaway Center N204",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_JS_471W_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3230, Section #: 1, Type: SEM, Campus: ATL, Meets: M 2:30-5:15p, Instructor: T. Menashe, Status: Open",
    "date_accessed": "2023-10-31"
}