{
    "course_code": "MATH 495RW",
    "course_title": "Honors",
    "credit_hours": "1-8",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Varies by section",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Continuing Writing Requirement",
    "permission": "Department Consent Required",
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": null,
    "course_description": "Normally taken in student's last semester, up to a maximum of 4 credit hours.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: This section is full 5957, Section #: 17, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Nagy, Status: Closed\nClass Nbr: This section is full 5962, Section #: 23, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: P. Raman, Status: Closed\nClass Nbr: This section is full 5958, Section #: 25, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: L. Ruthotto, Status: Closed\nClass Nbr: This section is full 5952, Section #: 3, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. Borthwick, Status: Closed\nClass Nbr: 5951, Section #: 35, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. Zureick-Brown, Status: Open\nClass Nbr: 6329, Section #: 44, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Y. Xi, Status: Open\nClass Nbr: This section is full 5954, Section #: 48, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: T. Mayo, Status: Closed\nClass Nbr: This section is full 5953, Section #: 53, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Manetta, Status: Closed\nClass Nbr: This section is full 5960, Section #: 54, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Y. Wang, Status: Closed\nClass Nbr: This section is full 5961, Section #: 55, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: E. Newman, Status: Closed",
    "date_accessed": "2024-03-30"
}