{
    "course_code": "PHIL 128",
    "course_title": "Metaphysics",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 14Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "Humanities and Arts(*)",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Topic: Time and Temporality\n \nWhat is time? Augustine famously says that, as long as no one asks him about time, he knows what it is; but as soon as someone asks him, he no longer knows. Time has been a riddle for philosophy from its very inception. The enigma is all the greater because time is not simply an object which can be described by an outside observer; rather, it envelops the observer. The subject who asks about time is itself within time.\n \nIn this course, we will study the history of time as a philosophical concept, from antiquity to the present. We will begin with the Ancient Greek idea of cosmic time, as a field within which we exist as biological organisms. Then, we will see that time is progressively interiorized in modernity, becoming part of the structure of subjectivity. Finally, time is theorized in the 20th-century as the precondition for intersubjectivity.\n \nAmong the concepts for the course, we will cover Zeno¿s paradoxes of motion, Plato¿s vision of time as the moving image of eternity, Aristotle¿s definition of time as the measure of motion, Plotinus¿s and Augustine¿s views of time as the soul¿s activity, Kant¿s understanding of time as the structure of experience, and the relation between time and human existence in Nietzsche, Kierkegaard, Heidegger, Levinas, and Kristeva.",
    "course_description": "This course is an introduction to the central question of metaphysics: what is the nature of reality?",
    "prerequisites": null,
    "instructors": "Bernardo Andrade - Primary Instructor",
    "schedule_location": "MWF 11:30am-12:20pm in Bowden Hall 116",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_PHIL_128_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 1800, Section #: 1, Type: LEC, Campus: ATL, Meets: MWF 11:30a-12:20p, Instructor: B. Andrade, Status: Open",
    "date_accessed": "2023-10-31"
}