{
    "course_code": "PHIL 114",
    "course_title": "Latin American, Latinx Thought",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities and Arts with Race & Ethnicity(*)",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "This course explores key topics in Latin American and Latinx thought. A number of themes will be touched on, including identity, liberation, coloniality and decoloniality, and border feminisms. We will trace the development of the theoretical debates concerning \"life\" as a concept across Latin America. In this course we will examine theorists and texts that are wildly disparate yet share a concern over the significance of life and its development. As we move out of the 19th and into the 20th century, what will become clear is that questions regarding biology and race are intimately bound to concerns over the direction or goal of \"culture\", and that all of these concerns have a stake in the question concerning the meaning of \"life\" and its relation to the human being. Hence, evolutionary theory spills over into discourses concerned with freedom and revolution, and vice versa. The goal of the class is to illuminate the imbrication of the mechanistic/determinist perspectives, and those that are more concerned with \"spiritual\" values like creativity and freedom. The central meeting point shared by these two approaches is a radical rethinking of life itself: in a word, \"revolution\". Ending in the 21st century, we will examine some contemporary thinkers who were motivated by radical theory of various persuasions, for example Marxism, decolonial theory and Chicana feminism, and psychoanalysis.",
    "course_description": "This course explores key topics in Latin American and Latinx thought, including identity, liberation, coloniality and decoloniality, and border feminisms.",
    "prerequisites": null,
    "instructors": "Everet Smith - Primary Instructor",
    "schedule_location": "MWF 10am-10:50am in Callaway Center S103",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_PHIL_114_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 1818, Section #: 1, Type: LEC, Campus: ATL, Meets: MWF 10-10:50a, Instructor: E. Smith, Status: Open",
    "date_accessed": "2024-03-31"
}