{
    "course_code": "PHIL 385",
    "course_title": "Special Topics in Philosophy: Buddhist Philosophy",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 8 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(Same as REL 365 2)\nThis course satisfies the Religion major requirement: - Tradition-Buddhism. \nThis course is an introduction to Buddhist philosophy with an emphasis on its development in South Asia. The focus will be on the main philosophical innovations of the Indian Buddhist tradition, starting with the earliest dialogues and moving through the classical developments of the Abhidharma, Madhyamaka, and Yog'c'ra streams. Some of the topics to be covered include the Buddha's diagnosis of the human condition and its causes; suffering and freedom from suffering; personal identity in the absence of an enduring self; emptiness or the absence of inherent existence in things; critique of the body-mind distinction; the theory of two truths, conventional and ultimate, and the implications for knowledge; inferential reasoning in the absence of essential natures; the status of language and the possibility of a non-conceptual perceptual knowledge; ethical cultivation without a self; altruism as enlightened self-interest; and the theory and practice of meditation. As a discussion-based seminar, the course depends on close reading of primary texts, active participation, and regular writing. Writing assignments will include short discussion posts and journal entries. There will also be a take-home midterm and a take-home final exam.",
    "course_description": "Selected topics and problems in philosophy. Content will vary in successive offerings of this course. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Sara L McClintock - Primary Instructor",
    "schedule_location": "MW 4pm-5:15pm in Carlos Hall 212",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_PHIL_385_7_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 6186, Section #: 7, Type: LEC, Campus: ATL, Meets: MW 4-5:15p, Instructor: S. McClintock, Status: Wait List",
    "date_accessed": "2024-03-31"
}