{
    "course_code": "CL 329R",
    "course_title": "Spec Stud in Classical Culture: Constructing Claudia",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 9",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "Constructing Clavdia\nWho and what influence and determine the construction of identity? What would a historian of the future say about you if their only sources were the social media posts of your \"frenemies\"?\nMost of the history of Roman women that we encounter originates in ancient literature written by and for elite males from a society where the literacy rate was 15% or lower. Women, especially those mentioned by name, tend to be represented as either paragons of virtue or pursuers of vice. These biased stereotypes, constructed by male elites invested in perpetuating their desired societal structures and reinforced through the centuries, continue to be leveraged to justify attitudes and behaviors in the present day. What happens when we look at a wider array of evidence? What happens when we integrate textual and material evidence with a critical eye and question the over-reliance upon the literary? \nStudents will hone their critical thinking skills, especially the analytical evaluation of ancient and modern sources, by examining the varied texts and objects that reveal glimpses of women of all socio-economic levels across the Roman empire. By examining traditional historic representations of Roman women we will illuminate the broader issue of how patterns established in the past for the construction and shaping of identity and history have persisted and continued to be used to shape messages, justify behavior, and reinforce societal structures today.",
    "course_description": "Topic changes to meet current interest of students and faculty. Course may be repeated for credit as topic varies.",
    "prerequisites": null,
    "instructors": "Katrina Dickson - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 3764, Section #: 2, Type: SEM, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: K. Dickson, Status: Open",
    "date_accessed": "2024-03-30"
}