{
    "course_code": "POLS 201",
    "course_title": "Classical Political Thought",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 35 / Seats Avail: 7Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as ANCMED 202R 2)\n\n\nThis course will be taught entirely online and will meet synchronously both days.\n\n\nAristotle is the most influential philosopher of all time. Dante called him \"the master of those who know.\"  His philosophy became the core of the rationalist tradition in Islam, Judaism, and Christianity and he remains a philosophic touchstone to this day.  His political philosophy is centered around two ideas: 1) that the central driver of human nature is the desire for happiness, and 2) that human beings by nature are political animals.  This course will situate Aristotle's political philosophy within an overview of his comprehensive philosophy, including his ethics, psychology, biology, physics, and metaphysics.  We will read selections from several works, but our core texts will be the Nicomachean Ethics and the Politics.  For comic relief, we will pause twice to read plays by the great comic playwright Aristophanes and analyze his bawdy and irreverent, but philosophically sophisticated, critiques of Athenian democracy.",
    "course_description": "Beginnings of the Western political heritage as shaped by such great political thinkers as Plato, Aristotle, Thucydides, and Xenophon.",
    "prerequisites": null,
    "instructors": "Judd Owen - Primary Instructor",
    "schedule_location": "TTh 2:40pm-3:55pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 3721, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 2:40-3:55p, Instructor: J. Owen, Status: Open",
    "date_accessed": "2024-03-30"
}