{
    "course_code": "POLS 110",
    "course_title": "Introduction to International Politics",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 60 / Seats Avail: 14Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "This course will only meet synchronously on Thursdays; remaining course content will be delivered asynchronously.\n\n\nThe course will introduce you to a fundamental theoretical framework for explaining behavior in the international system. Using this framework, we will examine the nature of the international system, the causes of international conflict, and the possibilities for international cooperation. We will apply this framework to shed light on problems from interstate armed conflict, civil wars, terrorism, and nuclear weapons, to international trade relations, international lending and investment, currency disputes, the global environment, and human rights. \n \nBy the end of the course, you will be able to (a) identify and explain a set of core concepts and methods used to understand international politics; (b) describe accurately how those ideas apply to a wide variety of current and historical international problems; and (c) evaluate the validity of a variety of contending explanations of international phenomena in light of evidence. Drawing on those skills, you may also (d) formulate your own synthetic views on major international problems and possible solutions to them.",
    "course_description": "Introduction to analytical concepts, nature of the interstate system, the assumptions and ideas of diplomacy, the determinants of foreign policy.",
    "prerequisites": null,
    "instructors": "Eric Reinhardt - Primary Instructor",
    "schedule_location": "Varies by section",
    "course_resources": null,
    "sections": "Class Nbr: 3714, Section #: 1, Type: LEC, Campus: ATL, Meets: Th 9:40-10:55a, Instructor: Team, Status: Open\nClass Nbr: 3715, Section #: 2, Type: LEC, Campus: ATL, Meets: Th 1-2:15p, Instructor: Team, Status: Open",
    "date_accessed": "2024-03-30"
}