{
    "course_code": "POLS 190",
    "course_title": "Fresh Sem: Poli Sci: Conflict & Cooperation",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Freshmen Seminar - Limited to First Year Students Only) - You must have permission to enroll in-person.\n\n\nThis class will be taught entirely in-person and will meet two days per week.\n\n\nWhy do individuals sometimes cooperate, act in the group's best interests, even when doing so is contrary to their short-term self-interest? When do efforts to promote such cooperation succeed or, instead, end in spirals of retaliatory conflict or inter-group violence? We explore these questions in many social settings, e.g., 'altruistic' behavior in various animal species; the willingness of soldiers to risk their lives in battle; participation in civil rights action or violent rebellion; conflict among ethnic groups; the varying success of community development and labor movements; and more. We also examine diversity and cooperation in a democracy: why diversity might be valuable for a group, how to promote successful dialogue among diverse groups, how inequality and the information age affect the prospects for cooperation under diversity. We look at a variety of applied explanations, including the role of reciprocity and retaliation; asymmetries in power; social and political institutions; norms, ideas, identity, and culture; social psychological dynamics; and genetics and natural selection.",
    "course_description": "For first-year students only. Entry level seminar focusing on a specific topic. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Eric Reinhardt - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Math & Science Center - N306",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3718, Section #: 2, Type: SEM, Campus: ATL, Meets: MW 1-2:15p, Instructor: E. Reinhardt, Status: Wait List",
    "date_accessed": "2024-03-30"
}