{
    "course_code": "POLS 353",
    "course_title": "Civil Liberties",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 34 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "This course will be taught entirely online and will meet synchronously both days.\n\n\nThis course examines the fundamental civil rights and liberties guaranteed by the Constitution of the United States, as interpreted by the United States Supreme Court, including the First Amendment's freedom of speech, freedom of the press, freedom of association, the free exercise of religion and religious establishment; the right to bear arms; the right to privacy; equal protection and substantive due process under the Fourteenth and Fifth Amendments. During our discussions we will focus on many of the most important decisions of the Supreme Court, including Plessy v. Ferguson, Brown v. Board of Education, Roe v. Wade, District of Columbia v. Heller and Obergefell v. Hodges. Due to the time constraints inherent in a semester, we will not, however, examine rights and liberties directly associated with criminal law.",
    "course_description": "Personal liberties guaranteed by the United States Constitution, including freedom of speech, religion, assembly, petition; the right of privacy; the right against age, sex, race, or economic discrimination.",
    "prerequisites": null,
    "instructors": "Jeffrey Morrison - Primary Instructor",
    "schedule_location": "TTh 4:20pm-5:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3730, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 4:20-5:35p, Instructor: J. Morrison, Status: Wait List",
    "date_accessed": "2024-03-30"
}