{
    "course_code": "POLS 367",
    "course_title": "Urban Politics",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 40 / Seats Avail: 12Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "This course will only meet synchronously on Thursdays; remaining course content will be delivered asynchronously.\n\n\nThe course focuses on urban politics in the United States. It is about the politics in and of its cities. Such politics, referred to as local or municipal politics, involves contests among individuals and groups to acquire influence over the branches, institutions, priorities, and decisions of city governments, and sometimes county and other local governments. Studying urban politics involves seeing, observing, identifying, describing, and explaining institutional choices of city governments (e.g., city budgets and service allocations) and how political behavior (e.g., protest and voting) and representation of groups and interests at the local level influence and are affected by institutional choices of city governments. In short, urban politics is about \"who gets what, when, how,\" plus where and why, from city governments.",
    "course_description": "Introduction and overview to the politics and governance of American cities. Emphasis is on understanding the relationships among governing structures, decision-making processes, and policy outcomes.",
    "prerequisites": null,
    "instructors": "Michael Owens - Primary Instructor",
    "schedule_location": "Th 4:20pm-5:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 3732, Section #: 1, Type: LEC, Campus: ATL, Meets: Th 4:20-5:35p, Instructor: M. Owens, Status: Open",
    "date_accessed": "2024-03-30"
}