{
    "course_code": "POLS 202",
    "course_title": "Modern Political Thought",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 45 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "This course will only meet synchronously on Wednesdays; remaining course content will be delivered asynchronously.\n\n\nThis course examines the philosophic origins of modern politics and culture by looking at the works of several authors whose writings played decisive roles in the rise and development of modern political philosophy. In our study of Machiavelli's Prince, Hobbes's Leviathan, Locke's Second Treatise of Government, Rousseau's First and Second Discourse, Mill's On Liberty, and Nietzsche's Thus Spoke Zarathustra, we will consider the ways in which modern political thought broke with the past and offered a new set of political visions. We will consider the differing views of these philosophers on issues such as the aims and limits of politics, the role of morality in the harsh world of political necessity, the proper place of religion and reason in political life, and the nature and basis of justice. Throughout the course, we will reflect on the influence that the revolutionary doctrines of modern political philosophy have had on the political world in which we live.",
    "course_description": "Political thought in the early modern period, from Machiavelli through the nineteenth century.",
    "prerequisites": null,
    "instructors": "Ahmed Siddiqi - Primary Instructor",
    "schedule_location": "W 11:20am-12:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 5639, Section #: 1, Type: LEC, Campus: ATL, Meets: W 11:20a-12:35p, Instructor: A. Siddiqi, Status: Open",
    "date_accessed": "2024-03-30"
}