{
    "course_code": "POLS 385",
    "course_title": "Special Topics: Political Science: The German Political System",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 34 / Seats Avail: 24Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "This course will be taught entirely in-person and will meet both days. You must have permission to enroll in-person.\n\n\nThis course emphasizes the changing nature of Germany's contemporary political system: the Federal Republic of Germany. Historical and social background will initially be considered: 19th century unification, World War I, the Weimar Republic, rise of the Nazis, World War II, the division of Germany, and reunification. It then focuses on the Federal Republic's political institutions and its style of governance. Study of the national executive, legislature, and judiciary will be combined with explanations of why such structures were chosen and their political consequences. The class will also consider Germany's party system, electoral system, federal system, and its relationship to the European Union. Critical analytical questions will be raised as to how and why the German political system has adapted itself and changed; in the past and in response to new challenges.  Recommended prerequisite: POLS 120: Introduction to Comparative Politics, or its equivalent.",
    "course_description": "Selected topics and problems in political science. Content will vary in successive offerings of this course. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Thomas D Lancaster - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Math & Science Center - E208",
    "course_resources": null,
    "sections": "Class Nbr: 3762, Section #: 2, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: T. Lancaster, Status: Open",
    "date_accessed": "2024-03-30"
}