{
    "course_code": "POLS 394",
    "course_title": "Research Topics in Political Science: Policing & Politics",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 40 / Seats Avail: 29Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "This course will be taught entirely online and will meet synchronously on Thursdays only; remaining course content will be delivered asynchronously.\n\n\nThe course focuses on how politics, historically and now, influences the police and policing and how the police and policing influence politics today. Although it mainly focuses on the U.S.A., it includes comparative considerations and examples of police and policing abroad, especially from South America, Western Europe, and South Africa. It covers how and why attitudes (e.g., trust, racial resentment, and conservatism) and behaviors of individuals and interest groups affect political choices (e.g., budgets) by municipal, state, and federal policymakers regarding the police and policing. It also explores how and why political actions by citizens and denizens and political choices by municipal, state, and federal policymakers regarding the police and policing shape attitudes and behaviors of individuals and interest groups. Given the subject matter, dimensions of racial inequality/equality and injustice/justice are addressed throughout the course.",
    "course_description": "Research on selected topics and problems in political science. Class will fulfill the \"research\" requirement for the political science major. May be repeated for credit when the topic varies.",
    "prerequisites": "POLS 208 or POLS_OX 208 or equivalent transfer credit as prerequisite.",
    "instructors": "Michael Owens - Primary Instructor",
    "schedule_location": "Th 2:40pm-3:55pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 3739, Section #: 1, Type: LEC, Campus: ATL, Meets: Th 2:40-3:55p, Instructor: M. Owens, Status: Open",
    "date_accessed": "2024-03-30"
}