{
    "course_code": "POLS 494W",
    "course_title": "Research Topics Seminar in Political Sciences: Pol of Public Health:COVID/Com",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Continuing Writing Requirement",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "This course will be taught entirely online and will meet synchronously both days.\n\n\nThis course trains students to apply the tools of political science to public health challenges.  The course assumes that most public health interventions take place in the messy world of complex interests and institutions.  It explores specific public health issues at different stages in the policy process.  Why, for example, do U.S. policymakers ignore the heat-related occupational health problems of migrant farmworkers?  Why has Thailand done such a good job on HIV/AIDS (and COVID) while having very high rates of traffic-related injuries and deaths?  Why do only some countries provide universal healthcare?  Why is it hard to implement nutrition and water-sanitation-hygiene measures? What explains poor healthcare in rural Georgia?  Does democracy make a difference? The last third of the course addresses COVID challenges: e.g. testing, contact tracing, vaccine distribution, school opening, scientific integrity, health communication, in comparative perspective.",
    "course_description": "Research Seminar on selected topics and problems in political science. Class will fulfill the \"research\" requirement for the political science major. May be repeated for credit when the topic varies.",
    "prerequisites": "POLS 208 or POLS_OX 208 or equivalent transfer credit as prerequisite.",
    "instructors": "Richard Doner - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3767, Section #: 2, Type: LEC, Campus: ATL, Meets: TTh 1-2:15p, Instructor: R. Doner, Status: Wait List",
    "date_accessed": "2024-03-30"
}