{
    "course_code": "POLS 490R",
    "course_title": "Advanced Seminar: Electoral Politics",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 6 / Seats Avail: 4Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "This course will be taught entirely online and will meet synchronously both days.\n\n\nElections have the potential to enhance public officials' accountability and responsiveness to citizens, demands. Yet, in many countries where leaders are popularly elected, objective measures of their performance, as well as the citizens' perception about the quality of government, suggest that these benefits are not being realized. In this course we study why this is the case.  \nThe course is divided into four modules. The first explores the accountability-enhancing role of elections. The second focuses on how information available to voters shape electoral results. The third deals with common forms of electoral manipulation. The last module touches on the role of the international community in promoting democracy, the effects of these interventions, and the challenges faced by election monitors. \nThis seminar is targeted to upper level undergraduate students who are interested in pursuing graduate studies in the social sciences. POLS 208 is a prerequisite.",
    "course_description": "Open only to senior and junior majors and others by permission of instructor. Selected topics in political science.",
    "prerequisites": null,
    "instructors": "Miguel Rueda Robayo - Primary Instructor",
    "schedule_location": "MW 11:20am-12:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 3763, Section #: 2, Type: SEM, Campus: ATL, Meets: MW 11:20a-12:35p, Instructor: M. Rueda Robayo, Status: Open",
    "date_accessed": "2024-03-30"
}