{
    "course_code": "REL 100R",
    "course_title": "Introduction to Religion: Religion in the News",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 60 / Seats Avail: 7Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities and Arts(*)",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "This course satisfies the Religion major requirement:- Theme.\nYou can't understand the world today without reference to religion. Every day, religion is in the news. There are religious \"extremists\" and \"fundamentalists,\" and religious arguments about sex, death, and civil and human rights. There are arguments about religious symbols such as the Ten Commandments or cartoons of Muhammad. Presidents are sworn in with their hand on a Bible. Along with these religious traditions and institutions that are in the news, phenomena that are not usually considered religious such as Greek life, sporting events, and popular culture can also be seen through the lens of religion.\n \nThis course introduces classic topics in the study of religion - God, ritual, salvation, sacred space, gender, etc. - in the context of contemporary issues such as abortion, the Coronavirus pandemic, xenophobia, terrorism, presidential elections, and race in America. The course aims to make the conceptual resources of the study of religion available for understanding and critiquing contemporary life.",
    "course_description": "An exploration of diverse ways of being religious (for example, in thought, action, community, and experience) as they are displayed in several traditions and cultures.",
    "prerequisites": null,
    "instructors": "Ellen Gough - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in White Hall 111",
    "course_resources": null,
    "sections": "Class Nbr: 3070, Section #: 2, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: Team, Status: Open",
    "date_accessed": "2024-03-30"
}