{
    "course_code": "REL 210R",
    "course_title": "Classic Religious Texts: The Upanishads",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 10",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities and Arts(*)",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "This course satisfies the Religion major requirement:- Tradition-Hinduism.\nThis course offers an introduction to a set of enigmatic texts known as the Upanishads, ancient scriptures which form the basis of much Hindu philosophical thought. We will start by learning about the culture that produced the Upanishads, as well as how they are related to other famous Hindu scriptures (such as the Vedas, the Bhagavad Gita, and the Brahma Sutra). We will then turn to the texts themselves, familiarizing ourselves with some of their central themes (e.g., the nature of the self, the ground of being, freedom); memorable characters (e.g., the father-son duo Uddalaka Aruni and Svetaketu); insightful allegories (e.g., the self as two birds on a fruit tree); and shocking events (skulls exploding and stealing bones). Throughout the course, we will also be interested in how the Upanishads have been interpreted by a number of authors from within and outside the Sanskrit tradition, including Shankara, Ramanuja, Simone Weil, and T.S. Eliot.",
    "course_description": "This course will explore classic religious texts in depth, developing skills to interpret sacred, philosophical and ethical works. Social, cultural, and/or philosophical contexts at work will provide interpretive frameworks.",
    "prerequisites": null,
    "instructors": "Shiv Subramaniam - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in Anthropology Building 107",
    "course_resources": null,
    "sections": "Class Nbr: 3346, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: S. Subramaniam, Status: Open",
    "date_accessed": "2024-03-30"
}