{
    "course_code": "REL 209",
    "course_title": "History of Religions In America",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 40 / Seats Avail: 2Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Humanities and Arts(*)",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "This course satisfies the Religion major requirement:- Region. \nTopic: Saints and Sinners, Seekers and Skeptics: Religion in the US\nThis course will consider how religion has shaped, and been shaped by, the American experience from colonial contact with native cultures to the present.  We'll ask: What are the relationships between various American religious traditions and American society, politics, and culture?  How has religion been brought to bear on questions of economic organization, cultural production, and political discourse? And how might the analytical categories of race, class, and gender be deployed to better understand the historical trajectories of American religious traditions? Along the way, we'll consider the often-complicated relationship between a Protestant \"center\" and the reality of ever-changing religious diversity in the United States; African American religious experience; the impact of immigration; the importance of women's history; where, why, and how people of faith have articulated modern visions of social change; and the ongoing challenges of religious diversity in modern America.",
    "course_description": "An examination of American religious history and culture from the colonial period to the present.",
    "prerequisites": null,
    "instructors": "Katherine Rosenblatt - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in Math & Science Center - N306",
    "course_resources": null,
    "sections": "Class Nbr: 3075, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: K. Rosenblatt, Status: Open",
    "date_accessed": "2024-03-30"
}