{
    "course_code": "REL 190",
    "course_title": "Fresh Sem: Religion: Religion and Destruction",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First Year Seminar",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "This course satisfies the Religion major requirement:- Theme.\nThis course surveys the emerging theories of iconoclasm. We are speaking of a spectrum of behaviors ranging from total annihilation, through various kinds of damage, obscuring, hiding, humiliation, mockery, and redefinition. People attack images of Mary, the Berlin Wall, Confederate statues, nude paintings, money, signage, books, icons. \nBut what is destruction-a tragedy? Outrage? Perhaps, but also protest, performance, a creative act. What is created by destruction and damage? Destruction is not necessarily the opposite of culture but another mode of its practice. So-called \"vandalism\" is not actually mindless and random: violation is a \"culture\" and \"art form\" in itself. There is also the iconoclasm of the museum: what is destroyed by the preservation of objects? \nReligions are concerned with their own materiality, especially sacred icons. What can iconoclasm tell us about our relation to material objects and to the sacred? Images of people are especially powerful-so we can ask about the interactions of material destruction and destruction of living bodies. What is the relation of iconoclasm, murder, war, and terrorism?",
    "course_description": "Dynamics of inquiry on a focused research topic. Will include discussion, debate, oral and written presentations. Topic varies.",
    "prerequisites": null,
    "instructors": "Eric Reinders - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Ignatius Few Building_129",
    "course_resources": null,
    "sections": "Class Nbr: 3072, Section #: 2, Type: SEM, Campus: ATL, Meets: TTh 10-11:15a, Instructor: E. Reinders, Status: Wait List",
    "date_accessed": "2024-03-30"
}