{
    "course_code": "REL 270",
    "course_title": "Special Topics in Religion: Jainism:Religion ofNonviolence",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 9Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "This course satisfies the Religion major requirement: Tradition-Jainism.\nThis course introduces the beliefs and practices of a religious tradition from India whose main teaching is nonviolence to all living beings: Jainism. The course is organized historically, beginning with the earliest texts from over 2,000 years ago, and ending with an examination of present-day practices, from the promotion of veganism to debates over the legality of the Jain fast to death. Jains believe that every living being-from an insect to a god-has a soul with infinite knowledge and bliss. The goal of every Jain is to realize this infinite knowledge and bliss and escape the cycle of rebirth by destroying karma through nonviolence, meditation, and limiting possessions. This course will examine the texts, objects, and practices that relate to this path to liberation. Jainism continues to develop in conversation with Buddhism and Hinduism, so we will spend a significant amount of time examining these traditions as well. Along the way, we will make a trip to the Jain temple in Atlanta and make extensive use of the collection of Jain sculptures and paintings at the Carlos Museum.",
    "course_description": "Variety of subjects pertaining to religion. Content will vary in successive offerings. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Ellen Gough - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in New Psyc Bldg 235 (36 Eagle Ro",
    "course_resources": null,
    "sections": "Class Nbr: 3165, Section #: 2, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: E. Gough, Status: Open",
    "date_accessed": "2024-03-30"
}