{
    "course_code": "REL 354RW",
    "course_title": "Ethics: Human Goodness",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "This course satisfies the new Religion major requirement: - Theme.\nOur seminar will explore a single, though not a simple, question:  \nWhat is human goodness?  What sorts of lives are good lives?  How might goodness relate to our flourishing?  \n- Our approach will be broadly philosophical. We will read and discuss together a range of texts as we pursue our questions about goodness, ethics, and forms of life.  Some texts will be philosophical and theological, some biographical, some literary, some filmic.   \n- This is a discussion class: we are in this together.  We learn from one another as well as from our readings, so bring yourselves to the table.  Your attendance and participation are essential to the success of this course.  \nWe build these conversations together, as an activity in community.  I do not have content to \"download.\"Texts:  Selected essays will be on electronic reserve accessible through our course's Canvas site (E Reserves).  Films will be stream-able through the Canvas site as well.\nThe following texts are available through Emory Bookstore: \n- Plato, Trial and Death of Socrates, trans. Grube (Hackett ed.)\n- Douglass, Frederick.  Narrative of the Life of Frederick Douglass (Norton ed.)\n- Kidder, Mountains Beyond Mountains (Random House pub.)",
    "course_description": "Analysis of methods and/or texts pertaining to ethical decision-making for individual and social problems such as race, sex/marriage, justice, war, biomedical technology, and environmental pollution. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Pamela M Hall - Primary Instructor",
    "schedule_location": "Varies by section",
    "course_resources": null,
    "sections": "Class Nbr: 3356, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 10-11:15a, Instructor: P. Hall, Status: Wait List\nClass Nbr: 4606, Section #: 2, Type: SEM, Campus: ATL, Meets: TTh 10-11:15a, Instructor: P. Hall, Status: Wait List",
    "date_accessed": "2024-03-30"
}