{
    "course_code": "REL 370",
    "course_title": "Special Topics in Religion: Law & Religion: Theory, Method",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 5",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures",
    "permission": "Department Consent Required",
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Topic: Law and Religion: Theories, Methods, and Approaches\nThis course satisfies the Religion major requirement: - Theme. \nPermission Required Prior to Enrollment. To request permission to register, contact Prof. María M. Carrión - mcarrio@emory.edu\nLaw school schedule: Thursday 1:00 pm-4:00 pm\n\n\nInterdisciplinary scholarship is often lauded for challenging assumptions, contributing new perspectives, and leading to groundbreaking new insights that would not be possible without crossing disciplinary borders. While there are certainly benefits to interdisciplinary scholarship, such approaches also pose a unique set of challenges. The success of interdisciplinary scholarship depends on the scholar's ability to communicate to audiences who often use different nomenclature, evidence, and analytical methods. A failure to appreciate these challenges can lead to attempts at interdisciplinary scholarship that are reductive, one- sided, vague, or confused.\n\n\nIn this course, students will survey the interdisciplinary field of law and religion. The course will begin by discussing the nature of the field known as law and religion. What areas of inquiry constitute this field? What do we mean when we talk about \"law\" and \"religion\"? The course will then cover different substantive areas and methodological approaches by reading, analyzing, and critiquing examples of law and religion scholarship from leading scholars. Students will be asked to think about the choices that scholars make: What is the relationship of law and religion in this example of scholarship? What does the scholar draw on as evidence for the argument? How does the scholar construct the argument? How does the scholar think about law? How does the scholar think about religion? These and other questions will help students understand how different approaches function; what they can achieve; what they cannot achieve; and why a scholar would choose a certain approach. This course is recommended for students interested in exploring the field of law and religion, as well as for students in advance of a significant writing project in law and religion, including a journal comment, major seminar paper, or thesis.",
    "course_description": "Variety of subjects pertaining to religion. Content will vary in successive offerings. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Silas Allard - Primary Instructor",
    "schedule_location": "Th 1pm-4pm in Gambrell Hall 5F",
    "course_resources": null,
    "sections": "Class Nbr: 5930, Section #: 5, Type: LEC, Campus: ATL, Meets: Th 1-4p, Instructor: S. Allard, Status: Open",
    "date_accessed": "2024-03-30"
}