{
    "course_code": "REL 370",
    "course_title": "Special Topics in Religion: Law and Religion: Canon Law",
    "credit_hours": "2",
    "seats": "Seats: Maximum Enrollment: 2 / Seats Avail: 2",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Topic: Law and Religion: Canon Law\nThis course satisfies the Religion major requirement: - Theme.\nPermission Required Prior to Enrollment. To request permission to register, contact Prof. María M. Carrión - mcarrio@emory.edu\nLaw school schedule: Thursdays 10:30 am-12:30 pm\n\n\nThe Anglo-American common law tradition is related to a much broader tradition also known as the ius commune: that fusion of Roman and canon law (ius) which is the common (commune) foundation of European and international law. The first part of this course will introduce students to the basic concepts and historical sources of the canon law, from its humble beginnings in late antiquity, through its flowering in the middle ages, and up to the modern (pre-codification) period. The second part of the course will introduce students to the Code of Canon Law (1983) of the Latin Church by means of selected topics. These topics will include, among others: general norms (Book I); persons and their fundamental rights and obligations (Book II); teaching authority (Book III); marriage (Book IV); property (Book V); substantive penal law (Book VI, rev. 2021); procedural law (Book VII). Additional canonical topics will be explored according to the expressed interest of the students.",
    "course_description": "Variety of subjects pertaining to religion. Content will vary in successive offerings. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Brian Austin - Primary Instructor",
    "schedule_location": "Th 10:30am-12:30pm in Gambrell Hall - 5K",
    "course_resources": null,
    "sections": "Class Nbr: 5933, Section #: 7, Type: LEC, Campus: ATL, Meets: Th 10:30a-12:30p, Instructor: B. Austin, Status: Open",
    "date_accessed": "2024-03-30"
}