{
    "course_code": "REL 370",
    "course_title": "Special Topics in Religion: Law & Religion:Islamic Finance",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 2 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures",
    "permission": "Department Consent Required",
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Topic: Law and Religion: Islamic Finance\nThis course satisfies the Religion major requirement: - Theme, Tradition-Islam.\nPermission Required Prior to Enrollment. To request permission to register, contact Prof. María M. Carrión - mcarrio@emory.edu\nLaw school schedule: Tuesday & Thursday 10:45am-12:15pm\n\n\nIslamic finance is an increasingly important sector of the international finance market. No longer limited to the Middle East or Southeast Asia, there is growing interest in this market on the part of non- Muslim customers, investors, and financial institutions, and sharia-compliant financial services and products are currently offered more than 70 countries, including in the U.K. and the U.S. Yet despite its dynamic growth and future potential, the Islamic financial industry remains relatively unknown in the United States. This course is designed as an intensive basic introduction to Islamic (or sharia-compliant) finance and banking. It will explore the hows and whys behind the industry, its ethical and legal underpinnings, and how it interacts with the U.S. and other legal systems. No previous familiarity with the field is necessary and there are no course prerequisites. All readings will be in English.",
    "course_description": "Variety of subjects pertaining to religion. Content will vary in successive offerings. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Lee Ann Bambach - Primary Instructor",
    "schedule_location": "TTh 10:45am-12:15pm in Gambrell Hall 5A",
    "course_resources": null,
    "sections": "Class Nbr: 5862, Section #: 3, Type: LEC, Campus: ATL, Meets: TTh 10:45a-12:15p, Instructor: L. Bambach, Status: Open",
    "date_accessed": "2024-03-30"
}