{
    "course_code": "LACS 265W",
    "course_title": "Visitor Meets Native",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 15Waitlist Total: 0, Auto-Enroll",
    "waitlist_total": ": 0, Auto-Enroll",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall",
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2024-05-17 through 2024-06-26",
    "class_notes": "This is an online course. Emory College Online summer courses have required synchronous/live sessions every week. Students must be available to sign into and virtually attend the course online during those times (noted as the course meeting times- all times listed are local to Atlanta). Each course will also involve significant asynchronous material that you access on your own time in addition to standard amounts of readings and course assignments. Students should plan to spend 15-20 hours/week on this course. Please also be aware that faculty will begin corresponding with students during Week Zero of the course (one week before the official start date of the course), and that some interaction with the course may be required at that time. Students should begin checking the Canvas course site regularly one week prior to the official start of the term.\n\n\nTourism is a totemic marker of modern subjectivity, an arena in which the modern self finds expression in a zone of absolute choice, as it is on vacation, more than anywhere, that the citizen of the industrialized world has ultimate control of where he/she is and what he/she does. Tourism is also one of the world's biggest industries, driving economic decisions around the world and leaving a large environmental footprint. This class interrogates this \"vacant time\" to ask, in essence, what constitutes a \"good trip\"? from both an individual psychic sense as well as from an ecological and political economic perspective. Themes to be examined include ideas of authenticity, collective memory and social power using a variety of sources ranging from anthropology, history and literature to popular culture.",
    "course_description": "This course will bring together existing research to examine tourism as at one time an economic enterprise and also as a deeply significant cultural experience that has played an under-recognized part in shaping the cultural mores and lifestyles of both the island destinations and the home countries.",
    "prerequisites": null,
    "instructors": "Robert Goddard - Primary Instructor",
    "schedule_location": "MWF 9:15am-10:15am in ONLINE",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_LACS_265W_1_A24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 1212, Section #: 1, Type: LEC, Campus: ATL, Meets: MWF 9:15-10:15a, Instructor: R. Goddard, Status: Open",
    "date_accessed": "2024-03-29"
}