{
    "course_code": "ENGCW 372RW",
    "course_title": "Intermediate Playwriting",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 10",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": "Department Consent Required",
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(Same as THEA 372RW 1)\n(Permission Required Prior to Enrollment)\n(Application required. Complete course atlas information (including texts and grading) and application form will be available on the Creative Writing Program website in MID-OCTOBER: https://creativewriting.emory.edu/index.html)\n\n\nWaitlisted students do not need to attend the first class if there is a significant chance they will not enroll.\n\n\nWriting sample required: 2-5 pages in any genre, preferably dramatic writing or poetry\n\n\nWriting is a fundamentally solitary endeavor, yet theatre is an art form dependent on collaboration. As such, writing for the stage requires one to balance the isolation of script writing with the communal element of live performance. By writing within a workshop environment, we can hone our own voices and benefit from the perspective and insight of our fellow creative minds.\n \nThis class will encourage students to write in their own stylistic voice. Through study of genre conventions, popular style formulas, and historical movements, students will write pieces that give them a sense of control and understanding of their own theatrical aesthetic.\n \nThe role of the Playwriting Workshop is to encourage students to find their own voices, review each other's work in an uplifting, supportive, and rigorous artistic environment. We will also read the works of modern playwrights who exemplify the concepts and ideas of writing that we are pursuing, and study the means through which they accomplish their craft.",
    "course_description": "Every year. Intermediate level workshop in writing plays.",
    "prerequisites": null,
    "instructors": "Ryan Stevens - Primary Instructor",
    "schedule_location": "Th 2:30pm-5:30pm in Rich Building 201",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ENGCW_372RW_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 4101, Section #: 1, Type: LEC, Campus: ATL, Meets: Th 2:30-5:30p, Instructor: R. Stevens, Status: Open",
    "date_accessed": "2023-10-31"
}