{
    "course_code": "ENGCW 373R",
    "course_title": "Creative Writing: Advanced Fiction",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": "Department Consent Required",
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(Permission Required Prior to Enrollment)\n\n\nApplication required. Complete course atlas information (including texts and grading) and application form will be available on the Creative Writing Program website in MID-OCTOBER: https://creativewriting.emory.edu/index.html\n\n\nPre-requisite: ENGCW 370RW, Intermediate Fiction (with a final grade of A- or A)\nWriting sample required: 5-10 pages of fiction (double-spaced) is required if English is not your first language\n\n\nStudents are strongly encouraged to attend the first class. Please email the instructor if an absence is unavoidable.\n\n\nLinked: The Short Story Cycle\nThis is an advanced, intensive workshop in the writing and reading/critiquing of linked short fiction. Students will complete a polished \"cycle\" of 3-4 interconnected short stories (approximately 25-40 pages in total), organized around a unifying element (sharing a narrator, cast of characters, era, theme, geography, etc.). In addition to ample writing and revising (based on feedback from the workshop process), students will read and respond to weekly student and published work; prepare a detailed, in-depth presentation of a book of linked short stories; and contribute significantly to and sometimes lead workshop discussions. Frequent, meaningful class participation will be expected in this course, which is designed for students with a solid working knowledge of fiction and familiarity with the elements of the craft, and who have participated in multiple writing workshops, (or the equivalent, including fiction written on your own, or in other academic settings). Students should come to the first class meeting with a rough idea for a cycle of stories, and be prepared to submit their first story by the third week of class.",
    "course_description": "Spring semester. Admittance by assessment of readiness for advanced work by intermediate level instructor in genre. Intensive workshop in the writing of fiction for advanced students. May be repeated for a maximum of eight hours credit.",
    "prerequisites": null,
    "instructors": "Gabriel Houck - Primary Instructor",
    "schedule_location": "W 2:30pm-5:30pm in Callaway Center C201",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ENGCW_373R_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: This section is full 4094, Section #: 1, Type: SEM, Campus: ATL, Meets: W 2:30-5:30p, Instructor: G. Houck, Status: Closed",
    "date_accessed": "2024-03-30"
}