{
    "course_code": "ENGCW 371RW",
    "course_title": "Creative Writing: Intermediate Poetry",
    "credit_hours": "4",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": "Department Consent Required",
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(Permission Required Prior to Enrollment)\n\n\nApplication required. Complete course atlas information (including texts and grading) and application form will be available on the Creative Writing Program website in MID-OCTOBER: https://creativewriting.emory.edu/index.html\n\n\nBoth accepted and waitlisted students are required to attend the first class.\n\n\nWriting sample required: 3-4 poems on separate pages\n\n\nThis is an intermediate, intensive workshop in which you will read, discuss, create, revise, and otherwise experience an abundance of poetry. We will seek, in our meetings, to make connections between the language and ideas of poetry and those of the worlds we inhabit. Together we will develop and expand a shared vocabulary we will use to communicate how poems can be made, read, understood, furthered, and enjoyed. You will read five full-length poetry collections, as well as an abundance of other texts (posted to Canvas) including poems, essays, and other materials in order to familiarize yourself with the breadth of possibilities and traditions from which you might draw. Highly engaged, curious, respectful participation in discussion of classmates' work, assigned texts, and other conversations is required. In varying forms over the course of the semester you will receive a combination of feedback from both myself and your peers, which you will use as you revise your poems for your portfolio.",
    "course_description": "Every semester. Intermediate level workshop in writing poetry. ENG 270, 271, or 272 required as prerequisite. May be repeated for a maximum of eight hours credit.",
    "prerequisites": null,
    "instructors": "Heather Christle - Primary Instructor",
    "schedule_location": "Varies by section",
    "course_resources": null,
    "sections": "Class Nbr: 4086, Section #: 1, Type: SEM, Campus: ATL, Meets: T 2:30-5:30p, Instructor: H. Christle, Status: Open\nClass Nbr: 4087, Section #: 2, Type: SEM, Campus: ATL, Meets: Th 8-11a, Instructor: H. Christle, Status: Open",
    "date_accessed": "2024-03-30"
}