{
    "course_code": "ENGCW 389W",
    "course_title": "Creative Writing: Spec. Topics: Theatre of the Internet",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 4",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": "Department Consent Required",
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(Same as THEA 389W 1)\n(Permission Required Prior to Enrollment)\n(Application required. Complete course atlas information (including texts and grading) and application )form will be available on the Creative Writing Program website in MID-OCTOBER: https://creativewriting.emory.edu/index.html)\n\n\nNo pre-requisite or writing sample required. Spring 2024 application required.\n\n\nWaitlisted students do not need to attend the first class if there is a significant chance they will not enroll.\n\n\nAs the internet continues to evolve and change at a rapid pace, it changes the rest of the world with it. But how has theatre charted these changes? How does live performance respond to the instant, infinite, strangeness of the internet? This course will focus on perspectives of social change regarding the internet and modern technology, from social media to web-based surveillance, and the unique historical, social, and cultural factors that shape and are shaped by the ever-shifting digital landscape. Students will study recent texts dealing with these themes, and have the chance to create their own internet-inspired projects.",
    "course_description": "Credit, variable; maybe be repeated for a maximum of eight hours credit when topic varies. Specific topics to be announced. Typical subjects include the novel, first person narrative, formalist poetry, and nonrealistic forms. ENGCW 270, 271, or 272 required as prerequisite.",
    "prerequisites": null,
    "instructors": "Ryan Stevens - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Rich Building 201",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ENGCW_389W_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 4107, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: R. Stevens, Status: Open",
    "date_accessed": "2024-03-30"
}