{
    "course_code": "ENGCW 389",
    "course_title": "Creative Writing Special Topics: Journalism in the Movies",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 5",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": "Department Consent Required",
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(Same as FILM 385 1)\n(Permission Required Prior to Enrollment)\n(Application required. Complete course atlas information (including texts and grading) and application form will be available on the Creative Writing Program website in MID-OCTOBER: https://creativewriting.emory.edu/index.html)\n\n\nBoth accepted and waitlisted students are required to attend the first class.\n\n\nPre-requisite: none; this class is not open to first-year students\nWriting sample required: 2 non-scientific papers that exhibit deep research (10-20 pages total)\n\n\nIf Journalism has historically been considered a pure and ethically-driven form of non-fiction; if, pardon the cliché, it is the first rough draft of history; if its principle motivator in this nation's history has been the pursuit of truth, justice and the American way (you did know Superman/Clark Kent was a newspaper reporter, right?); and if it is the most zealous guardian of not just any amendment to the U.S. Constitution but the First Amendment, then why is the profession of journalism historically misrepresented as crude and corrupt when Hollywood tries to tell its story? \nOr is the profession's purity just an old former newspaperman's misguided fantasy that confuses vice and virtue in a vocation that consumed him and his conscience for more than 35 years? Newsrooms have long been filled with quiet creative geniuses and loudmouth miscreants, the brilliant and the boorish, the talented and the tawdry, and yet there are few if any professions as tethered to, and as cognizant of, a code of ethics. What does that get you? Good fodder for screenwriters and filmmakers of feature films and documentaries at home and abroad. We'll dive into this history and have some lively assignments and discussions.",
    "course_description": "Credit, variable; maybe be repeated for a maximum of eight hours credit when topic varies. Specific topics to be announced. Typical subjects include the novel, first person narrative, formalist poetry, and nonrealistic forms. ENGCW 270, 271, or 272 required as prerequisite.",
    "prerequisites": null,
    "instructors": "Hank Klibanoff - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Woodruff Library 215",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ENGCW_389_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 4099, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: H. Klibanoff, Status: Open",
    "date_accessed": "2024-03-30"
}