{
    "course_code": "ART_OX 385R",
    "course_title": "Special Topic in Art History: Art, Ritual, Religion in ANE",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 28 / Seats Avail: 21Waitlist Total: 0 of 6",
    "waitlist_total": ": 0 of 6",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Irregularly",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "This course presents an in-depth analysis of ritual art and architecture in the ancient Near East from prehistory to the Second Temple, Byzantine and Islamic periods. It will deal with the most up-to-date theories and approaches to ritual and religion, covering key topics and debates relevant to art history and archaeology. It will also concentration on the role ritual objects and buildings played in the history of belief. Theories such as the sacred vs. profane, object biographies, ritual economy, ritual-to-power and contextual analyses of ritual assemblages will be presented. Regions/cultures we will cover include those of ancient Mesopotamia, ancient Egypt, Hatti, Aram-Damascus, Phoenicia, Israel and Judah. The artistic outputs of the major monotheistic traditions, Judaism, Christianity and Islam will also be discussed. The ultimate aim of this course is to provide social, economic, geographic and political contexts for the various religious traditions of the ancient Near East and to think critically about their artistic expressions, especially in a contextual light.",
    "course_description": "This course will offer opportunities for our students to study specialized topics within Art History. The course may be repeated for credit when topics vary.",
    "prerequisites": null,
    "instructors": "Erin Hall - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in Pierce Hall 104",
    "course_resources": null,
    "sections": "Class Nbr: 4491, Section #: 1, Type: LEC, Campus: OXF, Meets: MW 2:30-3:45p, Instructor: E. Hall, Status: Open",
    "date_accessed": "2024-03-30"
}