{
    "course_code": "BIOL 360L",
    "course_title": "Neurobiology Data Lab",
    "credit_hours": "2",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 5Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "Science, Nature and Technology with Lab",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "(Same as NBB 301L 1)\n(Topic: Neural Data Simulation & Analysis Lab)\n(Through this course, you will learn basic computational and programming skills and apply them to the simulation and analysis of neural data. Course instructors will provide introductory lessons on basic coding in Python, which will be used throughout the course through collaborative, group-based lab tutorials. The focus of this course will be to use these in-lab tutorials to understand how neuroscience data is structured, analyzed, simulated, and interpreted. The course will be divided into 2 portions: (1) coding, running, and interpreting simulations of neural activity, and (2) understanding the analysis of neural data. The course consists of lectures, group lab tutorials, and individual homework assignments for each module. This course originates in the Biology Department, and it will count as an elective and upper-level laboratory credit for the Biology major. (This course does NOT COUNT as elective credit for the NBB major; the catalog description is incorrect.) Prerequisites: Biology 142/142L and Chemistry 202; pre- or co-requisite: Biology 360/NBB 301).",
    "course_description": "This course will explore topics in cellular and small network neuroscience by performing virtual electrophysiology experiments on the computer. The content matches the material covered in Biology 360/NBB 301 and will help students understand neurons and neuronal networks in greater depth.",
    "prerequisites": "[(BIOL 142 and BIOl 142L) or BIOL_OX142]  and (BIOL 360 or NBB 301) or equivalent transfer credit as a prerequisite.",
    "instructors": "Samuel J Sober - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in 1462 Clifton Rd 109",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_BIOL_360L_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 1698, Section #: 1, Type: LAB, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: S. Sober, Status: Open",
    "date_accessed": "2024-03-28"
}