{
    "course_code": "ENVS 375",
    "course_title": "Tropical Marine Ecosystems",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 2",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2024-05-14 through 2024-05-31",
    "class_notes": "(Same as BIOL 375 1)\nThe first week of the class will be devoted to lectures and discussions, and will be held remotely (9:00am-12:30pm from 5/14-5/22, excluding the weekend). On 5/23 we will meet up in Miami to travel to two different marine stations in the Florida Keys between 5/23-5/31 for an immersive field component. Several of these field days will involve time in the water, so students who enroll need to be able to swim, or need to talk with Professor Keogh ASAP about how to participate. \nStudents can either arrange their own travel to Miami Airport on 5/23 (arriving no later than 6pm) or ride from Emory in the ENVS van. Students will be dropped off at Miami Airport on 5/31 (no earlier than 3pm) or can choose to ride back to Atlanta in the van.  \nUpon arrival in Miami, all travel, housing, food, and activities are covered by the $100 program fee. Students with financial aid are eligible for Maymester financial aid, and should contact the Financial Aid office for more details. Because of the reservations needed at marine labs, students will need to commit to enrollment and pay the $300 program fee deposit no later than March 10 ($200 of this program fee will be applied toward tuition).\nPlease feel free to direct questions about the course to the faculty instructor: ckeogh@emory.edu",
    "course_description": "This course will explore coastal and near-shore tropical marine ecosystems including mangroves and coral reefs. Readings will review key concepts of marine ecology with a focus on local ecosystems. Field excursions to local sites will provide opportunities to learn from researchers and managers.",
    "prerequisites": "ENVS 131 or ENVS_OX 131 or BIOL 141 or BIOL_OX 141 or BIOL 142 or BIOL_OX 142 or equivalent transfer credit as prerequisite.",
    "instructors": "Carolyn Keogh - Primary Instructor",
    "schedule_location": "MTWThF 9am-12:30pm in ONLINE",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ENVS_375_1_A24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 1207, Section #: 1, Type: LEC, Campus: ATL, Meets: MTWThF 9a-12:30p, Instructor: C. Keogh, Status: Open",
    "date_accessed": "2024-03-29"
}