{
    "course_code": "CS 598R",
    "course_title": "Rotation Project",
    "credit_hours": "3",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Varies by section",
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": null,
    "course_description": "Computer Science and Informatics PhD students are required to complete two rotation projects prior to their qualifying exams and dissertation research. Projects often involve interdisciplinary work, and can be co-supervised by a Math/CS faculty and an external faculty member or researcher (e.g., Schools of Medicine and Public Health, the CDC). Students are required to submit a project proposal and a final report.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 6677, Section #: 1, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: W. Jin, Status: Open\nClass Nbr: 6926, Section #: 10, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: L. Zhao, Status: Open\nClass Nbr: 6943, Section #: 11, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: X. Yang, Status: Open\nClass Nbr: 6956, Section #: 13, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Choi, Status: Open\nClass Nbr: 6958, Section #: 14, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: E. Gleichgerrcht, Status: Open\nClass Nbr: 6981, Section #: 15, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: T. Pan, Status: Open\nClass Nbr: 6983, Section #: 17, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Ho, Status: Open\nClass Nbr: 6994, Section #: 19, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. Fossati, Status: Open\nClass Nbr: 6745, Section #: 3, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: C. Yang, Status: Open\nClass Nbr: 6793, Section #: 4, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Bhasin, Status: Open\nClass Nbr: 6879, Section #: 5, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: K. Williams, Status: Open\nClass Nbr: 6880, Section #: 6, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: H. Kwon, Status: Open\nClass Nbr: 6881, Section #: 7, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Zufle, Status: Open\nClass Nbr: 6888, Section #: 8, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Sarker, Status: Open",
    "date_accessed": "2024-03-30"
}