{
    "course_code": "HLTH 226",
    "course_title": "Moving Often & Eating Well",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 30 / Seats Avail: 21Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Irregularly",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-05-12 through 2023-06-21",
    "class_notes": "At the individual, community, national and global level, we will examine the evidentiary support for sustaining regular physical activity and healthy eating patterns across all ages. We will study the relationship to risk, prevention, and recurrence of non-communicable diseases and negative health outcomes (examples will include but are not limited to; cancer, cardiovascular disease, diabetes, sleep, depression, and anxiety). We will also consider the potential negative health impact of physical inactivity, prolonged sitting, and unhealthy eating patterns. Students who enroll in this course should possess a strong curiosity in understanding these behaviors within a transdisciplinary framework and beyond the established, customary proposed benefits. Topics of investigation will be presented through an interdisciplinary perspective utilizing lectures and group discussions, individual and group projects, and community engagement. No textbook is required for this course.",
    "course_description": "Utilizing a transdisciplinary, lifestyle medicine perspective this course will examine the evidentiary support for promoting consistent physical activity and healthy eating patterns and the potential dose-response relationship to the risk, prevention, and recurrence of non-communicable diseases.",
    "prerequisites": null,
    "instructors": "Jill Welkley - Primary Instructor",
    "schedule_location": "TTh 1:15pm-2:45pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 1349, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 1:15-2:45p, Instructor: J. Welkley, Status: Open",
    "date_accessed": "2024-03-30"
}