{
    "course_code": "HLTH 325",
    "course_title": "Double Burden of Malnutrition",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 19 / Seats Avail: 15Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "Malnutrition is \"poor nutrition\" due either to excesses or deficiencies. Historically, obesity was a problem exclusive to high-income countries and undernutrition was a problem exclusive to low- and middle-income countries. With the growing global obesity epidemic, diet-related non-communicable diseases are increasingly important causes of illness and death in low-and middle-income countries. These countries have a health infrastructure developed to address undernutrition, which remains a public health problem, while simultaneously having to contend with the growing challenge of over nutrition. In this course, we will explore different measures, causes, and consequences of undernutrition and over nutrition, and interventions to prevent them. Building on this base, we will critique interventions that improve one type of malnutrition while inadvertently contributing to another kind of malnutrition. And, we will examine options for reducing both types of malnutrition at the same time. There are two main goals in this course:  to provide students with the skills and practice in (1) identifying if either or both types of malnutrition exist in individuals, households or populations and (2) developing interventions that simultaneously reduce both forms of malnutrition.",
    "course_description": "We will cover the history, trends, and prevalence of obesity and undernutrition in high-, middle- and low-income countries. We will critique interventions designed to improve each type of malnutrition and will examine options for reducing both simultaneously.",
    "prerequisites": null,
    "instructors": "Helena Pachon - Primary Instructor",
    "schedule_location": "TTh 8:30am-9:45am in Emerson Chemistry Bldg. E363",
    "course_resources": null,
    "sections": "Class Nbr: 4029, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 8:30-9:45a, Instructor: Pachon/Brown, Status: Open",
    "date_accessed": "2024-03-30"
}