{
    "course_code": "HLTH 409",
    "course_title": "Co-design for Health Tech.",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "Same as SOC 489\n\n\nThis interdisciplinary course will provide an overview of the key issues involved in the introduction of sustainable healthcare technology in resource-constrained settings. The course combines lectures on critical concepts in affordable health care technology development and implementation, including needs evaluation, supply chain infrastructure and usability design, financial sustainability, and the ethics of low-cost healthcare provision, with practical learning.  Through close faculty mentorship, small groups of students will work in cross-disciplinary teams to create a solution to an identifed real-world health problem, such as delivering clean water or perinatal monitoring.  Students will develop low-cost mobile health (mHealth) innovations in recognition that such technologies are increasingly relied upon as a rapid route to implementing and deploying healthcare solutions.  Organizations based within relevant resouce-constrained settings will be identified who can provide feedback and detailed information important to the solutions; wherever possible, pilot implementation of student-developed apps will be facilitated with local partners at the conclusion of the course",
    "course_description": "This interdisciplinary course provides an overview of the key issues involved in the introduction of low-cost, sustainable healthcare technology in resource-constrained settings. Working with partner organizations, student teams develop low-cost solutions to a real-world health problem.",
    "prerequisites": null,
    "instructors": "Rachel Hall-Clifford - Primary Instructor",
    "schedule_location": "W 2:30pm-5:15pm in New Psyc Bldg 220 (36 Eagle Ro",
    "course_resources": null,
    "sections": "Class Nbr: 3539, Section #: 1, Type: LEC, Campus: ATL, Meets: W 2:30-5:15p, Instructor: Team, Status: Open",
    "date_accessed": "2024-03-30"
}