{
    "course_code": "INFO 521",
    "course_title": "Databases Using SQL",
    "credit_hours": "2",
    "seats": "Seats: Maximum Enrollment: 40 / Seats Avail: 4",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-01-10 through 2022-04-25",
    "class_notes": null,
    "course_description": "Prerequisites: BIOS 500 or permission of instructor. In this course, you'll learn about the basic structure of relational databases and how to read and write simple and complex SQL statements and advanced data manipulation techniques. By the end of this course, you'll have a solid working knowledge of structured query language. You'll feel confident in your ability to write SQL queries to create tables; retrieve data from single or multiple tables; delete, insert, and update data in a database; and gather significant statistics from data stored in a database. This course will teach key concepts of Structured Query Language (SQL), and gain a solid working knowledge of this powerful and universal database programming language. This course provides a comprehensive introduction to the language of relational databases: Structured Query Language (SQL). Topics covered include: Entity-Relationship modeling, the Relational Model, the SQL language: data retrieval statements, data manipulation and data definition statements. Homework will be done using databases running in MySQL which students install on their machines and proc SQL in SAS. Students develop a real-world database project using MySQL during the course.",
    "prerequisites": null,
    "instructors": "Rameshbabu Manyam - Primary Instructor",
    "schedule_location": "T 3pm-4:50pm in Claudia Nance Rollins 1055",
    "course_resources": null,
    "sections": "Class Nbr: 3248, Section #: 1, Type: LEC, Campus: ATL, Meets: T 3-4:50p, Instructor: Manyam/Wang, Status: Open",
    "date_accessed": "2024-03-30"
}