{
    "course_code": "ISOM 553",
    "course_title": "Supply Chain Management",
    "credit_hours": "3",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": null,
    "course_description": "In some industries, supplying goods to customers is primarily controlled within an organization, and a classic example of this structure was the Ford plant at Highland Park. Today advances in communication and transportation have led to complex supply chains that span organizations and continents. This course will combine cases and readings to allow students to understand the operations and economics of supply chains, and how companies use supply chain management in creating a competitive advantage. This will require the development of some analytic tools for determining operating policies that effectively manage the numerous trade-offs in supply chains. We will also be careful, though, to put these decisions in the context of the overall strategy of the firm. Supply chains are a natural place to examine global operations, where links of the supply chain are located around the world in an attempt to successfully compete. Students with an interest in careers in consulting or in  operations functions are the primary target for this course. But supply chain organizations are often closely tied to marketing functions, and supply chains have on the financial structure of the firm.",
    "prerequisites": "Varies by section",
    "instructors": "Nikolay Osadchiy - Primary Instructor",
    "schedule_location": "Varies by section",
    "course_resources": null,
    "sections": "Class Nbr: 4833, Section #: 2157, Type: LEC, Campus: ATL, Meets: W 6:30-9:30p, Instructor: N. Osadchiy, Status: Open\nClass Nbr: 4834, Section #: 3201, Type: LEC, Campus: ATL, Meets: MW 4-5:15p, Instructor: N. Osadchiy, Status: Open\nClass Nbr: 4835, Section #: 3257, Type: LEC, Campus: ATL, Meets: W 6:30-9:30p, Instructor: N. Osadchiy, Status: Open",
    "date_accessed": "2024-03-30"
}