{
    "course_code": "IDS 385",
    "course_title": "Special Topics: Qualitative Methods",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 19 / Seats Avail: 19Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "Interviews and participant observation are widely used across the social sciences and humanities.  Interdisciplinary research often combines these methods with each other and with archival or literary methodologies.  An interdisciplinary researcher is thus faced with several questions at the beginning of their project: How do I get enough experience with these methods to know whether they are useful?  Why should I use (or not use) a particular method?  And how do the different methods' results fit together?   This course is aimed at helping students who are embarking on independent research projects answer these questions.  Students will conduct interviews, engage in participant observation, and they will analyze the results of these engagements.  The reading assignments and class discussion will consider the ethics of research, the historical origins of the methods, and methodological literature debating what such methods do and do not tell us.",
    "course_description": "Highly focused courses, drawing on multiple disciplines of the humanities and social sciences; may be repeated for credit when topics vary.",
    "prerequisites": null,
    "instructors": "Mark Risjord - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Callaway Center S420",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_IDS_385_3_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 4089, Section #: 3, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: M. Risjord, Status: Open",
    "date_accessed": "2024-03-29"
}