{
    "course_code": "IDS 385",
    "course_title": "Special Topics: Muslim Women's Storytelling",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 19 / Seats Avail: 19Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "Course Description\nThis class critically examines how Muslim women negotiate their experience, identity, and narrative in different genres and styles. Students will read Muslim women's narratives through scholarship, fiction, autobiography, memoir, music, television, and film. Additionally, students will learn relevant theoretical approaches from the field of religious studies and examine materials through the lenses of feminist literary theory, Orientalism, and gendered islamophobia. For this class, storytelling is both an object of analysis and a method for learning and presenting research. This class will include engagement and storytelling activities with Atlanta-based Muslim women from various walks of life and professional sectors. Students will learn to identify and analyze some of  the diverse socio-cultural contexts that shape how Muslim women see and express themselves in public discourse.",
    "course_description": "Highly focused courses, drawing on multiple disciplines of the humanities and social sciences; may be repeated for credit when topics vary.",
    "prerequisites": null,
    "instructors": "Rose Deighton - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Callaway Center S420",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_IDS_385_4_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 4090, Section #: 4, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: R. Deighton, Status: Open",
    "date_accessed": "2024-03-29"
}