{
    "course_code": "IDS 216W",
    "course_title": "Visual Culture",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 16Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Humanities and Arts with Cont.Communication(*)",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "We live in a culture that is saturated by visual images. Thus, it is vital to understand what forces shape visual culture and how it shapes our thinking about myriad topics such as politics, race, class, and gender. In this class students will learn the importance and power of the visual as we explore an analyze how the visual is produced, circulated, and consumed. We will begin by understanding the major theories behind visual culture and then learn how to apply these theories as we analyze a variety of visual materials including art, architecture, photography, comics, digital media, advertising, and television. Throughout, we will consider how issues of authority, power, and positionality shape the creation and interpretation of visual images. Students will become adept at \"reading\" visual images in the same way they read other texts, and the discussion-based course will give students ample opportunity to hone this skill.",
    "course_description": "History of the use of visual images in Western culture. Study of tools necessary to read images, including still and moving images, performance, and display.",
    "prerequisites": null,
    "instructors": "Julia Tulke - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in Callaway Center S420",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_IDS_216W_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 4086, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: J. Tulke, Status: Open",
    "date_accessed": "2024-03-29"
}