{
    "course_code": "IDS 385",
    "course_title": "Special Topics: Fundamentals Moral Leadership",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 19 / Seats Avail: 19",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "What is Moral Leadership and how can a person become a moral leader? Is morality a goal for leaders? Is it a measure of their success? Why are these questions important today - both for social leaders and in the workplace?\nThis course will provide students with an introduction to moral leadership, which I define as the ability of an individual to influence and guide others through ethical means and for ethical goals, but we will spend the course discussing what this definition means and how it applies to today's world.\nThe course will begin with an overview of moral leadership, examining both its theoretical foundations and concrete examples. It will also reflect on what constitutes a 'bad leader,' i.e., one that is either ineffective or immoral or both. Following this overview, students will delve into topics such as (1) learning for success, (2) living with meaning and purpose, (3) communicating one's goals and values effectively, and (4) leading teams with intention.\n \nA fundamental goal of the course is for students to identify their existing leadership abilities, build upon their leadership potential, and learn to apply skills for self-development throughout their lives.",
    "course_description": "Highly focused courses, drawing on multiple disciplines of the humanities and social sciences; may be repeated for credit when topics vary.",
    "prerequisites": null,
    "instructors": "Ira Bedzow - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in Anthropology Building 105",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_IDS_385_8_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 4491, Section #: 8, Type: LEC, Campus: ATL, Meets: MW 10-11:15a, Instructor: I. Bedzow, Status: Open",
    "date_accessed": "2024-03-29"
}