{
    "course_code": "LACS 385",
    "course_title": "Special Topics in Latin American and Caribbean Studies: Reimagining the Caribbean",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Same as WGS 385 1)\n(Complete Topic - Reimagining the Caribbean: Gender, Race, and Nation)\n(The Caribbean constitutes a unique point of entry to study the intersecting lenses of gender, race, sexuality, and nation in the Americas. The Caribbean often lives in the imagination of the Global North as a site of escape, fantasy, and pleasure, yet it was one of the earliest laboratories of western modernity, and one of the earliest testing grounds for US empire. As such, the Caribbean region constitutes an ideal site through which to \nexplore the emergence of racialized forms of gender subordination, systematic extractions of labor, the rise of postcolonial national cultures, and the growth of a particularly seductive brand of neoliberalism. Over the course of the semester, students will explore questions such as the following: How do slavery, indenture, colonialism, and neocolonialism shape the formation and articulation of gendered and sexual identities? How do race, gender, class, and sexuality converge in the production of national citizenship? How have histories of colonial dispossession and labor extraction shaped the moral economies and emergent socialities of the tourist industry? How does the Caribbean allow unique insight to the logic and organization of empire? Through a broad exploration of the social, cultural, and political landscape of the Caribbean, students will explore the answers to these and other questions.)",
    "course_description": "Special Topics in Latin American and Caribbean Studies. Topics vary.",
    "prerequisites": null,
    "instructors": "Aisha Finch - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Candler Library 123",
    "course_resources": null,
    "sections": "Class Nbr: 4110, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: A. Finch, Status: Open",
    "date_accessed": "2024-03-30"
}