{
    "course_code": "LACS 421W",
    "course_title": "Mexican National Cinema",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 3 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Continuing Communication(*)",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Same as SPAN 421W 1)\nThis course explores how cinema in Mexico, from its arrival at the end of the 19th century to contemporary production, has commented on and participated in the construction of national identity. We will analyze key works from the history of Mexican cinema as well as non-canonical films in order to explore how they relate to the national imaginary while also negotiating transnational and global influences. Because cinema is an 'industrial' art form, we will examine the impact of social, historical and political conditions as well as the impact of global economic structures on Mexican cinema throughout the 19th, 20thand 21stcenturies. Students will acquire knowledge of the periods of Mexican cinema history and a familiarity with critical approaches to the subject matter. Students will also develop the capacity to speak and write about film analysis in both narrative and technical terms in Spanish. In this writing course, students will produce various written exercises in Spanish including critical reflections on scholarly sources, short technical analyses and 2 research papers. PREREQUISITES: At least one Foundational Course (SPAN 300-318W).",
    "course_description": "This course explores how cinema has commented on and participated in constructing Mexican national identity. Students will acquire a competence in Mexican film history, the ability to speak and write about film analysis in Spanish, and familiarity with critical approaches to Mexican cinema.",
    "prerequisites": null,
    "instructors": "Laura Torres-Rodriguez - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in North Decatur Building 111",
    "course_resources": null,
    "sections": "Class Nbr: 4885, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 1-2:15p, Instructor: L. Torres-Rodriguez, Status: Wait List",
    "date_accessed": "2024-03-30"
}