{
    "course_code": "LACS 385",
    "course_title": "Special Topics in Latin American and Caribbean Studies: Racism in the Asian Diaspora",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 2 / Seats Avail: 2",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Same as PORT 385 1)\n* This course will be taught in English*\nTitle: Overcoming Racism in the Asian Diaspora: Old Precepts, New Paths. The Anti-racist struggle in Brazil and in the United States.\nIn this course I will deal specifically with the case of intolerance to the Japanese Diaspora in Brazil, but with the Japanese American Diaspora as a counterpoint. I argue that, according to the results of my research (over a decade) on the social representation of Japanese immigrants and their descendants in Brazil, the rapid economic rise of many Nikkei in the post-war period and, consequently, the elevation of their social condition did not bring about profound changes in the mentality of society, it only replaced negative stereotypes with \"positive\" ones, which also proved fragile through political and health crises.\n\n\nI also intend to discuss with students new possibilities of communication in the anti-racist struggle in Brazil and in the United States, since solid and consistent arguments do not seem to be tools, by themselves, sufficient and effective in polarized situations. My approach involves students in research projects that engage them with pressing social issues and greatly enhance classroom learning. I believe that when students build reciprocal relationships with wider communities in the context of shared research, their preconceptions of minority population change, motivating them to conduct further research, which they come to understand as a vehicle for social change.\nThus, at the end of the course, I intend to involve Emory students in the elaboration of a social project with the local Asian American community, in order to know the real demands of this ethnic group that lives in Atlanta and provide a closer relationship between knowledge and social practice.\nContact sharlene.arruda.mendes@emory.edu for permission to enroll.",
    "course_description": "Special Topics in Latin American and Caribbean Studies. Topics vary.",
    "prerequisites": null,
    "instructors": "Monica Okamoto - Primary Instructor",
    "schedule_location": "W 4pm-6:45pm in MODERN LANGUAGE_330",
    "course_resources": null,
    "sections": "Class Nbr: 5711, Section #: 2, Type: LEC, Campus: ATL, Meets: W 4-6:45p, Instructor: M. Okamoto, Status: Open",
    "date_accessed": "2024-03-30"
}