{
    "course_code": "LACS 263W",
    "course_title": "Plantation to Postcolonial",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Same as HIST 263W 1)\nCONTENT: \"Plantation America\" , stretching from the American South, through the Caribbean to northern Brazil, comprises a geographical area that, as its name suggests, was dominated by the economic system of plantation monoculture. This course will attempt two inter-related tasks: it will firstly survey the unity and variety of the plantation as a form of socio-economic organization; secondly it will explicate the unity and variety of the political and cultural forms that have evolved alongside the plantation. The course will be interdisciplinary in nature, using texts from history, literature and anthropology. TEXTS: all texts for the class are available on the online reserve system of Emory Library. EVALUATION: Student evaluation will be based on a number of short (7-page) papers and on a final group presentation, with most of the grading weight (80%) falling on the papers.",
    "course_description": "\"Plantation America\", stretching from the American South, through the Caribbean to northern Brazil, comprises a geographical area that, as its name suggests, was dominated by the economic system of plantation monoculture. This course will attempt two inter-related tasks: it will firstly survey the unity and variety of the plantation as a form of socio-economic organization; secondly it will explicate the unity and variety of the political and cultural forms that have evolved alongside the plantation. The course will be interdisciplinary in nature, using texts from history, literature and anthropology.",
    "prerequisites": null,
    "instructors": "Robert Goddard - Primary Instructor",
    "schedule_location": "TTh 8:30am-9:45am in Candler Library 114",
    "course_resources": null,
    "sections": "Class Nbr: 3456, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 8:30-9:45a, Instructor: R. Goddard, Status: Open",
    "date_accessed": "2024-03-30"
}