{
    "course_code": "ANT 334",
    "course_title": "Evolutionary Medicine",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 60 / Seats Avail: 36Waitlist Total: 0, Auto-Enroll",
    "waitlist_total": ": 0, Auto-Enroll",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": "Science, Nature, Technology",
    "permission": null,
    "dates": "2024-07-01 through 2024-08-07",
    "class_notes": "Evolutionary medicine is founded on the idea that many current challenges to human health can be accounted for by inconsistencies or discordances between contemporary environments and those under which humans evolved. Unfortunately, much of modern medical practice either ignores or misunderstands the evolution of physical and cultural responses to stress that were faced by our ancestors. This class will explore these topics proposing ways that evolutionary biologists may help to reframe questions about diseases and disorders within long-term, evolutionary contexts. New advances in treatment will also be discussed based on insights provided by a Darwinian approach to health and disease.\nThis class will explore various fundamental concepts in Evolution (including natural selection, neutral processes, gene flow, adaptation, and an introduction to population genetics) through the lens of medicine. Topics include COVID-19, HIV, cancer, diabetes, aging, and maladaptation to changing environments.\n\n\nThis is an online course. Emory College Online summer courses have required synchronous/live sessions every week. Students must be available to sign into and virtually attend the course online during those times (noted as the course meeting times- all times listed are local to Atlanta). Each course will also involve significant asynchronous material that you access on your own time in addition to standard amounts of readings and course assignments. Students should plan to spend 15-20 hours/week on this course. Please also be aware that faculty will begin corresponding with students during Week Zero of the course (one week before the official start date of the course), and that some interaction with the course may be required at that time. Students should begin checking the Canvas course site regularly one week prior to the official start of the term.",
    "course_description": "Biological and cultural adaptations to disease, the role of specific diseases in evolution, social epidemiological patterns related to culture, contemporary issues in disease control, and economic development. Considers a variety of diseases including malaria, tuberculosis, AIDS, and malnutrition.",
    "prerequisites": null,
    "instructors": "John Lindo - Primary Instructor",
    "schedule_location": "TTh 1:15pm-2:45pm in ONLINE",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ANT_334_1_A24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 1210, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 1:15-2:45p, Instructor: J. Lindo, Status: Open",
    "date_accessed": "2024-03-29"
}