{
    "course_code": "POLS 111",
    "course_title": "Principles of Political Science",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 12Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2022-05-13 through 2022-06-22",
    "class_notes": "This is the required foundational course for all degree programs in the Department of Political Science, including political science, international studies, public policy and analysis, math and political science, as well as political concentrations in the QSS major. This course also satisfies an Emory general education requirement. The course does not have prerequisites and is designed to equip students with the background and tools they need to take advanced courses in all degree programs. Pre-College students are welcome, and the instructors will work with students who face scheduling conflicts.\n\n\nThis is an online course. Emory College Online summer courses have required synchronous/live sessions every week. Students must be available to sign into and virtually attend the course online during those times (all times listed are local to Atlanta). Each course will also involve significant asynchronous material that you access on your own time in addition to standard amounts of readings and course assignments. Students should plan to spend 15-20 hours/week on this course. Please also be aware that faculty will begin corresponding with students during Week Zero of the course (one week before the official start date of the course), and that some interaction with the course may be required at that time. Students should begin checking the Canvas course site regularly one week prior to the official start of the term.",
    "course_description": "The course is organized around the following questions:  What is politics, and what is political science? How do political groups form? How do groups make decisions? How are group decisions implemented? We approach these questions using ideas that are found across the sub-fields of political science.",
    "prerequisites": null,
    "instructors": "Danielle Jung - Primary Instructor",
    "schedule_location": "TTh 11:30am-1pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 1030, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 11:30a-1p, Instructor: D. Jung, Status: Open",
    "date_accessed": "2024-03-30"
}