{
    "course_code": "POLS 208",
    "course_title": "Research Design and Methods",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 14Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2022-06-27 through 2022-08-03",
    "class_notes": "This course provides an introduction to how to design and conduct research in political science. This process includes: how to formulate research questions and subsequent hypotheses; how to design a research plan; determining what methodologies are appropriate; and employing strategies and techniques for collecting data. This course will not focus directly on the statistical analysis of quantitative data. This course will introduce you to the social science research mindset and help you to acquire a set of skills that are essential for both understanding the research you will encounter in later political science classes, and being able to produce high-quality original research of your own.\n\n\nThis is an online course. Emory College Online summer courses have required synchronous/live sessions every week. Students must be available to sign into and virtually attend the course online during those times (noted as the course meeting times- all times listed are local to Atlanta). Each course will also involve significant asynchronous material that you access on your own time in addition to standard amounts of readings and course assignments. Students should plan to spend 15-20 hours/week on this course. Please also be aware that faculty will begin corresponding with students during Week Zero of the course (one week before the official start date of the course), and that some interaction with the course may be required at that time. Students should begin checking the Canvas course site regularly one week prior to the official start of the term.",
    "course_description": "Fundamental concepts and quantitative techniques of empirical political inquiry. Introduction to concepts of measurement, parametric, and non-parametric statistics. Basic bivariate and univariate statistics used in political science.",
    "prerequisites": "QTM 100 or QTM_OX 100 or MATH_OX 117 or MATH_OX 117Q or QTM 220 or ECON 220 or ECON_OX 220 or POLS 310 or POLS 310W or ISOM 350 or equivalent transfer credit as prerequisite.",
    "instructors": "David Davis III - Primary Instructor",
    "schedule_location": "TTh 9:45am-11:15am in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 1028, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 9:45-11:15a, Instructor: D. Davis III, Status: Open",
    "date_accessed": "2024-03-30"
}