{
    "course_code": "HIST 241",
    "course_title": "Topics in History and Text: Citizenship/Law/Exclusion",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 5Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Same as JS 280 2)\nComplete topic title:  Citizenship, Law & Exclusion in the Early Modern World.\nHow did people and institutions understand citizenship in Europe and the Americas between the sixteenth and the seventeenth centuries? How did minorities grasp and exhibit different models of citizenship? \nStudents explore the history of citizenship by analyzing different genres of historical legal sources, such as court records, petitions, edicts, codes, and treatises, as lenses into the diverse perspectives and experiences of individuals, communities, and institutions. We will examine some of the treasured legal books in Emory Libraries' collections to shed light on jurists' perspectives versus people's everyday struggles for citizenship and their performance of resistance and belonging. We will study the case of Jews in Europe and the Americas as a model of a minority's struggle for inclusion. As we move between geographies, we will refer back to this model to grapple with modes of citizenship and engagement with the law in both comparative and interconnected perspectives.",
    "course_description": "The course demonstrates how literary, artistic, and/or cinematic texts, when understood in relation to the context of their production, can be used to study selected historical themes.",
    "prerequisites": null,
    "instructors": "Tamar Menashe - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Woodruff Library 875",
    "course_resources": null,
    "sections": "Class Nbr: 4976, Section #: 3, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: T. Menashe, Status: Open",
    "date_accessed": "2024-03-30"
}