{
    "course_code": "HIST 246W",
    "course_title": "Renaissance Women Writers",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities and Arts with Cont.Communication(*)",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Renaissance women left an astonishing textual legacy ranging from letters, orations, and memoirs to treatises, plays, and imaginative tales. This course uses select texts to investigate how European women used writing to shape, interpret, and comment on the world around them between 1400 and 1600, a period that witnessed the advent of printing, the break-up of Christianity, and early globalization. In exploring the ways that writing offered a vehicle for personal expression and agency, we will also probe the barriers that Renaissance women faced in becoming literate and in publishing their work. Our readings situate women's textual production in the context of family life, medical care, political rule, and sex work. The course aims to introduce students to a broad range of women's historical experiences while improving critical reading, writing, and communication skills. Readings focus on primary sources available electronically; we will make regular use of visual materials to bring the period to life. Grading: short written assignments, one longer essay, oral presentations, class participation, and rotating turns as discussion leader. No examinations.",
    "course_description": "Renaissance women left an astonishing textual legacy ranging from\nletters, speeches and memoirs to poems, plays, and imaginative tales. This course uses selected texts to investigate how Renaissance women used writing to shape, interpret and comment on the world around them.",
    "prerequisites": null,
    "instructors": "Sharon Strocchia - Primary Instructor",
    "schedule_location": "TTh 4pm-5:15pm in Bowden Hall 116",
    "course_resources": null,
    "sections": "Class Nbr: 3564, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 4-5:15p, Instructor: S. Strocchia, Status: Open",
    "date_accessed": "2024-03-30"
}