{
    "course_code": "HIST 231",
    "course_title": "Foundations of American Society to 1877",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 10",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities and Arts(*)",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Same as AMST 285 1)\nIn this course we will examine central themes and problems in studying American history through 1877. In addition to exploring significant social, political, cultural, and economic developments during this period, we will also devote significant time to examining primary sources, identifying historical arguments and methods in secondary works, and considering the possibilities and limits of constructing historical knowledge about subjects such as colonization, slavery, the American Revolution, the American Civil War, and Reconstruction. Students in this course will thus not only gain a better understanding of American history through 1877 but also develop a working knowledge of how history is constructed while sharpening their writing and critical thinking skills. Instead of attempting to cover every aspect of American History to 1877, we will uncover what historians do when working to recover the past. Our focus is thus not solely \"what happened\" in North America to 1877 but also, and more importantly, how we can learn about what happened during that time? Such an analysis will require weekly reading and writing assignments as well as frequent in class exercises where we work closely with primary sources and practice identifying and critiquing historical arguments and methods. In short, we will spend the majority of our time developing effective reading and analytical habits.",
    "course_description": "Considers the development of American society from tentative beginnings to Reconstruction. Special emphasis is given to certain critical periods including colonialism, the American Revolution, and the Civil War.",
    "prerequisites": null,
    "instructors": "Maria Montalvo - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in White Hall 103",
    "course_resources": null,
    "sections": "Class Nbr: 3550, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 10-11:15a, Instructor: M. Montalvo, Status: Open",
    "date_accessed": "2024-03-30"
}