{
    "course_code": "HIST 296",
    "course_title": "Special Topics: Cross-listed: US-Israel Relations",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Same as JS 271 1, MESAS 270 3, and POLS 285 1)\n(Ever since President John F. Kennedy first used the phrase in 1962, it has often been repeated that the United States has a \"special relationship\" with Israel. But beyond platitudes and slogans, what does this \"special relationship\" really mean?\nThis course responds to that question using multiple lenses, exploring the ways in which the contemporary U.S.-Israel relationship has emerged through the realms of culture, politics, religion, and foreign policy. Rather than conceptualizing these realms as discrete categories of analysis, the course uses the U.S.-Israel relationship to highlight the ways in which culture and conceptions of foreign policy interests can be intrinsically entangled. Though focusing on the post-1948 period, course also discusses the American Christian and Jewish politics of Zionism in the years prior Israel's creation. The course will expose students to a broad array of perspectives and debates on America's relationship with Israel, all the way through the present day.)",
    "course_description": "Selected topics in history for students in non-history originating (cross-listed) courses. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Geoffrey Levin - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in Callaway Center N118",
    "course_resources": null,
    "sections": "Class Nbr: 4144, Section #: 3, Type: LEC, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: Levin/Green, Status: Wait List",
    "date_accessed": "2024-03-30"
}