{
    "course_code": "HIST 306",
    "course_title": "The Italian Renaissance",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 19 / Seats Avail: 9Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Appropriate for First-Year Students: NO \nThe Italian Renaissance was one of the most dynamic, transformative periods in Western history. This course analyzes the politics, society, and culture of Renaissance Italy from the Black Death circa 1350 to the collapse of the Italian state system circa 1530. It aims to identify major turning points in this period, its overall trajectory, and broader historical significance, while also placing these developments in larger global contexts. Topics include the revival of classical learning; political innovations in Italian city-states and shifts in the geopolitical order; the expansion of transnational commercial networks; marriage and family life; the origins of the African slave trade; religious practices, the rise of the Renaissance papacy, and the growth of antisemitism. Readings include secondary works as well as various primary sources ranging from letters and diaries to Machiavelli's The Prince. We will integrate discussions, digital resources, and visual materials into lectures on a regular basis. Grading: class participation, student-led discussions, quizzes, short digitally based project, take-home midterm essay, and final take-home paper.",
    "course_description": "History 201 recommended as background. Examines developments in politics, society, and the economy that created a new cultural style in Italy between 1350 and 1530. Students have the option of some readings in Italian.",
    "prerequisites": null,
    "instructors": "Sharon Strocchia - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in Bowden Hall 118",
    "course_resources": null,
    "sections": "Class Nbr: 3608, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 1-2:15p, Instructor: S. Strocchia, Status: Open",
    "date_accessed": "2024-03-30"
}