{
    "course_code": "HIST 320",
    "course_title": "The Soviet Union",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 35 / Seats Avail: 9Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Same as REES 375 1)\nThis course will explore the birth, life, and death of the Soviet Union.  Topics such as the Revolution and Civil War, the 1920s retreat from Communism, the Stalin Revolution from Above, The Great Patriotic War, the Cold War, Khrushchev's Thaw, Brezhnev's \"Stagnation,\" Gorbachev's failed reforms, and the collapse of the Soviet Union will be examined through a variety of sources and methodologies.  In addition to scholarly works, contemporary memoirs, literature and even jokes and popular music and cinema will be used to elucidate the history of one of the two super-powers of the last century. Some of the great classics of Russian literature will be used to investigate the subject as well.  Students will conduct independent research to complete term papers on the subject of their choosing.  Students will finish a take-home essay midterm and take-home essays for the final exam.  Additionally, weekly Canvas short reflections on the material will be required, as well as a final voice thread presentation summarizing what students found most compelling about what they learned.  The course does not presume knowledge of Russian history, or even historical knowledge, therefore it has no prerequisites.  Although classified as a lecture course, the class will be a mixture of lecture and discussion that will hone the students' analytical skills, not simply their ability to remember names and dates.",
    "course_description": "Elements of continuity and change in twentieth century Russia. Focuses on twilight of the Old Regime; the 1917 revolution and civil war; Lenin's dictatorship and Stalin's transformation; the impact of World War II; and post-Stalin conservatism.",
    "prerequisites": null,
    "instructors": "Matthew Payne - Primary Instructor",
    "schedule_location": "TThF 10am-10:50am in Atwood Chemistry Bldg. 240",
    "course_resources": null,
    "sections": "Class Nbr: 3613, Section #: 1, Type: LEC, Campus: ATL, Meets: TThF 10-10:50a, Instructor: Payne/Digiacomo Cerveira Coutinho, Status: Open",
    "date_accessed": "2024-03-30"
}