{
    "course_code": "HIST 285",
    "course_title": "Topics: Historical Analysis: The Migrant South",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 14 / Seats Avail: 5Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Same as AMST 285 4)\nSince the late twentieth century, scholars have noted how migrations from Latin America, Asia, and Africa have diversified the demographic make-up of urban, suburban, and rural places in the US South. Local, regional, national, and transnational migrations, however, have long played a role in shaping the region. This seminar centers on the histories and experiences of migrants' people who engage in diverse practices of mobility as they move to/through the South.  \n \nFollowing a chronological timeline between the mid nineteenth through early twenty-first centuries, we will consider how forced, coerced, and voluntary migrations have (re)shaped the region at various historical moments. Course materials will cover issues of migration, race, ethnicity, labor, class, and legal status. Throughout the semester we will pay particular attention to the lived experiences of marginalized/minoritized southerners as they have intersected with themes of migration, (im)mobility, and place-making.",
    "course_description": "An introductory course on the nature and methods of history. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Iliana Rodriguez - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Tarbutton Hall 120A",
    "course_resources": null,
    "sections": "Class Nbr: 3584, Section #: 3, Type: LEC, Campus: ATL, Meets: TTh 10-11:15a, Instructor: I. Rodriguez, Status: Open",
    "date_accessed": "2024-03-30"
}