{
    "course_code": "HIST 351",
    "course_title": "Topics:Non-US Economic History: The Origins of Capitalism",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 19 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "HSC w/Race & Ethnicity Req.",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Our course will examine economic transformations and the forces that drove them between roughly 1550 and 1800, exploring how they laid the foundations for the modern world economy.  We will study ships crisscrossing oceans with coffee from Java or Martinique, Sumatran pepper, Chinese tea, Caribbean sugar, and American furs; the horrors of the Middle Passage for captive Africans; spinning jennies whirring in Lancashire; the connections between textiles made in South Asia and the trade in enslaved men and women in Africa and the Caribbean; audiences pressing into theaters and museums; white-hot debates over taxation in Paris or Boston; the crimes behind the new-money mansions of New Orleans, Newport, Bordeaux, or Bath; British accountants in Indian courts; shop windows filled with chocolate, leather gloves, and silk ribbons in Bristol; Edinburgh professor Adam Smith pondering how emotions and economic activities might hold a society together. These are only a few scenes from the dynamic centuries in which capitalism emerged.  \nFulfills the following History Concentrations: Law, Economics, and Human Rights; European History (before 1750 and after 1750); General Studies in History; United States (before 1860); Women, Gender, and Sexuality; Empires, Nations, and Citizenship; Latin America & Non-Western World History.",
    "course_description": "Topics related to economic change outside the United States or in which the U.S. is only one area of comparison. Slave trade, global economies, economic thought, colonialism, or comparative economic systems.",
    "prerequisites": null,
    "instructors": "Judith Miller - Primary Instructor",
    "schedule_location": "TTh 5:30pm-6:45pm in Atwood Chemistry Bldg. 215",
    "course_resources": null,
    "sections": "Class Nbr: 3624, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 5:30-6:45p, Instructor: J. Miller, Status: Open",
    "date_accessed": "2024-03-30"
}