{
    "course_code": "HIST 466W",
    "course_title": "India: The Home and the World",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 8 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Continuing Communication with Race & Ethnicity(*)",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Same as MESAS 466W 1)\n\n\nWhat happens if we study the history of India (or the US, or any other country) from the home, instead of the legislature, or Presidents and Prime Ministers, or foreign and domestic policy? What does the history of family and home tell us about the history of a people: changing gender roles and expectations, race and class hierarchies, aspirations and contradictions? \nThe broad themes include: family and nation; the women's question (is there a parallel men's question?); differences between Hindu and Muslim families; Dalit women's experience of multiple oppressions (of caste, class, gender); and everyday practices of gender in family, community and nation. We examine these with a view to re-thinking the \"modern\" in India, and what the struggle for freedom and democracy means for women and men of different generations, across different castes, classes, regions and communities of the subcontinent.\nCourse texts include: films (e.g., `Monsoon Wedding and `Garam Hawa;) novels (Rabindranath Tagore, `The Home and the World; Attia Hosain, `Sunlight on a Broken Column;) the autobiographies of political leaders like Gandhi and Rajendra Prasad, and Dalit (ex-untouchable) writers like Bama and Baby Kamble; and recent historical writings.",
    "course_description": "Jr/Sr Colloquium. \nWe study the history of India from the home, instead of the government or political leadership. What does the history of family and home tell us about changing roles and expectations, race and class hierarchies, social and economic advance, education, democracy and politics?",
    "prerequisites": null,
    "instructors": "Gyanendra Pandey - Primary Instructor",
    "schedule_location": "W 1pm-3:45pm in Bowden Hall 323",
    "course_resources": null,
    "sections": "Class Nbr: 3666, Section #: 1, Type: SEM, Campus: ATL, Meets: W 1-3:45p, Instructor: G. Pandey, Status: Wait List",
    "date_accessed": "2024-03-30"
}