{
    "course_code": "HIST 423W",
    "course_title": "Islam in Russia",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 8 / Seats Avail: 3Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Continuing Communication(*)",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Same as REES 423W 1)\nThis course will concentrate on the broad experience of Muslims within various Russian states. Muslim populations make up about 14% of the Russian Federation's population (and made up a much larger proportion of the Soviet Union's), making them a major contributor to Russian history. Situated on one of the Middle Age's great religious frontiers, the Russian state evolved in intense engagement with Muslim populations long before St. Vladimir famous (and almost certainly apocryphally) rejection of Islam in favor of Orthodox Christianity in the late tenth century. Unlike most European states, however, Russia's conquests of Islamic societies (beginning with the Tsardom of Ivan the Terrible) did not result in Muslim's expulsion, but rather a long exposure to the hegemonic Russian state and culture. Muslims were variously persecuted, wooed, assimilated, tolerated, forcibly converted, protected, 'ignored,' 'modernized,' socialized and granted independence and autonomy by various incarnations of the Russian state (Tsardom of Muscovy, Imperial Russia, the Soviet Union, and Russian Federation). While this story is often told as one written in blood, much of the time Muslims under Russian domination enjoyed enough religious toleration to consider these states the 'House of Islam' (dar al-Islam).",
    "course_description": "Jr/Sr Colloquium.\nThis course will examine Russia and its Muslims over a long chronological span (with particular emphasis on the 19th, 20th and 21st centuries) and broad geographical focus (the Volga, the Caucasus and Central Asia, as well as the Russian heartland).",
    "prerequisites": null,
    "instructors": "Matthew Payne - Primary Instructor",
    "schedule_location": "Th 1pm-3:45pm in Bowden Hall 323",
    "course_resources": null,
    "sections": "Class Nbr: 3652, Section #: 1, Type: SEM, Campus: ATL, Meets: Th 1-3:45p, Instructor: M. Payne, Status: Open",
    "date_accessed": "2024-03-30"
}