{
    "course_code": "HIST 449W",
    "course_title": "Uncovering Emory's Past",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 4",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Continuing Communication(*)",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "This seminar will provide an opportunity for students to master the techniques of historical research and writing and apply them to their immediate surroundings through an exploration of the history of Emory University from its founding as Emory College in 1836 to the present. Questions we will consider will include: What challenges has Emory faced in its transformation from a small southern college into a major American university? How has the university been shaped by its religious roots? What impact has the university had both intellectually and institutionally on the City of Atlanta, the nation, and the world? How have major benefactors and international figures like former president Jimmy Carter influenced Emorys development? How has the university responded to the issue of academic freedom? What has been the experience of various minority and identity groups at Emory and how have students, faculty and administrators confronted issues of difference and diversity? How have students and student organizations (including fraternities and sororities) both reflected and challenged prevailing social patterns on campus and in the wider world?",
    "course_description": "Jr/Sr Colloquium. \nThis seminar will provide an opportunity for students to master and apply the techniques of historical research, analysis, and writing through an exploration of the history of Emory University from its founding as Emory College in 1836 to the present.",
    "prerequisites": null,
    "instructors": "Eric L Goldstein - Primary Instructor",
    "schedule_location": "W 1pm-3:45pm in Callaway Center N204",
    "course_resources": null,
    "sections": "Class Nbr: 3658, Section #: 1, Type: SEM, Campus: ATL, Meets: W 1-3:45p, Instructor: E. Goldstein, Status: Open",
    "date_accessed": "2024-03-30"
}