{
    "course_code": "HIST 585",
    "course_title": "Special Topics in History: Embodiment,Resistance&Politics",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 4 / Seats Avail: 4",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Same as CPLT 751R-2\n\n\nTopic: \"Writing Resistance | This course will explore some of the ways that writers and thinkers have understood, defined, and tried to represent \"resistance\" in their work from refusing the confines of established categories; to rethinking how we define and use existing archives; to revisioning concepts of agency, community, and courage; to revisiting what we think of as the locus and/or impetus of revolutionary action. Materials will be selected from a broad range of materials across historical moments and national cultures. Selections will be made from among, but not limited to, the following: Sophocles' '\"Antigone\" and its staging by the Theater of War production; Charlotte Delbo, Convoy to Auschwitz: Women of the French Resistance; Vaclav Havel, Living in Truth; Jose Muñoz, Cruising Utopia; Assia Djebar, Fantasia: An Algerian Cavalcade; Lauren Berlant et al., \"The Feeltank Manifesto\": Dev Hochberg, Becoming Palestine: Toward an Archival Imagination of the Future; T.W. Adorno, \"On Foreign Words\"; Edward Said, Representations of the Intellectual; Svetlana Alexievich, Voices from Chernobyl; Eduardo Galeano, Memory of Fire; Mahasveta Devi, \"Draupadi.\" Participants in the seminar will be invited to contribute an additional work of their own choosing to our shared consideration.",
    "course_description": null,
    "prerequisites": null,
    "instructors": "Angelika Bammer - Primary Instructor",
    "schedule_location": "W 1pm-4pm in Callaway Center S108",
    "course_resources": null,
    "sections": "Class Nbr: 4588, Section #: 4, Type: SEM, Campus: ATL, Meets: W 1-4p, Instructor: A. Bammer, Status: Open",
    "date_accessed": "2024-03-30"
}