{
    "course_code": "HIST 799R",
    "course_title": "Advanced Research",
    "credit_hours": "1-9",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Varies by section",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": null,
    "course_description": null,
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: This section is full 4649, Section #: 1, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: T. Andrade, Status: Closed\nClass Nbr: This section is full 4658, Section #: 10, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: C. Crais, Status: Closed\nClass Nbr: This section is full 4659, Section #: 11, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Crespino/Tullos, Status: Closed\nClass Nbr: This section is full 4650, Section #: 2, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Eckert, Status: Closed\nClass Nbr: This section is full 4651, Section #: 3, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Evans-Grubbs, Status: Closed\nClass Nbr: This section is full 4652, Section #: 4, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. LaChance, Status: Closed\nClass Nbr: 4653, Section #: 5, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Lowery, Status: Open\nClass Nbr: This section is full 4654, Section #: 6, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Miller, Status: Closed\nClass Nbr: 4655, Section #: 7, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Payne, Status: Open\nClass Nbr: This section is full 4656, Section #: 8, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Tullos/Ward, Status: Closed\nClass Nbr: This section is full 4657, Section #: 9, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Y. Yannakakis, Status: Closed",
    "date_accessed": "2024-03-30"
}