{
    "course_code": "LACS 265W",
    "course_title": "Visitor Meets Native",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 14Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall",
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2023-05-12 through 2023-06-21",
    "class_notes": "Tourism is a totemic marker of modern subjectivity, an arena in which the modern self finds expression in a zone of absolute choice, as it is on vacation, more than anywhere, that the citizen of the industrialized world has ultimate control of where he/she is and what he/she does. Tourism is also one of the world's biggest industries, driving economic decisions around the world and leaving a large environmental footprint. This class interrogates this \"vacant time\" to ask, in essence, what constitutes a \"good trip\"? from both an individual psychic sense as well as from an ecological and political economic perspective. Themes to be examined include ideas of authenticity, collective memory and social power using a variety of sources ranging from anthropology, history and literature to popular culture.",
    "course_description": "This course will bring together existing research to examine tourism as at one time an economic enterprise and also as a deeply significant cultural experience that has played an under-recognized part in shaping the cultural mores and lifestyles of both the island destinations and the home countries.",
    "prerequisites": null,
    "instructors": "Robert Goddard - Primary Instructor",
    "schedule_location": "MWF 9:15am-10:15am in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 1294, Section #: 1, Type: LEC, Campus: ATL, Meets: MWF 9:15-10:15a, Instructor: R. Goddard, Status: Open",
    "date_accessed": "2024-03-30"
}