{
    "course_code": "MUS 370",
    "course_title": "Special Topics: Music: Sci-Fi and Experimental Music",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "Successful sci-fi films are often inextricably linked to the soundtrack that creates the atmosphere of their futuristic visuals. As we enter the 8th decade since sci-fi became a distinct genre in the 1950s, it is interesting to take a look at the various ways experimental sounds have evolved to enhance the fictive imagery. In this course, we will look at iconic scenes from popular (science) fiction movies, ranging from films like Forbidden Planet and Blade Runner to the Matrix and Stranger Things. While discussing what makes this fusion of sound and vision so staggering, we will cover some basics of creating experimental and synthesized sounds using software such as Ableton, Max, and others. At the end of the course, students will be required to dub a short video segment with music they have composed themselves using one or more compositional principles discussed in the course. This course is designed for all science fiction and music lovers curious enough to create their own futuristic sounds. Previous musical experience is helpful, but not required, as we will start with the basics of electronic music making. For advanced music students, there will be the opportunity to complete additional assignments that will allow them to explore the given software in more depth. If you have any questions, please feel free to contact the instructor at dvincze@emory.edu. Music majors: this course counts as elective credit.",
    "course_description": "Selected topics in Music. May be repeated when topic varies.",
    "prerequisites": null,
    "instructors": "Davor Vincze - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in Burlington Road Building 321",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 5796, Section #: 3, Type: LEC, Campus: ATL, Meets: TTh 1-2:15p, Instructor: D. Vincze, Status: Wait List",
    "date_accessed": "2024-03-30"
}