{
    "course_code": "ENGRD 230W",
    "course_title": "Professional Writing",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 21Waitlist Total: 0, Auto-Enroll",
    "waitlist_total": ": 0, Auto-Enroll",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Summer",
    "requirement_designation": "Continuing Communication(*)",
    "permission": null,
    "dates": "2024-07-01 through 2024-08-07",
    "class_notes": "Course description: In this writing-intensive and participation-driven course, we will collaboratively examine the contexts for and rhetorical dimensions of a range of professional documents' primarily, those you produce throughout the semester. Major assignments include a set of career materials (resume, cover letter, and/or personal statements), a research report analyzing workplace writing, and a multimodal project presenting a professional passion in a form of your choice (podcast, video, infographic, etc.). As we engage in this work, we will explore the nature of professionalism and strategies for producing ethical, effective, and efficient professional writing.\n\n\nThis is an online course. Emory College Online summer courses have required synchronous/live sessions every week. Students must be available to sign into and virtually attend the course online during those times (noted as the course meeting times- all times listed are local to Atlanta). Each course will also involve significant asynchronous material that you access on your own time in addition to standard amounts of readings and course assignments. Students should plan to spend 15-20 hours/week on this course. Please also be aware that faculty will begin corresponding with students during Week Zero of the course (one week before the official start date of the course), and that some interaction with the course may be required at that time. Students should begin checking the Canvas course site regularly one week prior to the official start of the term.",
    "course_description": "Introduction to professional writing genres and strategies across a range of fields, with emphasis on producing ethical, effective, and efficient communications. Assignments may include career materials (resume, cover letter, personal statements), a research report, and a multimodal project.",
    "prerequisites": null,
    "instructors": "Melissa Yang - Primary Instructor",
    "schedule_location": "TTh 1:15pm-2:45pm in ONLINE",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ENGRD_230W_1_A24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 1619, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 1:15-2:45p, Instructor: M. Yang, Status: Open",
    "date_accessed": "2024-03-29"
}