{
    "course_code": "WGS 300",
    "course_title": "Feminist Theory",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures",
    "permission": "Department Consent Required",
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "Course Description: \nThis course will survey a range of classic and contemporary feminist writing, with the aim of identifying the main concepts, logics, and frameworks which comprise various approaches to `feminist theory'. It will trace how feminist ideas have circulated through different methods, approaches, and perspectives, while fostering the development of students' analytical skills within a specifically transnational comparative feminist framework. The readings and discussions will challenge students to rethink complex meanings of difference and apply these understandings to pressing political and legal concerns within our modern world. Five core theoretical concepts (gender, difference, women's experiences, the personal is political, and intersectionality) will structure the semester, supplemented by feminist questions raised by film, art, social movements, and questions of social justice.",
    "course_description": "This course will explore feminist theory by tracing how feminist ideas have circulated through different methods, approaches, and perspectives. It may include a range of global and transnational perspectives.",
    "prerequisites": "WGS 200 or WGS_OX 200 or equivalent transfer credit as prerequisite.",
    "instructors": "Stu Marvel - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Anthropology Building 105",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2359, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: S. Marvel, Status: Wait List",
    "date_accessed": "2024-03-30"
}