{
    "course_code": "WGS 385",
    "course_title": "Spec Topics: Women, Gender, & Sexuality Studies: Muslim Women's Storytelling",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 4 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "This course satisfies the new Religion major requirement:-Tradition-Islam, Theme.\nMuslim Women's Storytelling: Islam, Gender, Sexuality, Muslim Women's Narratives.\nThis class critically examines how Muslim women negotiate their experience, identity, and narrative in different genres and styles. Students will read Muslim women's narratives through scholarship, fiction, autobiography, memoir, visual art, music, film, television, podcasting, and movement. Additionally, students will learn relevant theoretical approaches from the field of religious studies and examine materials through the lens of feminist literary theory, the study of Orientalism, and the idea of gendered islamophobia. Learning materials are multimodal, including written, visual, audio, and in-person accounts of the lives of Muslim women. For this class, storytelling is both an object of analysis and a method for learning and presenting research. This class will include engagement and storytelling activities with Atlanta-based Muslim women from various walks of life and professional sectors. Students will learn to identify and analyze some of the diverse socio-cultural contexts that shape how Muslim women see themselves and present themselves in public discourse. This class will rely heavily on public facing learning materials and teach skills for producing effective public scholarship. Major assignments will fall be oriented towards public humanities projects.\n\n\n(Same as REL 370 1 & IDS 385 3)",
    "course_description": "Offerings vary each semester.",
    "prerequisites": null,
    "instructors": "Rose Deighton - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in Emerson Chemistry Bldg. E103",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 4070, Section #: 3, Type: SEM, Campus: ATL, Meets: TTh 1-2:15p, Instructor: R. Deighton, Status: Wait List",
    "date_accessed": "2024-03-30"
}