{
    "course_code": "WGS 385W",
    "course_title": "Spec Topics: Women, Gender, & Sexuality Studies: Exper.Writing the Anthropocene",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "Course Description: \nHow do we respond to the Anthropocene: global warming, rising sea levels, the acidification of oceans, forest fires, and mass species extinction? How can experimental writing practices generate new ways of thinking about the Anthropocene? The course responds to the urgency of the Anthropocene not through the lens of policies or agreements, but through the practice of writing: experimental prose, Instagram posts, text with images, spoken word, autotheory, poetic writing, and other forms. The course has two aims: 1) to offer an opportunity to experiment with writing in the face of events that overwhelm us and 2) to generate new ways of thinking about the Anthropocene. Might our own experiments in different forms of writing help us to live in the Anthropocene? Readings will include selections from experimental writers as well as readings in geology, environmental humanities, popular science, poetry, fiction, and critical race studies, among others. Assessment will include a regular writing practice in the form of bi-weekly Instagram posts or journal entries (20%), two experimental writing 'sketches' to be completed and discussed over the course of the semester (20% each for a total of 40%), and a final experimental project that brings together the weekly writing practice with one or both of the sketches (40%).",
    "course_description": "Offerings vary each semester.",
    "prerequisites": null,
    "instructors": "Lynne R Huffer - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in Candler Library 122",
    "course_resources": null,
    "sections": "Class Nbr: 2364, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 10-11:15a, Instructor: L. Huffer, Status: Open",
    "date_accessed": "2024-03-30"
}