{
    "course_code": "WGS 385",
    "course_title": "Spec Topics: Women, Gender, & Sexuality Studies: Gender,Race,&Empire in U.S.",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "(Same as HIST 396 2)\nCourse Description: \nThis course will explore the intersection of gender, race, and empire in U.S. history, beginning with its early roots in European colonialism. Over the course of the semester, we will examine how gender and sexual violence were foundational to the development of capitalism, chattel slavery, settler colonialism, Jim Crow modernity, 'overseas' empire, and the national security state.  One of the central aims of this class will be to understand how dominant ideas about gender and sexuality, assumptions about marriage and family, and expectations about female morality and propriety became critical to an emerging racial and national ethos. As the course progresses, it will become clear that the re-ordering of sexual norms and gendered identities helped to legitimate these systems of conquest, and shifted normative ideas about citizenship, security, and belonging. The gendered domains examined here - including women's reproductive lives during slavery, Indigenous marriage reform, proper domesticity under colonial rule, gendered punishment under Jim Crow, and the broad regulation of heteronormativity, intimacy, and the nuclear family - all became important arenas in which to refine the practice of racial violence and imperial expansion.  The course will end with an examination of contemporary manifestations of empire through the lens of security, surveillance, carcerality, and military interventions.",
    "course_description": "Offerings vary each semester.",
    "prerequisites": null,
    "instructors": "Aisha Finch - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in Callaway Center N118",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2362, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 1-2:15p, Instructor: A. Finch, Status: Wait List",
    "date_accessed": "2024-03-30"
}