{
    "course_code": "WGS 475R",
    "course_title": "Advanced Seminar: Gender and Femicide in C.A.",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 2 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "(Same as LACS 490R 1, SPAN 485 7)\n*** This course is taught in Spanish***\nGender and Femicide in Central America\nThis is a seminar course that explores gendered violence as a theoretical, social, and human rights issue as represented in the cultural production of Central American women from 1980 to present. The course will cover the social historical and political context of the Northern Triangle; Guatemala, Honduras, and El Salvador and dialogues with the global contexts as it explores central questions on how have wars, genocide, criminal and political violence been gendered? How do Central American women narrate gender violence in relation to political violence? How during \"post conflict\" era women remember and narrate gender violence in war? In addition, this course expands on how the intersections of gender/sexuality, race/ethnicity, class, and other characteristics are reflected in women's experiences of gender-based violence such as incest, sexual harassment and feminicide. This course will cover fictional works and testimonies of writers such as Rigoberta Menchú, films, and performance. As part of the course Collaborative Online International Learning (COIL) component students will work in virtual teams, interview feminist activist, and attend virtual talks.   \nPrerequisites: At least one SPAN Foundational Course (SPAN 300-318W)",
    "course_description": "Advanced seminar for juniors and seniors only on selected topics in women's, gender, and sexuality studies.",
    "prerequisites": null,
    "instructors": "Leda Lozier - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in Callaway Center N203",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 5135, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 10-11:15a, Instructor: L. Lozier, Status: Wait List",
    "date_accessed": "2024-03-30"
}