{
    "course_code": "REES 190",
    "course_title": "Fresh Sem: Rees",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 8 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "(Same as RUSS 190 1, IDS 190 3)\n\n\nIn this era of digital social media, Russia  is often mentioned as a player in contemporary \"Culture Wars\" in the US and in other parts of the world.   But what does this really mean?  A term commonly used today to reference the sharp politicization of \"difference,\" variations of 'culture wars' historically have long been part of the dynamics of national identity formation, domestic multicultural dynamics, and international interaction.  Straddling the continents of Europe and Asia, Russia is the largest country in the world.  Using Russia as our case study, our seminar will examine Russia's colonial experience, its competition with the West, and its complex  Eurasian presence through the lens of  culture 'wars,' propaganda, and cultural resilience.  Our journey through the history of cultural politics and the politics of culture in Russia will consider conflicts of values, power-relations, gender norms, religion, and ideologies that engage figures as prominent as Russian writers Dostoevsky and Tolstoy, political leaders like Stalin and Putin, and composers like Tchaikovsky.  Our exploration will examine both national and transnational elements of culture, and address questions of freedom and human & civil rights in Russia which impact figures like  Mao, Gandhi,  and Martin Luther King.  Our seminar will utilize a range of multi-media materials.  No textbook purchase is required.  Just bring a sense of adventure!",
    "course_description": "Fulfills GER freshman seminar requirement. Seminar will introduce students to special topics in Russian and East European studies with a cross-disciplinary approach.",
    "prerequisites": null,
    "instructors": "Juliette Stapanian Apkarian - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in New Psyc Bldg 220 (36 Eagle Ro",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2501, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: J. Apkarian, Status: Closed",
    "date_accessed": "2024-03-30"
}