{
    "course_code": "REES 375W",
    "course_title": "Special Topics: Empires and Nationalism in E.",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 5",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Continuing Writing Requirement",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "(Same as POLS 385W 1, IDS 385W 7)\n\n\nThe course gives an overview of Eastern European history and culture with a focus on the period from the eighteenth to the early twenty-first century. For most of Eastern European history, nation-states were the exception rather than the rule. Three empires: Turkish, Austrian/Austrian-Hungarian, and Russian - dominated the region and prevented the development of nation-states. In the twentieth century, the Soviet Empire and Hitler's Third Reich largely continued this politics. And on the turn of the twenty-first century, neo-imperial tendencies have manifested themselves in Turkey's politics of neo-Ottomanism and in Russia's attempts to reestablish its control over the former Soviet space. Unsurprisingly, nationalism and national liberation movements have played an extremely important role in the history of the region. The course examines the tensions between the empire model and the nation-state model and the specificity of nationalism in Eastern European history, with special attention to the Russian/Soviet Empire and its legacy. We will also discuss the specificity of the new far-right/neo-fascist movements and the reasons for their rise in the context of globalization and the European integration.",
    "course_description": "Topics to be announced in advance.",
    "prerequisites": null,
    "instructors": "Nikolay Koposov - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in Modern Language 201",
    "course_resources": null,
    "sections": "Class Nbr: 2505, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 1-2:15p, Instructor: N. Koposov, Status: Open",
    "date_accessed": "2024-03-30"
}