{
    "course_code": "PHIL 285",
    "course_title": "Special Topics in Philosophy",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 2",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "This course invites students to reflect on the nature of human relations and connected \nissues, such as public deliberation, democracy, peace and conflict, tolerance, and \nsolidarity, among others. The course will be structured around four topic areas: being \nwith others, thinking with others, acting with others, and feeling with others. \nOur approach to these questions will be partly theoretical and partly practical. \nThroughout the semester, we will read a variety of texts, mainly philosophical but also \nscientific, from different schools of thought from the 19th century to the present. \nLectures and class discussions will be supplemented by several out-of-class activities \nthat we will carry out in collaboration with a community organization based in Atlanta. \nStudents will have the opportunity to develop their own ideas and thoughts about \nthese fascinating topics in several assignments, including a podcast series, that will \nenable them, not only to become conversant with these issues but also to improve their \ncomprehension abilities, analytical skills, critical thinking, and expressive competence",
    "course_description": "An opportunity to explore special topics and thinkers not offered in the standard curriculum, or to explore aspects of the standard curriculum in greater depth and detail than the ordinary curriculum courses allow.",
    "prerequisites": null,
    "instructors": "Belen Pueyo Ibanez - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in Callaway Center S101",
    "course_resources": null,
    "sections": "Class Nbr: 1632, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: B. Pueyo Ibanez, Status: Open",
    "date_accessed": "2024-03-30"
}