{
    "course_code": "PHIL 385",
    "course_title": "Special Topics in Philosophy",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "\"Reinventing Life\" | Covid has called modern lives into question, revealing our limitations and vulnerabilities and forcing us to reexamine our individual and collective priorities. In rendering \"normal life\" impossible, the pandemic has focused attention on how lifestyles defined by consumption and oriented to individual success reinscribe social injustice and foster mass death and planetary destruction. At a moment when the pandemic's ultimate impact remains uncertain, this seminar aims to resist the call to go \"back to normal\" by exploring a variety of modern attempts to reimagine the meaning of life after Darwin and to cultivate alternative visions of the future and envision new forms of community in the age of computers and technoscience. By bringing visual arts, music, theatre, and literature into conversation with diverse forms of political, cultural, and social theory, we will situate current strivings to create meaningful modern lives in longer cultural, historical, and philosophical trajectories.\n\n\nSame as CPLT 333-1, GER 375-2",
    "course_description": "Selected topics and problems in philosophy. Content will vary in successive offerings of this course. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Elizabeth Goodstein - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Bowden Hall 118",
    "course_resources": null,
    "sections": "Class Nbr: 1683, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: Goodstein/Willett, Status: Open",
    "date_accessed": "2024-03-30"
}