{
    "course_code": "PHIL 385W",
    "course_title": "Special Topics in Philosophy: Buddhist Ethics",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 7 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "This course satisfies the new Religion major requirement: -Tradition-Buddhism, Theme. \nTo registrar for this course prior study of Buddhism is strongly encouraged. \nThis writing-intensive seminar takes a broadly philosophical approach to the study of Buddhist understandings of the nature of goodness and how goodness can be recognized and cultivated. Materials for the course will range from Buddhist scriptures, to philosophical treatises, to narratives, to poetry, and to films. The intention of the course is to engage seriously with Buddhist understandings of the nature of the human condition as infused with suffering, and how humans can nevertheless develop goodness and resilience within this fleeting and unstable world. Topics include the extent and limits of generosity, the proper objects of loving-kindness and compassion, the moral consequences of truths and falsehoods, and mind-training techniques for taking obstacles as the path.\nWriting assignments will be weekly and will emphasize engagement with the course materials. There will also be a final written project that builds on the work done during the semester. The seminar is appropriate for students with some prior background in Buddhism, whether through college courses or self-study. It thus requires the permission of the instructor to enroll.\n\n\n(Same as REL 354RW 1)",
    "course_description": "Selected topics and problems in philosophy. Content will vary in successive offerings of this course. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Sara L McClintock - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in New Psyc Bldg 235 (36 Eagle Ro",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3995, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: S. McClintock, Status: Wait List",
    "date_accessed": "2024-03-30"
}