{
    "course_code": "PHIL 482W",
    "course_title": "Topics: Philosophy: Human Flourishing",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": "Instructor Consent Required",
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "TOPIC: Human Flourishing \nThis seminar addresses issues that lie at the heart of philosophy understood not as a body of knowledge (by or about previous thinkers) or as a set of intellectual skills (of valid inferences or conceptual analysis) but, instead, as a way of life:   What sort of person should I strive to be? What kind of life should I cultivate and live?  How can my life not simply escape major ills but, rather, genuinely flourish, how can it be a life full of happiness, value, and meaning?  These are questions that every person faces and addresses (consciously or unconsciously, effectively or ineffectively) each day.  They are inescapable in practice.  These issues will be addressed through a focus on three central questions or clusters of questions: \"What is human well-being?  What is a flourishing life and how is it possible to lead a flourishing life?\" Can flourish be measured?  If so, how?  Or is it somehow too individual or too qualitative to allow for any quantitative analysis?  If flourishing cannot be measured, are there other ways to recognize it and nurture it?  What are they? What is the relation between individual flourishing, one person's well-being, and societal flourishing, the well-being of a community or culture?  Are they connected?  If so, how?  To what extent, if at all, are the well-being of others, the sustainability of a community and its environment, and social justice key components of flourishing?",
    "course_description": "Writing-intensive study of particular subjects pertaining to Philosophy.  May be repeated for credit when topic varies.",
    "prerequisites": "Two PHIL courses or equivalent transfer credit as prerequisite.",
    "instructors": "John J Stuhr - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Bowden Hall 116",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 1680, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: J. Stuhr, Status: Closed",
    "date_accessed": "2024-03-30"
}