{
    "course_code": "EH 584",
    "course_title": "Built Environment and Public Health",
    "credit_hours": "2",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 15",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "This course is in collaboration with a GA Tech class; students from both schools participate together.  The non-traditional time accomodates the GA Tech schedule.  Some or all of the sessions will take place at GA Tech.  Allow time for transportation.  There is an Emory/Tech shuttle, and carpooling is encouraged.",
    "course_description": "This interdisciplinary course examines how cities and neighborhoods can have both positive and adverse effects on human health and produces recommendations to improve these outcomes. This seminar is an elective planning and public health course that explores the interconnections between these fields and equips students with skills and experiences to plan healthy communities. This course covers planning and public health foundations, natural and built environments, vulnerable populations and health equity, and health policy and global impacts. This course is offered in conjunction with Emory¿s Gangarosa Department of Environmental Health and the Georgia Tech City and Regional Planning program and brings together students from both programs and perspectives. When offered in person, half of the course may take place at Georgia Tech; allow for travel time.",
    "prerequisites": null,
    "instructors": "Arthi Rao - Primary Instructor",
    "schedule_location": "F 11am-12:55pm",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_EH_584_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 1581, Section #: 1, Type: LEC, Campus: ATL, Meets: F 11a-12:55p, Instructor: A. Rao, Status: Open",
    "date_accessed": "2024-03-28"
}