{
    "course_code": "KRN 383",
    "course_title": "Modern Korean Literature in Translation",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 4",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Same as EAS 383 1 and CPLT 389 1)\n(Topic: Multiple Koreas, Multiple Voices)\n(This course takes a somewhat unconventional approach to the traditional survey course on Korean literature from the 20th century to the present by touching on key social and political issues in Korean history through writers who self-identify as Korean across the world. Modernization, colonialism, national division, and immigration from and to the Korean peninsula has resulted in a transnational and multi-ethnic community with cultural narratives that do not necessarily coincide.\nBeginning with texts from the early 20th century, we will move through works from colonial Korea (1905-1945), North Korea (1947-), South Korea (1947-), multiple sites of the Korean diaspora (1937-), and from ethnic minority groups currently living in South Korea (2003-). Through close readings, we will examine narratives from different communities that claim to represent Korean culture and how they contribute to perceptions of the national culture(s). Do these multiple sites of Korean identity constitute a singular notion of a geographic space, a unified history, or a collective community? Lectures will include visual media and theoretical texts to further our understanding of how cultural objects interact with each other to construct ethnicity and national culture. Through this framework, we will approach the transmission and reception of Korean texts in terms of soft power and transnational cultural exchange to ask the broader question of what constitutes cultural identity.)",
    "course_description": "Readings of Modern Korean literature in translation from 1900-present with appropriate literary criticism and historical texts to supplement students' knowledge of the context of Korean literary texts.",
    "prerequisites": null,
    "instructors": "Jenny Wang Medina - Primary Instructor",
    "schedule_location": "MW 8:30am-9:45am in Woodruff Library 875",
    "course_resources": null,
    "sections": "Class Nbr: 2033, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 8:30-9:45a, Instructor: J. Medina, Status: Open",
    "date_accessed": "2024-03-30"
}