{
    "course_code": "JS 273",
    "course_title": "Topics in Jewish Rel & Culture: American Judaisms",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 6",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "Same as REL 270-12\nTopic title: American Judaisms. This course introduces students to the diversity and history of Jewish belief and practice in the United States.  After defining some key terms and concepts in Rabbinic Judaism, we will explore the varied ways that Jews in the United States have articulated their relationship to God, Jewish law, and Jewish peoplehood between settlement in the colonial period to the present. Keeping our attention on the dynamics of continuity and change, we will ask: What does it mean to be an American Jew? Who holds the religious authority to make determinations about the boundaries of Jewish inclusion? How has Judaism's encounter with America politics and culture shaped Jewish belief and practice? How have American Jews negotiated the dual impulses of integration and distinctiveness? How has that negotiation produced innovative and unique American varieties of Judaism? And how has gender been central to American Jewish religious change?",
    "course_description": "Special Topics in Jewish Religion and Culture: Variety of subjects emphasizing Jewish Religion and Culture. Content will vary. May be repeated when the topic changes.",
    "prerequisites": null,
    "instructors": "Katherine Rosenblatt - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in Candler Library 101",
    "course_resources": null,
    "sections": "Class Nbr: 3563, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 10-11:15a, Instructor: K. Rosenblatt, Status: Open",
    "date_accessed": "2024-03-30"
}