{
    "course_code": "JS 273",
    "course_title": "Topics in Jewish Rel & Culture: Harvey Milk's Life&Afterlives",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 3 / Seats Avail: 2Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Same as REL 270 5 and WGS 285 3)\n(This course satisfies the Religion major requirement:- Region, Theme.)\n(Harvey Bernard Milk, a Jewish gay community activist, elected to the San Francisco Board of Supervisors on November 8, 1977, was assassinated at San Francisco City Hall on the morning of November 27, 1978. This seminar course will explore who Harvey Milk was during his life (a \"New York Jew,\" a gay man, a community activist, and a politician) and who he became after his death (a martyr and iconic figure). Resources for our exploration of Milk's life, legacy, and legend will include biographical articles and books, a documentary film, the feature film \"Milk\" (starring Sean Penn), a stage play and a television film based upon it, an opera, an oratorio, and a variety of artistic images and cultural objects. Through our focus on Milk's life and cultural \"afterlives,\" we will investigate the intersectional nature of identity, the construction and interpretation of \"hero\" and martyr figures, the nature of collective memory, the ways in which religious language and imagery are used to honor \"secular saints,\" and how conflicting claims are often made for cultural icons.)",
    "course_description": "Special Topics in Jewish Religion and Culture: Variety of subjects emphasizing Jewish Religion and Culture. Content will vary. May be repeated when the topic changes.",
    "prerequisites": null,
    "instructors": "William K Gilders - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Woodruff Library 215",
    "course_resources": null,
    "sections": "Class Nbr: 3873, Section #: 2, Type: SEM, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: W. Gilders, Status: Open",
    "date_accessed": "2024-03-30"
}