{
    "course_code": "JS 309",
    "course_title": "Jews & Judaism in Modern Times",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 8 / Seats Avail: 4",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Same as REL 309 1)\nRace, Religion, & Covenant: The Jewish Condition in Modern Times\nThe class will begin with a brief overview of premodern Judaism before turning to two of the most important events shaping modern Judaism: the exile from Spain and Portugal at the end of the 1400's and the debate over \"emancipation\" of the Jews in Europe focused on the 1750's through the 19th century. We will also discuss the Holocaust, the creation of the State of Israel and the religious and ethnic diversity of contemporary Jewish life. Where do different \"denominations\" of Judaism like Orthodox. Conservative or Reform come from? Can they each be understood, in part, as responses to the special pressures that modern conditions have forced Jewish communities to reckon with? What about Zionism and Jewish secularism? How do the religious and ethnic, racial or national understandings of Judaism intersect? Why does the question \"how does Jewishness relate to whiteness\" provoke such fierce debate today inside and outside of the Jewish community.",
    "course_description": "Modern Jewish history, society, and thought, with emphasis on religious and secular reformulations of Jewish self-identity.",
    "prerequisites": null,
    "instructors": "Don Seeman - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Callaway Center N204",
    "course_resources": null,
    "sections": "Class Nbr: 2458, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 10-11:15a, Instructor: D. Seeman, Status: Open",
    "date_accessed": "2024-03-30"
}