{
    "course_code": "LAW 883",
    "course_title": "Bankruptcy Develop Journal:Second Year",
    "credit_hours": "2",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Varies by section",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-01-04 through 2022-04-19",
    "class_notes": null,
    "course_description": null,
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: This section is full 4811, Section #: 001, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: K. Levine, Status: Closed\nClass Nbr: 4951, Section #: 002, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: M. Bagley, Status: Open\nClass Nbr: This section is full 4952, Section #: 003, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: Seaman/Williams, Status: Closed\nClass Nbr: This section is full 4953, Section #: 004, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: R. Parrish, Status: Closed\nClass Nbr: This section is full 4954, Section #: 005, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: K. Pinder, Status: Closed\nClass Nbr: This section is full 5064, Section #: 006, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: N. Morris, Status: Closed\nClass Nbr: This section is full 4955, Section #: 007, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: D. Partlett, Status: Closed\nClass Nbr: This section is full 4956, Section #: 009, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: R. Pardo, Status: Closed\nClass Nbr: This section is full 4957, Section #: 010, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Romig, Status: Closed\nClass Nbr: This section is full 4958, Section #: 011, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: P. Koster, Status: Closed\nClass Nbr: This section is full 4959, Section #: 012, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: G. Shepherd, Status: Closed\nClass Nbr: This section is full 5059, Section #: 013, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: D. Brown, Status: Closed\nClass Nbr: This section is full 5083, Section #: 014, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: F. Smith, Status: Closed\nClass Nbr: This section is full 4960, Section #: 015, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Pennell, Status: Closed\nClass Nbr: This section is full 4961, Section #: 016, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: K. Cooper, Status: Closed\nClass Nbr: This section is full 4963, Section #: 017, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: L. Carroll, Status: Closed\nClass Nbr: This section is full 4962, Section #: 018, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: G. Georgiev, Status: Closed\nClass Nbr: This section is full 5451, Section #: 019, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: S. Payne, Status: Closed\nClass Nbr: This section is full 4964, Section #: 020, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Nash, Status: Closed\nClass Nbr: This section is full 5460, Section #: 021, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Schwartz, Status: Closed\nClass Nbr: This section is full 5461, Section #: 022, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Mathews, Status: Closed\nClass Nbr: This section is full 5463, Section #: 023, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: S. Pill, Status: Closed\nClass Nbr: This section is full 5466, Section #: 024, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: R. Freer, Status: Closed\nClass Nbr: This section is full 5469, Section #: 025, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Van der Vyver, Status: Closed\nClass Nbr: This section is full 5479, Section #: 026, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: M. Lawrence, Status: Closed\nClass Nbr: This section is full 5480, Section #: 027, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: M. Sybblis, Status: Closed\nClass Nbr: This section is full 5638, Section #: 028, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: A. Volokh, Status: Closed\nClass Nbr: This section is full 5458, Section #: 029, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Shepherd, Status: Closed",
    "date_accessed": "2024-03-30"
}