{
    "course_code": "LAW 885",
    "course_title": "Emory Law Journal:Second Year",
    "credit_hours": "2",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Varies by section",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-01-04 through 2022-04-19",
    "class_notes": "Students must submit the appropriate form with the professor's approval to be enrolled.",
    "course_description": null,
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: This section is full 4813, Section #: 001, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: M. Keegan, Status: Closed\nClass Nbr: 4975, Section #: 002, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: M. Bagley, Status: Open\nClass Nbr: This section is full 4976, Section #: 003, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: D. Brown, Status: Closed\nClass Nbr: This section is full 4977, Section #: 006, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: A. Cloud, Status: Closed\nClass Nbr: This section is full 4978, Section #: 009, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: G. Shepherd, Status: Closed\nClass Nbr: This section is full 4979, Section #: 010, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: G. Georgiev, Status: Closed\nClass Nbr: This section is full 4980, Section #: 011, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: M. Goldstein, Status: Closed\nClass Nbr: This section is full 4981, Section #: 013, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Shepherd, Status: Closed\nClass Nbr: This section is full 4982, Section #: 014, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: K. Levine, Status: Closed\nClass Nbr: This section is full 4983, Section #: 015, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: A. Kirk, Status: Closed\nClass Nbr: This section is full 4984, Section #: 016, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: R. Pardo, Status: Closed\nClass Nbr: This section is full 4985, Section #: 020, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: N. Morris, Status: Closed\nClass Nbr: This section is full 4986, Section #: 021, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: P. Koster, Status: Closed\nClass Nbr: This section is full 4987, Section #: 022, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Romig, Status: Closed\nClass Nbr: This section is full 5435, Section #: 023, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: M. Lawrence, Status: Closed\nClass Nbr: This section is full 5437, Section #: 024, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: R. Parrish, Status: Closed\nClass Nbr: This section is full 5472, Section #: 025, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Hughes Jr., Status: Closed\nClass Nbr: This section is full 5485, Section #: 026, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: K. Pinder, Status: Closed\nClass Nbr: This section is full 5486, Section #: 027, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Pennell, Status: Closed\nClass Nbr: This section is full 4995, Section #: 028, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: M. Carter, Status: Closed\nClass Nbr: This section is full 5493, Section #: 029, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: K. Johnson, Status: Closed\nClass Nbr: This section is full 5489, Section #: 030, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: D. Partlett, Status: Closed\nClass Nbr: This section is full 5052, Section #: 031, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: P. Price, Status: Closed\nClass Nbr: This section is full 5053, Section #: 032, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: A. Savage, Status: Closed\nClass Nbr: This section is full 5054, Section #: 033, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: F. Smith, Status: Closed\nClass Nbr: This section is full 4988, Section #: 034, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: A. Volokh, Status: Closed\nClass Nbr: This section is full 4989, Section #: 035, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Witte Jr., Status: Closed\nClass Nbr: This section is full 5050, Section #: 036, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: L. Blank, Status: Closed\nClass Nbr: This section is full 5494, Section #: 037, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Schwartz, Status: Closed\nClass Nbr: This section is full 5051, Section #: 038, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: K. Cooper, Status: Closed",
    "date_accessed": "2024-03-30"
}