{
    "course_code": "LAW 897",
    "course_title": "Directed Research:Specific Topics",
    "credit_hours": "1-12",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Varies by section",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Varies by section",
    "dates": "2022-01-04 through 2022-04-19",
    "class_notes": "Varies by section",
    "course_description": null,
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: This section is full 4915, Section #: 002, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Witte Jr., Status: Closed\nClass Nbr: This section is full 4916, Section #: 003, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: L. Carroll, Status: Closed\nClass Nbr: This section is full 4917, Section #: 005, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: S. Payne, Status: Closed\nClass Nbr: This section is full 4918, Section #: 008, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: N. Morris, Status: Closed\nClass Nbr: 6183, Section #: 01, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Witte Jr./Waters Jr., Status: Open\nClass Nbr: This section is full 4919, Section #: 011, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: P. Koster, Status: Closed\nClass Nbr: This section is full 4921, Section #: 017, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Shepherd, Status: Closed\nClass Nbr: 6083, Section #: 024, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: C. Lytle, Status: Open\nClass Nbr: This section is full 4922, Section #: 025, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: R. Waldman, Status: Closed\nClass Nbr: 4923, Section #: 026, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Bagley, Status: Open\nClass Nbr: 4924, Section #: 027, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: G. Georgiev, Status: Open\nClass Nbr: This section is full 5003, Section #: 028, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Sybblis, Status: Closed\nClass Nbr: 4925, Section #: 029, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Sybblis, Status: Open\nClass Nbr: 4926, Section #: 030, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: R. Domingo, Status: Open\nClass Nbr: This section is full 5056, Section #: 031, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: N. Daspit, Status: Closed\nClass Nbr: This section is full 5057, Section #: 032, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Van der Vyver, Status: Closed\nClass Nbr: 6082, Section #: 033, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Athans, Status: Open\nClass Nbr: 5061, Section #: 034, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: S. Geraghty, Status: Open\nClass Nbr: 6109, Section #: 035, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Lawrence, Status: Open\nClass Nbr: 6143, Section #: 036, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Romig, Status: Open\nClass Nbr: 5078, Section #: 037, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. Hutchinson, Status: Open\nClass Nbr: This section is full 5079, Section #: 038, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. An-Naim, Status: Closed\nClass Nbr: 4930, Section #: 039, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Tulibacka, Status: Open\nClass Nbr: 4990, Section #: 041, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: K. Levine, Status: Open\nClass Nbr: This section is full 4993, Section #: 042, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. Brown, Status: Closed\nClass Nbr: This section is full 4996, Section #: 043, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. ELLIOTT, Status: Closed\nClass Nbr: 4998, Section #: 044, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Carter, Status: Open\nClass Nbr: This section is full 4999, Section #: 045, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Ludsin/Perry, Status: Closed\nClass Nbr: This section is full 5000, Section #: 046, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Mathews, Status: Closed\nClass Nbr: This section is full 5001, Section #: 047, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Seaman, Status: Closed\nClass Nbr: 5002, Section #: 048, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: S. Pill, Status: Open\nClass Nbr: This section is full 5062, Section #: 049, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Seaman, Status: Closed\nClass Nbr: 5077, Section #: 088, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Volokh, Status: Open\nClass Nbr: 4929, Section #: 090, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: K. Pinder, Status: Open\nClass Nbr: This section is full 4928, Section #: 092, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: L. Carroll, Status: Closed\nClass Nbr: This section is full 4927, Section #: 094, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: L. Blank, Status: Closed\nClass Nbr: This section is full 5060, Section #: 40, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: R. Parrish, Status: Closed\nClass Nbr: This section is full 6601, Section #: 41, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: K. Cooper, Status: Closed",
    "date_accessed": "2024-03-30"
}