{
    "course_code": "LAW 889",
    "course_title": "Int'l Law Review:Second Year",
    "credit_hours": "2",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Varies by section",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-01-04 through 2022-04-19",
    "class_notes": "Students must submit the appropriate form with the professor's approval to be enrolled.",
    "course_description": null,
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 4817, Section #: 001, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: M. Bagley, Status: Open\nClass Nbr: This section is full 4965, Section #: 002, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: L. Blank, Status: Closed\nClass Nbr: This section is full 5041, Section #: 003, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: D. Brown, Status: Closed\nClass Nbr: This section is full 4966, Section #: 004, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: M. Duncan, Status: Closed\nClass Nbr: This section is full 5419, Section #: 005, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: A. Samandari, Status: Closed\nClass Nbr: This section is full 4967, Section #: 006, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: M. Goldstein, Status: Closed\nClass Nbr: This section is full 4968, Section #: 009, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: N. Morris, Status: Closed\nClass Nbr: This section is full 4969, Section #: 014, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: K. Pinder, Status: Closed\nClass Nbr: This section is full 4970, Section #: 015, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: P. Price, Status: Closed\nClass Nbr: This section is full 4971, Section #: 017, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: T. Ruskola, Status: Closed\nClass Nbr: This section is full 5423, Section #: 019, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: P. Zwier, Status: Closed\nClass Nbr: This section is full 4972, Section #: 020, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Pennell, Status: Closed\nClass Nbr: This section is full 4973, Section #: 021, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: A. Volokh, Status: Closed\nClass Nbr: This section is full 5422, Section #: 022, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Shepherd, Status: Closed\nClass Nbr: This section is full 4974, Section #: 023, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: R. Waldman, Status: Closed\nClass Nbr: This section is full 5495, Section #: 024, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Witte Jr., Status: Closed\nClass Nbr: This section is full 5042, Section #: 026, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: M. Carter, Status: Closed\nClass Nbr: This section is full 5043, Section #: 027, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: M. Dudziak, Status: Closed\nClass Nbr: This section is full 5044, Section #: 028, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: G. Georgiev, Status: Closed\nClass Nbr: This section is full 5045, Section #: 029, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: M. Lawrence, Status: Closed\nClass Nbr: This section is full 5046, Section #: 030, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: P. Koster, Status: Closed\nClass Nbr: This section is full 5047, Section #: 031, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: R. Parrish, Status: Closed\nClass Nbr: This section is full 5048, Section #: 032, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: G. Shepherd, Status: Closed\nClass Nbr: This section is full 5049, Section #: 033, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: M. Tulibacka, Status: Closed",
    "date_accessed": "2024-03-30"
}