{
    "course_code": "CHEM 729R",
    "course_title": "Special Topics in Chemistry",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 16",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Special Topic: Math and Numerical Foundations for Chemistry Research\n \nMathematical methods constitute indispensable tools in the realm of chemistry research, encompassing not only physical chemistry but also extending their utility across various subfields. In the domain of physical chemistry, mathematical methodologies find application in elucidating the intricacies of quantum and classical mechanics. Beyond this, these mathematical tools have evolved into pivotal numerical techniques for data analysis and experimental predictions, and have even permeated into the domain of machine learning. This course is designed to provide a comprehensive introduction to three core mathematical topics: linear algebra, differential equations, and statistics. It aims to establish a strong foundation in the fundamental mathematical concepts, theorems, and methodologies within each of these subjects, with a subsequent extension into numerical methods. Furthermore, the curriculum will delve into modern computational techniques, such as machine learning methods and stochastic methods, from a mathematical perspective. As a graduate-level course, the grades are determined by 2-3 group projects instead of homework.",
    "course_description": "Different topics in Chemistry.",
    "prerequisites": null,
    "instructors": "Yao Wang - Primary Instructor",
    "schedule_location": "MW 4pm-5:15pm in Emerson Chemistry Bldg. E102",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_CHEM_729R_3_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3914, Section #: 3, Type: LEC, Campus: ATL, Meets: MW 4-5:15p, Instructor: Y. Wang, Status: Open",
    "date_accessed": "2024-03-30"
}