{
    "course_code": "THEA 370R",
    "course_title": "Creating New Works",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 3Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "Creating New Works: Writing the Playable Play\nCourse Description:\nHow should a writer approach the generation of performance text meant to actively incorporate audience participation? In this course we will study a variety of works and theories--bridging immersive theater, video games, and themed entertainment--towards building a craft vocabulary for plays that can be played with by audiences. We will then write and workshop original short pieces, exploring digital tools such as Twine to model the ways audiences might exert agency within them. Lastly, we will engage in a hands-on exploration of staging our texts via a final full-class project. This course is writing-centric, with previous playwriting experience preferred, and will also require willingness to experiment with software programs and participate in light performance.",
    "course_description": "Prerequisites: 200-level theater class or permission of instructor. A workshop for the creation of new works by actors, designers, directors, and writers. Projects may include performances created from improvisation, adaptations of fiction or nonfiction, experimentation with classics, and self-scripted monologues.",
    "prerequisites": null,
    "instructors": "Drew Paryzer - Primary Instructor",
    "schedule_location": "MW 6pm-7:15pm in Rich Building 201",
    "course_resources": null,
    "sections": "Class Nbr: 4769, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 6-7:15p, Instructor: D. Paryzer, Status: Open",
    "date_accessed": "2024-03-30"
}