{
    "course_code": "HIST 204",
    "course_title": "The Silk Road & Central Eurasia",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 38 / Seats Avail: 14Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "This course introduces students to the central nexus of commercial, cultural and political exchange in Eurasia over the course of nearly three millennia. From the Bronze Age to the rise of European sea-borne hegemony, the Silk Road sent the horse and Buddhism to China, silk and the Black Death to Europe, Islam and sufi mysticism into South Asia.  From the great world Empires of Chingis Khan and Alexander to the mercantile city states of Central Asia and Sinkiang, the lands of the Silk Road shaped human history profoundly.  The story of the region will be told by ancient mummies and Chinese monks, Persian heroes and Arab ambassadors, Venetian merchants and warrior princes.  Classics of world literature such as the Avesta, the Rigvedas, Firdusi's Shahnama and Herodotus, Histories, travelogues of Xuangzang and Marco Polo, the autobiography of Babur and Sufi poetry will supplement more scholarly accounts.  And in these stories, students will hear the tale of the world's first globalization and see, it is hoped, a mirror of their own world.  This class will meet the General Education Requirement in History, Society and Culture (HSC); it is not intended to be a preparation course for later Eurasian history courses nor does it presume that students have knowledge of the topic.",
    "course_description": "Examines history of Central Eurasia as nexus commercial, cultural and political exchange in Eurasia from the Bronze Age to the rise of European Imperialism. Topics include: nomadic empires, oasis merchants, barbarians and empires, Buddhism, Islam, European adventurers, pre-modern globalization.",
    "prerequisites": null,
    "instructors": "Matthew Payne - Primary Instructor",
    "schedule_location": "TThF 1pm-1:50pm in Math & Science Center - N304",
    "course_resources": null,
    "sections": "Class Nbr: 1183, Section #: 1, Type: LEC, Campus: ATL, Meets: TThF 1-1:50p, Instructor: M. Payne, Status: Open",
    "date_accessed": "2024-03-30"
}