{
    "course_code": "HIST 219",
    "course_title": "The First World War",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 38 / Seats Avail: 21Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "The First World War was one of the most cataclysmic and transformative events of modern history, in Europe and worldwide.  In its causes and its course the war touched deeply upon fundamental elements of European society and political culture.  It opened up the age of total war, with effects upon all aspects of life.  In this class we will study the First World War in this broad sense, from the perspectives of social and cultural as well as military and political history.  We consider the experience of the war by soldiers and civilians, its representation in visual and written forms, the strains upon gender roles for men and women, the role of colonial troops and the campaigns outside Europe, the evolving nature of the fighting and the role of technology, and the changes wrought in social and political relations during the war and its immediate aftermath, with the revolutionary collapse of four empires.  If knowledge of the twentieth century is essential to understanding the twenty-first, studying the history of the First World War is indispensable to both.",
    "course_description": "This course explores the global military, diplomatic, social, economic, and cultural dimensions of the First World War. It engages with both recent scholarship and an array of textual and visual primary sources in order to understand the conflict and its transformative effects.",
    "prerequisites": null,
    "instructors": "Brian Vick - Primary Instructor",
    "schedule_location": "MWF 10am-10:50am in White Hall 102",
    "course_resources": null,
    "sections": "Class Nbr: 1148, Section #: 1, Type: LEC, Campus: ATL, Meets: MWF 10-10:50a, Instructor: B. Vick, Status: Open",
    "date_accessed": "2024-03-30"
}