{
    "course_code": "HIST 228",
    "course_title": "Asian American History",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 23 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "HSC w/Race & Ethnicity Req.",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Same as AMST 228 1, EAS 228 1)\nThis course introduces students to the history of people of Asian ancestry in the United States, including immigrants, students, professionals, and refugees from East Asia, South Asia, and Southeast Asia. While primarily historical in approach, this course will draw on other disciplines, including cultural studies, anthropology, musicology, and sociology to arrive at a complex understanding of the experiences of Asians in the United States.\nThis course moves along both chronologically and thematically to investigate several timely issues facing the Asian American community today, including legal and illegal immigration, structural and cultural racism, and liberal and conservative politics. In addition to traditional historical sources, students will use photographs, film, music, art, and works of fiction as a lens through which to interpret multiple dimensions of Asian American lives.",
    "course_description": "This course introduces students to the history of people of Asian ancestry in the United States, including immigrants, students, professionals, and refugees from East Asia, South Asia, and Southeast Asia. Thematically, it investigates timely issues facing the Asian American community today.",
    "prerequisites": null,
    "instructors": "Chris Suh - Primary Instructor",
    "schedule_location": "MW 4pm-5:15pm in White Hall 102",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 1150, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 4-5:15p, Instructor: C. Suh, Status: Wait List",
    "date_accessed": "2024-03-30"
}