{
    "course_code": "HIST 285",
    "course_title": "Topics: Historical Analysis: Cuba: Revolutionary Island",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 28 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "HSC w/Race & Ethnicity Req.",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Same as LACS 270 1)\nComplete topic title:  Cuba: Revolutionary Island, 1492-Present.\nThis course explores the role of popular politics in Cuba's trajectory from the status of a sugar island to socialist state. How have movements for racial, class, and gender inclusion shaped this island's history? How has a popular revolutionary imagination persisted on the island throughout the past two hundred years in the context of outside military intervention, economic embargoes, and large-scale migration? We will learn about life in Cuba from the perspective of a diverse group of protagonists: indigenous Taínos, enslaved and formerly enslaved people during the late nineteenth century, peasants and squatters, student founders of the Communist Party, factory workers, film-makers, entertainers, teachers, doctors, foreign observers, and Cuban-Americans. We will read first-hand accounts, as well as scholarship authored by historians, anthropologists, and sociologists. We will also watch movies and documentaries authored by leading artists on the island.",
    "course_description": "An introductory course on the nature and methods of history. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Adriana Chira - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in Math & Science Center - N306",
    "course_resources": null,
    "sections": "Class Nbr: 1927, Section #: 2, Type: LEC, Campus: ATL, Meets: TTh 1-2:15p, Instructor: A. Chira, Status: Open",
    "date_accessed": "2024-03-30"
}