{
    "course_code": "HIST 285",
    "course_title": "Topics: Historical Analysis: Global Histories: Law & Empire",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 2Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Same as AFS 270 4)\n(How have law and empire shaped the modern world? Does human rights law have imperial roots? In this course, we will explore these and other important questions. We will begin with a broad overview of the rise of the global international legal system from the Age of Revolution to the advent of democratic nation states in the Age of Empire. We will explore major themes in the history of law and empire across different global spheres. We will learn about abolition, legal pluralism, protection, land dispossession and enclosure, labour control, authority, and sovereignty. We will then explore these themes through specific case studies from Latin America, Africa, and Asia. We will explore how law was used both to construct systems of colonial governance and control, and as a mode of resistance by indigenous peoples against colonial systems. Finally, we will consider some of the afterlives of these histories in our contemporary world. By the end of the course, students will be able to critically evaluate the role of law in the imperial and colonial eras, and analyze how these histories continue to shape our present.)",
    "course_description": "An introductory course on the nature and methods of history. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Anjuli Webster - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in Rich Building 211",
    "course_resources": null,
    "sections": "Class Nbr: 5257, Section #: 4, Type: LEC, Campus: ATL, Meets: MW 10-11:15a, Instructor: A. Webster, Status: Open",
    "date_accessed": "2024-03-30"
}