{
    "course_code": "HIST 285",
    "course_title": "Topics: Historical Analysis: Intro. to African History",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 23 / Seats Avail: 19Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Same as AFS 270 2)\nThis course introduces the history of the peoples of Africa. It begins with African civilizations in ancient times and runs through the present. It concentrates on people and civilizations indigenous to Africa. The origins of Islam, the Atlantic slave trade, and European explorers and missionaries receive attention mainly in their African aspects. The emphasis on Africa in this course provides a valuable alternative perspective on these, and other, seemingly familiar events. We will also explore the reshaping of Africa's political economy during the colonial period and after independence. \n\tThe course ought to prove full of surprises: you will be privy to the newest and best historical findings about African history, its peoples and languages, as well as to unresolved areas and debates among historians. You will leave the course knowing much more about Africa's history than newspapers or television. This knowledge will be valuable to understand modern Africa and the world where we live in.",
    "course_description": "An introductory course on the nature and methods of history. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Mariana Candido - Primary Instructor",
    "schedule_location": "MW 5:30pm-6:45pm in Atwood Chemistry Bldg. 316",
    "course_resources": null,
    "sections": "Class Nbr: 1197, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 5:30-6:45p, Instructor: M. Candido, Status: Open",
    "date_accessed": "2024-03-30"
}