{
    "course_code": "HIST 296",
    "course_title": "Special Topics: Cross-listed: Religion and the Constitution",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Same as REL 270 4)\n(This course satisfies the new Religion major requirement: - Theme, Region)\n(What do the First Amendment's religious clauses mean, and how has the interpretation of their meaning changed over time? How has the judicial system applied the First Amendment to particular (and oftentimes controversial) issues? How does the very act of legal decision-making render definitions of, and create boundaries for, religion? Is the American state secular? This course offers an introduction to thinking historically about the evolution of legal though about religion in the United States. We'll use courtroom contests and public debates to examine clashes between believers of the same and of different faiths, between believers and the state, and between believers and non-believers. We'll investigate efforts to determine the meaning of the free exercise and establishment clauses while questioning to what extent they operate in tandem or at odds with each other. And we'll probe how the very act of legal decision-making renders definitions of and creates boundaries for religion.\nThis course focuses on American constitutional history and offers an introduction to thinking historically about the evolution of legal thought about religion in the United States.  It is not a comprehensive survey of religion in American law, but rather an opportunity to explore particular moments, contests, people, and issues in American legal and religious history.)",
    "course_description": "Selected topics in history for students in non-history originating (cross-listed) courses. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Katherine Rosenblatt - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in New Psyc Bldg 230 (36 Eagle Ro",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 4383, Section #: 3, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: K. Rosenblatt, Status: Wait List",
    "date_accessed": "2024-03-30"
}