{
    "course_code": "HIST 365W",
    "course_title": "Slavery & Abolition in Africa",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 11 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "HSCW w/Race & Ethnicity Req.",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Same as AFS 365W 1)\nSlavery and abolition are not unchanging systems rooted in the past. In this seminar we will examine the nature and diversity of slavery in Africa, covering the entire continent from 1300s to 1900s. Primary and secondary sources will help us to understand slavery as a historical institution, subjected to change over time. Slavery and the different slave trades that coexisted in Africa adapted to external demand and evolved into new systems of labor exploitation after emancipation. During the semester we will identify different kinds of historical evidence and understand their role in the production of historical knowledge; evaluate the dynamics of gender, ethnic, and racial identities in the definitions of slavery; and understand the historical links between labor exploitation, slavery, slave trade, and colonialism in Africa. The course will interrogate the significant role slavery, slave trades, racism, colonialism, and forced labor have played in shaping the African past and present.",
    "course_description": "Slavery is not an unchanging systems rooted in the past. We will examine the nature and diversity of slavery in Africa, from 1300s to 1900s, and interrogate the significant role slavery, slave trades, racism, colonialism, and forced labor have played in shaping the African past and present.",
    "prerequisites": null,
    "instructors": "Mariana Candido - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Tarbutton Hall 106",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 1206, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: Candido/Rall, Status: Wait List",
    "date_accessed": "2024-03-30"
}