{
    "course_code": "HIST 351",
    "course_title": "Topics:Non-US Economic History: The Origins of Capitalism",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 34 / Seats Avail: 14Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "HSC w/Race & Ethnicity Req.",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "Ships crisscrossing oceans with coffee from Java or Martinique, Sumatran pepper, Chinese tea, Caribbean sugar, and American furs; the horrors of the Middle Passage for captive Africans; spinning jennies whirring in Lancashire; Montgolfier flying his hot air balloon in 1783; enslaved men and women bringing freedom suits in courts from Virginia to Boston to London; audiences pressing into theaters and museums; white-hot debates over taxation in Paris or Boston; fathers and mothers facing imprisonment for debt; the 'crimes' behind the new-money mansions of Newport, Bordeaux or Bath; British accountants in Indian courts; courtroom contests over failed marriages and inheritance; shop windows filled with chocolate, leather gloves, and silk ribbons in Bristol; Edinburgh professor Adam Smith pondering how emotions and economic activities might hold a society together: These are only a few scenes from the dynamic centuries in which capitalism emerged.  Our course will examine economic transformations and the forces that drove them between roughly 1550 and 1800, exploring how they laid the foundations for the modern world economy.",
    "course_description": "Topics related to economic change outside the United States or in which the U.S. is only one area of comparison. Slave trade, global economies, economic thought, colonialism, or comparative economic systems.",
    "prerequisites": null,
    "instructors": "Judith Miller - Primary Instructor",
    "schedule_location": "MW 5:30pm-6:45pm in Atwood Chemistry Bldg. 215",
    "course_resources": null,
    "sections": "Class Nbr: 1194, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 5:30-6:45p, Instructor: J. Miller, Status: Open",
    "date_accessed": "2024-03-30"
}