{
    "course_code": "HIST 318",
    "course_title": "Modern Germany",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 22 / Seats Avail: 9Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Same as GER 318 1, JS 371 1)\nModern Germany not only lies at the heart of Europe in a geographical sense, it has also shaped, if not dominated, European history for the better part of the last two hundred years. Since 1871, the territory called Germany has experienced Imperial governance (1871-1918), fragile democracy (1918-1933), ironclad dictatorship (1933-1945), foreign military occupation (1945-1949), the country's division (1949-1989), and an unforeseen re-unification (1990) of the two German states into the Federal Republic of Germany that we find on maps today. Germany has caused and been devastated by two World Wars and has become infamous for committing the crime of the twentieth century, the Holocaust. This course will cover the key issues that have shaped modern Germany and its impact on Europe and the world. It will combine social, political, and cultural histories and practice the reading of primary sources. Since modern German history remains highly contested among contemporary scholars, the course will also introduce students to different approaches and interpretations of German history.",
    "course_description": "Political, intellectual, and social history of Germany since the eighteenth century. Particular emphasis on German unification, the Weimar Republic, and Nazi Germany.",
    "prerequisites": null,
    "instructors": "Astrid M. Eckert - Primary Instructor",
    "schedule_location": "MWF 10am-10:50am in New Psyc Bldg 220 (36 Eagle Ro",
    "course_resources": null,
    "sections": "Class Nbr: 1156, Section #: 1, Type: LEC, Campus: ATL, Meets: MWF 10-10:50a, Instructor: A. Eckert, Status: Open",
    "date_accessed": "2024-03-30"
}