{
    "course_code": "HIST 583",
    "course_title": "Introduction to Advanced Historical Study",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 6",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Permission Required Prior to Enrollment)\n\n\nWhat does it mean to be a professional historian? How do we research and present the past? What tools are available to us to investigate and interpret the lives of historical actors and the structures that influence societies and cultures?\nThis course, designed primarily for incoming Ph.D. students in the History Program, has three areas of focus. We will: 1) seek to understand the different genres in which historians produce knowledge, from grant proposals and conference presentation to books and blogs; 2) discuss approaches to understanding the past inspired by weekly engagement with texts including books, articles, blogs, and tweets; and 3) deconstruct the profession, from mentoring relationships to review processes and venues for collaboration.\nThese three weekly approaches will allow us think about research and its communication before students embark on their own research and produce interpretations of their findings. These approaches will teach us about critical aspects of the profession including the importance of communicating to multiple audiences, the use of techniques from many disciplines, and the relationship of the present to the past.",
    "course_description": null,
    "prerequisites": null,
    "instructors": "Ellie Schainker - Primary Instructor",
    "schedule_location": "F 8am-11am in Bowden Hall 323",
    "course_resources": null,
    "sections": "Class Nbr: 1176, Section #: 1, Type: SUP, Campus: ATL, Meets: F 8-11a, Instructor: E. Schainker, Status: Open",
    "date_accessed": "2024-03-30"
}