{
    "course_code": "HIST 585",
    "course_title": "Special Topics in History: Reinventing Life",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 6 / Seats Avail: 5",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Same as PHIL 572R 1, CPLT 751R 8)\n\n\n2.\tIn the Covid-19 pandemic, non-life called modern lives into question. In rendering 'normal life' impossible, the pandemic focused attention on how lifestyles defined by consumption and oriented to individual success reinscribe social injustice and lead to mass death and planetary destruction. Yet the ultimate cultural impact remains highly uncertain, with the same developments that gave birth to BLM and hopes for more inclusive democratic processes provoking reactive waves of racist denial and authoritarian violence. This class aims to resist the call to go \"back to normal\" by examining a range of contemporary efforts to envision new forms of life and community. We will bring visual arts, music, theatre, and literature into conversation with diverse forms of political, cultural, and social theory and situate current strivings to create meaningful modern lives in longer cultural and historical trajectories. Topics include artistic economies and avant-gardes, digitization and surveillance, megacities, and the new authoritarianism, as well as self-care and slow food movements, climate change and social justice, ideology and utopia, the future of the arts, and post-work society.\n\n\nRequirements: active participation in seminar, research paper",
    "course_description": null,
    "prerequisites": null,
    "instructors": "Elizabeth Goodstein - Primary Instructor",
    "schedule_location": "W 2:30pm-5:30pm in Bowden Hall 216",
    "course_resources": null,
    "sections": "Class Nbr: 5847, Section #: 5, Type: SEM, Campus: ATL, Meets: W 2:30-5:30p, Instructor: Willett/Goodstein, Status: Open",
    "date_accessed": "2024-03-30"
}