{
    "course_code": "HIST 585",
    "course_title": "Special Topics in History: Empires",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 3",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "At the beginning of the twentieth century, most people lived within an empire, either under colonial rule, or within a colonizing power. Indeed, for much of human history over the past few thousand years, empire has been the norm, not the exception. Empire still seems strikingly relevant, especially as people around the world reckon with the past. This course is an introduction to, and intensive investigation of, the history and historiography of empires, what they were, what they are, how they work, and why we should care. The seminar is intended for students across the humanities and interpretative social sciences. We will examine a range of explanations for empire: institutional, geopolitical, economic, and cultural. Many of our readings will focus on the European empires of the nineteenth and twentieth centuries, but we will also examine ancient and early modern empires as well as non-Western empires such as the Ottoman, Chinese, Japanese, and the Comanche. At the core of this seminar is the conviction that the problem of empire, the problem of the organization of power, is a central part of the modern world, including the present. Empire, then, remains an ineluctable part of the world we inhabit.",
    "course_description": null,
    "prerequisites": null,
    "instructors": "Clifton C Crais - Primary Instructor",
    "schedule_location": "T 11:30am-2:30pm in Emerson Chemistry Bldg. E504",
    "course_resources": null,
    "sections": "Class Nbr: 1170, Section #: 1, Type: SEM, Campus: ATL, Meets: T 11:30a-2:30p, Instructor: C. Crais, Status: Open",
    "date_accessed": "2024-03-30"
}