{
    "course_code": "HIST 562R",
    "course_title": "Themes & Approaches in Latin American History: Body &Society in Latin America",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 6 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Same as HISP 720 1, ANT 585 2, RLR 700 5)\nThis course, offered annually, addresses a broad scope of Latin American history, historiography, and historical method through a focused theme. This year's theme \"Body and Society in Latin America\" asks how scholars of Latin American history have addressed the challenge posed in the 1990's by historians Caroline Bynum, Roy Porter, and others to move beyond the mind-body duality embedded in Western epistemology to focus on \"the body that eats, that works, that dies, that is afraid\" (Bynum, 1995). At the same time, the course emphasizes that the human body \"has not timelessly existed as an unproblematic natural object with universal needs and wants\" (Porter, 1991). Rather, we highlight how bodily experience, the meaning of the body, and bodily metaphors varied across the vast space and time of Latin American history. How have historians of Latin America used the body as a lens to address projects of colonial domination, national formation, state building, and modernization? How has a focus on the body served to illuminate foundational aspects of identity, such as sex, gender, and sexuality; race and racialization; fitness, disability and normalcy; and class and status?",
    "course_description": null,
    "prerequisites": null,
    "instructors": "Javier Villa-Flores - Primary Instructor",
    "schedule_location": "Th 2:30pm-5:30pm in Bowden Hall 323",
    "course_resources": null,
    "sections": "Class Nbr: 1178, Section #: 1, Type: SUP, Campus: ATL, Meets: Th 2:30-5:30p, Instructor: Yannakakis/Villa-Flores, Status: Open",
    "date_accessed": "2024-03-30"
}