{
    "course_code": "HIST 799R",
    "course_title": "Advanced Research",
    "credit_hours": "1-9",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": null,
    "course_description": null,
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3749, Section #: 1, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: T. Andrade, Status: Closed\nClass Nbr: This section is full 3758, Section #: 10, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Andrade/Ravina, Status: Closed\nClass Nbr: This section is full 3759, Section #: 11, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: C. Crais, Status: Closed\nClass Nbr: This section is full 3761, Section #: 13, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Eckert, Status: Closed\nClass Nbr: This section is full 3762, Section #: 14, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Evans-Grubbs, Status: Closed\nClass Nbr: This section is full 5687, Section #: 15, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Crespino/Tullos, Status: Closed\nClass Nbr: This section is full 5980, Section #: 16, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: C. Anderson, Status: Closed\nClass Nbr: This section is full 3750, Section #: 2, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Evans-Grubbs/Pastan, Status: Closed\nClass Nbr: This section is full 3751, Section #: 3, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Goldstein/Schainker, Status: Closed\nClass Nbr: This section is full 3752, Section #: 4, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. LaChance, Status: Closed\nClass Nbr: This section is full 3753, Section #: 5, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Lesser/Rogers, Status: Closed\nClass Nbr: This section is full 3754, Section #: 6, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Payne, Status: Closed\nClass Nbr: This section is full 3755, Section #: 7, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Tullos, Status: Closed\nClass Nbr: This section is full 3756, Section #: 8, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Villa-Flores, Status: Closed\nClass Nbr: This section is full 3757, Section #: 9, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Y. Yannakakis, Status: Closed",
    "date_accessed": "2024-03-30"
}