{
    "course_code": "NBB 321",
    "course_title": "Behavioral Neuroendocrinology of Sex",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 5Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "(Same as PSYC 321 1) (Prior completion of PSYC 110 or equivalent NBB course is recommended) (This course examines the role hormones, particularly steroid hormones, play in the development and activation of reproductive behaviors in animals and humans. In addition, the role of hormones in the development of sex differences in the brain and behavior will be explored. The first third of this course covers biological mechanisms of hormone production and the regulation and function of the neuroendocrine system. A background in biology is helpful, but neither required, nor necessary. The concepts necessary to understand the biology of the neuroendocrine system are developed in class. The last two-thirds of the course cover the behavioral effects of hormones and are divided into the immediate effects of hormones (activation) and long-term effects of hormones (organization). Research covers both animals and humans with everything from sex changing fish to sex change in human's topics for consideration. This course provides a comprehensive overview of the manner in which hormones produce physical modifications and modulate sexual behavior in a variety of species.)",
    "course_description": "Explores hormonal contributions to the development and expression of gender and sexual behavior in animals and humans.",
    "prerequisites": null,
    "instructors": "Kim Wallen - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in New Psyc Bldg 290 (36 Eagle Ro",
    "course_resources": null,
    "sections": "Class Nbr: 2552, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: K. Wallen, Status: Open",
    "date_accessed": "2024-03-30"
}