{
    "course_code": "BIOL 250",
    "course_title": "Cell Biology",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 50 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "Emory scientists do some of the coolest cell biology in the world; so, we will use research from these scientists to learn cell biology, how to sweat through and critique scientific literature, how to design cellular and molecular mechanisms, and experiments to test them.  Then, after we learn the papers, we will hang out for informal Q&A with the scientists who wrote them, discovering who they are, why they did the experiments they did, which ones they wish they had done differently, where they see the field heading.  As science and medicine is done in collaborative groups, most of our work will be done in guided groupwork in class.  Exams and thought questions will allow you to practice applying the information and concepts we learn to novel scenarios, much like what happens in real labs and clinics.",
    "course_description": "We will explore cells at the molecular level. Major themes include membrane organization and transport, protein trafficking, cytoskeleton structure and cell motility, cell adhesion, cell signaling, and the cell cycle. Key medical issues associated with cellular dysfunction will be presented.",
    "prerequisites": "(BIOL 142 and BIOL 142L) or BIOL_OX 142 or equivalent transfer credit as a prerequisite.",
    "instructors": "Arri Eisen - Primary Instructor",
    "schedule_location": "MW 5:30pm-6:45pm in Atwood Chemistry Bldg. 260",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 1221, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 5:30-6:45p, Instructor: A. Eisen, Status: Wait List",
    "date_accessed": "2024-03-30"
}