{
    "course_code": "BIOL 385",
    "course_title": "Special Topics in Biology: The Human Genome",
    "credit_hours": "4",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "The concept of a \"genome\" has become central to our understanding of biology, disease, and individuality.  This course will examine the concepts and experimental methods used to understand genomes.  The human species will serve as the focus of the course because the human genome is the most extensively studied, but comparisons to other species will be made and generalizable concepts will be highlighted.  The questions explored will include:  How are genomes structured?  How do they function inside cells?  How do they vary between individuals?  And how does this variation contribute to differences in traits and disease risk?  Students will interact with the primary literature through group-based presentations and discussions.  Students will interact with primary genomic datasets through the UCSC Genome Browser interface.  Students must also register for and attend a Biology 385 Discussion Section (second meeting pattern).  Prerequisites:  Biology142 +142L and Biology 264 (or permission of instructor).",
    "course_description": "A course on topics of special biological interest, designed for Biology majors elective credit. This course is repeatable when the topic varies.",
    "prerequisites": "(BIOL 142 and BIOL 142L) or BIOL_OX 142 or equivalent transfer credit as a prerequisite.",
    "instructors": "David Gorkin - Primary Instructor",
    "schedule_location": "Varies by section",
    "course_resources": null,
    "sections": "Class Nbr: 1172, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 2:30-3:45p; M 5-5:50p, Instructor: D. Gorkin, Status: Open\nClass Nbr: 4791, Section #: 2, Type: LEC, Campus: ATL, Meets: MW 2:30-3:45p; T 5-5:50p, Instructor: D. Gorkin, Status: Open",
    "date_accessed": "2024-03-30"
}