{
    "course_code": "BIOL 370LW",
    "course_title": "Intro.to Microbiology Lab",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Continuing Writing Requirement",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "This is the 3-credit hour OPTIONAL laboratory to accompany Biology 370 (Introduction to Microbiology) and will introduce students to some of the basic techniques used in the study of physiology, biochemistry, and genetics of microorganisms.  Students will isolate a microorganism at the beginning of the term and study its properties in subsequent periods, ultimately leading to its identification.  Students will be graded on their performance in the lab, on any pop quizzes, and a final exam.  As well, students will write individual, scaffolded papers, to prepare for the larger group paper to be submitted at the end of the semester.  The paper and submission process mimic that for submission and peer review of a journal article.  Written reflections are required throughout the semester, to aid in the writing and review process.  This course will fulfill elective and upper-level laboratory credit for the Biology major, as well as a Writing Requirement for the GERs.  There is no textbook for this course.  Prerequisites: Biology 142/142L; pre- or co-requisite: Biology 370.",
    "course_description": "Introduction to basic laboratory techniques in microbiology. Experiments dealing with the physiology, biochemistry, genetics, and molecular biology of microbes will be included. (This course meets the upper-level laboratory requirement and will count as elective credit for the Biology major.)",
    "prerequisites": "[(BIOL 142 and BIOL 142L) or BIOL_OX 142] as prerequisite and BIOL 370 as pre/co-requisite or equivalent transfer credit.",
    "instructors": "Kathleen Campbell - Primary Instructor",
    "schedule_location": "Varies by section",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 1187, Section #: 1, Type: LAB, Campus: ATL, Meets: T 2:30-5:30p, Instructor: K. Campbell, Status: Wait List\nClass Nbr: This section is full 1188, Section #: 2, Type: LAB, Campus: ATL, Meets: Th 2:30-5:30p, Instructor: K. Campbell, Status: Wait List",
    "date_accessed": "2024-03-30"
}