{
    "course_code": "THM 600",
    "course_title": "Post-MDiv Elective",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 1 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Closed",
    "instruction_method": "Varies by section",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": "Varies by section",
    "dates": "2022-01-10 through 2022-04-25",
    "class_notes": null,
    "course_description": "When applied for by the student, one credit of THM600 is associated with a three credit hour course to complete the four-hour postMDiv elective requirement.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: This section is full 6136, Section #: 1, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: W. Fluker, Status: Closed\nClass Nbr: This section is full 6145, Section #: 2, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Kemp, Status: Closed\nClass Nbr: This section is full 6152, Section #: 3, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: M. Moultrie, Status: Closed\nClass Nbr: This section is full 6160, Section #: 4, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: H. Kim, Status: Closed\nClass Nbr: This section is full 6252, Section #: 5, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: D. Jeong, Status: Closed\nClass Nbr: This section is full 6253, Section #: 6, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: M. Dube, Status: Closed\nClass Nbr: This section is full 6282, Section #: 7, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: P. Kwok, Status: Closed\nClass Nbr: This section is full 6291, Section #: 8, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: B. Brady III, Status: Closed\nClass Nbr: This section is full 6298, Section #: 9, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: D. Tumminio Hansen, Status: Closed",
    "date_accessed": "2024-03-30"
}