{
    "course_code": "NRSG 799R",
    "course_title": "Dissertation Research",
    "credit_hours": "1-12",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-05-13 through 2022-08-03",
    "class_notes": null,
    "course_description": null,
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 1459, Section #: 1, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Higgins, Status: Open\nClass Nbr: 1460, Section #: 10, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: S. Dunbar, Status: Open\nClass Nbr: 1461, Section #: 11, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. Waldrop, Status: Open\nClass Nbr: 1462, Section #: 12, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: R. Gary, Status: Open\nClass Nbr: 1463, Section #: 13, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: V. Hertzberg, Status: Open\nClass Nbr: 1464, Section #: 14, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: K. Smith, Status: Open\nClass Nbr: 1465, Section #: 2, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: K. Yeager, Status: Open\nClass Nbr: 1466, Section #: 3, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: C. Reilly, Status: Open\nClass Nbr: 1467, Section #: 4, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Holstad, Status: Open\nClass Nbr: 1468, Section #: 5, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: S. Close, Status: Open\nClass Nbr: 1469, Section #: 6, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Cimiotti, Status: Open\nClass Nbr: 1470, Section #: 7, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: K. Hepburn, Status: Open\nClass Nbr: 1471, Section #: 8, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Song, Status: Open\nClass Nbr: 1472, Section #: 9, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: L. Thompson, Status: Open",
    "date_accessed": "2024-03-30"
}