{
    "course_code": "ANT 203",
    "course_title": "Foundations of Linguistics",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 14 / Seats Avail: 14Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Social Sciences(*)",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "(SAME AS LING 201 1)\nWhat do you know when you know a language? How did you come to learn this information so quickly? How do the world's languages differ? How do linguists study language? This course explores the complex nature of human language and introduces students to the scientific study of human language. As we unpack our knowledge of language, we will explore speech sounds (phonetics), sound systems of language (phonology), word and sentence formation (morphology and syntax), how language expresses meaning (semantics), and how context influences the interpretation of meaning (pragmatics). We will also study language in a broader human context, investigating the role of language in defining human society. Additional topics include historical linguistics, language typology, sociolinguistics, and language acquisition.",
    "course_description": "An introduction to the systematic study of human language, surveying the fields of phonetics, phonology, morphology, syntax, semantics, pragmatics, sociolinguistics, child language acquisition, and historical linguistics.",
    "prerequisites": null,
    "instructors": "Erica Britt - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in White Hall 103",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ANT_203_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 4070, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 10-11:15a, Instructor: E. Britt, Status: Open",
    "date_accessed": "2024-03-28"
}