{
    "course_code": "ANT 334",
    "course_title": "Evolutionary Medicine",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 150 / Seats Avail: 150Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Science, Nature, Technology",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "Biological and cultural adaptations to disease, the role of specific diseases in evolution, social epidemiological patterns related to culture, contemporary issues in disease control, and economic development. Considers a variety of diseases including malaria, tuberculosis, AIDS, and malnutrition. Evolutionary medicine is founded on the idea that many current challenges to human health can be accounted for by inconsistencies or discordances between contemporary environments and those under which humans evolved. Unfortunately, much of modern medical practice either ignores or misunderstands the evolution of physical and cultural responses to stress that were faced by our ancestors. This class will explore these topics proposing ways that evolutionary biologists may help to reframe questions about diseases and disorders within long-term, evolutionary contexts. New advances in treatment will also be discussed based on insights provided by a Darwinian approach to health and disease. This class will explore various fundamental concepts in Evolution (including natural selection, neutral processes, gene flow, adaptation, and an introduction to population genetics) through the lens of medicine. Topics include COVID-19, HIV, cancer, diabetes, aging, and maladaptation to changing environments.",
    "course_description": "Biological and cultural adaptations to disease, the role of specific diseases in evolution, social epidemiological patterns related to culture, contemporary issues in disease control, and economic development. Considers a variety of diseases including malaria, tuberculosis, AIDS, and malnutrition.",
    "prerequisites": null,
    "instructors": "John Lindo - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in Anthropology Building 303",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ANT_334_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3388, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 1-2:15p, Instructor: J. Lindo, Status: Open",
    "date_accessed": "2024-03-28"
}