{
    "course_code": "ANT 285",
    "course_title": "Anthropology; Special Topics: Indigenous North America",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 20Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "(Same as THEA 289 2)\n\n\nThis course is about listening to and engaging with a range of Indigenous perspectives from Turtle Island (aka North America). We will focus on theatrical works and performance projects by Native scholars, artists, and wisdom holders. Performance genres and styles span from historical documentary to modern day comedy, to decolonial praxis, and everything in between.\nWe will read and view work by these and other performance artists: Joy Harjo, Muscogee (Creek) Nation citizen and 23rd Poet Laureate of the United States; Mary Kathryn Nagle, playwright, lawyer, and citizen of the Cherokee Nation of Oklahoma; The 1491s, a sketch comedy group; Guillermo Gómez-Peña, 'performance artist, writer, radical pedagogue...fighting colonialism since 1492' (GGP artist website); Marie Clements, a Métis playwright, performer, director, producer and screenwriter; and Leanne Betasamosake Simpson, a Michi Saagiig Nishnaabeg scholar, writer and artist.\nWe will be challenged to sharpen our listening and our awareness of the importance of relationality, voice, care, and ethics in this work. Major themes this semester include: sovereignty, dispossession, decolonization, human rights, political activism, social justice, creativity, respectful engagement, futurity, and connections to land.\nRequirements include: attendance, participation in discussions, short assignments & papers, final paper, collaborative work, and peer review.",
    "course_description": "Seminar or lecture series on topics of anthropological interest at an intermediate level. Maybe repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Debra Vidali - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in New Psyc Bldg 250 (36 Eagle Ro",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ANT_285_4_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 4468, Section #: 4, Type: LEC, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: D. Vidali, Status: Open",
    "date_accessed": "2024-03-28"
}