{
    "course_code": "ANT 351W",
    "course_title": "Sustainable Dev:Anthro Perspective",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 20Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "The field of sustainable development engages some of the most pressing and challenging issues in the world today, including poverty and inequality, environmental threats (especially climate change), social justice, and food insecurity and hunger. As is widely recognized, climate change continues to present major dangers to life forms around the world, while widespread poverty, inequality, violence, and food insecurity continued to grip large parts of the world. The study of sustainable development lies at the intersection of social, environmental, and political economic systems whether one works in the USA or elsewhere in the world. This course explores the field of sustainable development by examining different theories and key concepts, critical areas of study, and major domains of application in sustainable development.  The course is grounded in a series of case studies that explore past and present efforts to implement sustainable development.  Attention will be placed on the broader historical, political, and economic forces that shape both policy and intervention. The course is a writing intensive course, which requires a significant writing component. Thus, it encourages high levels of student participation and discussion and is centered on short writing assignments and an in-depth research paper chosen by the student in consultation with the instructor.",
    "course_description": "Anthropological perspectives on social change and economic development in the Third World today. Population growth, agricultural development, political instability, colonialism, imperialism, and urban problems in cultural context.",
    "prerequisites": null,
    "instructors": "David L Nugent - Primary Instructor",
    "schedule_location": "TTh 5:30pm-6:45pm in Anthropology Building 107",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ANT_351W_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3389, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 5:30-6:45p, Instructor: D. Nugent, Status: Open",
    "date_accessed": "2024-03-28"
}