{
    "course_code": "ANT 385",
    "course_title": "Special Topics: Anthropology: Anth of Middle East & N Africa",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 25Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "Anthropology of the Middle East & North Africa\n\n\nThe Middle East and North Africa (MENA) is a sprawling region spanning two continents, inclusive of diverse peoples, cultures, languages, religions, and ecologies. This advanced course invites a thoughtful exploration of the many kinds of lives and environments that exist in this region. The focus of the class will primarily be anthropological and contemporary. Key themes include: Humanitarianism and Displacement; Religion; Protest and Social Movement; War and Memory; Migration and Nationalism; Ecology and Environment; Gender and Sexuality; and Diasporic Life Outside the Region. While far from exhaustive, these wide-ranging and intersecting topics will primarily be explored through close readings of select ethnographies and in-class discussions. This knowledge will be expanded through analysis of film, graphic novels, and fiction. Students will be asked to deepen their study of these topics or explore another of interest through a final term paper. This advanced course welcomes students' own experiences in and commitments to the region, but no prior knowledge of MENA is required.",
    "course_description": "Seminar or lecture series of topics of anthropological concern. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Peter Habib - Primary Instructor",
    "schedule_location": "TTh 4pm-5:15pm in New Psyc Bldg 235 (36 Eagle Ro",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ANT_385_2_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3524, Section #: 2, Type: LEC, Campus: ATL, Meets: TTh 4-5:15p, Instructor: P. Habib, Status: Open",
    "date_accessed": "2024-03-28"
}