{
    "course_code": "ANT 385",
    "course_title": "Special Topics: Anthropology: Anthropology of Power",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 25Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "Why is the world the way it is? Who comes to construct ideas of history, race, and gender? How are academics, science, medicine, and anthropology part of these powerful artifacts which frame our lived experiences? How are emotions tied to power and why do certain things make us feel certain ways? Why do we speak the way we do and whose language are we speaking? Why do certain aesthetics come to dominate at different times and what goes into creating our landscapes? What are the ontological frames that make up our world, and from whence do they come? These are the kinds of questions this course will grapple with, using the framework of hegemony. Hegemony is a theory of the state and power that students will investigate and operationalize to analyze a broad variety of seemingly unconnected and yet intertwined topics spanning across a myriad of anthropological subjects, bringing complex theoretical frameworks down to the granular level of life in an embodied world. Drawing on ethnographic case studies and academic scholarship from around the world as well as popular media and their own experiences, this course will equip students to situate power in different contexts and analyze the political implications of hegemony broadly.",
    "course_description": "Seminar or lecture series of topics of anthropological concern. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "SJ Dillon - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in New Psyc Bldg 235 (36 Eagle Ro",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ANT_385_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3523, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: S. Dillon, Status: Open",
    "date_accessed": "2024-03-28"
}