{
    "course_code": "ANT 385",
    "course_title": "Special Topics: Anthropology: Culture and Trauma",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 20Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "The word \"trauma\" , which originally just meant \"wound\" in medical terminology, has now become part of everyday language, and refers to the psychological results of undergoing a frightening or horrendous event. Generally thought of as an individual ailment (\"PTSD\"), trauma also has major cultural dimensions. This course examines some of the cultural dimensions of trauma, such as collective trauma, intergenerational transmission of trauma, \"chosen\" trauma, the cultural construction of national trauma, cultural variation in the experience of trauma, resilience as a response to collective trauma, and many others. Theoretical approaches range from the psychoanalytic to the sociological and anthropological. Cases of cultural trauma and its aftermath from such diverse places as China, Guatemala, the Middle East, Tibet, and West Virginia, will be examined. Authors to be read include such important theorists as Arthur Kleinman, Tanya Luhrmann, Vamik Volkan, Laurence Kirmayer, Jeffrey Alexander, and others. Books to be read, whole or in part, may include Kai Erikson, Everything in Its Path; Emily Ng, A Time of Lost Gods; Clara Mucci, Resilience and Survival; P. Antze and M. Lambek, eds., Tense Past; Sara E. Lewis, Spacious Minds; Jeffrey Alexander et al, Cultural Trauma and Collective Identity; Rebecca Solnit, A Paradise Built in Hell; and/or others.\n\n\nClass assignments will include regular short response papers on Canvas; brief oral reports; an in -class midterm exam; and a final exam, possibly a take-home exam.",
    "course_description": "Seminar or lecture series of topics of anthropological concern. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Robert A Paul - Primary Instructor",
    "schedule_location": "MW 4pm-5:15pm in Math & Science Center - W307C",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ANT_385_3_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 4453, Section #: 3, Type: LEC, Campus: ATL, Meets: MW 4-5:15p, Instructor: R. Paul, Status: Open",
    "date_accessed": "2024-03-28"
}