{
    "course_code": "GER 102",
    "course_title": "Elementary German II",
    "credit_hours": "4",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "Varies by section",
    "typically_offered": "Spring",
    "requirement_designation": "Humanities, Arts, Language [Foreign Language]",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "This is the second of the two-course sequence of elementary German that explores the roles and group affiliations that contribute to the identity formation of young adults in the United States and the German-speaking world. Specifically, students will examine the following three roles in 102, devoting 4-5 weeks to each: The young adult as (1) a consumer; (2) a traveler/tourist; and (3) a citizen. Students will use a textbook and supplemental materials to acquire the language necessary to communicate meaningfully about each topic. Through this process of examining identity formation, students in this course, together with its prerequisite, German 101, will develop a solid foundation in speaking, writing, reading, and understanding German and life in German-speaking countries.",
    "course_description": "Spring, Summer (Vienna). The second of the two-course sequence (101-102) that introduces students to reading, writing, speaking, and understanding the German language through an exploration of the different identities of young adults in the United States and the German-speaking world.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": "Varies by section",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 1310, Section #: 1, Type: SEM, Campus: ATL, Meets: TThF 1-2:15p, Instructor: A. Starcevic, Status: Closed\nClass Nbr: This section is full 1311, Section #: 2, Type: SEM, Campus: ATL, Meets: TThF 2:30-3:45p, Instructor: A. Starcevic, Status: Closed\nClass Nbr: This section is full 1312, Section #: 3, Type: SEM, Campus: ATL, Meets: TThF 11:30a-12:45p, Instructor: F. Voigt, Status: Closed\nClass Nbr: This section is full 1313, Section #: 4, Type: SEM, Campus: ATL, Meets: MWF 11:30a-12:45p, Instructor: D. Uca, Status: Closed",
    "date_accessed": "2024-03-30"
}