{
    "course_code": "GER 405",
    "course_title": "Heimat: Identity and Belonging",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 7",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "HAL w/Race & Ethnicity Req.",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "This seminar focuses mostly on contemporary texts to explore concepts of Heimat and its discontents on three levels: 1) Heimat as rootedness in a specific locale or landscape, such as the German forest or mountains, but also the diverse urban center of Berlin; 2) Heimat as an ethnic affiliation culminating in racial supremacy, but also the intersectional identity formations resulting from experiences of migration, discrimination, and exclusion; 3) Heimat as our threatened planet earth, a concept fostered by the environmental justice movement.  For each of these overlapping units, we will foreground marginalized voices in order to combat the continued and systemic workings of racism, sexism, anti-Semitism, xenophobia, and homophobia with a framework that poses Germany as a diverse, equitable, and inclusive Heimat.    \nThis course is a LINC (Learning Through Inclusive Collaboration) course with <course>. Funded by the Howard Hughes Medical Institute, LINC'd courses are designed to help faculty and students who are engaged in thematically related courses across different disciplines to create points of intersection, or links, between the two courses. Each course will remain independently taught, but will engage in several LINC activities that will draw connections across key themes and concepts and help students integrate across ways of knowing.",
    "course_description": "Explores the concept of Heimat as central to cultural engagements in the German-speaking world since the late eighteenth century, foregrounding voices marginalized because of their race or ethnicity.",
    "prerequisites": "GER 300 level courses-wildcard. Any 300 level GER or GER_OX courses.",
    "instructors": "Caroline Schaumann - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in MODERN LANGUAGE_330",
    "course_resources": null,
    "sections": "Class Nbr: 5354, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 1-2:15p, Instructor: C. Schaumann, Status: Open",
    "date_accessed": "2024-03-30"
}