{
    "course_code": "JS 218",
    "course_title": "Nazi Germany",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 5Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "HSC w/Race & Ethnicity Req.",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "(Same as HIST 218 1, GER 218 1)\nThis course addresses the history of Nazi Germany from 1933 to 1945, a dictatorship that persecuted its political and racial enemies, rewarded those who complied with its political and racial vision, brought war to Europe and the world, and committed the crimes collectively known as the Holocaust. It offers a comprehensive overview of the origins, development, and outcomes of National Socialism. Topically, it covers the rise of the Nazi party, the establishment of the dictatorship, the emergence of the racial state, the life of Jews and social outsiders in Nazi Germany, the road to war, resistance to the Nazis, daily life in Nazi Germany, gender roles and sexual identity, as well as the medical crimes of euthanasia, and the Holocaust. This introductory course is designed for students without any prior knowledge of the subject and will focus on the reading of primary sources (original documents from the time period), combined with lectures and discussion. Assessment is based on active participation and written assignments (primary source analysis, film paper, take-home final).",
    "course_description": "Course offers an overview of the origins, development, and outcomes of National Socialism. It covers: the rise of Nazi Party, establishment of dictatorship, emergence of racial state, life of Jews and social outsiders, road to war, WWII, occupation of Europe, resistance, euthanasia, the Holocaust.",
    "prerequisites": null,
    "instructors": "Astrid M. Eckert - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in Candler Library 114",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_JS_218_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3690, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 10-11:15a, Instructor: A. Eckert, Status: Open",
    "date_accessed": "2024-03-29"
}