{
    "course_code": "JS 258",
    "course_title": "Anthropology of the Jews",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 14 / Seats Avail: 14Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "(Same as ANT 258 1, REL 258 1)\n\n\nThis is a fascinating time to be - or just learn about - Judaism and Jewishness. We are less than a century out from the genocidal devastation of the Holocaust, the birth of the State of Israel as the first independent Jewish commonwealth in almost two millennia, unprecedented freedom for Jews in many (but not all) parts of the world, and vast migrations by almost every historical Jewish community to a different part of the world than it lived in a century ago. Surely, these are features of the modern Jewish condition we will need to discuss anthropologically.\nWe also live in an age of unprecedented technology and shifts in worldview. Can a genetic profile \"prove\" Jewishness? In what special ways are some women using assisted reproductive technology or \"reproductive tourism\" to fulfill Jewish kinship or social and religious expectations? Some of the most interesting anthropological research on Jewish communities today centers on these issues.\n\n\nThis class takes place at a moment of increasing political polarization, including confrontations with legacies of (and contested definitions of) race, gender, and antisemitism. Do the new discussions of race and gender, as well as the politics of \"diversity, equity and inclusion\" make it harder or easier to identify and respond to key elements of the modern Jewish condition, individually or collectively? Has it grown easier or harder to answer the old question whether \"Jewishness\" is primarily a religious, ethnic, racial or national designation [spoiler: these are not the only options]? Does it matter? To whom? What is actually at stake in these conversations?\n\n\nFinally, we may be at something of a crossroads for the history of anthropology as a research discipline. Along with reading about the sheer diversity of ways of being, thinking, or living Jewishly, we will acknowledge the fraught Jewish history of the anthropological discipline, and ask some critical questions about its future. Is anthropology today capable, given the tools at its disposal, of rendering an adequate account of modern Jewish life? Why, for the most part, has it failed to do so (ok, that's another spoiler alert)? How has the modern Jewish condition impacted the anthropological project from its beginnings, and how might clearer thinking about Jews, Jewishness and Judaism contribute to new forms of anthropological thought? How can we read current ethnographies of Jews and Judaism critically to better understand what they tell us about the Jewish world, how they do it, and what they can learn to do better?",
    "course_description": "Introduction to Jewish populations and cultures within the framework of four fields of general anthropology: biological, archaeological, cultural, and linguistic.",
    "prerequisites": null,
    "instructors": "Don Seeman - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Callaway Center C101",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_JS_258_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3253, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 10-11:15a, Instructor: D. Seeman, Status: Open",
    "date_accessed": "2024-03-29"
}