{
    "course_code": "JS 180",
    "course_title": "Special Topics in Jewish Studies: The Bible",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 0 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "(Same as REL 170 2)\nThis course satisfies the Religion major requirement:- Tradition-Judaism. \nWhat is the Bible? Answering this deceptively simple question will be the focus of this course, which will provide an introduction to and overview of the Bible in its various forms and versions, Jewish and Christian, and to the diverse ways it has been interpreted and understood, especially in the United States context. While the course will give significant attention to how various communities identify, interpret, and appeal to the Bible as a sacred and authoritative book, no particular position of belief about the Bible will be assumed or required for participation in the course, nor will any prior knowledge of the Bible be expected. The course is for students who have been reading the Bible all their lives as well as those who will be opening its covers for the first time. Emphasis will be placed on the primary reading of biblical texts and class discussion.\nThis course is part of the ECAS Voluntary Core Curriculum Program. First-year students are enrolled first.",
    "course_description": null,
    "prerequisites": null,
    "instructors": "William K Gilders - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Callaway Center N204",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_JS_180_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: This section is full 4101, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: W. Gilders, Status: Closed",
    "date_accessed": "2024-03-29"
}