{
    "course_code": "SOC 561",
    "course_title": "Sociology of The Arts",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 4",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "Sociological consideration of the arts has a long history. It extends back to the works of such classic scholars as Max Weber and W.E.B. Du Bois and has burgeoned greatly in recent times. In studying realms of creativity, such scholars have connected the arts to key concerns in sociological theory, such as commodification, inequality, legitimation, and racialized hierarchies, while also drawing upon a host of cutting-edge methodologies. Put another way, this seminar on a specialized topic also ties directly to the core of sociology.     \n \nWe will seek a purchase on this sociological work by discussing classic works in class and by reading contemporary works addressing themes that currently enliven the sociology of the arts. We will explore such topics as artistic careers, fields of artistic production, aesthetic boundaries, the audiences for artistic works, and the import and impact of critics. Besides providing students with grounding in the sociology of the arts, this seminar will also prepare them for doing their own research in this area of scholarship, as well as in sociology more broadly. In particular, we will give special attention to methods and designs employed in current research. Thus, by the end of the semester, all will have a grasp of the field and an understanding of how to conduct their own research.   \n \nAll readings will be available on the class Canvas site.",
    "course_description": "Sociological consideration of the arts has a long history. In this advanced seminar, we seek a purchase on this sociological work by discussing these classic works in class and by reading contemporary works addressing themes that currently enliven the sociology of the arts. As a result, we will explore such topics as artistic careers, fields of artistic production, aesthetic boundaries, the audiences for artistic works, and the import and impact of critics. Besides providing students with grounding in the sociology of the arts, this advanced seminar will also prepare them for doing their own research in this area of scholarship, as well as in sociology more broadly. In particular, we will give special attention to methods and designs employed in current research, and each student will also embark upon their own empirical project. Thus, by the end of the semester, all will have a grasp of the field and an understanding of how to conduct research in the sociology of the arts.",
    "prerequisites": null,
    "instructors": "Timothy J Dowd - Primary Instructor",
    "schedule_location": "T 4pm-6:45pm in Tarbutton Hall 206",
    "course_resources": null,
    "sections": "Class Nbr: 1154, Section #: 1, Type: SEM, Campus: ATL, Meets: T 4-6:45p, Instructor: T. Dowd, Status: Open",
    "date_accessed": "2024-03-30"
}