{
    "course_code": "SOC 551",
    "course_title": "Interactionist Approach to Social Relations",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 7",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "This course approaches the dynamics of social interaction from the symbolic interactionist (SI) perspective. We examine and discuss an overview of both classic and contemporary works in this tradition. In the first section of the course, we will focus on the development of the SI perspective and will read major early theorists including Mead, Du Bois, Cooley, Blumer, Stryker, and Goffman. In the second section of the course we will cover recent theoretical developments, focusing on topics including role taking processes, the looking-glass self, reflected appraisals, identity formation and negotiation processes, stigmatized identities and stress, and identities online. Throughout the course, we will focus on how selves and identities are created, modified, and enacted through interactions with others. \nThis course will:\n-\tIncrease students: understanding of how sociological theories are developed, tested, and refined, and to apply a symbolic interactionist theory to a substantive area of their interest.\n-\tDeepen students: knowledge of sociological research methods through engaging with identity studies that draw on a wide range of methodological approaches.\n-\tImprove students: written and oral communication skills through discussions and writing assignments",
    "course_description": null,
    "prerequisites": null,
    "instructors": "Cathryn Johnson - Primary Instructor",
    "schedule_location": "W 1pm-3:45pm in Tarbutton Hall 206",
    "course_resources": null,
    "sections": "Class Nbr: 1153, Section #: 1, Type: SEM, Campus: ATL, Meets: W 1-3:45p, Instructor: C. Johnson, Status: Open",
    "date_accessed": "2024-03-30"
}