{
    "course_code": "SOC 497R",
    "course_title": "Directed Research",
    "credit_hours": "Varies by section",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": null,
    "course_description": "Supervised work on a faculty member's research project, normally for students who have demonstrated superior performance in sociology.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 5483, Section #: 1, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: C. Puckett, Status: Open\nClass Nbr: 6371, Section #: 11, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: A. Sewell, Status: Open\nClass Nbr: 6373, Section #: 12, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: T. Dowd, Status: Open\nClass Nbr: 6375, Section #: 13, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: T. Scott, Status: Open\nClass Nbr: 6380, Section #: 14, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: A. Dixon, Status: Open\nClass Nbr: 6381, Section #: 15, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: C. Johnson, Status: Open\nClass Nbr: 5768, Section #: 2, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: R. Franzosi, Status: Open\nClass Nbr: 6247, Section #: 5, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: W. Guo, Status: Open\nClass Nbr: 6251, Section #: 6, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: I. Browne, Status: Open\nClass Nbr: 6275, Section #: 7, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: K. Hegtvedt, Status: Open\nClass Nbr: 6319, Section #: 8, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Park, Status: Open",
    "date_accessed": "2024-03-30"
}