{
    "course_code": "ITAL 470",
    "course_title": "Topics in Italian Literature",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 18Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Intercultural Communication(*)",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "ITAL 470 Naples, Rome, Venice\n(A. Castaldo / TTh 1:00-2:15)\nContent: This class will delve into the cultural history of three millenary Italian cities, Naples, Rome, and Venice, which have played a key role in the history and collective imagination of Italian and European culture. We will explore each city through the lens of literature, cinema/TV, and art history while focusing on topics such as collective and micro history, fictional narratives (from novels to tv shows), notable personalities, meaningful historical events, and cultural manifestations, from traditional - often centuries-old - popular celebrations to modern-day film and art festivals. This class will rely on geographic visualization tools, from Google Maps Street View to historical virtual maps, which will allow us to explore the urban environments and to situate in their real context the cultural objects we will analyze. Class taught in Italian.",
    "course_description": "In Italian. Intensive study of a single author, genre, literary movement, or period. Topic to be announced in advance. May be repeated for credit when topic varies. Prerequisite: Italian 302 or permission of program director.",
    "prerequisites": null,
    "instructors": "Achille Castaldo - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in Woodruff Library 215",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ITAL_470_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3055, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 1-2:15p, Instructor: A. Castaldo, Status: Open",
    "date_accessed": "2024-03-29"
}