{
    "course_code": "ITAL 365",
    "course_title": "Sustainable Food and Italy",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 6 / Seats Avail: 6",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "ITALIAN 365 sec 1:  At the Italian Table: Sustainable Food and Culture of Italy \nS. Muratore (MW 2:30-3:45pm) \nCOURSE DESCRIPTION (3 credits) HAP, Italian major/minor/ sustaianability minor\nThis course will examine ways in which food shapes contemporary Italian society. We will focus on the art of cuisine through the analysis of texts, films and cultural events. We will also examine the concepts of sustainability and the history and principles of the \"Slow Food Movement\". It is divided in two parts: Sustainable Food Fair and Italian Food History and Culture.\n\n\nIn the first part of the semester, we will focus on studying the basic principle of Sustainable Food and the Slow Food Movement while organizing the Emory Sustainable Food Fair. The organization of fair will provide students with an opportunity to lead and promote a deeper understanding of sustainable food and ecological justice among the members of the Emory Community at large. In the second part of the semester will examine ways in which food shapes contemporary Italian society and its cultural practices. We will focus on the art of cuisine through the analysis of texts, films and cultural events to explore its role in Italian culture. Going to food markets, cooking, eating with family and friends and talking about food shapes our understanding of Italian society and can be considered a crucial aspect of what being \"Italian\" means. Students will be engaged both in group, and individual projects, assignments and excursions. The course includes a community-engaged learning module designed to expose students to Emory University's sustainability network of Farmer's Markets, local vendors, and vegetable gardens (Sustainable Food Fair).",
    "course_description": "This course will examine ways in which food shapes contemporary Italian society. We will focus on the art of cuisine through the analysis of texts, films and cultural events. We will also examine the concepts of sustainability and the history and principles of the \"Slow Food Movement\"..",
    "prerequisites": null,
    "instructors": "Simona Muratore - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in New Psyc Bldg 290 (36 Eagle Ro",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ITAL_365_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3058, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: S. Muratore, Status: Open",
    "date_accessed": "2024-03-29"
}