{
    "course_code": "ITAL 190",
    "course_title": "Freshmen Seminar: Italian: Gender/Sexuality in Ital Ren.",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 0 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First Year Seminar",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "ITAL 190-1 The Making of Gender and Sexuality in the Italian Renaissance\nG. Waters (MW 11:30am-12:45pm in person)\nContent:  The Italian Renaissance represents a profound moment in the development of Western identity, that is when a confluence of cultural developments disrupted centuries of Aristotelian, binary thinking (McHugh 2023). The period heralds a new modality of gender and sexual expression that constitutes a world at play while also inaugurating a new era of self-reflexivity and self-fashioning. The class will explore this tension of the internal/external self and how men and women exploited subjective expression and experimentation to imagine new gendered possibilities in the domains of marriage, religion, warfare, and same-sex desire. We will use an array of literary and historical sources to examine themes such as gender identities, gender dynamics, and sexual identities in the various Renaissance courts to gain an understanding of the liberality with which gender and sexual identity were performed.",
    "course_description": "Seminar designed to engage freshmen in aspects of inquiry and research into areas of Italian culture through mutual exploration of subject matter. Primary mode of classroom discourse is dialogue and group projects.",
    "prerequisites": null,
    "instructors": "Garrett Waters - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in Woodruff Library 214",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ITAL_190_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: This section is full 3046, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: G. Waters, Status: Closed",
    "date_accessed": "2024-03-29"
}