{
    "course_code": "HLTH 306",
    "course_title": "Designing Health Research",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 4Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "This course introduces students to key concepts in health research. It uses didactic and applied training to develop competency in research methods, both quantitative and qualitative. The course introduces the basic steps, methods and strategies of the research process; problem identification, hypothesis development, literature review, research design and methodology, data management, data analysis, and scientific communication. Its aim is to help students design and develop a thoughtful, persuasive, and potentially fundable scientific research proposal that addresses a health concern. Students begin with a broad health topic that they would like to investigate and learn how to narrow it down into a specific and feasible research question; then they learn how to design a methodology to address the question. In addition to comprehending and developing the elements of a research project, students also learn the principles of ethical conduct of research, essentials of scientific writing, as well as presentation skills. Students also learn how to conduct a literature review, how to evaluate the literature, and how to use a reference management software. (Prerequisites can be any one of the following: HLTH 207, OR QTM100, OR MATH_OX 117Q, OR ECON 220 - if you have taken one of these listed prerequisites and still have issues enrolling, please contact Ms. Addy at Shiyra.Sadoff@emory.edu)",
    "course_description": "This course explores qualitative and quantitative methodologies used in health research, as well as principles for responsible conduct of research. Through hands-on development of a research proposal, students build skills for reviewing literature, evaluating evidence, and scientific communication.",
    "prerequisites": "HLTH 207 or equivalent transfer credit as prerequisite.",
    "instructors": "Ghada Farhat - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in 1462 Clifton Rd 101",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_HLTH_306_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2581, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 1-2:15p, Instructor: G. Farhat, Status: Open",
    "date_accessed": "2023-10-31"
}