{
    "course_code": "HLTH 324",
    "course_title": "Nutrition and Performing Arts",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 29 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Performing artists and performers in training, including musicians, singers, actors, and dancers, have unique energy and nutritional demands, yet little attention has been given to their nutritional needs, making them subject to nutrition myths that are likely to be counterproductive. Whether it is a dancer managing the last of a hundred pirouettes in a ballet, or a jazz trumpeter motivating people to tap their feet and snap their fingers in the last set of a long evening, it takes power, concentration, and endurance to bring all the elements of a successful performance together. Performing artists must manage the dynamic interaction between energy/nutrient utilization and provision to help assure a long, healthful, and successful career. This course will cover the nutritional elements that will help students understand the basic science behind nutritional recommendations, and strategies that can help performing artists achieve the desired body profile, optimal hydration, endurance, and health. Special attention will be given to artists of different age and sex, the nutritional stresses associated with travel, performing in hot and humid environments, and optimal eating strategies that can help artists prepare for performances at different times of day and night. ***We are overriding the HLTH 220 prerequisite. If interested in enrolling without the prerequisite, please complete the Overload Request Form at this link by November 19th https://www.surveymonkey.com/r/CSHH5241OPR",
    "course_description": "Performing artists are subject to nutrition myths, making it difficult for them to manage the interaction between nutrient utilization and provision to assure a successful career. This course covers nutritional factors for helping performing artists achieve the desired performance outcomes.",
    "prerequisites": "HLTH 220 or equivalent transfer credit as prerequisite.",
    "instructors": "Dan Benardot - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Emerson Chemistry Bldg. E102",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_HLTH_324_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2584, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: D. Benardot, Status: Open",
    "date_accessed": "2024-03-30"
}