{
    "course_code": "HLTH 210",
    "course_title": "Predictive Health and Society",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 140 / Seats Avail: 4Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": "Social Sciences(*)",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(Same as ANT 231 1)\nThe idea that health is about illness, and health care means medical care or an intervention for disease or injury, is embedded in our culture. We assume that predicting our health means we are predicting disease, and that predictive health involves a search for a disease-specific gene. Introduction to Predictive Health and Society explores a radically different approach to health. Health is not the state of not being sick, rather it is what we live every day \"it is the state of our bodies\" cells and cellular changes over time. We are building the science of health, not disease, with new insights into biomarkers of the ongoing cellular functions. In short, health prediction is a fundamental and revolutionary paradigm shift that focuses health care on health and supports disease prevention by pre-emption. We will be joined by ethicists, behaviorists, geneticists, infectious disease experts, leaders in public health, health economists and research scientists from a number of disciplines and schools across the university, and around the world. Each class encourages you to reflect on the material as it pertains to you in your daily lived experience of health. Each topic will have a bearing on choices available to you and how you yourself choose to live your life - the way you eat, sleep, experience stress and we encourage you to consider daily challenges in a new perspective.",
    "course_description": "This course introduces the evidence base for the science of health and emphasizes STEM educational translations to the population, clinic and individual levels. Innovative efforts are needed to drive changes in health care from a reactive, disease-focused system to a proactive health-focused one.",
    "prerequisites": null,
    "instructors": "Michelle Lampl - Primary Instructor",
    "schedule_location": "Th 1pm-2:15pm in ONLINE",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_HLTH_210_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2579, Section #: 1, Type: LEC, Campus: ATL, Meets: Th 1-2:15p, Instructor: M. Lampl, Status: Open",
    "date_accessed": "2024-03-30"
}