{
    "course_code": "HLTH 350R",
    "course_title": "Core Issues in Global Health: Under the Weather?",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 24 / Seats Avail: 15Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "This course will provide an overview of climate change science and the public health impacts, with an emphasis on the cultural and social dimension of impacts, vulnerability and adaptation. We will begin with a review of the evidence on climate change and variability and explore a number of topics related to climate change of interest to the anthropological and global health community, such as: Disparate Impacts: The Global North vs the Global South; Food security: Climate change impacts on food quality and quantity; Climate change and biodiversity loss; Environmental Justice as a policy frame; Arctic and Circumpolar health issues; Indigenous perceptions of climate change; Impacts on oceans; Climate Refugees: Migration and population displacement. (Prerequisite: HLTH 250)",
    "course_description": "This course emphasizes core issues in global health, explores the identification of global health priorities, the nature of global health organizations and the challenges to finding and implementing solutions. The focus changes with the instructor",
    "prerequisites": "ANT205 or HLTH250 or equivalent transfer credit as prerequisite.",
    "instructors": "George Luber - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Emerson Chemistry Bldg. E102",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_HLTH_350R_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2590, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: G. Luber, Status: Open",
    "date_accessed": "2023-10-31"
}