{
    "course_code": "HLTH 353",
    "course_title": "GH: Players, Politics, & Power",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 0 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "This course is a seminar style course that focuses on the interplay of major global health actors/players, the politics of global health, and the power dynamics that infuse the interplay. The course will concentrate on key global health players over the last 25 years including public, multilateral, private and philanthropic players. The landscape of global health was framed by the post-World War 2 set of organizations and institutions. Over the last 25 years and particularly since the millennium the landscape has fundamentally changed. This course will explore the dynamics of this change, the influence of respective global health players in crafting the global health agenda and the relative power of each player over time. A key focus of this course will interrogate the question of whether and how the priorities and politics of the big global health players influence decisions taken at community, sub-national and national levels in low and middle income countries. The course will require a significant amount of reading, critique, discussion and analysis. (HLTH 250 is a Prerequisite for this course) The time for this course was rescheduled after senior registration started, so to make enrollment fair, we will open up enrollment again during A/D/S on November 20th; if interested in enrolling please email Ms. Addy at shier.sadoff@emory.edu",
    "course_description": "We will examine the interplay of key global health players, the politics of global health, and the power dynamics that influence decisions at community, sub-national, and national levels in low- and middle-income countries. We will focus on events that have shifted this landscape the past 25 years.",
    "prerequisites": "HLTH 250 or HLTH_OX 250 or ANT 205 or ANTH_OX 205 or SOC 250 or equivalent transfer credit as prerequisite.",
    "instructors": "Deborah A McFarland - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in 1462 Clifton Rd 100A",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_HLTH_353_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: This section is full 2591, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: D. McFarland, Status: Closed",
    "date_accessed": "2023-10-31"
}