{
    "course_code": "HLTH 385",
    "course_title": "Special Topics: Human Health: Bioethics, Equity, & Justice",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "This course explores the complex relationships between bioethics, health equity, and social justice. Through a multidisciplinary lens, students will explore critical topics such as care ethics, ethics of justice, transformative justice, disability studies, health-focused social movements, and the concept of body sovereignty. This course aims to foster a deep understanding of the ethical dimensions that shape healthcare systems and policies while promoting a just and equitable approach to healthcare.\nStudents will engage in in-depth discussions, critically analyze case scenarios, and participate in practical exercises that promote empathy, ethical reflection, and social justice advocacy. Students will be evaluated on their ability to apply ethical frameworks to real-world healthcare challenges, their understanding of the intersections between social justice and bioethics, and their capacity to propose ethical solutions that promote health equity. By the end of this course, students will emerge with a nuanced understanding of how bioethics, health equity, and social justice intersect and influence healthcare practices and policies. They will be better equipped to address complex ethical dilemmas, advocate for marginalized populations, and work towards a just and equitable healthcare system. This course provides a foundation for students pursuing careers in healthcare, public health, ethics, policy, or related fields.",
    "course_description": "Seminar of lecture series of topics in human health. May be repeated for credit when topic varies. Credit varies from one to four hours.",
    "prerequisites": null,
    "instructors": "Andrea Fitzroy - Primary Instructor",
    "schedule_location": "TTh 5:30pm-6:45pm in Emerson Chemistry Bldg. E102",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_HLTH_385_3_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: This section is full 2603, Section #: 3, Type: LEC, Campus: ATL, Meets: TTh 5:30-6:45p, Instructor: A. Fitzroy, Status: Open",
    "date_accessed": "2023-10-31"
}