{
    "course_code": "HLTH 440",
    "course_title": "Botanical Medicine & Health",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 60 / Seats Avail: 49Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(Same as BIOL 442 1, ANT 440 1)\nMankind has long recognized that plants are extremely useful as a source of medicine. Medical traditions based on botanical drug sources can be found in all human cultures and date back to prehistory. In this course, both ancient and modern day botanical traditions across many cultures will be discussed as they pertain to medicine. The pathways through which natural drugs are made by plants and how they affect humans will be the focus of this class. Some examples include botanical drugs for infectious disease, cancer, cardiovascular health, dental health, central nervous system function, and much more. By the end of this course, you will have a solid understanding of the major botanical drugs, including their sources, applications, and cultural relevance.",
    "course_description": "Mankind has long recognized that plants are extremely useful as source of medicine. Medical traditions based on botanical sources are found in all human cultures and date back to prehistory. In this course both ancient and modern day botanical traditions across many cultures will be examined.",
    "prerequisites": null,
    "instructors": "Cassandra Quave - Primary Instructor",
    "schedule_location": "MW 8:30am-9:45am in Anthropology Building 303",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_HLTH_440_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2594, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 8:30-9:45a, Instructor: Team, Status: Open",
    "date_accessed": "2024-03-30"
}