{
    "course_code": "CL 317",
    "course_title": "Vergil and Dante",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "Content:\n\t\tThe Aeneid and The Divine Comedy are both central texts in the western literary canon, closely linked by the literary genre of epic and even more by the profound influence of Vergil on Dante's conception of his poem.  Yet they are strikingly different too:  Vergil's epic of national origins places the cataclysmic events of his own lifetime in a scheme of fate and historical causation reaching back to Rome's mythic origins, while Dante's poem, though also deeply ingrained in history, explores the place of the Christian soul in the great drama of sin and redemption.  Vergil and Dante both became national poets in retrospect, and both conceived their great works under the profound influence of previous epic poetry.  For Vergil that previous influence was primarily Homer, for Dante Vergil.  Our primary goal is a close reading of both poems in their contexts, but we shall also consider how literary canons are formed, how works are re-read in later times, and what the definition of a classic is.  Both works will be read in English translation, but students with knowledge of Latin or Italian or both will be invited to contribute their perspectives based on reading in the originals as well.",
    "course_description": "Reading of Vergil's Aeneid and Dante's Divine Comedy in English translation.",
    "prerequisites": null,
    "instructors": "Niall W Slater - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Candler Library 222A",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3723, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: N. Slater, Status: Closed",
    "date_accessed": "2024-03-30"
}