{
    "course_code": "CL 487W",
    "course_title": "Special Topics in Classics: Roman Gardens and Landscapes",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 1 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": "Department Consent Required",
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Same as ARTHIST 475RW 2)\n\"Roman Gardens and Landscapes\"This seminar will consider Roman landscape from the ancient descriptions of Pliny the Younger and the vast complex of Hadrian's villa at Tivoli, to the literary gardens of the Renaissance humanists and the papal villas of Baroque Rome. Exploring the seven hills and their environs, themes will include: shaping the landscape--design and emulation; the ideology of the villa and landscape in poetry and prose; the iconographical programs of imperial and humanist gardens; hydraulics and automata in garden grottoes; fountains and sculpture programs; botany and the culture of curiosity; the changing relationship of the garden with the natural world. Throughout, we will consider the dialogue between the ancient and early modern worlds. The seminar will work closely with rare books, etchings, and maps held in the Rose Manuscript, Archive, and Rare Book Library and the Michael C. Carlos Museum.\nArt History major/minor: Division I or II\nArchitectural Studies minor: elective",
    "course_description": "Variable course topic means that supplemental topic/structure will be variable as well (options include but are not limited to film/museum/travel/lecture series/independent research/experiential learning). Alternate course to CL 329 which is variable topic without extra component.",
    "prerequisites": null,
    "instructors": "Sarah C. McPhee - Primary Instructor",
    "schedule_location": "T 1pm-3:45pm in Carlos Museum - Tate",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 5578, Section #: 2, Type: LEC, Campus: ATL, Meets: T 1-3:45p, Instructor: McPhee/Varner, Status: Closed",
    "date_accessed": "2024-03-30"
}