{
    "course_code": "CL 487W",
    "course_title": "Special Topics in Classics: War, Plague & Refugees",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 4 / Seats Avail: 2Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Continuing Writing Requirement",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Same as HIST 487RW 1)\n(This course will look at pandemics, political change, and social upheaval in the Mediterranean world from the fifth century BCE through the sixth century CE. How did the Greeks, Romans, Egyptians, and Byzantines encounter plague, and what happened to their social and religious world as a result? How did the upheaval of plague affect the lives of women and other disenfranchised members of society? We will look at the stories and accounts of those who lived through these times, and we will also examine the art and artifacts of the time period in order to evaluate material evidence along with textual narratives. This was also a period of great movement and migration, as peoples from the north and the east migrated to the Mediterranean world. How were these movements of people accommodated, and how did they change the world they encountered?)",
    "course_description": "Variable course topic means that supplemental topic/structure will be variable as well (options include but are not limited to film/museum/travel/lecture series/independent research/experiential learning). Alternate course to CL 329 which is variable topic without extra component.",
    "prerequisites": null,
    "instructors": "Mary Grace DuPree - Primary Instructor",
    "schedule_location": "M 4pm-6:45pm in Bowden Hall 118",
    "course_resources": null,
    "sections": "Class Nbr: 3823, Section #: 1, Type: LEC, Campus: ATL, Meets: M 4-6:45p, Instructor: M. DuPree, Status: Open",
    "date_accessed": "2024-03-30"
}