{
    "course_code": "FIN 499R",
    "course_title": "Special Topics: Masterclass in Global Markets",
    "credit_hours": "1.5",
    "seats": "Seats: Maximum Enrollment: 24 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Graded",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-03-14 through 2022-04-10",
    "class_notes": "Professor Kirsten Travers-UyHam and Rebecca Ginzburg 94BBA, President and COO of Junto Capital Management LP will co-teach a Masterclass in Hedge Fund Investing.  This course will enable students to design their own strategy and operational framework for the launch of an investment fund, based on best market practices.  Teams will work together to research opportunities, pitch their ideas, and simulate the trading process and management of their own fund. The course will utilize professional trading products and platforms, allowing the students to experience how global events and news impact live market prices and fund performance over time.  This course is ideal for students who are planning careers in investment management, sales and trading or Fintech\n\n\nA/D/S deadline is March 14\no\tMarch 31, April 1 and 2 (class starting Thursday afternoon through Saturday afternoon) \no\tThursday:  4-6pm (2 hours)  \no\tFriday:  9am- 4pm, including teaching time as well as students' group work (7 hours)\no\tSaturday:  9am-4pm, including teaching time as well as students' group work (7 hours)",
    "course_description": "Special topics courses include courses that address a current or timely topic, that are in a \"pilot\" phase before being offered on an ongoing basis, or that are known to be one time offerings. Special topics course offerings can vary from term to term.",
    "prerequisites": "FIN 320 or SPECSTUBUS students or equivalent transfer credit as prerequisite.",
    "instructors": "Kirsten Travers-Uyham - Primary Instructor",
    "schedule_location": "Th 4pm-6pm in Goizueta Business School - TBA\nFSa 9am-4pm in Goizueta Business School - TBA",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3976, Section #: 1177, Type: LEC, Campus: ATL, Meets: FSa 9a-4p; Th 4-6p, Instructor: K. Travers-Uyham, Status: Wait List",
    "date_accessed": "2024-03-30"
}