{
    "course_code": "ENGCW 373RW",
    "course_title": "Creative Writing: Advanced Fiction",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 7",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": "Department Consent Required",
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Permission Required Prior to Enrollment)\n\n\nApplication required. Complete course atlas information (including texts and grading) and application form will be available on the Creative Writing Program website: https://creativewriting.emory.edu/index.html\n\n\nLearning and Mastery. This is an advanced course on the art of fiction writing.  In this course you will be pushed to answer the questions: Why write?  What is this story for? Is this narrative needed?  We will consider the ethical demands of creating human beings, placing them into scenes, and setting them off into plots. Students will create personal cannons, and begin to consider their own place in the literary traditions.  We will pay close attention to the craft of fiction writing as a way to participant profoundly in being human.  The course design will be created in response to the cannons you create, the craft concerns you present, and your own submitted writing throughout the class.  In this way, we will be group of writers addressing our strengths, weakness and curiosities together.",
    "course_description": "Spring semester. Admittance by assessment of readiness for advanced work by intermediate level instructor in genre. Intensive workshop in the writing of fiction for advanced students. May be repeated for a maximum of eight hours credit.",
    "prerequisites": null,
    "instructors": "Tiphanie Yanique - Primary Instructor",
    "schedule_location": "T 2:30pm-5:30pm in Callaway Center N204",
    "course_resources": null,
    "sections": "Class Nbr: 4009, Section #: 1, Type: SEM, Campus: ATL, Meets: T 2:30-5:30p, Instructor: T. Yanique, Status: Open",
    "date_accessed": "2024-03-30"
}