{
    "course_code": "ENGCW 374RW",
    "course_title": "Creative Writing: Advanced Poetry",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 6",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": "Department Consent Required",
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Permission Required Prior to Enrollment)\n\n\nApplication required. Complete course atlas information (including texts and grading) and application form will be available on the Creative Writing Program website: https://creativewriting.emory.edu/index.html\n\n\nThis course is intended for students with a serious commitment to poetry, and a strong belief in their ability to learn among a community of people whose work will both overlap with and differ from their own. Students will strive for excellence and excitement in the regular composition and revision of new poems, as well as an ever-broadening sense of the possibilities of our art. In addition to posting poems for workshop, students will provide context for their creative work, sharing influential texts and ideas, in order to deepen the class's collective ability to understand where their poems are coming from, and where they might be headed. Readings will include full-length poetry collections and essays on craft. Each student will be responsible for guiding discussion of one book (with a partner), and attendance at all Creative Writing Reading Series events is required.",
    "course_description": "Spring semester. Admittance by assessment of readiness for advanced work by intermediate level instructor in genre. Intensive workshop in the writing of poetry for advanced students. May be repeated for a maximum of eight hours credit.",
    "prerequisites": null,
    "instructors": "Heather Christle - Primary Instructor",
    "schedule_location": "Th 2:30pm-5:30pm in Ignatius Few Building_131",
    "course_resources": null,
    "sections": "Class Nbr: 4008, Section #: 1, Type: SEM, Campus: ATL, Meets: Th 2:30-5:30p, Instructor: H. Christle, Status: Open",
    "date_accessed": "2024-03-30"
}