{
    "course_code": "ARTVIS 230",
    "course_title": "New Media Art",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": "Department Consent Required",
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "This course will introduce and identify a variety of possibilities within the genre of New Media, specifically sound art, 3-D digital space-making, and video projection. The class time will primarily be focused on hands-on creating digital artwork through demos, collaborative projects, lectures on New Media history, and in-class lab time. Readings will be geared towards providing students with a foundation of knowledge of contemporary new media artists and practices, as well as the positionality of new media within a larger cultural context. In order to help students on their own idea generation, we will also study specific aesthetics and theoretical concerns of working in new media. Through a series of workshops, projects, and a final project, students will also gain technical skills in sound editing, 3D rendering, and video editing for an art context.\nPrerequisite: ARTVIS 109 or permission from the instructor: jane.foley@emory.edu\n\n\n(Permission of Instructor Required Prior to Enrollment)\n\n\n(Prerequisite: XXX)",
    "course_description": "This course will introduce and identify a variety of formal and conceptual possibilities within the genre of New Media. Students will create art using sound art, 3-D digital space-making, and video projection.",
    "prerequisites": null,
    "instructors": "Jane Foley - Primary Instructor",
    "schedule_location": "T 1pm-4:30pm in Visual Arts 117",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3779, Section #: 1, Type: ART, Campus: ATL, Meets: T 1-4:30p, Instructor: J. Foley, Status: Closed",
    "date_accessed": "2024-03-30"
}