{
    "course_code": "PSYC 499R",
    "course_title": "Directed Research",
    "credit_hours": "1-12",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Varies by section",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "Varies by section",
    "course_description": "Credit variable. Psychology majors only, registration by permission of faculty supervisor.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 2947, Section #: 1, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Barber, Status: Open\nClass Nbr: 4027, Section #: 10, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. Dilks, Status: Open\nClass Nbr: 4028, Section #: 11, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Duke, Status: Open\nClass Nbr: 4029, Section #: 12, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. Edwards, Status: Open\nClass Nbr: 4030, Section #: 13, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: E. Emory, Status: Open\nClass Nbr: 4031, Section #: 14, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: R. Fivush, Status: Open\nClass Nbr: 4032, Section #: 15, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: S. Goodman, Status: Open\nClass Nbr: 4033, Section #: 16, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: H. Gouzoules, Status: Open\nClass Nbr: 4034, Section #: 17, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: S. Hamann, Status: Open\nClass Nbr: 4035, Section #: 18, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: R. Hampton, Status: Open\nClass Nbr: This section is full 4036, Section #: 19, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Kazama, Status: Closed\nClass Nbr: 4019, Section #: 2, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. Edwards, Status: Open\nClass Nbr: 4037, Section #: 20, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Kelly, Status: Open\nClass Nbr: 4038, Section #: 21, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: E. Kim, Status: Open\nClass Nbr: 4039, Section #: 22, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: P. Kragel, Status: Open\nClass Nbr: 4040, Section #: 23, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: S. Lourenco, Status: Open\nClass Nbr: 4041, Section #: 24, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. Maney, Status: Open\nClass Nbr: 4042, Section #: 25, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Manns, Status: Open\nClass Nbr: 4043, Section #: 26, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. McDowell, Status: Open\nClass Nbr: 4044, Section #: 27, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: L. Nygaard, Status: Open\nClass Nbr: 4045, Section #: 28, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: P. Palmer, Status: Open\nClass Nbr: 4046, Section #: 29, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: P. Rochat, Status: Open\nClass Nbr: This section is full 4020, Section #: 3, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: P. Bauer, Status: Closed\nClass Nbr: 4047, Section #: 30, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: H. Rodman, Status: Open\nClass Nbr: 4048, Section #: 31, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Tasimi, Status: Open\nClass Nbr: 4049, Section #: 32, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Treadway, Status: Open\nClass Nbr: 4050, Section #: 33, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: I. Waldman, Status: Open\nClass Nbr: 4051, Section #: 34, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: E. Walker, Status: Open\nClass Nbr: 4052, Section #: 35, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: K. Wallen, Status: Open\nClass Nbr: 4053, Section #: 36, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: B. Yamasaki, Status: Open\nClass Nbr: 4054, Section #: 37, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: B. Wilson, Status: Open\nClass Nbr: 4055, Section #: 38, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: P. Wolff, Status: Open\nClass Nbr: 6262, Section #: 39, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: N. Bliwise, Status: Open\nClass Nbr: 4021, Section #: 4, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: G. Berns, Status: Open\nClass Nbr: 4022, Section #: 5, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Cohen, Status: Open\nClass Nbr: 4023, Section #: 6, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: P. Brennan, Status: Open\nClass Nbr: 4024, Section #: 7, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Y. Cheong, Status: Open\nClass Nbr: 4025, Section #: 8, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: L. Craighead, Status: Open\nClass Nbr: 4026, Section #: 9, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: W. Craighead, Status: Open",
    "date_accessed": "2024-03-30"
}