{
    "course_code": "PSYC 799R",
    "course_title": "Doctoral Dissertation Research",
    "credit_hours": "1-12",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(S/U Only)\n\n\n(Permission Required Prior to Enrollment)",
    "course_description": null,
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 3998, Section #: 1, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: P. Palmer, Status: Open\nClass Nbr: 4007, Section #: 10, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: S. Lourenco, Status: Open\nClass Nbr: 4008, Section #: 11, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: P. Rochat, Status: Open\nClass Nbr: 4009, Section #: 12, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: S. Hamann, Status: Open\nClass Nbr: 4010, Section #: 13, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: S. Lourenco, Status: Open\nClass Nbr: 4011, Section #: 14, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Manns, Status: Open\nClass Nbr: 4012, Section #: 15, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: H. Rodman, Status: Open\nClass Nbr: 4013, Section #: 16, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: H. Gouzoules, Status: Open\nClass Nbr: 4014, Section #: 17, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: E. Walker, Status: Open\nClass Nbr: 4015, Section #: 18, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: P. Bauer, Status: Open\nClass Nbr: 4016, Section #: 19, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Bachevalier, Status: Open\nClass Nbr: 3999, Section #: 2, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Tasimi, Status: Open\nClass Nbr: 4017, Section #: 20, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. Maney, Status: Open\nClass Nbr: 4018, Section #: 21, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Kelly, Status: Open\nClass Nbr: 4000, Section #: 3, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: P. Brennan, Status: Open\nClass Nbr: 4001, Section #: 4, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: S. Goodman, Status: Open\nClass Nbr: 4002, Section #: 5, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: L. Craighead, Status: Open\nClass Nbr: 4003, Section #: 6, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. McDowell, Status: Open\nClass Nbr: 4004, Section #: 7, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Treadway, Status: Open\nClass Nbr: 4005, Section #: 8, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. Dilks, Status: Open\nClass Nbr: 4006, Section #: 9, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: L. Nygaard, Status: Open",
    "date_accessed": "2024-03-30"
}