{
    "course_code": "ELSP 521",
    "course_title": "Academic Research Article Writing",
    "credit_hours": "2",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 4",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-05-13 through 2022-08-03",
    "class_notes": "Tentative meeting time T/Th 11am-12:40pm\nResearch Article Writing: A course designed to support the writing of a research article (RA) for publication, focusing on designing a writing plan and crafting arguments as well as writing specific sections of a research article. This course is best suited for students who are currently writing or revising a research article. Some class time is spent analyzing  particular RA sections (abstract, introduction, methods, results, discussion/conclusion) in your discipline. Participants also have the chance to work on their articles, applying lessons learned from the class and receiving peer and instructor feedback.\nFor more details, contact hboldt@emory.edu",
    "course_description": "ELSP 521 an intensive analysis of the principles and revision practices of research article writing. Tools such as rhetorical, genre, and corpus analysis may be used to analyze published literature in their own field and then apply conclusions to an original piece of writing. Course content focuses on the central role of rhetorical organization, development of identifying an argument, a research gap, construction of logical arguments, data interpretation, as well other important concepts including reader-oriented writing, style, and tone.",
    "prerequisites": null,
    "instructors": "Grace Song - Primary Instructor",
    "schedule_location": "TTh 11am-12:40pm in North Decatur Bldg 101E",
    "course_resources": null,
    "sections": "Class Nbr: 2219, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 11a-12:40p, Instructor: G. Song, Status: Open",
    "date_accessed": "2024-03-30"
}