{
    "course_code": "LAW 659D",
    "course_title": "Doing Deals: Private Equity",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-14 through 2023-11-20",
    "class_notes": "Prerequisite: Business Associations (concurrently NOT okay), Contract Drafting (concurrently NOT okay), Deal Skills (concurrently okay). Recommended Prerequisites/Corequisites: Corporate Finance, Accounting in Action or Analytical Methods.\nPreselected Transactional Certificate Students will receive an email informing them how/when to\nenroll. Non-transactional certificate students who meet the pre-reqs may try to enroll during Open Enrollment.",
    "course_description": "\"The course is designed as a workshop in which law students and business students work together to structure and negotiate varying aspects of a private equity deal, from the initial term sheet stages, through execution of the purchase agreement, to completion of the financing and closing. Private equity deals that are economically justified sometimes fail in the transaction negotiation and documentation phase.\nThis course will seek to provide students with the tools necessary to understand and resolve difficult issues and complete successful transactions. Students will be divided into teams consisting of both lawyers and business people to review, consider and negotiate actual transaction documents. Issues presented will include often- contested key economic and legal deal terms, as well as common ethical dilemmas. To reinforce the key legal and financial points of an LBO transaction, there will be a short midterm and a final exam.\"",
    "prerequisites": "Transactional Law Student ONLYBusiness Associations, Contract Drafting, and Deal Skills are pre-requisites for this course. If you have not satisfied all courses, then you are not eligible to enroll at this time. Please contact Kelli.Pittman@emory.edu with all inquiries.",
    "instructors": "Kevin Crowley - Primary Instructor",
    "schedule_location": "T 4:15pm-6:15pm in Goizueta Business School - TBA",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 1030, Section #: 001, Type: LEC, Campus: ATL, Meets: T 4:15-6:15p, Instructor: K. Crowley, Status: Closed",
    "date_accessed": "2024-03-30"
}