{
    "course_code": "LAW 807A",
    "course_title": "SEM: Legal Anthropology",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 14 / Seats Avail: 2",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-14 through 2023-11-20",
    "class_notes": "What is law? Do all societies have it? Is there really something distinct about thinking like a lawyer? This course primarily draws on anthropological studies of legal systems and practices to show that the answers to these questions are surprisingly complex. We will study law both cross-culturally and, within the United States, cross-contextually, in order to explore what really distinguishes legal rules from cultural norms and to ask whether basic legal concepts exist across cultures. As we read ethnographic and other social-scientific texts, we will come to appreciate how many of our foundational assumptions regarding law are culturally specific and how legal structures both construct and are constructed by our social world.",
    "course_description": "What is law? Do all societies have it? Is there really something distinct about \"thinking like a lawyer\"? This course primarily draws on anthropological studies of legal systems and practices to show that the answers to these questions are surprisingly complex. We will study law both cross-culturally and, within the United States, cross-contextually, in order to explore what really distinguishes legal rules from cultural norms and to ask whether basic legal concepts exist across cultures. As we read ethnographic and other social-scientific texts, we will come to appreciate how many of our foundational assumptions regarding law are culturally specific and how legal structures both construct and are constructed by our social world.",
    "prerequisites": null,
    "instructors": "Deepa Das Acevedo - Primary Instructor",
    "schedule_location": "T 4pm-6pm in Gambrell Hall - 5K",
    "course_resources": null,
    "sections": "Class Nbr: 5885, Section #: 001, Type: SEM, Campus: ATL, Meets: T 4-6p, Instructor: D. Das Acevedo, Status: Open",
    "date_accessed": "2024-03-30"
}