{
    "course_code": "LAW 897",
    "course_title": "Directed Research:Specific Topics",
    "credit_hours": "1-12",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Varies by section",
    "instruction_method": "Varies by section",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2023-08-14 through 2023-11-20",
    "class_notes": null,
    "course_description": "Students may register for directed study or directed research opportunities, with the approval of a sponsoring faculty member and the Associate Dean for Academic Programs & Students or their designee. Directed study and directed research projects may range from one to four credits each semester but are typically two credits. J.D. students may take a maximum of 18 credits of directed study and/or directed research over the course of the J.D. program. Students wishing to do directed research or directed study in excess of the 18-credit limit must petition the Associate Dean for Academic Programs & Students or their designee.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 1172, Section #: 001, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. Waters Jr., Status: Open\nClass Nbr: 1170, Section #: 002, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Athans, Status: Open\nClass Nbr: 1115, Section #: 003, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Carter, Status: Open\nClass Nbr: 1178, Section #: 004, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: H. Ludsin, Status: Open\nClass Nbr: This section is full 1181, Section #: 005, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: P. Koster, Status: Closed\nClass Nbr: 1182, Section #: 006, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Broyde, Status: Open\nClass Nbr: 1186, Section #: 007, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: R. Waldman, Status: Open\nClass Nbr: 1187, Section #: 008, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Tulibacka, Status: Open\nClass Nbr: 1188, Section #: 009, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: R. Freer, Status: Open\nClass Nbr: 1192, Section #: 010, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Nevitt, Status: Open\nClass Nbr: 1193, Section #: 011, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Nash, Status: Open\nClass Nbr: 1195, Section #: 012, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Volokh, Status: Open\nClass Nbr: 1196, Section #: 013, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: N. Morris, Status: Open\nClass Nbr: 1200, Section #: 014, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: F. Smith, Status: Open\nClass Nbr: 1204, Section #: 015, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Goldstein, Status: Open\nClass Nbr: 1208, Section #: 016, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: K. Levine, Status: Open\nClass Nbr: 6795, Section #: 017, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Romig, Status: Open\nClass Nbr: 6796, Section #: 018, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: T. Jacobi, Status: Open\nClass Nbr: 6797, Section #: 019, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Fineman, Status: Open\nClass Nbr: 6806, Section #: 020, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: K. Cooper, Status: Open\nClass Nbr: 6807, Section #: 021, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Witte Jr., Status: Open\nClass Nbr: 6810, Section #: 022, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Jennings, Status: Open\nClass Nbr: 6811, Section #: 023, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. Howard, Status: Open\nClass Nbr: 6822, Section #: 024, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Acevedo, Status: Open\nClass Nbr: This section is full 6856, Section #: 025, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Sag, Status: Closed",
    "date_accessed": "2024-03-30"
}