{
    "course_code": "BUS 480",
    "course_title": "Senior Seminar: Applied Field Experience",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 0 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Seminar Description:  The goal of the Applied Field Experience seminar is to enhance the value of an internship by helping each student apply what they learn in the classroom to the workplace. You will reflect on the internship experience to identify the skills you are building, the culture of that workplace, and the work you are doing to determine how these areas inform your career progression.  The seminar is for students who will have an internship for the Fall or Spring semester only. The course is conducted through a virtual classroom and requires weekly responses and the submission of short essays. You can meet with the instructor in person or via Zoom to ask questions.  In consultation with their academic advisors, BBA students in their final term in Goizueta are permitted to work up to 40 hours per week of they have a reduced course load of 1-11 credits. If you are an international student completing an internship in a Fall or Spring term this is the required course for CPT approval. Please contact Kim Timpone (ktimpon@emory.edu) in order to enroll in this seminar.\n\n\nInstructor:  Kim Timpone is Associate Director of Coaching and Programming in the BBA Career Management Center. In her role, Kim is responsible for leading the CMC Coach team and facilitating career education programs and events for BBA students. Additionally, she serves as the liaison for the BBA Program to ISSS supporting international students as it relates to immigration matters like CPT and OPT. Prior to joining Emory, she worked in the Career Development Center at Barry University assisting students across a wide variety of majors and career interests. Kim also taught a Career Readiness course in the School of Business at Barry. Kim is a graduate of the University of South Florida with a Master of Arts in Counselor Education and she earned her Bachelor of Arts in Psychology from Florida Gulf Coast University.",
    "course_description": "Senior seminar courses fall outside the scope of traditional academic coursework, and instead allow students to learn from and interact with experienced practitioners, and to develop industry-specific insights, fine-tune career skills, and increase professional exposure.",
    "prerequisites": "This section is reserved for students in the BBA program.",
    "instructors": "Andrea Hershatter - Primary Instructor",
    "schedule_location": null,
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_BUS_480_1102_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: This section is full 5725, Section #: 1102, Type: SEM, Campus: ATL, Meets: Does Not Meet, Instructor: Hershatter/Timpone, Status: Closed",
    "date_accessed": "2024-03-30"
}