{
    "course_code": "BUS 480",
    "course_title": "Senior Seminar: Customer Success/Subscription",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 0 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Mondays, 5:30-8:00 pm - Class Dates: 1/29, 2/5, 2/12, 2/19, alternate date: 2/26 (this course will be taught on four dates for 2.5 hours)\n\n\nSeminar Description:  The subscription economy is changing business as we know it. The idea behind it is that customers are happier subscribing to the products and services they want, when they want them, rather than purchasing them with the burden of ownership.\n    This new business model is transforming the customer value economics and necessitates a new approach to retaining customers and subscribers over time. This new practice is called Customer Success and it redefines the way companies interact and serve customers leveraging new methodologies designed to maximize customer value and overall success.\nCustomer Success encompasses all customer touch points, all the way from pre-sales experiences to on-boarding, training and support and ongoing success.\n     This seminar will provide practical strategies to design, plan, execute and measure a Customer Success organization within a subscription-based business. It will cover topics such as designing the customer journey, customer success metrics, organizational structures, required skills and best practices.",
    "course_description": "Senior seminar courses fall outside the scope of traditional academic coursework, and instead allow students to learn from and interact with experienced practitioners, and to develop industry-specific insights, fine-tune career skills, and increase professional exposure.",
    "prerequisites": null,
    "instructors": "Andrea Hershatter - Primary Instructor",
    "schedule_location": "M 5:30pm-8pm in Goizueta Business School 331",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_BUS_480_1103_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: This section is full 6142, Section #: 1103, Type: SEM, Campus: ATL, Meets: M 5:30-8p, Instructor: A. Hershatter, Status: Closed",
    "date_accessed": "2024-03-30"
}