{
    "course_code": "BUS 480",
    "course_title": "Senior Seminar: Grassroots Marketing",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 0 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Mondays, 5:30-7:30 pm - Class Dates: 1/29, 2/5, 2/12, 2/19, 2/26, alternate date: 3/4\n\n\nSeminar Description:  This course is an introduction to the best practices for developing winning brand strategy and effective marketing approaches that focus on the needs of entrepreneurial ventures. It is well suited for any students from any discipline who have an entrepreneurial spirit and dreams of creating their own brand and business. Proven brand strategy frameworks, entrepreneur-focused marketing strategies and sales tactics, recent developments, trends and social networking for small and medium-sized enterprises will be examined. Requirements for developing a brand strategy and comprehensive marketing plan and pitch deck aimed at potential investors for starting or supporting an entrepreneurial venture are stressed. An in-class group project of developing a pitch presentation for an existing/planned student-led entrepreneurial venture will enable students to apply what is learned throughout the seminar. Presentations and collaboration with local entrepreneurs and entities will provide students with real world exposure and experience. Additionally, recognizing the importance of building a strong personal brand and frameworks and tools to do so will be examined and students will have the opportunity to apply what they learn.",
    "course_description": "Senior seminar courses fall outside the scope of traditional academic coursework, and instead allow students to learn from and interact with experienced practitioners, and to develop industry-specific insights, fine-tune career skills, and increase professional exposure.",
    "prerequisites": "This section is reserved for students in the BBA program.",
    "instructors": "Andrea Hershatter - Primary Instructor",
    "schedule_location": "M 5:30pm-7:30pm in Goizueta Business School 301",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_BUS_480_1101_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: This section is full 4808, Section #: 1101, Type: SEM, Campus: ATL, Meets: M 5:30-7:30p, Instructor: Hershatter/Taylor, Status: Closed",
    "date_accessed": "2024-03-30"
}