{
    "course_code": "BUS 480",
    "course_title": "Senior Seminar: Psychology of Leadership",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 0 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Tuesdays 6:00-8:00 pm - Class Dates:  1/30, 2/6, 2/13, 2/20, 2/27, alternate date: 3/5\n\n\nSeminar Description: This seminar will introduce you to what we know about relating to others in personal, social, and especially, business situations.  The ability to build strong relationships is key in driving organizational stability, change and success.\n     We will use the CBDE relationship model which suggests all relationships go through a process of Choice, Beginning, Deepening and Ending.  Different verbal and nonverbal skills are needed to successfully move from one phase of a relationship to the next.  There will be a special emphasis on how to end relationships successfully through the use of students' immediate experience of ending their own undergraduate time in a useful manner.  Hopefully, what is learned in this brief experience will provide a model for dealing with relationship challenges to come after graduation.\n     The seminar will emphasize a specific personality characteristic, Locus of Control, and a set of social skills, nonverbal ability, and focus on the parts they play in determining how successful we are in connecting to others. To make the experience more immediate and real, students will participate in the presentation of one of seven nonverbal channels and be given the opportunity to take and interpret a personality test.  All results are private and for students to learn about themselves. Finally, students will be asked to keep a brief weekly diary of the progress they are making on ending their undergraduate experience time at Emory.",
    "course_description": "Senior seminar courses fall outside the scope of traditional academic coursework, and instead allow students to learn from and interact with experienced practitioners, and to develop industry-specific insights, fine-tune career skills, and increase professional exposure.",
    "prerequisites": null,
    "instructors": "Andrea Hershatter - Primary Instructor",
    "schedule_location": "T 6pm-8pm in Goizueta Business School 301",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_BUS_480_1105_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: This section is full 6144, Section #: 1105, Type: SEM, Campus: ATL, Meets: T 6-8p, Instructor: Hershatter/Nowicki Jr., Status: Closed",
    "date_accessed": "2024-03-30"
}