{
    "course_code": "BUS 480",
    "course_title": "Senior Seminar: Life Sci./Hlthcare Start.Innov",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 0 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(Complete Topic - Life Science & Healthcare Startup Innovation)\nTuesdays 5:30-7:30 pm - Class Dates:  1/30, 2/6, 2/13, 2/20, 2/27, alternate date: 3/5\n\n\nSeminar Description: This offering is actually a \"debate class\" disguised as a business seminar. In each session students especially those with an interest and/or knack for finance, venture, and private equity will be discussing various types of existing and emerging business models of today's vast healthcare startup market. That means everything from therapeutics, to medical devices and drug delivery systems, applied genomics research and data science, to the spectrum of digital health companies, and predictive analytics and bioinformatics platforms. We will be debating the pros and cons of high-risk investments into many of these classes of innovations aiming to save lives and improve outcomes for patients. Students will take on a financial and venture diligence role to (1) assess investment opportunities and get a glimpse of why the decision to finance early stage healthcare startups can be so difficult and (2) learn what startups and investors are doing to keep the pipeline of potential cures, treatments, and viable patient solutions robust.",
    "course_description": "Senior seminar courses fall outside the scope of traditional academic coursework, and instead allow students to learn from and interact with experienced practitioners, and to develop industry-specific insights, fine-tune career skills, and increase professional exposure.",
    "prerequisites": null,
    "instructors": "Andrea Hershatter - Primary Instructor",
    "schedule_location": "T 5:30pm-7:30pm in Goizueta Business School 304",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_BUS_480_1107_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: This section is full 6147, Section #: 1107, Type: SEM, Campus: ATL, Meets: T 5:30-7:30p, Instructor: A. Hershatter, Status: Closed",
    "date_accessed": "2024-03-30"
}