{
    "course_code": "BUS 798R",
    "course_title": "Pre-Candidacy Dissertation Research",
    "credit_hours": "Varies by section",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": null,
    "course_description": "Students are supervised by their advisor as they work on research for their dissertation leading up to applying for candidacy.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 5830, Section #: 5101, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: K. Kadous, Status: Open\nClass Nbr: 5831, Section #: 5102, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: K. Towry, Status: Open\nClass Nbr: 5832, Section #: 5103, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: T. Yohn, Status: Open\nClass Nbr: 5874, Section #: 5104, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: I. Dichev, Status: Open\nClass Nbr: 5875, Section #: 5105, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: K. Sedatole, Status: Open\nClass Nbr: 5876, Section #: 5106, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Shanken, Status: Open\nClass Nbr: 5878, Section #: 5107, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: C. Green, Status: Open\nClass Nbr: 5879, Section #: 5108, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: T. Chan, Status: Open\nClass Nbr: 5880, Section #: 5110, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: V. Todri, Status: Open\nClass Nbr: 5882, Section #: 5111, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: R. Cui, Status: Open\nClass Nbr: 5889, Section #: 5112, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: P. Adamopoulos, Status: Open\nClass Nbr: 5890, Section #: 5113, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: A. Bharadwaj, Status: Open\nClass Nbr: 5891, Section #: 5114, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: N. Osadchiy, Status: Open\nClass Nbr: 5892, Section #: 5115, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: D. Lee, Status: Open\nClass Nbr: 5893, Section #: 5116, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: R. Chellappa, Status: Open\nClass Nbr: 5894, Section #: 5117, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: D. Schweidel, Status: Open\nClass Nbr: 5895, Section #: 5118, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: M. Lewis, Status: Open\nClass Nbr: 5896, Section #: 5119, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: G. Negro, Status: Open\nClass Nbr: 5897, Section #: 5120, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: M. Williams, Status: Open\nClass Nbr: 5898, Section #: 5121, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Perry-Smith, Status: Open\nClass Nbr: 5899, Section #: 5122, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: E. Hall, Status: Open\nClass Nbr: 5900, Section #: 5123, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: W. Longhofer, Status: Open\nClass Nbr: 5901, Section #: 5124, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Bockstedt, Status: Open\nClass Nbr: 5902, Section #: 5125, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: N. Jegadeesh, Status: Open\nClass Nbr: 5903, Section #: 5126, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: G. Maturana, Status: Open\nClass Nbr: 5904, Section #: 5127, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: T. Chordia, Status: Open\nClass Nbr: 5905, Section #: 5128, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: D. McCarthy, Status: Open\nClass Nbr: 5906, Section #: 5129, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: G. Maturana, Status: Open\nClass Nbr: 5907, Section #: 5130, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: W. Mann, Status: Open\nClass Nbr: 6055, Section #: 5131, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: I. Dichev, Status: Open",
    "date_accessed": "2024-03-30"
}