{
    "course_code": "HIST 599R",
    "course_title": "Research",
    "credit_hours": "1-9",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2023-05-12 through 2023-08-02",
    "class_notes": null,
    "course_description": null,
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: This section is full 1954, Section #: 1, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Andrade/Fu, Status: Closed\nClass Nbr: This section is full 1963, Section #: 10, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Team, Status: Closed\nClass Nbr: This section is full 1964, Section #: 11, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Candido/Rucker, Status: Closed\nClass Nbr: This section is full 1965, Section #: 12, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Crais/Candido, Status: Closed\nClass Nbr: This section is full 1955, Section #: 2, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Dudziak/LaChance, Status: Closed\nClass Nbr: This section is full 1956, Section #: 3, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Lowery, Status: Closed\nClass Nbr: This section is full 1957, Section #: 4, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Team, Status: Closed\nClass Nbr: This section is full 1958, Section #: 5, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: LaChance/Suddler, Status: Closed\nClass Nbr: This section is full 1959, Section #: 6, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Lesser/Rogers, Status: Closed\nClass Nbr: This section is full 1960, Section #: 7, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Miller, Status: Closed\nClass Nbr: This section is full 1961, Section #: 8, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Pandey/Yannakakis, Status: Closed\nClass Nbr: This section is full 1962, Section #: 9, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Y. Yannakakis, Status: Closed",
    "date_accessed": "2024-03-30"
}