{
    "course_code": "ENG 190",
    "course_title": "Freshman Seminar:English: Law and Literature",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Freshmen Seminar - Limited to First Year Students Only)\n\n\nCourse Topic: Law and Literature\n\n\nWhat can literature teach us about the law, and what can the law teach us about literature? Within these broad queries lurk questions about the nature of justice, punishment, human psychology, institutional structures, cultural norms, and disciplinary methodology. In this Freshman Seminar, we will consider the productive and limiting aspects of positing law and literature as opposing or complementary forces. Our legal texts will comprise some of the stickiest judicial opinions in Anglo-American law: marriage equality, racial segregation, physician-assisted suicide, even cannibalism on the high seas, while our literary texts will include genres that might surprise you, among them a contemporary allegorical fantasy and a Victorian adventure-romance novella. We will learn how to analyze and respond to caselaw as lawyers do, how to close-read and persuasively defend an argument as literary scholars do, and how to critically think and converse as informed and engaged citizens do.",
    "course_description": "Every semester. Freshmen only. Through readings on variable topics, frequent writing assignments, and in-class discussions, the seminar emphasizes reasoned discourse and intellectual community. Does not satisfy first-year writing requirement.",
    "prerequisites": null,
    "instructors": "Emma Davenport - Primary Instructor",
    "schedule_location": "TTh 8:30am-9:45am in Callaway Center S102",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 5461, Section #: 3, Type: SEM, Campus: ATL, Meets: TTh 8:30-9:45a, Instructor: E. Davenport, Status: Wait List",
    "date_accessed": "2024-03-30"
}