{
    "course_code": "ENG 190",
    "course_title": "Freshman Seminar:English: Dystopias: Hers and His",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Freshmen Seminar - Limited to First Year Students Only)\n\n\nA number of critics have described our contemporary era as a golden age for the genre of dystopian fiction. The result is that, as one commentator puts it, \"there's a book for every type of modern dread.\" Particularly prominent in this current dystopic outpouring has been the influence of women writers, in contrast to the earlier dystopias composed mainly by men.\nThis course juxtaposes 2 classic dystopias by male writers, Orwell's 1984 and Huxley's Brave New World, with 3 novels by contemporary women writers to explore how works by Ma, Butler, and Newitz are reshaping the genre. Whether post-apocalyptic, post-pandemic, or post-political, the imaginative societies envisioned by these writers pose crucial questions about where the real dangers lie for our future, and our present, through their groundbreaking dystopic novels.\nRequirements: Class attendance and informed participation, regular short response paragraphs, and two short papers, one potentially optional. Please email the instructor (martine.brownley@emory.edu) with any questions or for further information about this course.",
    "course_description": "Every semester. Freshmen only. Through readings on variable topics, frequent writing assignments, and in-class discussions, the seminar emphasizes reasoned discourse and intellectual community. Does not satisfy first-year writing requirement.",
    "prerequisites": null,
    "instructors": "Martine W Brownley - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Tarbutton Hall 111",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3825, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 1-2:15p, Instructor: M. Brownley, Status: Closed",
    "date_accessed": "2024-03-30"
}