{
    "course_code": "ENG 213W",
    "course_title": "Fictions of Human Desire",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "Course Topic: Queer Reading\n\n\nFrom its origins in oral and vernacular traditions to its performance alongside throwing shade and vogueing in the ballroom competitions captured in Paris Is Burning (1990), queer reading has evolved to mean many things, especially in the digital age. This course will explore the foundations and contemporary forms of \"queer reading,\" providing students an introduction to key issues related to the reading practices and literary communities formed around racial, sexual, and gender-based difference. We will pay special attention to the impact that the internet has had on the spread and performance of queer reading. Students will cultivate close-reading practices, writing strategies, and digital literacies engaging with texts from scholars, activists, writers, poets, and artists who have helped develop our concept of queer reading, like Audre Lorde, James Baldwin, Gloria Anzaldúa, Zora Neale Hurston, and Toni Morrison, as well as contemporary media like Rupaul's Drag Race, Contrapoints, and Pose. We will also think about queer reading's global impact and increasing commodification in economic markets. Beyond weekly close (queer) reading assignments involving collaborative annotation, students will develop a final creative and multimodal research project delving into a topic or text of their choice",
    "course_description": "An inquiry into the various expressions of human desire through readings of selected works of literature. Topics may include romance, psychoanalysis, gay and lesbian studies, or the four loves, classically conceived.",
    "prerequisites": null,
    "instructors": "Tyler Tennant - Primary Instructor",
    "schedule_location": "TTh 8:30am-9:45am in New Psyc Bldg 220 (36 Eagle Ro",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3884, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 8:30-9:45a, Instructor: T. Tennant, Status: Closed",
    "date_accessed": "2024-03-30"
}