{
    "course_code": "ENG 210W",
    "course_title": "Major Authors",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 4",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "Course Topic: Octavia Butler\n\n\nFor this course, we will read three quintessential texts from Octavia Butler's multi-decade career: Kindred, Parable of the Sower, and Fledgling. Butler's work evokes questions about time and place, while drawing our attention to real and imagined cultural, political, and ecological crises. Our conversations this semester will center the dynamics of the histories Butler draws on as potential sites of tragedy and trauma, joy and celebration, which then inform how each text projects into a past/present/future in which best- and worst-case scenarios unfold. Along with Butler's works, we will read an excerpt of Pauline Hopkins's Of One Blood (1901-1902), a graphic novel retelling of Parable, and other comparable media, such as Black Panther and the Avant Garde work of Sun Ra. To help focus our discussions, we will use an Afrofuturist framework, which explores the connections between Blackness, technology, time, and futurity and collapses hard distinctions between past, present, and future. Assignments for this course include a rhetorical analysis, a research paper, and a final creative project. Ultimately, we will discover the value of Butler's Black futures in the classroom, the canon, and in our lives.",
    "course_description": "An introduction to one or more major authors in English literature, with an emphasis on literary merit and its determination, canon formation, literary movements, and reading strategies.",
    "prerequisites": null,
    "instructors": "Ra'Niqua Lee - Primary Instructor",
    "schedule_location": "MW 8:30am-9:45am in Callaway Center C203",
    "course_resources": null,
    "sections": "Class Nbr: 3882, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 8:30-9:45a, Instructor: R. Lee, Status: Open",
    "date_accessed": "2024-03-30"
}