{
    "course_code": "ENG 214W",
    "course_title": "Global Literature In English",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Same as AAS 285W 2)\nCourse \"Topic: Home\" and the Caribbean Diaspora\n\n\nWhat does it mean to leave one home for another? Or to go home, after making a new one elsewhere? As the course title suggests, to borrow from poet Dionne Brand, students in this class will explore the idea of \"home\" through the lens of the Caribbean Diaspora by reading short stories, novels, poems, and essays of Caribbean authors living and writing outside of their home space. Texts encountered in this course will focus on themes of diaspora, exile, language, gender and sexuality, family, and self-making. Readings will include works by Jean Rhys, Edwidge Danticat, Dionne Brane, Merle Collins, Tiphanie Yanique, and Nalo Hopkinson, among others.\"Students will develop the skills necessary to write about literature through a series of creative and analytic assignments designed to engage writing in multiple modes.\"",
    "course_description": "An exploration of Anglophone literatures from around the world. Regional focus and selection of texts will vary but may include works by Achebe, Cliff, Friel, Head, Lamming, Rushdie, Silko, Soyinka, Tan, and/or Walcott.",
    "prerequisites": null,
    "instructors": "Julian H. Currents - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in New Psyc Bldg 235 (36 Eagle Ro",
    "course_resources": null,
    "sections": "Class Nbr: 5684, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: J. Currents, Status: Open",
    "date_accessed": "2024-03-30"
}