{
    "course_code": "ENG 332W",
    "course_title": "Victorian Literature",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 8",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "Course Topic: Deviant Creatures\n\n\nMany of today's most fraught social issues share at their core a central question: who counts as a full-fledged 'person,' with all the rights and privileges that accompany that status? Nineteenth-century British writers were intensely interested in this question, at a time when the British Empire was engaged in a project of defining the ideal citizen and distinguishing that person from its other subjects. One critical medium for creating, and challenging, conceptions of the liberal subject was literature.\nIn this survey course, we will explore the tangled problem of who counts as a 'person,' then and now, by examining Victorian literature's encounters with all manner of deviant creatures: monsters, matriarchs, prostitutes, and children; the enslaved, the laboring, and the queer; a Galapagos tortoise, a White Rabbit, a beloved wombat. We will intersperse poetry, non-fiction prose, and novels with (gentle) introductions to the critical and theoretical perspectives that will help us ask good questions of our readings, questions about race, empire, gender, sexuality, class, and ecology. Ultimately, we will return to our framing query: in what ways do we remain in the shadow of the nineteenth century's definition of personhood, and what are the consequences of this inheritance for us now?",
    "course_description": "Representative works from the Victorian period, including poets such as Tennyson, the Brownings, and the Rossettis, and prose writers such as Carlyle, Mill, Ruskin, and Cobbe.",
    "prerequisites": null,
    "instructors": "Emma Davenport - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in 1462 Clifton Rd 101",
    "course_resources": null,
    "sections": "Class Nbr: 5460, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: E. Davenport, Status: Open",
    "date_accessed": "2024-03-30"
}