{
    "course_code": "ENG 340W",
    "course_title": "Modern English Literature",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "This survey of twentieth-century British literature immerses us in a period of constant literary innovation as authors seek both to reflect and to inspire the changing world around them. We will focus especially on modernist writing from the turn of the century through World War II, charting a course that moves from the aftereffects of Victorian realism through major experiments in fiction, poetry, and drama. We will also trace modernism's legacy by examining selected works in each of these genres in the postwar, postmodern era. In addition to paying close attention to literary form, our discussions will cover topics including representations of consciousness and the passage of time; new conceptions of gender and class; the impact of war and the writing of memory; the figures of the artist, the adventurer, and the rebel; the fate of nature and the role of myth; and the relationships among city, country, and the world at large.\nTexts will include some (not all) of the following: novels by Joseph Conrad, Virginia Woolf, E. M. Forster, and Muriel Spark; short stories by Katherine Mansfield, Hanif Kureishi, Jackie Kay, and Zadie Smith; plays by George Bernard Shaw, Oscar Wilde, Caryl Churchill, and Samuel Beckett ; and poetry by Thomas Hardy, W. H. Auden, Philip Larkin, Stevie Smith, and Carol Ann Duffy. Course expectations include regular participation in class discussions, three essays on works from the syllabus, and a final take-home exam.",
    "course_description": "Selected works from various genres by twentieth-century authors writing in English such as Yeats, Joyce, Shaw, Eliot, Lawrence, Auden, and Thomas.",
    "prerequisites": null,
    "instructors": "Erwin Rosinberg - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Tarbutton Hall 106",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3891, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 10-11:15a, Instructor: E. Rosinberg, Status: Wait List",
    "date_accessed": "2024-03-30"
}