{
    "course_code": "ENG 348W",
    "course_title": "Contemporary Literature",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 10",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "Since the 1980s, the Anglo-American novel has seen a steep rise in 'literary' genre fiction, from William Gibson's groundbreaking Neuromancer (1984) and Cormac McCarthy's Blood Meridian (1985) to Toni Morrison's Beloved (1987). Today, formerly maligned modes of mass cultural genre: science fiction, fantasy, western, horror, romance, etc., are fully in conversation with the category of 'literary fiction.' This development has major implications for how literature is produced, bought and sold, and critiqued. To better grasp the ways genre has permeated literary culture writ large, this course draws from critical idioms and methods like Marxist literary studies, literary sociology, ethnic studies, and media studies. This course will help students learn to do genre criticism and intervene in conversations about how genres operate as literary institutions and as units of intelligibility for publishing, optioning, and adaptation in the broader cultural sphere. Readings may include novels by Gibson, McCarthy, Morrison, Kazuo Ishiguro, Ling Ma, and Stephen Graham Jones.",
    "course_description": "Selected works from various genres by writers from the 1950s to the present.",
    "prerequisites": null,
    "instructors": "Mitch Murray - Primary Instructor",
    "schedule_location": "TTh 4pm-5:15pm in Callaway Center C203",
    "course_resources": null,
    "sections": "Class Nbr: 4158, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 4-5:15p, Instructor: M. Murray, Status: Open",
    "date_accessed": "2024-03-30"
}