{
    "course_code": "ENG 357W",
    "course_title": "Southern Literature",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 15Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "What is it about southern voices that has been so compelling for readers around the world? In this course, we will look at a selection of texts by some of the most celebrated writers of the American South, with attention to the issues, both social and literary, and the aesthetics that shaped their writing. We will read novels, short stories, poems, and essays by a selection of the following: Thomas Jefferson, Edgar Allan Poe, Frederick Douglass, Harriet Jacobs, Mark Twain, Kate Chopin, Charles Chesnutt, James Weldon Johnson, Katherine Anne Porter, Zora Neale Hurston, Arna Bontemps, William Faulkner, Allen Tate, Flannery O'Connor, Carson McCullers, Gayl Jones, Cormac McCarthy, and/or others.\nParticulars: attendance and participation required; 2 short papers (5-7 pages each); in-class writing; short (2-3-page) out-of-class writing assignments; a major research paper (and accompanying oral presentation) due at the end of the semester.",
    "course_description": "The development of Southern literature with representative works by writers such as Mark Twain, Cable, Glasgow, Chesnutt, Faulkner, Welty, O'Connor, and Percy.",
    "prerequisites": null,
    "instructors": "Barbara Ladd - Primary Instructor",
    "schedule_location": "MW 8:30am-9:45am in Callaway Center C201",
    "course_resources": null,
    "sections": "Class Nbr: 3878, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 8:30-9:45a, Instructor: B. Ladd, Status: Open",
    "date_accessed": "2024-03-30"
}