{
    "course_code": "ENG 485W",
    "course_title": "Topics in Applied Research: Animals,Gender,Early Mod.Drama",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 2Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "Course Topic: Animals, Gender, and Early Modern Drama\n\n\nWhat can historical sources about gender and animals contribute to our analysis of early modern English dramas by Shakespeare and his contemporaries? How do early modern narratives about species and gender overlap and diverge? This course explores such ecofeminist questions as we bring an array of primary sources to bear upon our study of five remarkable dramas, comedies and tragedies that take up misogyny, racial difference, companionship, and service. Together, we will focus on how these literary works engage with gender as they conjure up animal metaphors, animal matter, and early modern animal practices. Over the semester, you will contemplate a variety of early modern primary sources , including Ovidian poetry, travel narratives, an animal encyclopedia, a hunting guide, a treatise on dogs, recipe books, and books about medicine and cosmetics. By asking questions of these sources, you will gain insight not only into specific dramas, but also into the process of literary interpretation. Above all, you will acquire an understanding of primary sources as starting points for independent inquiry into literary texts. You will also complete a final project on gender and animality that uses primary sources as relevant contexts for your analysis of the drama",
    "course_description": "Collaborative projects designed to deepen students' knowledge of a particular topic, and to develop individual & group research/presentation skills. Examples: archives; exhibitions; digital projects; anthologies; investigative journalism; large-scale textual analyses; public humanities projects.",
    "prerequisites": null,
    "instructors": "Patricia Cahill - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Woodruff Library 773",
    "course_resources": null,
    "sections": "Class Nbr: 3842, Section #: 1, Type: RSC, Campus: ATL, Meets: TTh 10-11:15a, Instructor: P. Cahill, Status: Open",
    "date_accessed": "2024-03-30"
}