{
    "course_code": "ENG 389W",
    "course_title": "Special Topics:Literature: Latinx Poetry",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 2Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "Course Topic: Latinx Poetry\n\n\nIn this course we will study the history of US Latinx poets, poems, and poetics from the 19th century to the present. Most early US Latinx poetry was published in Spanish, often in newspapers. Its form was quite baroque and dense during the 19th century, imitating the British and Latin American romantic poetic traditions. In the early 20th century, Latinx poets tend to follow the cues of American Modernists, using sparse prose and innovative non-traditional free verse forms. By the 1960s, Latinx poetics are deeply influenced by the Black Power, Chicano Power, and Red Power movements, often reflecting a particular politics of gender normativity and racial pride. Institutions like the Nuyorican Poets café were created to institutionalize the orality and communal spaces of poetic production emanating from the Puerto Rican struggle for rights in New York City. By the 2000s, poets are drawing on these historical poetic practices, from the sonnet to the sestina, from the epic to the haiku, demonstrating a rich tradition. We should note that Latinx poetry is also the most understudied genre in the canon of Latinx Literature.",
    "course_description": "Literary topics vary. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Nicole Guidotti-Hernandez - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Callaway Center C203",
    "course_resources": null,
    "sections": "Class Nbr: 3857, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: N. Guidotti-Hernandez, Status: Open",
    "date_accessed": "2024-03-30"
}