{
    "course_code": "ENG 389W",
    "course_title": "Special Topics:Literature: The Chinese in America",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 2Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "Course Topic: The Chinese in America\n\n\nThis course will examine the history of the Chinese presence in the United States, especially as it has been expressed in literature and popular culture. Our historical range will include the importance of Chinese trade and Chinese goods in the American Revolutionary War; the Gold Rush and the construction of the transcontinental railway; the exclusion era; and the resurgence of Chinese immigration in the late twentieth century and continuing to the present day. We will study works of social and cultural history, memoirs, fiction, poetry, and film by and about Chinese Americans. The emphasis will be on understanding the connection between the historical context of these works and the particular concerns and shape of those works.  \n \nThis course will be discussion based, so active participation is required. There will be five short essays in total, and frequent reading quizzes. \n \nTexts (tentative): Chang, The Chinese in America; Hong Kingston, China Men; Lee, The Fortune Cookie Chronicles; Kwok, Girl in Translation; Yu, Interior Chinatown; Gene Yang, American Born Chinese. Other articles by Tchen, Wu, Gen, Tsai will be available online. Films: Be Like Water, Flower Drum Song, Broken Blossoms.",
    "course_description": "Literary topics vary. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Catherine Nickerson - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Callaway Center S105",
    "course_resources": null,
    "sections": "Class Nbr: 3887, Section #: 4, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: C. Nickerson, Status: Open",
    "date_accessed": "2024-03-30"
}