{
    "course_code": "ENG 388W",
    "course_title": "Topics in Lit. & Environment: Contemporary Ecofiction",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 6Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "This course explores current environmental fiction to understand how our natural world is changing and how some of our best writers perceive these changes. The six \"cli-fi\" novels deal with today's environmental trends and in some cases imagine our present through speculative projections into a near future. All are \"Anthropocene\" texts reflecting awareness of human impacts on planetary systems as well as local environments. While novelists have traditionally focused on personal experience, many serious writers now see the boundaries between the personal and global as permeable. This shift in perspective leads to experiments in the aesthetic management of time, space, characterization, point of view, and assimilation of large scientific and social ideas. Subjects include climate instability, extinctions, involuntary migrations of both humans and animals, and global inequalities, all challenging. But the twin premises are that cognitive courage beats denial and that engaged literature is one of our most vital alternatives to fatalism. Novels: Ashley Shelby, South Pole Station; Richard Powers, The Overstory; Charlotte McConaghy, Migrations; Kim Stanley Robinson, The Ministry for the Future; Lydia Millet, A Children's Bible; Jenny Offill, Weather. Requirements: thoughtful discussion, group report, response papers, and midterm and final essays. (Students who took a previous iteration of this course under English 389 should not enroll.)",
    "course_description": "A study of literary works of various genres and other imaginative writing about the relation of humans to the non-human world. Approaches may focus on particular genres, periods, or themes (e.g.,\necofiction, ecopoetry, literature of climate change, multispecies writing, animal ethics, etc.).",
    "prerequisites": null,
    "instructors": "John Sitter - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in Callaway Center S105",
    "course_resources": null,
    "sections": "Class Nbr: 3886, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: J. Sitter, Status: Open",
    "date_accessed": "2024-03-30"
}