{
    "course_code": "ENG 490W",
    "course_title": "Seminar in Literary Interpretation",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 4",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": "Department Consent Required",
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "This course will offer guidance and support to students conducting research for their honors theses. The class will introduce honors students to research in the professional field of English. While providing information about diverse theoretical approaches to literary research, the course will give practical advice on how to conduct and describe a major research project. Through a graduate student buddy system, the course will also offer the opportunity to build partnerships with more advanced researchers in the English Department. Although the class will focus on literary research, it is designed to offer ideas and practices relevant to a variety of fields. The course will raise the question of how research and writing in English relate to ways of building and communicating knowledge in other disciplines. Above all, the class will aim to build solidarity among students conducting innovative projects and to develop awareness of the privileges and responsibilities of participating in a research community. The requirements will include weekly readings, two or more in-class presentations, the drafting and revision of a thesis prospectus, and 15 pages of thesis draft.",
    "course_description": "Fall semester. Required of honors students (other seniors may enroll with permission of director of undergraduate studies). Readings in the theory and practice of literary criticism. Designed to assist honors students in researching their theses.",
    "prerequisites": null,
    "instructors": "Laura Christine Otis - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Woodruff Library 214",
    "course_resources": null,
    "sections": "Class Nbr: 3889, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: L. Otis, Status: Open",
    "date_accessed": "2024-03-30"
}