{
    "course_code": "ENG 752R",
    "course_title": "Studies In 20th Cent. American Lit: William Faulkner",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "English 752R/ English 489W: William Faulkner\nFall 2022\nProfessor Barbara Ladd\nMeeting: MW:  10-11:15; Callaway S104\nFaulkner was an artist (his mother painted), a poet (influenced by French and British poets of the late 19th century, among others), a writer of short stories, a novelist, a screenwriter, an essayist, and one of the most widely translated and influential writers of the 20th century, a Nobel Laureate. In this course, we will undertake a study of his work, with attention to his modernism and aesthetic experiments, the social and literary worlds that shaped his work, his global reception, and his continuing significance for readers and writers in the 21st century. It is possible, if funding is available, that we will visit his home in Oxford, Mississippi.\nTexts: Selected from among the following:  New Orleans Sketches (ed. Collins); Collected Stories of William Faulkner; The Sound and the Fury, As I Lay Dying, Sanctuary, Light in August, Absalom, Absalom!, The Wild Palms/If I Forget Thee, Jerusalem, and Go Down, Moses. Recommended: William Faulkner: Early Prose and Poetry (ed. Carvel Collins); screenplays: Today We Live (1933), To Have and Have Not (1944), and The Big Sleep (1946). This is a seminar, so reading lists will be individualized to reflect the research interests of participants. \nWork:  Those taking the course for a grade will be expected to select a research focus in conjunction with their research interests. Email me for additional information.",
    "course_description": "Readings in key primary texts, critical responses, contextual and/or archival material from the period.  Course may be organized by topic or theoretical approach; or it may focus on the work of one or more key writers of the period (e.g. Eliot, Faulkner, Hughes, Baldwin, Ellison, Morrison, Silko).",
    "prerequisites": null,
    "instructors": "Barbara Ladd - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in Callaway Center C201",
    "course_resources": null,
    "sections": "Class Nbr: 6066, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 10-11:15a, Instructor: B. Ladd, Status: Open",
    "date_accessed": "2024-03-30"
}