{
    "course_code": "ENG 730R",
    "course_title": "Romanticism",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 8 / Seats Avail: 5",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Same as CPLT 752R 1)\nContent: A survey of major works of British Romanticism as they explore encounters with the untranslatable and the inhuman in global contexts traditionally defined by revolution, industrialization, and imperialism. Gayatri Chakravorty Spivak has suggested the word planetarity to help name such encounters--that is, encounters with an alterity (or otherness) unassimilable both to economic formulas of capitalist globalization and to psychic figures of interiorized subjectivity. In this seminar we will consider how romantic-era prose, poetry, and drama is inextricable from such economic formulas and psychic figures and yet also the site of their coming into crisis--the site where their norms break down. For many of these texts, 'imagination' stands in a privileged relation to such moments of breakdown. What only seems paradoxical is that the planetary stakes of romanticism emerge from its investment in imagination or what Percy Shelley--channeling Sydney--calls \"the defense of poetry.\" This seeming paradox will inform much of our work, and also serve as a point of departure to address a wide range of issues informing romantic era writing. \n \nTexts: Blake, Wollstonecraft, Equiano, Wordsworth, Coleridge, De Quincey, Byron, Percy Shelley, Keats read in conjunction with more recent critical and theoretical writing.",
    "course_description": "Readings in key primary texts, critical responses, contextual and/or archival material from the period.  Course may be organized by topic or theoretical approach; or it may focus on the work of one or more key writers of the period (e.g. Wordsworth, Coleridge, Blake, Byron, Keats, and the Shelleys).",
    "prerequisites": null,
    "instructors": "Deborah Elise White - Primary Instructor",
    "schedule_location": "T 1pm-4pm in Callaway Center C201",
    "course_resources": null,
    "sections": "Class Nbr: 4720, Section #: 1, Type: SEM, Campus: ATL, Meets: T 1-4p, Instructor: D. White, Status: Open",
    "date_accessed": "2024-03-30"
}