{
    "course_code": "ENG 489W",
    "course_title": "Special Top Adv Study:English: Louisa M.Alcott's Little Women",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 2Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "Course Topic: Louisa May Alcott's Little Women\n\n\nLittle Women, originally published in 1869, has remained continuously in print and has sold at least ten million copies. In other words, it is a significant and enduring influence on the way we describe the lives of girls and their growth into women. It is a window onto key aspects of American culture in the late-nineteenth century: the aftermath of the Civil War; ideas about children's education and about the meaning of childhood; concepts of social class and civic virtue; roles for women and men; ideals of domestic economy; the marketplace of publishing. And, as it has retained its cultural currency into the 21st century, it can also tell us about how those ideas have changed over time, and how nostalgia inflects them all. In this course, we will explore all these aspects of the novel as well as its place in the career of Louisa May Alcott, a prolific writer of sensational fiction, abolitionist fiction, and satiric essays as well the books that labelled her \"The Children's Friend.\" \n Students will explore the novel and its multiple cultural contexts through readings in the history of children's literature, making a material object related to the novel, an original research project conducted in stages and presented to the seminar, reflective essay on course learning.  \nTexts: Alcott, Little Women (I50th Anniversary Edition) with Original Illustrations; Alcott, Behind a Mask; Cheever, Louisa May Alcott: A Personal Biography.",
    "course_description": "Intensive study of specific literary topics, e.g., questions of form or history, or concentrations on one or more authors or literary movements. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Catherine Nickerson - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Callaway Center N118",
    "course_resources": null,
    "sections": "Class Nbr: 3888, Section #: 2, Type: SEM, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: C. Nickerson, Status: Open",
    "date_accessed": "2024-03-30"
}