{
    "course_code": "ENG 489W",
    "course_title": "Special Top Adv Study:English: William Faulkner",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 9Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "Course Topic: William Faulkner\n\n\nFaulkner was an artist (his mother painted), a poet (influenced by French and British poets of the late 19th century, among others), a writer of short stories, a novelist, a screenwriter, an essayist, and one of the most widely translated and influential writers of the 20th century, a Nobel Laureate. In this course, we will undertake a study of his work, with attention to his modernism and aesthetic experiments, the social and literary worlds that shaped his work, his global reception, and his continuing significance for readers and writers in the 21st century. It is possible that we will visit his home in Oxford, Mississippi.\nTexts: Some texts provided by professor. Others selected from among the following: New Orleans Sketches (ed. Collins); Collected Stories of William Faulkner; The Sound and the Fury, As I Lay Dying, Sanctuary, Light in August, Absalom, Absalom!, The Wild Palms/If I Forget Thee, Jerusalem, and Go Down, Moses. Recommended: William Faulkner: Early Prose and Poetry (ed. Carvel Collins). We will examine some of his screenplays: Today We Live (1933), To Have and Have Not (1944), and The Big Sleep (1946). This is a seminar, so reading lists will be, to some extent, individualized to reflect the research interests of participants.\nWork: short responses to scholarship and criticism; in-class writing; 2 major papers; research; presentations.",
    "course_description": "Intensive study of specific literary topics, e.g., questions of form or history, or concentrations on one or more authors or literary movements. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Barbara Ladd - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in Callaway Center C201",
    "course_resources": null,
    "sections": "Class Nbr: 3877, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 10-11:15a, Instructor: B. Ladd, Status: Open",
    "date_accessed": "2024-03-30"
}