{
    "course_code": "AFS 190",
    "course_title": "Frsh Seminar: African Studies: Paris:City of Light /Darkness?",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Same as FREN 190 1)\nFREN 190 Paris: City of Light or Darkness? The Politics of Race in 20th-21st century Paris\n(Xavier / TT 10:00-11:15am).  Cross-listed with AFS 190 (5 seats).\n \nContent:  Throughout the 20th and 21st century, Paris has enjoyed a cosmopolitan reputation for racial and intellectual freedom. From African-American writers and jazz\nmusicians fleeing the Harlem Renaissance, to Martiniquan, Senegalese and Guyanese poets seeking higher education and Chinese painters looking to learn Modernist art. Paris of the 1920's welcomed a generation of artists and thinkers of color who would go on to make world history. Yet amidst the city's renowned climate of tolerance lurked the specter of French colonization and orientalism that exploited the creative work of artists like Josephine Baker and Pan Yuling. This course will examine the struggles of migrants in Paris  over the last century analyzing their vibrant artistic production to uncover both the light and darkness of racial politics in Paris.",
    "course_description": "Introduces first-year students to the interdisciplinary field of African Studies, including historical context, sources, and methods of inquiry; aims to improve critical reading, analytical, and writing skills in small group discussion.",
    "prerequisites": null,
    "instructors": "Subha Xavier - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Candler Library 101",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 5537, Section #: 2, Type: SEM, Campus: ATL, Meets: TTh 10-11:15a, Instructor: S. Xavier, Status: Wait List",
    "date_accessed": "2024-03-30"
}