{
    "course_code": "AFS 386",
    "course_title": "Postcolonial African Art",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 8 / Seats Avail: 4Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "HAP w/Race & Ethnicity Req.",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Same as ARTHIST 365 1)\nComplete Topic - Postcolonial Arts of Africa: Museum Identity & Museum Approaches\nArtists linked to the continent of Africa often resist framing their work according to ethnic, national, or continental identities. Yet complex histories and understandings of identity often contribute to the content or reception of the artists' work. What expectations might visitors to American or European museums and galleries have about art by an artist specifically identified with the continent of Africa? And how might expectations change if the art were not presented with a qualifier that linked the artist or the work to the continent? Answers to such questions shape understandings, and they also impact where in a museum we might find an artist's work as well as the ways in which the institution might present the work. \nThe course does not require previous study of the continent of Africa or African art. We will focus on arts created for worldwide audiences by diverse artists linked to different areas of the African continent. We will look at, read about, and discuss a range of works in order to think about what various labels reveal and conceal about art and identity in national and transnational contexts. The flexible course design also invites dynamic discussion and features pen-and-paper assignments. \nArt History maj/min: Div III/IV\nArt History maj with Museums Conc: elective",
    "course_description": "Treatment of the major issues raised by the new genres of art that have resulted from the African experience of European colonization. May be repeated for credit when topic changes, up to a maximum of twelve hours.",
    "prerequisites": null,
    "instructors": "Susan Elizabeth Gagliardi - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Math & Science Center - W307C",
    "course_resources": null,
    "sections": "Class Nbr: 5521, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 10-11:15a, Instructor: Gagliardi/Nagawa, Status: Open",
    "date_accessed": "2024-03-30"
}