{
    "course_code": "ARTHIST 252",
    "course_title": "European Painting, 1590-1789",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 13Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "Humanities and Arts(*)",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "\"European Paintings and Sculpture, 1400-1700\"This course covers painting and sculpture in Italy, Spain, France, Flanders, Holland, and England from 1400-1700. We will look closely at some of the great works of the artists Donatello, Michelangelo, Leonardo da Vinci, Titian, Rubens, Caravaggio, Artemisia Gentileschi, Gian Lorenzo Bernini, Vermeer, Velazquez, Van Dyck, and more.  \n \nThis course explores the history of painting and sculpture across Europe during the early modern period. Works of art are studied both as individual monuments with intrinsic aesthetic appeal and as expressions of the needs, ideals, and aspirations of the particular society within which they were created. Artists, patrons and artistic movements are understood within the context of the expanding horizons of the age of exploration and cross-cultural encounters. Students will also be asked to consider the lasting impact of early modern painting and sculpture today. \nThis class is part of the Voluntary Core Curriculum Program and open to freshmen and sophomores only\nArt History majors/ minor: Division II",
    "course_description": "Painting in Italy, Spain, France, Flanders, Holland, and England to the time of the French Revolution. Emphasis on the production of such artists as Caravaggio, Rubens, Poussin, El Greco, Velasquez, Hals, Rembrandt, Van Dyck, Vermeer, Watteau, Fragonard, Boucher, and Greuze.",
    "prerequisites": null,
    "instructors": "Alexandra Zigomalas - Primary Instructor",
    "schedule_location": "TTh 4pm-5:15pm in Tarbutton Hall 106",
    "course_resources": null,
    "sections": "Class Nbr: 5453, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 4-5:15p, Instructor: A. Zigomalas, Status: Open",
    "date_accessed": "2024-03-30"
}