{
    "course_code": "ARTHIST 369R",
    "course_title": "Spec Stud:19th/20th Cent Art: A Play with Shabby Leftovers",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 13Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Complete Topic -  A Play with Shabby Leftovers: Collage and Assemblage)\n(This course traces collage and assemblage practices in the 20th century and into the 21st century. From the outset, we will establish theoretical models such as the Baudelairean ragpicker, the collector à la Walter Benjamin, or the bricoleur of Claude Lévi-Strauss. Drawing upon texts from the fields of anthropology, economics, literature, philosophy, and psychoanalysis, we will grapple with distinct manifestation of collage and assemblage. Students will be asked to pay particular attention to the economic and social contexts that give meaning to a given artist's choice of materials and means of production. Do such choices respond to post-war destruction, to planned obsolescence in advanced capitalism, or to the impact of globalization on developing nations? Do they express technological optimism or do they underscore the chilling sameness of mass production? Are they turned inward (as a picturing of dreamscapes) or directed outward (as a confrontation with contemporary socio-economic conditions)? The modes of collage and assemblage will be our lenses onto shifting object-subject relations in the modern and postmodern periods.)",
    "course_description": "Possible topics include Post-Impressionism and its consequences; Matisse &amp; Picasso; Art and Politics between the Wars; Dada and Surrealism; the Avant-Garde; Abstract Art; What is Art?; Theories of Modernism. May be repeated for credit when topic changes, up to a maximum of twelve hours.",
    "prerequisites": null,
    "instructors": "Lisa Lee - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Callaway Center S105",
    "course_resources": null,
    "sections": "Class Nbr: 3426, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: L. Lee, Status: Open",
    "date_accessed": "2024-03-30"
}