{
    "course_code": "ARTHIST 470RW",
    "course_title": "Sem:Ancient Mediterr/Anatolian Art: The Ancient City",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 3Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Complete Topic - The Ancient City: Urbanism & Society in Classical Antiquity)\n(Life in many areas of the ancient world was defined by cities, both as physical and conceptual landscapes. From the early origins of the Greek city-states, through colonies and planned communities across the Mediterranean, and into the great metropolises of the Hellenistic kingdoms and Roman Empire, urbanism and architectural design both influenced and was influenced by the values and identities of those that lived in them.  \nThis course will introduce students to current theoretical approaches to the study of urbanism, drawn from architectural studies, anthropology, and archaeology, as well as the major works of ancient and early modern authors from Vitruvius to Alberti. While focusing on the cityscapes of the Greeks and Romans, the course will consider the evolution of ancient urbanism from the cities of Mesopotamia, nearly 5,500 years ago, to the abandonment of Classical urban planning principles in Late Antiquity.\nWhile this course has no prerequisites, as an advanced seminar students are suggested to have some preexisting familiarity with Greek and Roman culture or architectural studies.\nArt History major/minor: Division I; Architectural Studies minor: elective)",
    "course_description": "Advanced seminar with emphasis on critical texts, methods, and techniques of art historical investigation. For art history majors; open to others with permission from the instructor.",
    "prerequisites": null,
    "instructors": "Andrew Ward - Primary Instructor",
    "schedule_location": "T 1pm-3:45pm in Carlos Hall Conference",
    "course_resources": null,
    "sections": "Class Nbr: 3432, Section #: 2, Type: SEM, Campus: ATL, Meets: T 1-3:45p, Instructor: A. Ward, Status: Open",
    "date_accessed": "2024-03-30"
}