{
    "course_code": "ARTHIST 480RW",
    "course_title": "Sem:Late18th Cont Eur&Am Art: Letters and Late Modernism",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 6 / Seats Avail: 5",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "\"Letters and Late Modernism\"This research seminar examines letters as a form of understanding late modernism, especially mid-twentieth century American abstract art. We will think about letters as forms of genre literature and consider their particular freedoms and limitations, among them a one-to-one mode of address and (often) an off-the-cuff, free-wheeling style. Beyond style, we will also consider content, asking how letters help us understand the special concerns of late modern abstract art, especially the relevance, if any, of the interior self and psychological experience to historicizing, interpreting, and evaluating works of art. Readings are drawn from primary materials and include love letters, letters to the editor, correspondence, and postcards. Authors include Clement Greenberg, John Berger, Lucy Lippard, and Chris Kraus, among others. Students will write term papers that draw on letters as resources.\nThis is an upper-level, writing-intensive seminar designed for students who have some experience with art history, typically having taken courses at the 200 or 300 level.\nArt History major/minor: Division III\nNote to students: Jean Campbell is listed as primary co-instructor, but this class will be taught by Dr. Becky Bivens.  Information will be updated once Dr. Bivens has been issued her Emory Employee ID.",
    "course_description": "Advanced seminar with emphasis on critical texts, methods, and techniques of art historical investigation. Permission from instructor required.",
    "prerequisites": null,
    "instructors": "Becky Bivens - Primary Instructor",
    "schedule_location": "T 10am-12:45pm in Carlos Hall Conference",
    "course_resources": null,
    "sections": "Class Nbr: 6610, Section #: 2, Type: SEM, Campus: ATL, Meets: T 10a-12:45p, Instructor: B. Bivens, Status: Open",
    "date_accessed": "2024-03-30"
}