{
    "course_code": "ARTHIST 475RW",
    "course_title": "Sem:Med/Euro/Renais/Baroque Art: Medieval Manuscripts",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 1 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "\"Illuminating Medieval Manuscripts\"The book as we know it was one of the most original creations of the Middle Ages, and represented a technological advance over carved stones, papyri, and scrolls that had served as writing surfaces in the ancient world.  This course turns to the evidence of medieval manuscripts to understand how the book was created in the first place, how it was produced, how the text and imagery interact, and how scholars now conceive of this rich body of material. We'll begin with Kurt Weitzmann's landmark study Illustrations in Roll and Codex (1947) that argues for creation of the book or codex by the 2nd century CE using the evidence of illustrations of Homer, and delve into scholarship by Michael Camille and others about how the imagery of manuscripts extends and editorializes on the text. Case studies include Irish illuminated manuscripts like the Book of Kells, intensely illustrated medieval Psalters that Christianize this chapter in the Hebrew Bible, medieval Bestiaries and other specialized texts, and private devotional works like the Hours of Jeanne d'Evreux. The course will draw upon medieval manuscript facsimiles in the Rose Library, as well as the Candler Bible, an original, thirteenth-century preacher's bible from Paris.  \nArt History major/minor: Division II",
    "course_description": "Advanced seminar with emphasis on critical texts, methods, and techniques of art historical investigation. For art history majors; open to others with permission from the instructor.",
    "prerequisites": null,
    "instructors": "Elizabeth Pastan - Primary Instructor",
    "schedule_location": "Th 10am-12:45pm in Carlos Hall Conference",
    "course_resources": null,
    "sections": "Class Nbr: 3434, Section #: 1, Type: SEM, Campus: ATL, Meets: Th 10a-12:45p, Instructor: E. Pastan, Status: Wait List",
    "date_accessed": "2024-03-30"
}