{
    "course_code": "ARTHIST 719R",
    "course_title": "Seminar: Ancient Egypt Art/Arch: Ancient Egyptian Afterlife",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 8 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Complete Topic: The Discovery of the Ancient Egyptian Afterlife \nIt is a well-established idea that the ancient Egyptians went to great lengths achieve eternal life, including such practices as mummification and the construction of often huge and lavishly equipped tombs. However, on closer scrutiny, the Egyptian sources are much less occupied with ideas like eternal life and preservation of the body than this framework would lead us to believe, raising the question of how the modern understanding of ancient Egyptian mortuary religion came about. Through close examination of both primary and secondary sources, this seminar explores the development of the modern concept of the ancient Egyptian afterlife in Western history. In the formative period of the long 19th century in particular, interpretations of the Egyptian afterlife were heavily tinged by broader contemporary ideas in such areas as biblical and Classical scholarship, theology, and ethnography, while also being inextricably bound up with colonial concerns, and the seminar examines these various backdrops and influences to understand how they have helped shape interpretations of the ancient Egyptian sources.",
    "course_description": "Advanced seminar on the art and/or architecture of Ancient Egypt with emphasis on critical texts, methods, and techniques of art historical investigation. For art history majors; open to others with permission from the instructor.",
    "prerequisites": null,
    "instructors": "Rune Nyord - Primary Instructor",
    "schedule_location": "M 2:30pm-5:15pm in Carlos Hall Conference",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3437, Section #: 1, Type: SEM, Campus: ATL, Meets: M 2:30-5:15p, Instructor: R. Nyord, Status: Closed",
    "date_accessed": "2024-03-30"
}