{
    "course_code": "ARTHIST 729",
    "course_title": "Seminar: Classical Art/Architect.: Reconstructing Anc Rome",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 6",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "\"Reconstructing Ancient Rome in the Renaissance: \nPirro Ligorio's Anteiequae Vrbis Imago of 1561\"In 1561, the Renaissance artist, antiquarian and archaeologist, Pirro Ligorio, published his reconstruction of ancient Rome, the Anteiquae Urbis Imago.  Ligorio, one of the leading figures in 16th century Roman humanism, based his reconstruction on a close scrutiny of surviving monuments, like the Colosseum or the Pantheon, but also on evidence from ancient coins, texts and inscriptions.   In addition, Ligorio  had access to much archaeological material that is now lost. Emory owns a very rare edition of Ligorio's map, now housed in the Rose Manuscript, Archives and Rare Book Library.   This course will consider the history and topography of the ancient city and investigate individual monuments featured on the map and compare Ligorio's reconstructions and the evidence he was using with current scholarly assessments. We will also be exploring related materials in the rare book library including Giovanni Battista Piranesi's Le Antichitá Romane.  We will also be working closely with ECDS on our digital platform \"Views of Rome\" and students will be developing new entries for or the digitized  map.",
    "course_description": "Advanced seminar on classical art and/or architecture of the with emphasis on critical texts, methods, and techniques of art historical investigation. For art history majors; open to others with permission from the instructor.",
    "prerequisites": null,
    "instructors": "Eric Varner - Primary Instructor",
    "schedule_location": "T 1pm-3:45pm in Carlos Museum - Tate",
    "course_resources": null,
    "sections": "Class Nbr: 3441, Section #: 1, Type: SEM, Campus: ATL, Meets: T 1-3:45p, Instructor: E. Varner, Status: Open",
    "date_accessed": "2024-03-30"
}