{
    "course_code": "HLTH 190",
    "course_title": "Freshman Seminar Human Health: Black Bile to Digital Depress.",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 6 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Same as FREN 190 2)\nFrom Black Bile to Digital Depression: The History of Melancholy in Science, Literature, Art, and Media\nCórdova MW 10:00-11:15am\nContent: Throughout Western history, the nature of melancholy (\"depression,\" in today's terms) has inspired, and baffled, thinkers, doctors, artists, and writers. There has been a proliferation of concepts and theories of melancholy over thousands of years, with each discourse relating in different ways to broader social, philosophical, and artistic concerns. This Freshman seminar offers a comparative survey of these discourses and their related issues: ideological, social, aesthetic, and scientific, from the Ancient Greeks onwards. We will focus on the ways in which melancholy has been thought and theorized in medicine, theology, psychoanalysis, psychiatry, ethnography, and philosophy; on how it raises crucial problems related to politics, society, culture, and gender; and on the modes through which melancholy has been felt and expressed in literature, visual art, music, and social media. \nRequired Texts: \n(1) Sartre, Nausea - 9780811220309\n(2) Radden, The Nature of Melancholy - 019515165",
    "course_description": "Seminar on various human health topics.",
    "prerequisites": null,
    "instructors": "Chad Cordova - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in MODERN LANGUAGE_128",
    "course_resources": null,
    "sections": "Class Nbr: 5906, Section #: 2, Type: SEM, Campus: ATL, Meets: MW 10-11:15a, Instructor: C. Cordova, Status: Open",
    "date_accessed": "2024-03-30"
}