{
    "course_code": "HLTH 385",
    "course_title": "Special Topics: Human Health: 21 Century HLTH & Well-Being",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 50 / Seats Avail: 5Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "Complete Topic - 21st Century HLTH & Well-Being: Ancient Practices Meet Modern Science. All the opportunities of the modern world are ours for the taking. Yet many of us fail to benefit fully from these opportunities, because we struggle with depression and anxiety. And we are not alone. More people are taking antidepressants than ever before, and yet rates of depression and anxiety continue to rise, especially in young adults. This course is designed to help to help us understand why this is the case and what we can do about it. We will explore why depression evolved in humans, why conditions in the modern world tend to promote distress rather than satisfaction and why medications alone are not likely to solve our problems. Following this, we will explore how more ancient and holistic healing practices can be harnessed to enhance our emotional well-being. Among the ancient practices to be discussed will be hyperthermia, fasting, long distance running, orgasm, compassion meditation, building purpose and psychedelic plant-based medicines.",
    "course_description": "Seminar of lecture series of topics in human health. May be repeated for credit when topic varies. Credit varies from one to four hours.",
    "prerequisites": null,
    "instructors": "Charles L Raison - Primary Instructor",
    "schedule_location": "Th 10am-11:15am in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 2956, Section #: 1, Type: LEC, Campus: ATL, Meets: Th 10-11:15a, Instructor: Raison/Noble, Status: Open",
    "date_accessed": "2024-03-30"
}