{
    "course_code": "HLTH 373",
    "course_title": "Delivering Health",
    "credit_hours": "2",
    "seats": "Seats: Maximum Enrollment: 40 / Seats Avail: 9Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "This course provides an overview of the US health care system and its ability to deliver health. It draws on several disciplines - organizational theory, business and economics: to inform analyses and discussion. Sectors, such as the hospital and that providing mental health care, are examined in terms of structure, financing and performance. It addresses questions such as: how and how well does the system serve people who are acutely, chronically or mentally ill? How can we increase the value of health care in the US? How do health care, community care and public health intersect? The course consists of lectures, class discussions, and presentations by practitioners in the field. The primary text is: Delivering Health Care in America: A Systems Approach. It is supplemented by readings from other texts, journals and the lay press.",
    "course_description": "This course employs multiple perspectives, including organizational theory, business, and economics, to examine the structure, financing, and performance of the US health care system and its ability to deliver health. Mental health, long-term care, and public health sectors are explored in depth.",
    "prerequisites": null,
    "instructors": "Victoria L Phillips - Primary Instructor",
    "schedule_location": "T 2:30pm-4:10pm in 1462 Clifton Rd 113",
    "course_resources": null,
    "sections": "Class Nbr: 2966, Section #: 1, Type: LEC, Campus: ATL, Meets: T 2:30-4:10p, Instructor: V. Phillips, Status: Open",
    "date_accessed": "2024-03-30"
}