{
    "course_code": "HLTH 485",
    "course_title": "Variable Topics in Human Health: Clinical Perspec. Global Hlth",
    "credit_hours": "2",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "This course is designed to be an introduction to concepts in Global Health. Students will be exposed to core global health competencies through formal didactic sessions, skills workshops, and relevant clinical experiences. The Consortium of Universities for Global Health (CUGH) has identified 12 competency domains applicable to 21st Century Global Health Practitioners. The course will provide students with basic education across these domains with an emphasis on Global Burden of Disease, Globalization of Health and Health Care, Ethics, and Health Equity. Didactic sessions will be led by the course directors as well as by guest lecturers from the School of Medicine, School of Public Health, Emory Global Health Institute, and CDC. Speakers will be encouraged to build connections with course students for future collaboration in research and global health related projects (i.e. during Discovery). Skills workshops will be led by residents in the Pediatric and Internal Medicine global health tracks. Clinical experiences will be observational and hands-on in nature and will take place in relevant \"local-global\" settings such as the Clarkston Community Health Center, Oakhurst Medical Center, or Emory Travel Medicine. Permission Only.",
    "course_description": "Seminar or lecture in various topics on human health. May be repeated for credit (up to 9 hours) when topic varies.",
    "prerequisites": null,
    "instructors": "Brittany Murray - Primary Instructor",
    "schedule_location": "F 1pm-3pm",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2929, Section #: 1, Type: LEC, Campus: ATL, Meets: F 1-3p, Instructor: B. Murray, Status: Closed",
    "date_accessed": "2024-03-30"
}