{
    "course_code": "BSHES 504D",
    "course_title": "Social Behavior In Public Health",
    "credit_hours": "2",
    "seats": "Seats: Maximum Enrollment: 23 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "Distance Learning",
    "typically_offered": "Summer",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2021-05-21 through 2021-08-06",
    "class_notes": "Permission Only - Program Approval to Take Courses Required\n\n\nAll EMPH courses are online and asynchronous with the exception of online synchronous sessions on opening weekend (5/21-5/23) and Closing Day (8/6).",
    "course_description": "The purpose of this course is to describe how behavioral and social science theories, research methods, and practice models can be used to understand and intervene upon public health problems.  The social ecological model provides the conceptual framework for the course with an emphasis on the importance of primary prevention.  Students will gain an understanding of how factors at the individual, intrapersonal, community and public policy levels interact to influence health over the life course.  The course introduces theories at each of these levels and how to use these theories to inform intervention design.  It includes a review of risk factors for the leadings causes of morbidity and mortality and a detailed discussion of how social and economic inequalities and other factors influence health (e.g., social class, culture, race/ethnicity, and gender).  The course concludes with a discussion of translating knowledge to action and bringing evidence-based interventions to scale.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": "FSa 8:30am-11:30am in ONLINE\nF 8:30am-11:30am in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2083, Section #: 901, Type: SEM, Campus: ATL, Meets: FSa 8:30-11:30a, Instructor: G. Baldwin, Status: Closed\nClass Nbr: This section is full 2084, Section #: 902, Type: SEM, Campus: ATL, Meets: FSa 8:30-11:30a, Instructor: R. Noonan, Status: Closed",
    "date_accessed": "2024-03-30"
}