{
    "course_code": "LAT 320",
    "course_title": "Medieval Latin",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 9",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Spring",
    "requirement_designation": "Humanities, Arts, Language [Foreign Language]",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "We'll read selections from Latin literature from the 4th-13th centuries: prose (history, biography, personal letters, saints' lives) and poetry (epic, lyric, hymns and drinking songs) by both men and women. The text used is the second edition of Karl Harrington's Medieval Latin, revised by Joseph Pucci, but readings will be tailored to fit students' own interests and level of reading facility, and so we will draw from other collections too, including on-line. \n\tAll classes will be synchronous, on Zoom. Class time will center on translation and discussion of the literary and historical background of the works we are reading. Grades are based on class participation and weekly short assignments of written translation or interpretation of text (all open book). At the end of the semester, each student will choose a work for everyone to read, give a short report on the work chosen, and then lead us through the translation and discussion. Instead of an exam, students will do a research paper (about 10 pages) on the work they presented. \n\tTexts used:\nKarl Harrington and Joseph Pucci, Medieval Latin. 2nd edition, 1997. University of \tChicago. (Required; be sure to get 2nd edition)\nCassell's Standard Latin Dictionary or another Latin dictionary (Collins; Oxford, etc.). \t(Recommended; be sure you have a good dictionary).\nT",
    "course_description": "An introduction to Latin of the medieval world, including grammar and readings in a variety of texts from the fourth to thirteenth centuries.",
    "prerequisites": null,
    "instructors": "Judith Evans-Grubbs - Primary Instructor",
    "schedule_location": "TTh 11:20am-12:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 5300, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 11:20a-12:35p, Instructor: J. Evans-Grubbs, Status: Open",
    "date_accessed": "2024-03-30"
}