{
    "course_code": "IDS 216W",
    "course_title": "Visual Culture",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 3Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2023-05-12 through 2023-06-21",
    "class_notes": "Topic: Vis. Culture of Popular Music It was the sound of the city collapsing. In the measured, deliberate noise, words tumbling past each other so fast it was almost impossible to tell them apart, you could hear social facts begin to break up...It sounded like fun, wrecking the world.\" This is how music journalist Greil Marcus described his first encounter with punk rock. For him and countless others like him, popular music is more than a source of entertainment; it is a potent mechanism of cultural critique and a fundamental shaper of identity. Long before MTV created the demand for music videos, a visual culture of music existed in the album covers, fanzines, logos, and promo materials associated with popular music. This was especially evident in the fashion that came to represent the cultural or political values of a musical scene. As an intro to the rapidly expanding, interdisciplinary field of Visual Studies, this course will offer instruction in theory and analysis of the visual culture of popular music in the 20th century. The class will take as its focus a number of musical genres and performers of the past century. What can we learn about a given time and place in history through an examination of its audiovisual texts? How can popular music be viewed as a marker of political or social values? Can popular music inspire revolutionary action? Students will be invited to apply the analytical tools and methodologies acquired in the class to contemporary popular music.",
    "course_description": "History of the use of visual images in Western culture. Study of tools necessary to read images, including still and moving images, performance, and display.",
    "prerequisites": null,
    "instructors": "Laura Hunt - Primary Instructor",
    "schedule_location": "MWF 1pm-2pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 1295, Section #: 1, Type: LEC, Campus: ATL, Meets: MWF 1-2p, Instructor: L. Hunt, Status: Open",
    "date_accessed": "2024-03-30"
}