{
    "course_code": "BIOS 520",
    "course_title": "Clinical Trials",
    "credit_hours": "2",
    "seats": "Seats: Maximum Enrollment: 80 / Seats Avail: 25",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-16 through 2024-04-29",
    "class_notes": "Prerequisites: BIOS 500 or BIOS 510 and knowledge of SAS or R or permission of instructor.",
    "course_description": "Prerequisites: BIOS 500 or BIOS 506 or permission of instructor. This course is intended to not only provide a basic grounding in all aspects of the conduct of clinical trials from the perspective of a biostatistician, but also teach students the state-of-the-art knowledge in clinical trials and help them find clinical trial related jobs in pharmaceutical companies, hospitals, oncology research institutes, etc. \nTopics of this course include generic drug development, new drug development, pre-clinical trial, the state-of-the-art designs for contemporary Phase I, II, and III clinical trials, protocol writing, hypothesis, methods of randomization, blinding, sample size determination, ethics, subject recruitment, data collection, quality control, monitoring outcomes and adverse events, interim analysis, data analysis, issues with data analysis, reporting, interpreting results, and current advances in clinical trials",
    "prerequisites": null,
    "instructors": "Traci Leong - Primary Instructor",
    "schedule_location": "Th 5pm-6:50pm in R. Randall Rollins Bldg. RL 40",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_BIOS_520_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 1060, Section #: 1, Type: LEC, Campus: ATL, Meets: Th 5-6:50p, Instructor: Leong/Busch, Status: Open",
    "date_accessed": "2024-03-30"
}