{
    "course_code": "BIOS 797R",
    "course_title": "Directed Study",
    "credit_hours": "1-9",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Varies by section",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Varies by section",
    "course_description": "Provides an in-depth exposure to specific topics not covered in regular courses, for example, statistical genetics and specialized experimental designs.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 1084, Section #: 10, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: L. Waller, Status: Open\nClass Nbr: 1085, Section #: 11, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Yang, Status: Open\nClass Nbr: This section is full 5693, Section #: 12, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Yang, Status: Closed\nClass Nbr: This section is full 5819, Section #: 13, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Y. Ko, Status: Closed\nClass Nbr: This section is full 5820, Section #: 14, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Lau, Status: Closed\nClass Nbr: This section is full 5821, Section #: 15, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: B. Risk, Status: Closed\nClass Nbr: This section is full 5869, Section #: 16, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Y. Hu, Status: Closed\nClass Nbr: This section is full 5881, Section #: 17, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: R. Nabi, Status: Closed\nClass Nbr: This section is full 6380, Section #: 19, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Epstein, Status: Closed\nClass Nbr: 1076, Section #: 2, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Yang, Status: Open\nClass Nbr: This section is full 6398, Section #: 20, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Y. Guo, Status: Closed\nClass Nbr: 1077, Section #: 3, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: H. Chang, Status: Open\nClass Nbr: 1078, Section #: 4, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Y. Hu, Status: Open\nClass Nbr: 1079, Section #: 5, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: L. Peng, Status: Open\nClass Nbr: 1080, Section #: 6, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: L. Peng, Status: Open\nClass Nbr: 1081, Section #: 7, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: B. Risk, Status: Open\nClass Nbr: 1082, Section #: 8, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: R. Nabi, Status: Open\nClass Nbr: 1083, Section #: 9, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: B. Risk, Status: Open",
    "date_accessed": "2024-03-30"
}