{
    "course_code": "HC 509",
    "course_title": "The Making of Global Christianity",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 23 / Seats Avail: 9",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-16 through 2024-04-29",
    "class_notes": "(HYBRID; required attendance ON CAMPUS Tuesdays 2:30-4:30pm; remaining contact time fulfilled via asynchronous online engagement)",
    "course_description": "Christianity was a demonstrably global faith (with its center of gravity in Africa, Asia, and the Middle East) before it became a predominantly Western religion (c. 1500). Now, after roughly five centuries, it has once again reemerged as a hugely non-Western phenomenon. A full historical account reveals a faith that is inherently global because it is ultimately local and therefore never fully defined by any historic phase or context. This course provides an exploration of Christianity's 2,000 year history with a primary focus on the processes of cross-cultural transmission and the critical elements that have defined the experience and expression of the faith in successive heartlands. Five core issues will guide the discussion: the translation principle (or indigenous appropriations and vernacular expressions of the faith); the agents and agencies of missionary expansion; major movements of reformation and renewal; interaction with other major faiths; and causative factors in the periodic shifts or extermination of the faith.",
    "prerequisites": null,
    "instructors": "Jehu Hanciles - Primary Instructor",
    "schedule_location": "T 2:30pm-4:30pm in Rita Anne Rollins Building_411",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_HC_509_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 5448, Section #: 1, Type: LEC, Campus: ATL, Meets: T 2:30-4:30p, Instructor: J. Hanciles, Status: Open",
    "date_accessed": "2024-03-30"
}