{
    "course_code": "DANC 226",
    "course_title": "Topics in Somatic Practices: Contact Improvisation",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 23 / Seats Avail: 15",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Physical Education and Dance",
    "permission": "Department Consent Required",
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "We recommend completing one semester of DANC 150 Movement Improvisation prior to taking this course. Contact Improvisation, an improvised duet form, explores partnering through many techniques including weight-sharing, counter balancing, momentum and stillness. We focus on bodily awareness and physical reflexes rather than consciously controlled movements. Movers shift direction, velocity, momentum and the quality of touch as they explore dancing together. In this course, dancers concentrate on how partnering with others enables them to feel sensations in their own body more acutely. All levels of movement experience--from none to some--can come experience the joy of improvising through contact! We recommend completing one semester of DANC 150 Movement Improvisation prior to taking this course.\n\n\n(Permission Required Prior to Enrollment)\n\n\nPlease email Greg Catellier, gcatell@emory.edu for a permission number and let him know if you have taken DANC 150R.",
    "course_description": "Somatic movement education builds a relationship between the body and mind by guiding the mover through a process of full body integration. A variety of somatic practices may be covered, including Bartenieff Fundamentals, Iyengar-based yoga, and core movement training. Somatic practices can be applied to everyday activities and performance, affecting levels of confidence and encouraging authenticity.",
    "prerequisites": null,
    "instructors": "Gregory Catellier - Primary Instructor",
    "schedule_location": "TTh 4pm-5:15pm in Schwartz Center Studio 255",
    "course_resources": null,
    "sections": "Class Nbr: 3097, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 4-5:15p, Instructor: O'Neal/Catellier, Status: Open",
    "date_accessed": "2024-03-30"
}