{
    "course_code": "ENG 190",
    "course_title": "Freshman Seminar:English",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 14 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "Course Topic: Witchcraft and Early Modern Drama\n\n\nJust about everyone is familiar with the witches of Macbeth, but less well known is the fact that, in Shakespeare's day, plays about witches were common. This class offers you the opportunity to take a deep dive into dramas by major playwrights from 16th and 17th century England. In addition to Macbeth, we'll read a selection of plays marked by brilliant language and vivid stage spectacle, including Thomas Middleton's The Witch, about romantic  triangles, unwanted pregnancy, and a range of occult practices such as potions and flight ; Samuel Rowley, Thomas Dekker, and John Ford's The Witch of Edmonton, about a real woman executed for having made a deal with a dog who may be the devil; John Marston's tragedy Sophonisba, which features a witch derived from the classics who has been described as \"the most disgusting and horrid figure in early modern drama\"; John Webster's great revenge tragedy The Duchess of Malfi, which ponders female power, toxic masculinity, witchcraft, and werewolves;  and Thomas Heywood and Richard Brome's The Late Lancashire Witches, an over-the-top domestic comedy based on a real witchcraft investigation.  Throughout the semester, we'll explore some potent historical contexts; hone close reading skills; and articulate what these dramas might say to us now about race, gender, sexuality, class and able-bodiedness.",
    "course_description": "Every semester. Freshmen only. Through readings on variable topics, frequent writing assignments, and in-class discussions, the seminar emphasizes reasoned discourse and intellectual community. Does not satisfy first-year writing requirement.",
    "prerequisites": null,
    "instructors": "Patricia Cahill - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Candler Library 122",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2465, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: P. Cahill, Status: Closed",
    "date_accessed": "2024-03-30"
}