{
    "course_code": "ENG 206W",
    "course_title": "Introduction to Narrative",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 2",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "Joan Didion writes, \"we tell ourselves stories in order to live.\" In this course, we will focus on the structure of narrative-how different writers tell stories and how they explore the limits of what shape a narrative can take. We will explore the phenomena of deeply unreliable narrators, of authors who become obsessed with the stories they tell, of how suspenseful narrative affects the body, of visual storytelling in film, of how conventions of popular culture genres can be recombined in startling ways. We will see stories in the form of recipes, stories where the real and the unreal are hard to distinguish, stories that work to expose layers and layers of meaning around a single event, stories that refuse to come to a resolution or end.\nTexts (tentative): Christie, The Murder of Roger Ackroyd, Yu, Interior Chinatown, Machado, In the Dream House, Morrison, The Bluest Eye, Johnson, The Feather Thief, Fadiman, The Spirit Catches You and You Fall Down; short stories, essays, and poems by Conan Doyle, Matthews, Perec, Queneau, Jen, Didion, Dunne, Brooks, Dickinson, Loomis, O'Hara; documentary films I'll Be Gone in the Dark, LulaRich, and The Jinx.",
    "course_description": "An introduction to the study of narrative, with an emphasis on narrative fiction and the critical vocabulary used to describe it. Readings will vary by semester, and may include examples from other disciplines.",
    "prerequisites": null,
    "instructors": "Catherine Nickerson - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Tarbutton Hall 105",
    "course_resources": null,
    "sections": "Class Nbr: 2758, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 10-11:15a, Instructor: C. Nickerson, Status: Open",
    "date_accessed": "2024-03-30"
}