{
    "course_code": "ENG 312W",
    "course_title": "Studies In Shakespeare",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 2",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Summer",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "Course Topic: Shakespeare and (De)colonialism\n\n\nScholars of colonialism question the extent to which it is possible to use the 'master's tools' to dismantle the master's house and 'construct something better.' What does this mean for Shakespeare, a centerpiece of the literature curriculum and ordained 'master' of the English language? Shakespeare occupies a privileged place both in the white male canon and in the history of colonialism. His works were deployed in imperial projects and often celebrated as evidence of Western cultural supremacy. However, at the same time, Shakespeare has been mobilized for anti-racist and anti-colonial purposes. As scholars Katherine Gillen and Lisa Jennings note, works like Aimé Césaire's Une Tempête and Toni Morrison's Desdemona 'disrupt the colonial imaginaries that continue to inflict political and epistemological violence on colonized subjects.'\nIn this course, we will draw on anti-racist, feminist, and decolonial practices as we read through Shakespeare's texts and more modern appropriations of his works to accomplish the following learning objectives: (1) attend to the specific geographies, cultures, epistemologies, and colonial/racial histories embedded in our current political, social moment as they pertain to readings of Shakespeare; (2) pursue intersectional understandings of identity in Shakespeare's works; and (3) center critical and creative responses to Shakespeare by BIPOC artists and critics.",
    "course_description": "Special topics in the study of Shakespeare. May include historical approaches, thematic emphases, performance studies, etc.",
    "prerequisites": null,
    "instructors": "Kelly Duquette - Primary Instructor",
    "schedule_location": "TTh 8:30am-9:45am in Rich Building 108",
    "course_resources": null,
    "sections": "Class Nbr: 4100, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 8:30-9:45a, Instructor: K. Duquette, Status: Open",
    "date_accessed": "2024-03-30"
}