{
    "course_code": "ENG 290W",
    "course_title": "Topics in Literary History: Survey Latinx Lit.(1900-Pres.)",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 10",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "Course Topic: Survey in Latinx Literature (1900 to the Present)\n\n\nBy 1898, the era of U.S. imperialism in the Caribbean and Pacific had come to fruition in the Spanish-American War. With annexation of Puerto Rico and the Philippines to the United States and Cuban independence from Spain and the abolition of slavery on the island nation, long established networks between the Caribbean and mainland U.S. became even stronger. Further, Mexican origin peoples within U.S. borders consolidated their presence in the U.S. as settler colonials accompanied by new migration caused by the Mexican Revolution. With further U.S. military intervention in Central America, including construction of the Panama Canal, the nation saw an increase in migration from the region, that only intensified with U.S. military intervention in the during the 1970s and 1980s. All of these political and social changes make for the themes and context of study for this second half of the Latinx Literature Survey 1898-Present. With an eye towards gender, sexuality, race, and religion, we will analyze novels, short stories, poetry, newspaper articles, and memoirs written by Latinx writers that reflect these political and demographic changes in the United States.",
    "course_description": "Long historical surveys of national, regional, or ethnic traditions; or of genres or subgenres. Examples: History of African Literature, History of Latinx Literature, History of Science Fiction, History of the Sonnet, History of Southern U.S. Literature, History of Drama.",
    "prerequisites": null,
    "instructors": "Nicole Guidotti-Hernandez - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in 1462 Clifton Rd 101",
    "course_resources": null,
    "sections": "Class Nbr: 2747, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 10-11:15a, Instructor: N. Guidotti-Hernandez, Status: Open",
    "date_accessed": "2024-03-30"
}