{
    "course_code": "ENG 357W",
    "course_title": "Southern Literature",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 21",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "Content: A study of southern literature from the American Revolutionary period forward to the late 20th century, with attention to literary and historical contexts and some of major voices in southern writing. No electronics may be used in the classroom. NOTE: You will encounter offensive language (racist, sexist, classist language including obscenities) and ideas as well as some graphic scenes of violence in our reading material.\nTexts: Edgar Allan Poe, The Portable Edgar Allan Poe; Mark Twain, Great Short Works of Mark Twain; James Weldon Johnson, The Autobiography of an Ex-Colored Man; Katherine Anne Porter, The Collected Stories of Katherine Anne Porter; William Faulkner, Go Down, Moses; Flannery O'Connor, Wise Blood; Carson McCullers, The Ballad of the Sad Café and Other Stories; one text from among those listed on an independent reading list I provide; a selection of poems, stories, and/or essays to be provided by professor.\nWork: Weekly reflections/responses/presentations--there will be 8-10 of these (40%); Short Paper 1 (10%); Examination Paper (15%); Long Paper (25%); Attendance/Engagement/ Participation (10%). Research required. Participation means substantive contributions to discussion, evidence of having read the material prior to discussion in class.",
    "course_description": "The development of Southern literature with representative works by writers such as Mark Twain, Cable, Glasgow, Chesnutt, Faulkner, Welty, O'Connor, and Percy.",
    "prerequisites": null,
    "instructors": "Barbara Ladd - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Callaway Center N204",
    "course_resources": null,
    "sections": "Class Nbr: 2755, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: B. Ladd, Status: Open",
    "date_accessed": "2024-03-30"
}