{
    "course_code": "ENG 389",
    "course_title": "Special Topics: Literature: Feminist and Queer Memoir",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 2Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "Course Topic: Feminist and Queer Memoir\n\n\nIn this course, we will explore forms and theories of queer and feminist life writing, specifically examining how memoirs continue to play a central role in the development of LGBTQ+ and feminist discourses. We will learn about the history of memoir as a genre, discuss how personal narratives have circulated in the public sphere, and analyze techniques authors use to communicate intersectional identities. Together, we will investigate how life writing has the potential to capture alternative histories and encapsulate distinct subcultures.  \nWe will read texts from the 1970s and 1980s likes Zami: A New Spelling of My Name by Audre Lorde as well as contemporary works such as Spinning by Tillie Walden. This course is designed to provide opportunities for you to strengthen your skills in critical thinking, close reading, and visual analysis. Assignments include essays, discussion posts, and a final research or creative project of your choosing.",
    "course_description": "Literary topics vary. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Tesla Cariani - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in Rich Building 108",
    "course_resources": null,
    "sections": "Class Nbr: 2769, Section #: 2, Type: LEC, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: T. Cariani, Status: Open",
    "date_accessed": "2024-03-30"
}