{
    "course_code": "ENG 389W",
    "course_title": "Special Topics:Literature: True Crime",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "Course Topic: True Crime\n\n\nThis course will cover the history of the true crime genre, including its current explosion of popularity. Sources will include print literature, documentary film and television, and podcasts. We will explore multiple aspects of the genre: its conventions, its pleasures, the moral dilemmas it poses for its fans, its participation in the criminal justice system and carceral culture, its relation to historical norms and stereotypes about race, gender, sexuality, region, social class, and religion.\nContent warning: many of the texts we will study are about murder and sexual violence and include explicit and realistic details like autopsy reports, crime scene photos, and the confessions of serial killers. We will encounter misogyny, homophobia, transphobia, racism, class contempt, and other forms of bigotry. There may be situations of betrayal, family strife, violence inflicted on children, substance abuse, mental illness, and injustice that will be disturbing to you. Please consider carefully if you are able to engage with this kind of material for a full semester.\nTexts (tentative): Lizzie Borden: Hash and Rehash, In Cold Blood (book and films), I'll Be Gone in the Dark (book and film), Serial, The Ripper, The Stranger Beside Me, Ted Bundy: Falling for a Serial Killer, Atlanta's Missing and Murdered, Evidence of Things Not Seen, Trial 4, Incident at Oglala, Finding Cleo, Tiger King, The Jinx, Buried Truths, The Fall Line, True Crime Obsessed, In The Dark.",
    "course_description": "Literary topics vary. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Catherine Nickerson - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Callaway Center C203",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2759, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: C. Nickerson, Status: Closed",
    "date_accessed": "2024-03-30"
}