{
    "course_code": "ENG 384RW",
    "course_title": "Criticism",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 15",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "Course Topic: Criticism: Introduction to Literary Theory\n\n\nThis course will introduce students to key concepts and texts in literary and cultural theory. The readings will be organized by theoretical school and ordered by a rough chronology that attempts to present various movements in the order that they assumed prominence in the academy. The schools we will cover include Marxism, feminism, gender studies, critical race theory, post-colonialism, psychoanalysis, structuralism and post-structuralism, cultural studies, and more. Our classes will be devoted to working through the arguments of our texts, considering their relevance to humanist inquiry and contemporary social and political issues. At certain moments in the semester, we will also engage in \"case studies,\" brief readings in fiction, poetry, and memoir-style writing that will allow us to reflect on the applications of our theoretical readings to cultural objects.",
    "course_description": "Prerequisites: two courses in literature or the instructor's consent. The relationship of critical theory to various literary forms. Specific material for analysis will vary in successive offerings of this course. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Ross Knecht - Primary Instructor",
    "schedule_location": "TTh 4pm-5:15pm in Callaway Center C203",
    "course_resources": null,
    "sections": "Class Nbr: 2753, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 4-5:15p, Instructor: R. Knecht, Status: Open",
    "date_accessed": "2024-03-30"
}