{
    "course_code": "ENG 389",
    "course_title": "Special Topics: Literature: Techno Thrillers",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 11",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "Course Topic: Techno Thrillers\n\n\nThis course will focus on a range of contemporary fictional narratives considered to be \"techno-thrillers\". As a popular narrative form, the techno-thriller is distinguished by its careful attention to the details of high tech and cutting edge science, and a concern with impending disaster. Michael Crichton, usually considered to be the inventor of the genre, had great success with this formula by developing a dramatic, fast-paced narrative style and constructing scenes that evoke a popular fear that advanced technology is inherently unstable and prone to unpredictable, run-away effects and even catastrophe. As we shall see, however, techno-thrillers are not simply or only symptomatic of unnamed anxieties, but, more interestingly, also explore new kinds of spaces and forms of agency that the Internet and what Bill Gates calls \"frictionless capitalism\" make possible, such as vast biotech and financial assemblages. In doing so, they convey affects expressive of a sense that we are living in and moving through new landscapes and networked milieus that we don't yet fully perceive and understand. Thus techno-thrillers play on the fact that the ordinary is only a facade behind or through which extraordinary new kinds of forces are at work.",
    "course_description": "Literary topics vary. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "John H Johnston - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in Callaway Center C203",
    "course_resources": null,
    "sections": "Class Nbr: 2748, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 1-2:15p, Instructor: J. Johnston, Status: Open",
    "date_accessed": "2024-03-30"
}