{
    "course_code": "ENG 389W",
    "course_title": "Special Topics:Literature: Queer Literature Black & White",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 11",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "Course Topic: Queer Literature in Black and White\n\n\nRace, in this case specifically the Black/white binary, has long been used to bolster various theories about sexuality in both its queer and heteronomative manifestations. Some claim that Black and/or Black African people are \"naturally\" more homophobic because queerness is a white invention borne of decadence and immorality, while the former is more religious and less inclined towards \"modern\" practices like queer sex. In like kind, white norms have come to define queerness across racial and ethnic groups, from the concept of \"coming out\" to notions that white capitalist neoliberalism should be a shared goal for all LGBTQIA+ peoples across the globe. This course will look at how postwar and contemporary white and Black U.S. (and some British) novels construct queerness with regard to race, class, Western culture, capitalism, gender, and, of course, sex, at times bolstering and at other times subverting these assumptions. Authors may include (but are not limited to): James Baldwin, William S. Burroughs, Leslie Feinberg, Audre Lorde, Alan Hollingsworth, and Bernadine Evaristo. Students will be expected to write weekly analyses of the reading and submit one 5-7 page midterm and one 10-12 page final paper in addition to participating in class discussions and attending lectures. While this class will engage in some cultural analysis, as a literature course, all assignments must be close readings of the text. Knowledge of this methodology is strongly encouraged but not required",
    "course_description": "Literary topics vary. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Michelle Wright - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Math & Science Center - W307C",
    "course_resources": null,
    "sections": "Class Nbr: 2767, Section #: 2, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: M. Wright, Status: Open",
    "date_accessed": "2024-03-30"
}