{
    "course_code": "ENG 389",
    "course_title": "Special Topics: Literature: Re-presenting the Past: Lit.",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 4 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "\"Re-presenting The Past: Literature, History, Memory\" | One of the functions of literature is to tel us about the past: how we became who we are as people and as persons: what we suffered, how we triumphed, and what shaped our view of the world and our sense of self. In so doing, it fosters empathy. How does literature render the past in ways that distinguishes it from history? Through its materials? Its approach? Its concept of truth? We will consider these issues as we put history and memory side by side, taking American slavery, the Nazi Holocaust, and the modern history of Israel/Palestine as our historical touchstones. Conceptually and methodologically, we will be guided by both foundational and recent work in the growing interdisciplinary field of Memory Studies. Drawing on work in this field from the humanities, social sciences, and natural sciences, we will consider how and why people remember and/or forget aspects of the past and what the effects of remembering and/or forgetting can be.\n\n\nParticulars: \n1. Short (c. 500 words) weekly responses to the readings in both analytical and creative forms.\n2. An independent research project that: (1) explores a particular historical experience/event from the perspectives of both history and memory, and (2) responds to it in the form of either a design for a memorial or a commemorative ritual.\n\n\nBooks: \nPatrick Modiano, Dora Bruder\nToni Morrison, Beloved\nAlice Oswald, Memorial\nJoe Sacco, Palestine\nPeter Weiss, The Investigation\n\n\nSame as CPLT 389-3, HIST 396-1",
    "course_description": "Literary topics vary. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Angelika Bammer - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Ignatius Few Building_131",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3122, Section #: 3, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: A. Bammer, Status: Closed",
    "date_accessed": "2024-03-30"
}