{
    "course_code": "ENG 368W",
    "course_title": "Literature & Cultural Studies",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "Course Topic: Social Justice and Digital Humanities\n\n\nIn this course, we will work together to create a praxis of Digital Humanities (DH) that is grounded in literary studies and centers social justice from inception to publication. We will begin by developing an intersectional, critical framework for approaching DH through theoretical readings in queer theory, postcolonial theory, disability studies, Black feminisms, and Indigenous studies. We will pair reading with a selection of DH projects from a range of fields in the humanities from history to sociology. Some of these projects will serve as models for your own DH final project.  \nOur course will be organized around several units that will focus our discussions and assignments. For example, in the unit on mapping, we will read about the complex histories of mapping in terms of colonialism, surveillance, dispossession, globalism, activism, and connection. We will also discuss examples of digital mapping projects that center marginalized identities such as Mapping LGBTQ St. Louis (1945-1992), led by Andrea Friedman and Miranda Rectenwald. Over the course of the semester, we will experiment with different DH tools and practices. Assignments include presentations, response papers, exercises with different tools, and a culminating digital project of your choosing. No prior technical experience is necessary, just a willingness to take risks and explore!",
    "course_description": "An introduction to the relationship between literary studies and the study of cultural theory and popular culture.",
    "prerequisites": null,
    "instructors": "Tesla Cariani - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in Callaway Center S105",
    "course_resources": null,
    "sections": "Class Nbr: 4075, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: T. Cariani, Status: Open",
    "date_accessed": "2024-03-30"
}