{
    "course_code": "ENG 489W",
    "course_title": "Special Top Adv Study:English: Monsters in the Archives",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 6 / Seats Avail: 4",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": "Department Consent Required",
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "Course Topic: Monster in the Archives\n\n\nThe Monster in the Library: Introducing The Bram Stoker Archive- Emory has recently acquired the Bram Stoker archives, which have long been in private hands. These materials reflect not only the preoccupations of the Irish-born Stoker as he researched and penned Dracula during his lengthy employment at London's Lyceum Theatre, but also the wide influence the novel had on literary, filmic, and popular culture. Using first-hand experience in this archival collection, this course will journey to Stoker's theatre environment where he worked closely with famous Shakespeareans Henry Irving and Ellen Terry; to the literary world of London to see Stoker's associates and influences including Byron and Shelly; to Transylvania to meet Vlad the Impaler and the controversial historical background of Dracula; and to the many permutations of Dracula even up to the current day. Students with literary, cultural, or historical interests in Irish literature, nineteenth-century literature, archival work, public humanities, theatre history and other interdisciplinary fields will find substantial material to work with, much of which has never before been publicly available. In addition to examining archival materials and reading supporting texts, students can expect course activities which include writing, designing or curating materials for the public, and presenting.\n\n\nFor permission to enroll, please send an email to the instructors briefly detailing your interest in the course.",
    "course_description": "Intensive study of specific literary topics, e.g., questions of form or history, or concentrations on one or more authors or literary movements. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Sheila Cavanagh - Primary Instructor",
    "schedule_location": "W 1pm-3:45pm in Woodruff Library 422",
    "course_resources": null,
    "sections": "Class Nbr: 2742, Section #: 1, Type: SEM, Campus: ATL, Meets: W 1-3:45p, Instructor: Cavanagh/Trapp, Status: Open",
    "date_accessed": "2024-03-30"
}