{
    "course_code": "ENG 485W",
    "course_title": "Topics in Applied Research: Public Humanities",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 4",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": "Department Consent Required",
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "What can humanities do in the world? Public Humanities engages debates about the relation of humanistic inquiry to communal engagement and stimulates active, collaborative, research of broad public interest. At the center of this course will be projects developed in collaboration with community partners in a wide range of fields inside and outside the university that engage students in socially-meaningful scholarship. Weekly seminar meetings will provide an opportunity to discuss readings about the history and theory of humanities in general and the emerging field of Public Humanities in particular, and will afford time for group work on the collaborative research projects. Brief presentations and short writing assignments will serve to encourage reflection on connections between disciplinary research and Public Humanities practice. \nThis course is primarily intended for graduate students,  but the instructors ( Benjamin Reiss of English and Thomas Rogers of History)  will also consider applications from advanced undergraduates. To apply, send a one-paragraph statement of interest plus your Emory transcript (OPUS version is fine) to breiss@emory.edu  and tomrogers@emory.edu.  Inquiries about the seminar, including about the nature of the research projects,  should go to the same addresses.",
    "course_description": "Collaborative projects designed to deepen students' knowledge of a particular topic, and to develop individual & group research/presentation skills. Examples: archives; exhibitions; digital projects; anthologies; investigative journalism; large-scale textual analyses; public humanities projects.",
    "prerequisites": null,
    "instructors": "Benjamin Reiss - Primary Instructor",
    "schedule_location": "M 6pm-9pm in New Psyc Bldg 250 (36 Eagle Ro",
    "course_resources": null,
    "sections": "Class Nbr: 2760, Section #: 1, Type: RSC, Campus: ATL, Meets: M 6-9p, Instructor: Reiss/Rogers, Status: Open",
    "date_accessed": "2024-03-30"
}