{
    "course_code": "ENG 489",
    "course_title": "Special Topic Adv. Study: English",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 4 / Seats Avail: 2",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "\"Literature at the Limits of Language\" | What is the specificity of literary language? In what way is literature a \"limit-case\" of language -- that is, a way of taking language to the very limits of what it can say or do? In this seminar we will explore a number of literary and theoretical texts that reflect directly on these questions. In doing so, we will consider how such texts often pose a challenge to the clear generic definitions through which we usually distinguish literature and theory, but also through which we make other generic distinctions such as fiction and history or poetry and prose. At the \"limits\" of language, we will be reading hybrid works in which different kinds of language come together and break apart in peculiar and challenging combinations. Since we will be reading several works in translation, we will also devote special attention to theoretical reflections on translation and the way literary language seems to resist translation--and what that may suggest about the specificity of the literary and the \"limits\" of language.\n\n\nThree papers; One additional (short) written assignment; oral presentation (Subject to revision)\n\n\nSame as CPLT 490-1",
    "course_description": "Intensive study of specific literary topics, e.g., questions of form or history, or concentrations on one or more authors or literary movements. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Deborah Elise White - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in Callaway Center S101",
    "course_resources": null,
    "sections": "Class Nbr: 3130, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: D. White, Status: Open",
    "date_accessed": "2024-03-30"
}