{
    "course_code": "ENG 485W",
    "course_title": "Topics in Applied Research: Contemporary Publishing",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": "Department Consent Required",
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "Course Topic: Contemporary Publishing\n\n\nHow does the publishing industry work today? Much has changed in the last few decades. Editors have ceded some of their once great power over what is published to a range of figures, including literary agents, sales managers, marketers, and subsidiary rights directors. In the last decade, Amazon has reconfigured the industry, raising the importance of ebooks and self-publishing. Meanwhile, the market for literary adaptations into TV, film, and audio has exploded. What has all this meant for the kinds of literature that are produced?\nThis course will be part seminar in which we address these questions and part practicum through which students will develop familiarity with the current publishing industry. Students will work collaboratively with Plympton, a San Francisco-based literary studio that works on emergent cross-media opportunities in publishing, from designing ebooks to finding short stories for podcasts or for screen adaptation. For deeper context, students will read and discuss studies and reports about publishing, as in a typical seminar. We will bring the students' hands-on experience to bear on the scholarly questions preoccupying the field of publishing studies.\nNote: students must apply for admission to this course. Please contact Dr Sinykin for more information.",
    "course_description": "Collaborative projects designed to deepen students' knowledge of a particular topic, and to develop individual & group research/presentation skills. Examples: archives; exhibitions; digital projects; anthologies; investigative journalism; large-scale textual analyses; public humanities projects.",
    "prerequisites": null,
    "instructors": "Dan Sinykin - Primary Instructor",
    "schedule_location": "TTh 4pm-5:15pm in Candler Library 123",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2763, Section #: 2, Type: RSC, Campus: ATL, Meets: TTh 4-5:15p, Instructor: D. Sinykin, Status: Closed",
    "date_accessed": "2024-03-30"
}