{
    "course_code": "FREN 488W",
    "course_title": "Topics in French: Montaigne's Essays",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 15Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Humanities, Arts, Language with Writing",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "FREN 488W  Of Experience: Montaigne's Essays\nCórdova (MW 1:00-2:15, in person)\nContent: This seminar provides an introduction to the Essais (1580-95) of Michel de Montaigne (1533-92). Through close and patient reading of several of his (often) funny and (always) idiosyncratic texts, we will learn about early modern politics, art, and society, and address questions related to themes such as: experience, pleasure, violence, sadness, death, gender and sexuality, humor, animality, friendship, writing, monsters, grottoes, illness, and (the failures of) education. Montaigne's Essais will be read in dialogue with thinkers and writers that bear witness to his diverse intellectual context and afterlife. We will also investigate related cases from the visual arts and explore the question of why there is such renewed interest in Montaigne today. Along with careful reading and active class discussion, students will undertake assignments both creative and analytic.",
    "course_description": "Courses will include the study of a variety of subjects in French and/or francophone literature and culture. May be repeated for credit.",
    "prerequisites": "FREN 310, FREN 314 and two 300 level FREN courses, or equivalent transfer credit as prerequisite.",
    "instructors": "Chad Cordova - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Woodruff Library 773",
    "course_resources": null,
    "sections": "Class Nbr: 3666, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: C. Cordova, Status: Open",
    "date_accessed": "2024-03-30"
}