{
    "course_code": "FREN 488",
    "course_title": "Topics in French",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 12Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Humanities, Arts, Language [Foreign Language]",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "FREN 488 Queer Photography from XIX in France\nGaudry (TTh 1:00-2:15pm )\nContent:  In this course, students will learn that from its conception, photography has not been a simple illustration of gender categories, but an active tool for building contemporaneous notions of gender, sexual minorities, race and disabled people. This course uses a multimodal Digital Humanities method to 1) investigate the relation between photography and gender from its origins, by focusing first on XIX century and then moving to contemporaneous practices in France, 2) conduct digital visual experiments by which gender representations are shifted. Students will experiment with photography and French writing through Digital Humanities, by using multiple platforms, creating contents for the text, making their own photo-text and photomontage. \nContent Warning:\nWe will be talking about gender and sexual identities through art and history of ideas. We will cautiously analyze our perspectives, but it may feel complex and difficult on an affective level.",
    "course_description": "Courses will include the study of a variety of subjects in French and/or francophone literature and culture. May be repeated for credit.",
    "prerequisites": "FREN 310, FREN 314 and two 300 level FREN courses, or equivalent transfer credit as prerequisite.",
    "instructors": "Perrine Gaudry - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in Anthropology Building 107",
    "course_resources": null,
    "sections": "Class Nbr: 3433, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 1-2:15p, Instructor: P. Gaudry, Status: Open",
    "date_accessed": "2024-03-30"
}