{
    "course_code": "FREN 391R",
    "course_title": "Francophone Studies: Decolonizing the Map",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 10Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "HAL w/Race & Ethnicity Req.",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "FREN 391R Decolonizing the Map Digital Cartographies of Resistance\n(Rodriguez / TT 2:30-3:45pm in person)\nContent:  In his Notebook of a Return to the Native Land, Martinican poet Aimé Césaire supersedes colonial and scientific cartography tinted with the arbitrary colors of scholars (NRNL, 51) in the name of a special geography too; the world map made for my own use  with the geometry of my spilled blood (51). His radical gesture of reclaiming authorship in the map-making process is an act of anti-colonial resistance repeatedly encountered in Francophone literature. Writers from the Francophone regions of the world recount their struggle inhabiting a space bearing the scars of colonialism and shadows of neocolonialism. In this semester's novels, short stories, poems and films, we will examine how writers from Algeria, Martinique, Viet-Nam, Senegal, Guadeloupe and first-generation immigrants in France, decolonize the world map by creating cartographies of resistance. With the help of digital humanities tools, we will pursue creative pathways to produce digital maps retracing the itineraries of our corpus protagonists who, through acts of resistance, redefine and decolonize cartography.  Prerequisites:  FREN 310W and FREN 314, or by placement.",
    "course_description": "A survey of literary and cultural creations from the Francophone world, with a special emphasis on Africa, the Caribbean, and South East Asia.",
    "prerequisites": null,
    "instructors": "Alicia Rodriguez - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in MODERN LANGUAGE_127",
    "course_resources": null,
    "sections": "Class Nbr: 3429, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: A. Rodriguez, Status: Open",
    "date_accessed": "2024-03-30"
}