{
    "course_code": "ISOM 551A",
    "course_title": "Processes and Systems Management",
    "credit_hours": "1.5",
    "seats": "Seats: Maximum Enrollment: 66 / Seats Avail: 11Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-10-27 through 2021-12-18",
    "class_notes": "The delivery format listed for this class is based on current university guidelines. However, if there are further changes to the COVID19 guidelines for Fall 2021 or other acts beyond our control, the school reserves the right the modify the delivery method for this class",
    "course_description": "This course looks at how processes and systems, the so-called operating core of the organization, impacts the ability of a firm to execute its strategy. The challenges confronting firms competing in today's dynamic environment demand a multi-disciplinary focus. As we prepare students who seek to understand and face these challenges, this course covers the multiple activities comprising a firm's operating core and its supply chain. The operating core of a firm is an integrated system that combines activities related to design and engineering, production, quality management, networks of material and information flows, and the development, distribution and delivery of goods and services to customers.",
    "prerequisites": "This section is reserved for students in the One-Year or Two-Year MBA program.",
    "instructors": "Ramnath Chellappa - Primary Instructor",
    "schedule_location": "Varies by section",
    "course_resources": null,
    "sections": "Class Nbr: 2821, Section #: 3201, Type: LEC, Campus: ATL, Meets: MW 8-9:30a, Instructor: R. Chellappa, Status: Open\nClass Nbr: 2822, Section #: 3202, Type: LEC, Campus: ATL, Meets: MW 9:45-11:15a, Instructor: R. Chellappa, Status: Open\nClass Nbr: 2823, Section #: 3203, Type: LEC, Campus: ATL, Meets: MW 1-2:30p, Instructor: R. Chellappa, Status: Open",
    "date_accessed": "2024-03-30"
}