{
    "course_code": "NRSG 799R",
    "course_title": "Dissertation Research",
    "credit_hours": "1-12",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2024-05-17 through 2024-08-07",
    "class_notes": null,
    "course_description": null,
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 1488, Section #: 1, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: V. Hertzberg, Status: Open\nClass Nbr: 1489, Section #: 10, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Pappas/Rogers, Status: Open\nClass Nbr: 1490, Section #: 11, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: C. Xiao, Status: Open\nClass Nbr: 1491, Section #: 12, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: N. Carlson, Status: Open\nClass Nbr: 1492, Section #: 13, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: L. McCauley, Status: Open\nClass Nbr: 1493, Section #: 14, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: F. Epps, Status: Open\nClass Nbr: 1494, Section #: 2, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: K. Yeager, Status: Open\nClass Nbr: 1495, Section #: 3, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: K. Hepburn, Status: Open\nClass Nbr: 1496, Section #: 4, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: K. Smith, Status: Open\nClass Nbr: 1497, Section #: 5, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Song, Status: Open\nClass Nbr: 1498, Section #: 6, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Cimiotti, Status: Open\nClass Nbr: 1499, Section #: 7, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. Waldrop, Status: Open\nClass Nbr: 1500, Section #: 8, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: R. Gary, Status: Open\nClass Nbr: 1501, Section #: 9, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: L. Thompson, Status: Open",
    "date_accessed": "2024-03-29"
}