{
    "course_code": "THEA 190",
    "course_title": "Fresh Seminar: Theatre + Ecology",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Freshmen Seminar - Limited to First Year Students Only)\n(Synchronous on Tuesdays. Asynchronous material included.)\n(This course is a survey of the burgeoning field of theatre-making centered on our ecological crises. Through the critical reading of plays from around the world, students will examine how drama is being used to bring awareness to environmental issues including extinction, climate change, environmental justice and sustainability. Students will be introduced to organizations such as the international network Artists and Climate Change, and their Climate Change Theatre Action; and the Earth Matters On Stage (EMOS) New Play Festival and Symposium, that are leading the charge, uniting artists, educators and scientists to bring awareness to these issues through theatre. Also, theatre companies like Superhero Clubhouse, whose new plays teach eco-critical literacy to students. Additionally, we will look at eco-activist performance; theatre practitioners whose works challenges audiences to move from ego-centrism to eco-centrism; Green Theatre; and organizations and resources that promote sustainability in theatrical production practices. Students will consider how theatre artists can, and do, facilitate the normalization of eco-involvement in their communities. The course culminates in students creating either a short play that addresses an environmental issue or the conception of an event that use eco-theater.)",
    "course_description": "An introductory seminar on a special topic in theater studies.",
    "prerequisites": null,
    "instructors": "Lydia Fort - Primary Instructor",
    "schedule_location": "T 11:20am-12:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 1849, Section #: 2, Type: SEM, Campus: ATL, Meets: T 11:20a-12:35p, Instructor: L. Fort, Status: Wait List",
    "date_accessed": "2024-03-30"
}