{
    "course_code": "THEA 216",
    "course_title": "History of Drama & Theater II",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as ENG 216 1)\n(Synchronous on Tuesdays. Asynchronous material included.)\n(This course examines theater history from the eighteenth century to the present. The goal is to acquaint students with the major trends in theater over the past three hundred years. Expect to read two plays each week as well as period documents and essays on theory. Theater is the most social form of art making and has always been closely connected to developments in politics, philosophy, social change, science, and other arts, particularly music, literature and painting. Many important playwrights were also poets, novelists, lyricists, social critics and/or political activists. Some plays are read because of their historical interest alone. Not all the plays read in this class are great works of art. They are important because of what they tell us about changes in the craft of theater and the social context in which audiences chose to spend their time at the theater. Most theater attempts to entertain and divert a target audience. Plays that clearly fall into this category are not necessarily frivolous, and certainly not historically irrelevant. Throughout history, theater has been most popular during times of extreme upheaval, social change and tension for the audience.)",
    "course_description": "General history of the theater from French neoclassicism through the twentieth century, focusing on representative dramatic works and on the influence of actor, staging, and audience.",
    "prerequisites": null,
    "instructors": "Donald McManus - Primary Instructor",
    "schedule_location": "T 8am-9:15am in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 1853, Section #: 1, Type: LEC, Campus: ATL, Meets: T 8-9:15a, Instructor: D. McManus, Status: Open",
    "date_accessed": "2024-03-30"
}