{
    "course_code": "THEA 289",
    "course_title": "Special Topics: Theatre: Simulated Patient",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": "Department Consent Required",
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "Request Permission: https://mejordan.wufoo.com/forms/krunbnm1xxh82b/\nThis course explores the field of Human Simulation within Healthcare training contexts through 4 remote synchronous classes spread out through the semester and asynchronous observations and performance. A Simulated Patient (SP) is trained to portray a patient in an authentic reproducible way in Human Simulation for healthcare learners. Professional SPs often have performance backgrounds and are employed by Professional Schools (i.e. Nursing, Medical, Physician Assistant, Physical Therapy, Law School, etc.). Students will learn, practice, and perform methods for portraying an SP through the lens of acting and performing. Students will gain the necessary preparation to perform as an SP in a remote medical training encounter; such as mental health interviews. In this course, student SP's will the gain the understanding and practice in the components of a medical exam, techniques on patient portrayal, and the art of giving feedback to healthcare learners from the patient's perspective. Learning activities will include observation, physical and verbal portrayal skills, performances, and feedback. Homework includes readings, observations of professional SP's, self-assessments, and preparation of case study performances.",
    "course_description": "Individual courses on special topics in theater at the 200-level. This course may be repeated.",
    "prerequisites": null,
    "instructors": "Gina Shannon - Primary Instructor",
    "schedule_location": "W 6pm-9pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 1861, Section #: 2, Type: LEC, Campus: ATL, Meets: W 6-9p, Instructor: G. Shannon, Status: Open",
    "date_accessed": "2024-03-30"
}