{
    "course_code": "THEA 366W",
    "course_title": "Contemporary Drama",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 6 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as ENG 366W 2 and CPLT 389W 4)\n(Topic - Shapes of Storytelling)\nWhy do most stories have a beginning, middle, and end? Why not one long middle like \"Too Many Cooks\" (2014)? Or several endings like  \"Clue\" (1985) and \"I May Destroy You\" (2020)? We are never surprised in a play when the lights come up or when the curtain comes down. For my entire life, I was taught that linear structures (eg narrative arc, five act structure, five paragraph essay, etc.) were better than any other form. Sure, they're straightforward, have clear, and build momentum but so much is lost by not exploring other shapes a story can take! This class will explore writers like Jeremy O. Harris, Nina Simone, Yaa Gwasi, and August Wilson to examine what shapes a story can take.  Students will examine many dramatic structures not just the Aristotelian, patriarchal forms that dominate the field today. This is an open class seeking students with prerequisites in theater, literature, cinema, or any combination of comparative studies. If Jane Alison's essay \"Beyond the Narrative Arc\" interests you, this class is for you.)",
    "course_description": "Selected works of the contemporary theater since 1950, including dramatists such as Beckett, Bond, Fornes, Gems, Pinter, Shepard, and Wilson.",
    "prerequisites": null,
    "instructors": "Jireh Holder - Primary Instructor",
    "schedule_location": "F 2:40pm-5:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 1865, Section #: 1, Type: LEC, Campus: ATL, Meets: F 2:40-5:35p, Instructor: J. Holder, Status: Wait List",
    "date_accessed": "2024-03-30"
}