{
    "course_code": "PORT 201",
    "course_title": "Intermediate Portuguese I",
    "credit_hours": "3",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Varies by section",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Language [Foreign Language]",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "This course aims to further develop communication skills in Portuguese and expand knowledge of Lusophone cultural traditions. Specifically, we will focus on oral communication, written communication, listening skills and reading comprehension. To be adequately prepared for the course, students should have successfully completed Portuguese 101 and 102 (or their equivalent). Classes will be taught in Portuguese in order to expose the student to the target language. It is also a goal of the course to create a positive interaction among the students. Group work will be frequent, as well as the use of the students' different background and experience with the language. PARTICULARS: Evaluation is based on daily and active participation, homework, quizzes, compositions, exams, and Portuguese program activities.) (PREREQUISITES: Port 102, Port 110, or equivalent (including courses taken during a study abroad program).",
    "course_description": "The first half of a yearlong review, with emphasis on continued development of the four basic linguistic skills (speaking, listening, reading, and writing) and knowledge of Lusophone cultures and societies.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": "Varies by section",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 1283, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 10-11:15a, Instructor: M. Ribeiro, Status: Closed\nClass Nbr: 2292, Section #: 2, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: Silva Von Streber/Teixeira, Status: Open",
    "date_accessed": "2024-03-30"
}