{
    "course_code": "ENG 190",
    "course_title": "Freshman Seminar:English: Shakespeare & Contentment",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First Year Seminar",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Topic: First-Year Seminar: Shakespeare & Contentment\n(Freshmen Seminar - Limited to First-Year Students Only)\n\n\nCourse Description:  It's often said that pursuing contentment is wise. But if you live in a world that seems to be breaking apart, is it even possible to find contentment - a word that actually derives from the Latin for \"holding together\"? In a time of extreme political divisions and profound injustice, should one really expect to be able to keep it together?\nIn this seminar, we will consider how Shakespeare answers these questions in four closely-related plays: Henry VI, Parts 1, 2, and 3 and Richard III. These remarkable plays are set during a time of English civil war and feature warrior women, weak kings, and one of Shakespeare's most popular villains. However, because these narratives about quests for contentment are filled with scenes of military violence, sexual assault, and political ambition, they may feel startlingly contemporary. As we read these plays and watch film adaptations, we will reflect on how the richness and complexity of Shakespeare's investigation into the nature of contentment may speak to us today. \nSignificantly, we will also have opportunities to think about our own pursuit of contentment. We'll converse with others  at Emory who are pondering well-being; try out simple research-based contentment practices; and seek out experiences outside the classroom related to our study. Our seminar requires active participation, regular writing, and a willingness to take intellectual risks. But no previous knowledge of Shakespeare is required",
    "course_description": "Every semester. Freshmen only. Through readings on variable topics, frequent writing assignments, and in-class discussions, the seminar emphasizes reasoned discourse and intellectual community. Does not satisfy first-year writing requirement.",
    "prerequisites": null,
    "instructors": "Patricia Cahill - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Bowden Hall 118",
    "course_resources": null,
    "sections": "Class Nbr: 3217, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 10-11:15a, Instructor: P. Cahill, Status: Wait List",
    "date_accessed": "2024-03-30"
}