{
    "course_code": "ENG 320W",
    "course_title": "Restoration & Early18th Century LIiterature",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 5Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Topic: Restoration and Early Eighteenth-Century: 1660-1740\nAt first glance, seventeenth- and eighteenth-century British literature may seem distant and unfamiliar to a contemporary reader. But a closer look reveals that writers from this era were grappling with many of the questions and anxieties that still preoccupy us today, especially those regarding money, sex, power, and personal freedom. And this is no accident, given that many of the features of modernity were coming into being in the years after 1660. In this volatile era in Britain, we see the rise, for instance, of empirical science, consumer capitalism, print journalism, and constitutional forms of government. In response to these historical changes, writers playfully and creatively experimented with literary language, form, and genre, as they sought to find new ways to capture what they understood to be a fundamentally new reality.\nTexts:\nWe will study John Milton's Paradise Lost, Daniel Defoe's Robinson Crusoe, Jonathan Swift's Gulliver's Travels, and Eliza Haywood's Fantomina, among other works, and conclude by considering how Jane Austen, in her novel Pride and Prejudice, responded to and reimagined this earlier literature.\nRequirements:\nAttendance and active class participation are required; written work will include short weekly Canvas postings, three 5-page essays, and a take-home exam",
    "course_description": "Selected works of Restoration and Augustan literature, including authors such as Dryden, Behn, Congreve, Swift, Pope, Addison, and Steele.",
    "prerequisites": null,
    "instructors": "Paul Kelleher - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Callaway Center S105",
    "course_resources": null,
    "sections": "Class Nbr: 3098, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 10-11:15a, Instructor: P. Kelleher, Status: Open",
    "date_accessed": "2024-03-30"
}