{
    "course_code": "ENG 336W",
    "course_title": "The English Victorian Novel",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 22 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Topic: Victorian Genres; The novel became the ascendant popular literary form during the Victorian era (1837-1901). During this explosion of experiments in fiction, British authors developed a wide variety of genres that continue to shape how we read novels today. In this course, we will survey this proliferation of analytic categories, which included the psychological bildungsroman, the industrial novel, sensation fiction, high realism, imperial romance, naturalism, and the nascent genre of science fiction. Over the course of our study, we will examine what genre really means and we will evaluate how novels theorize their own genres. Throughout, we will attend to the questions of race, empire, gender, sexuality, class, and ecology that shaped the development of these genres in the nineteenth century. \nOur texts may include some (not all) of the following: Charlotte Bronte's Jane Eyre, Elizabeth Gaskell's North and South, George Eliot's Adam Bede, Wilkie Collins's The Moonstone, H. Rider Haggard's She, Thomas Hardy's Tess of the d'Urbervilles, and H. G. Well's The Time Machine. \nPlease note: If adding this course after the first week of class, please contact the instructor prior to adding to discuss missed work.",
    "course_description": "The development of the British novel during the Victorian period, with representative works by novelists such as the Brontes, Dickens, Eliot, Meredith, Hardy, and Conrad.",
    "prerequisites": null,
    "instructors": "Emma Davenport - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Math & Science Center - W307C",
    "course_resources": null,
    "sections": "Class Nbr: 3223, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: E. Davenport, Status: Open",
    "date_accessed": "2024-03-30"
}