{
    "course_code": "ENG 290W",
    "course_title": "Topics in Literary History: Hist.Blk Detection to beTaught",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities and Arts with Cont.Communication(*)",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Topic: Topics in Literary History: History of Black Detection\n\n\nThis class will examine the literary history of Black detective fiction. We will diverge from the authoritative literary histories that recognize Edgar Allan Poe as the genre's forefather. In doing so, we will initiate a fresh investigation into the ways Black writers within the genre have historically reoriented traditional detective fiction's aesthetics and themes. Before we read a selection of works from Black detective fiction writers, we will anchor this class by reading important criticism of early detective fiction, identify general features of the genre, and locate its historical developments of the last two decades. This will provide the framing upon which we will investigate the following questions: 1) What histories inform black detective fiction's aesthetics? 2) How did Black writers synthesize elements of early detective fiction towards positing a new understanding of the core themes of the genre? 3) What insights have Black detective fiction offered to the sociohistorical discourse of crime? By engaging these questions, students will identify Black detective fiction's literary contributions to the larger generic form and relate its production to its sociohistorical significance. Additionally, we will analyze contemporary works of Black detective fiction to see how Black writers grapple with today's social issues. Student assignments will include short response papers, online discussions, investigative reports, group presentations, and a final research paper.",
    "course_description": "Long historical surveys of national, regional, or ethnic traditions; or of genres or subgenres. Examples: History of African Literature, History of Latinx Literature, History of Science Fiction, History of the Sonnet, History of Southern U.S. Literature, History of Drama.",
    "prerequisites": null,
    "instructors": "Kareem Joseph - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Bowden Hall 116",
    "course_resources": null,
    "sections": "Class Nbr: 5641, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: K. Joseph, Status: Wait List",
    "date_accessed": "2024-03-30"
}