{
    "course_code": "ENG 355W",
    "course_title": "20th Century American Novel",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 22Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Topic: The Black Fantastic  \nThis course will focus on African American novels that feature the Black Fantastic narratives that reach beyond the often dismal restrictions of Jim Crow, state sponsored oppression, racial terror, and quotidian threats and aggressions' to imagine and thus assert a Blackness that exists and even flourishes outside the confines of racist fears and desires. From Pauline Hopkins' Of One Blood, where Blackness literally goes underground to protect itself against colonization, to George Schuyler's Black No More, in which technology and the limits of the human imagination confound one another, to Gloria Naylor's Mama Day, where a fictional island off the coasts of Georgia and South Carolina takes on Shakespeare's Prospero, Miranda, Caliban and Ariel and imbues them with the sensibility of Southern Black folkways, this course will analyze the way these writers and more have challenged the reader to see Blackness beyond ordinary times and spaces. \nThis class will also be reading intensive, so if it is a struggle for you to read more than 250 pages of fiction each week (and write on it) this class is not for you! Class sessions will be organized around class discussion, small group work and brief lectures. Requirements will be a weekly reader reaction/textual analysis of 350-500 words, active participation in group discussion, two thesis proposals of 250- 400 words each, and one midterm paper of roughly 1500 words and one final paper of 2500 words.",
    "course_description": "The development of the modern American novel with representative works by novelists such as Wharton, Dreiser, Hemingway, Faulkner, Fitzgerald, Steinbeck, and Bellow.",
    "prerequisites": null,
    "instructors": "Michelle Wright - Primary Instructor",
    "schedule_location": "MW 4pm-5:15pm in Callaway Center S105",
    "course_resources": null,
    "sections": "Class Nbr: 2797, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 4-5:15p, Instructor: M. Wright, Status: Open",
    "date_accessed": "2024-03-30"
}