{
    "course_code": "ENG 341W",
    "course_title": "20th Century English Novel",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "In this survey of twentieth-century British novelists, we will explore a wide range of literary styles and strategies, charting the novel's development through a period of rapid social and political change in which the very idea of what Britain represented as a nation, an empire, an identity was under constant revision. Our focus will be on how this sense of change is represented, reflected, and even created by the new artistic and narrative forms of the modernist era. While the authors on our syllabus often addressed large-scale subjects, they most often did so through a particular focus on the individual, demonstrating the variability and specificity of personal experience. Topics of discussion will include experimental representations of consciousness and the passage of time; shifting conceptions of gender, sexuality, race, and class; the impact of war and the writing of memory; the figures of the artist, the adventurer, and the lover; and the relationships among city, country, and the world at large. \nTexts: Joseph Conrad, The Secret Agent; Ford Madox Ford, The Good Soldier; Virginia Woolf, To the Lighthouse; E. M. Forster, A Passage to India; Samuel Selvon, The Lonely Londoners; Christopher Isherwood, Goodbye to Berlin; Muriel Spark, The Prime of Miss Jean Brodie; Jeanette Winterson, Oranges are Not the Only Fruit; Hanif Kureishi, The Buddha of Suburbia. Participation in class discussions, three 5-7 page analytical essays, and a take-home final.",
    "course_description": "The development of the modern English novel with representative works by authors such as Joyce, Forster, Woolf, Lawrence, Waugh, and Naipaul.",
    "prerequisites": null,
    "instructors": "Erwin Rosinberg - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Candler Library 114",
    "course_resources": null,
    "sections": "Class Nbr: 3231, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 10-11:15a, Instructor: E. Rosinberg, Status: Open",
    "date_accessed": "2024-03-30"
}