{
    "course_code": "ENG 384RW",
    "course_title": "Criticism: Black Literary Theory",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 17 / Seats Avail: 4Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Same as AAS 385W 1)\nTopic: Black Literary Theory; What happens when we treat blackness as a problem for literary thought? How does black(ness)\"as an idea, identity, or imaginary\" shift across various texts and diasporas? This course explores a wide range of approaches to and seminal works in the African Diasporic literary tradition. It navigates various texts that complicate European literary and aesthetic thought while generating incisive readings in the wake of chattel slavery, settler colonialism, Jim Crow penology, ecocide, and heteropatriarchal violence. Students will ultimately ponder how blackness helps us theorize \"literature,\" not merely as a mode of cultural production, but as a third space in which to explore the complexity of imaginaries, social structures, communication, and lived experience. In particular, the course traverses African Diasporic contributions to psychoanalytic theory, deconstruction, (post-)structuralism, theological hermeneutics, queer-feminist thought, Marxism, and, more recently, Afro-pessimism. Theorists may include Aimé Césaire, Hortense Spillers, Audre Lorde, Henry L. Gates Jr., Fred Moten, Nahum Chandler, and Frank Wilderson, accompanied by Toni Morrison, Richard Wright, Zora Neale Hurston, Maryse Condé, Akwaeke Emezi, Danez Smith, Jordan Peele, Beyoncé, Kendrick Lamar, and Big Freedia.",
    "course_description": "Prerequisites: two courses in literature or the instructor's consent. The relationship of critical theory to various literary forms. Specific material for analysis will vary in successive offerings of this course. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Brenton Boyd - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in Callaway Center C101",
    "course_resources": null,
    "sections": "Class Nbr: 3090, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: B. Boyd, Status: Open",
    "date_accessed": "2024-03-30"
}