{
    "course_code": "ENG 389W",
    "course_title": "Special Topics:Literature: Romantic Drama",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 10Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Topic: Romantic Drama (Same as CPLT 389W 4)\n\n\nCourse Description: British Romantic Drama has often been considered something of a paradox when it comes to the best-known romantic-era writers. These writers often emphasize experiences of interiority and self-consciousness that seem to defy representation on the stage. Yet the most important writers of this period were obsessed with problems of agency and action. In both closet dramas intended for reading and theatrical dramas they hoped to see produced, they explored struggles for political and social justice as well as individual dignity and recognition. What does it mean to take action and then discover that the consequences of that action are entirely unexpected? How can one act against tyranny without becoming a tyrant? How can poets even show action on the stage when that action: is a change in consciousness? We will explore such questions looking primarily at British Drama but with some attention to German and Haitian authors. \nTexts: Plays to be drawn from works by Byron, Chanlatte, Coleridge, Hemans, Kleist; Schiller, P.B. Shelley, and Wordsworth; some secondary reading may supplement these texts. \nRequirements (provisional): Attendance; class participation; weekly reading response posts; three writing assignments (ca 1800 words each) with opportunities to rewrite the first one; Final Exam",
    "course_description": "Literary topics vary. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Deborah Elise White - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Callaway Center S109",
    "course_resources": null,
    "sections": "Class Nbr: 3233, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: D. White, Status: Open",
    "date_accessed": "2024-03-30"
}