{
    "course_code": "ENG 482RW",
    "course_title": "Seminar in Fiction:English: Novel of Manners, Then & Now:",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 5Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Topic: Novel of Manners, Then & Now: Austen, Forster, Ishiguro, Smith\n \nWe most often understand \"manners\" to refer to codes of politeness, customs that connote respect and promote sociable interaction and that, according to many casual observers, are currently under threat (and maybe always have been). A study of the novel of manners will help us investigate both the cultural and historical specificity of such practices as well as the perpetual obsession over their apparent demise. Our conversation will range widely, including over the ways that manners intersect with changing notions of class, nationality, race, sexuality, and gender, and will proceed from two key premises: one, that the novel in England has always derived much of its energy and its capacity for critique from the sustaining and breaking of mannered interactions; and two, that reading novels closely makes us keener observers of the habits, both spoken and unspoken, that make up society itself. The course is a close study of the work of four key novelists in this tradition: Jane Austen (in the early 19th century), E. M. Forster (in the early 20th), and Kazuo Ishiguro and Zadie Smith (both writing today).  \n \nTexts may include Austen, Sense and Sensibility and Persuasion; Forster, Where Angels Fear to Tread and Howards End; Ishiguro, The Remains of the Day and Never Let Me Go; Smith, White Teeth and On Beauty. Engaged participation in discussions, short weekly Canvas postings, and midterm and final essays.",
    "course_description": "Studies in narrative fiction and narrative forms. Readings vary and may focus on one or more authors or on questions of literary art. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Erwin Rosinberg - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in Callaway Center N118",
    "course_resources": null,
    "sections": "Class Nbr: 3232, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 1-2:15p, Instructor: E. Rosinberg, Status: Open",
    "date_accessed": "2024-03-30"
}