{
    "course_code": "ENG 789",
    "course_title": "Special Topics In Literature: Disability and Literature",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 7",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "This seminar will pursue two interlocking questions. First, to what extent has our knowledge and experience of disability been forged through literary representation? Second, what alternative histories and ideologies are revealed when we examine literary representations of atypical minds and bodies that pre-date the scientific codification of normality and abnormality in the nineteenth century? Our task in this seminar will be to study (mostly) pre-twentieth-century literary texts in order to build disability knowledges and strategies for thinking beyond, or to the side of, the norm.  We will ask: before the norm, what did literature know about atypical minds and bodies? How was  difference represented, how did human variations signify, in some of the most adventurous, imaginative, and rhetorically sophisticated texts written in English? Some of the authors we will consider include William Shakespeare, John Milton, Daniel Defoe, Mary Wollstonecraft, Olaudah Equiano, Mary Shelley, and Jane Austen. Our readings will be supplemented by theoretical and critical texts, including the work of Lennard Davis, Rosemarie Garland-Thomson, Tobin Siebers, Sari Altschuler, Alison Kafer, Jasbir Puar, and Jenifer L. Barclay. Seminar participants will do one class presentation and will submit a research paper by the end of the semester.",
    "course_description": "Various topics, such as theoretical, generic, or cultural studies of literature.",
    "prerequisites": null,
    "instructors": "Paul Kelleher - Primary Instructor",
    "schedule_location": "W 1pm-3:45pm in Callaway Center C201",
    "course_resources": null,
    "sections": "Class Nbr: 3137, Section #: 1, Type: SEM, Campus: ATL, Meets: W 1-3:45p, Instructor: P. Kelleher, Status: Open",
    "date_accessed": "2024-03-30"
}