{
    "course_code": "ENG 489",
    "course_title": "Special Topic Adv. Study: English: Imitating Reality",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 10Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "In our image-saturated world, smartphones and social media have democratized image creation even as deep fakes, CGI, virtual reality, and the spectacles of reality TV, call the relation between truth and representation into question. The intensification of technological reproduction thereby raises aesthetic and philosophical concerns coeval with literature itself. How can we differentiate between fiction and lies, art and artifice? Is there such a thing as artistic truth? Is it morally harmful to enjoy certain representations? To be sure, the notion that art copies or imitates reality may be traced to antiquity, as can the controversy over the moral value of such imitation. Do such products of human imagination elevate us and help us attain higher truths, or rather debase and corrupt those who consume them?\nSince modern technologies of reproduction began to transform the experience of reality in the nineteenth century, such questions have taken on ever greater urgency. You will gain historical and cultural perspective on our image-saturated world as we consider the imitation of reality in literature, film, and popular culture; you will explore images and truth, art and meaning through diverse theoretical perspectives on artistic creation and strategies of representation. This course culminates in an independent project of your choice investigating issues of reality, imitation, and spectacle in contemporary life",
    "course_description": "Intensive study of specific literary topics, e.g., questions of form or history, or concentrations on one or more authors or literary movements. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Elizabeth Goodstein - Primary Instructor",
    "schedule_location": "TTh 4pm-5:15pm in Atwood Chemistry Bldg. 215",
    "course_resources": null,
    "sections": "Class Nbr: 5687, Section #: 2, Type: SEM, Campus: ATL, Meets: TTh 4-5:15p, Instructor: E. Goodstein, Status: Open",
    "date_accessed": "2024-03-30"
}