{
    "course_code": "DANC 207R",
    "course_title": "Emory Dance Company",
    "credit_hours": "1-2",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Varies by section",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Physical Education and Dance",
    "permission": "Department Consent Required",
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "Audition required at the beginning of the semester. Students selected for the company must also be enrolled in a dance technique class (ballet, jazz, modern, hip-hop). Email dance@emory.edu for audition dates and questions.",
    "course_description": "Emory Dance Company is a professionally oriented performance company that exposes students to the diverse choreographic approaches of faculty, student and guest artist work, as well as historical reconstructions. Course admission is by audition. Students gain performance techniques, collaborative skills, and often contribute to the making of original choreography as they prepare for a fully produced dance concert. Simultaneous enrollment in a dance technique class is required. In addition, students gain experience in some of the technical aspects of dance concert production.  Credit hours are assigned in accordance with the number of works in which a student participates. Evaluation procedures announced in class.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 1021, Section #: 1, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: G. Staib, Status: Open\nClass Nbr: 2972, Section #: 2, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Medina, Status: Open\nClass Nbr: This section is full 5982, Section #: 3, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: L. Teague, Status: Closed\nClass Nbr: 5983, Section #: 4, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: G. Catellier, Status: Open",
    "date_accessed": "2024-03-30"
}