{
    "course_code": "BIOETH 505",
    "course_title": "Special Topics in Bioethics: Ethics of Emerging Technologie",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 8",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-05-17 through 2024-08-07",
    "class_notes": "Course Description: This course is designed to explore the ethical dimensions of a wide array of cutting-edge advancements shaping our future. Throughout this course, we'll delve into the metaphysical and epistemological aspects of emerging technologies, using them as springboards for robust ethical discussions. From AI, robotics, augmented reality, and virtual reality to mind-uploading, biobanking, space exploration, gene therapy, cultured meat, xenotransplantation, and more, we'll examine how these innovations can promote human flourishing while addressing the ethical dilemmas they present. Through engaging with science fiction and cinematic portrayals, we'll provoke thought and stimulate dialogue on the societal implications of these technologies. Our goal is to cultivate a deep understanding of how to navigate these ethical landscapes responsibly, ensuring equitable distribution of benefits and burdens, and minimizing potential harms, all while considering the well-being of future generations and adopting a global perspective.",
    "course_description": "Topics and professors for the Bioethics elective change every semester.",
    "prerequisites": null,
    "instructors": "Ju Zhang - Primary Instructor",
    "schedule_location": "W 3pm-6pm in Ethics Center - RARB_150",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_BIOETH_505_1_A24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2096, Section #: 1, Type: LEC, Campus: ATL, Meets: W 3-6p, Instructor: J. Zhang, Status: Open",
    "date_accessed": "2024-03-29"
}