{
    "course_code": "CL 100",
    "course_title": "Hero and Antihero",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 90 / Seats Avail: 21Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "CL 100. Hero and Antihero\nHelen of Troy and the wrath of Achilles; the long ordeals and cunning ploys of Odysseus and Penelope; the travels of Jason and his Argonauts; the destructive passion of Medea; the Trojan Horse and the founding of Rome: these tales have intrigued and inspired artists, writers, and thinkers for centuries. This course will introduce students to the four major epics of the ancient Greek and Roman world that shaped these stories of heroism and its opposite: the Iliad, the Odyssey, the Argonautica, and the Aeneid. We will consider the nature of heroism with attention to its motifs (the perilous journey, the descent to the Underworld, battles with monsters, oracles and prophecies) and its themes (what qualities define a hero? what actions are heroic? what makes an antihero? how are heroes both like and unlike gods? how does gender affect our conception of the hero?). We will also look an early response to the four epics that raises important questions about heroic values: the great Roman novel, The Golden Ass. Through it all we will consider the larger social context of the cultures that produced these works.",
    "course_description": "An examination of the heroic figure in Greek and Roman literature and culture, focusing on such famous texts as Homer's Iliad and Odyssey and Vergil's Aeneid in their historical, political, and/or artistic context.",
    "prerequisites": null,
    "instructors": "Jonathan Master - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in White Hall 112",
    "course_resources": null,
    "sections": "Class Nbr: 1264, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: J. Master, Status: Open",
    "date_accessed": "2024-03-30"
}