{
    "course_code": "CL 329R",
    "course_title": "Spec Stud in Classical Culture: Antigone Revived",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 14 / Seats Avail: 7",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "CL 329R-1. Antigone Revived: Modern Responses to Ancient Literature\nIn Sophocles' tragedy, Antigone was never revived, but modern literature shows the extraordinary resilience of this character. Multiple fresh versions of her tragic tale have emerged over the centuries; this course will focus on some of the best and most recent. In the first part of this course, we will read and view a number of different takes on the Antigone theme beginning with Sophocles' Antigone (translated by the Irish poet Seamus Heaney), including Athol Fugard's play The Island, Kamila Shamsie's 2017 novel Home Fire, and poet-classicist Anne Carson's radical \"translation,\" Antigonick. In the second part of the course, we will read and view modern takes on at least one additional ancient Greek work of literature. Depending on the previous background and interests of students in the class, it might be the Iliad, the Odyssey, or Euripides' Medea; I will welcome suggestions from students enrolled in the class. \nRequirements: regular participation in class/Canvas discussions; a 4-5-page interpretive paper dealing with one of the works under study; an oral report presenting a response, either creative or scholarly, to Antigone or to another ancient work; and a final paper or project that examines or creates a modern response to an ancient work of literature.\nPrerequisites: None, but I recommend students have some previous experience with Greek literature or mythology.",
    "course_description": "Topic changes to meet current interest of students and faculty. Course may be repeated for credit as topic varies.",
    "prerequisites": null,
    "instructors": "Louise Pratt - Primary Instructor",
    "schedule_location": "MWF 1pm-1:50pm in Candler Library 222A",
    "course_resources": null,
    "sections": "Class Nbr: 1263, Section #: 1, Type: SEM, Campus: ATL, Meets: MWF 1-1:50p, Instructor: L. Pratt, Status: Open",
    "date_accessed": "2024-03-30"
}