{
    "course_code": "CL 329RW",
    "course_title": "Spec Studies in Classical Culture: Sages and Saints",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 4 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Same as MESAS 370W 1, CPLT 389W 1, IDS 385W 2, REL 370W 1)\nFall topic: Sages and Saints: The Greco-Roman Heritage of the Middle Eastern World\nStarting from an age of new global awakening with Pythagoras, Heraclitus, Siddharta \nGautama, Zoroaster, Confucius and Lao Tzu (roughly 6-5 Centuries BCE), this class will trace the emergence of a wisdom/saint tradition in the figures initially of Abraham and Moses and then Socrates and Plato (4-3 centuries BCE), through Marcus Aurelius and Epictetus (1-2 centuries CE), to Plotinus (3rd century CE in Egypt and Rome), Porphyry (Syria), Iamblichus (Syria) and such later saintly figures as Macrina and Gregory of Nyssa (Cappadocia), Syncletica (Egypt), Evagrius (Pontus, Egypt), Hypatia (Alexandria, Egypt) and Rabi?a (in Late Antiquity. We do not want to omit the figures of Abraham, Moses, David, Jesus Mohammed is later, but we shall assume these figures to be central to our enterprise.",
    "course_description": "Topic changes to meet current interest of students and faculty. Course may be repeated for credit as topic varies.",
    "prerequisites": null,
    "instructors": "Kevin Corrigan - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in Anthropology Building 303",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 4523, Section #: 2, Type: SEM, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: Corrigan/Hosseini Nassab, Status: Open",
    "date_accessed": "2024-03-30"
}