{
    "course_code": "CL 487W",
    "course_title": "Special Topics in Classics: Ancient Greek Sanctuaries",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 4 / Seats Avail: 3Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Same as ARTHIST 470RW 1)\n\"Building Identity: Ritual and Representation in the Greek Sanctuary\" This course explores ancient Greek sanctuaries, and particularly how sacred space was used to articulate communal, individual, and even marginalized identities in antiquity. We will consider their setting, architecture, and use as places for the display of sculpture and other valuable offerings, as well as the rituals associated with them, including procession, feasting, and performance. In addition to media traditionally associated with elite and civic identity, this course engages with objects and ritual practices that can be used to understand the lives of women, foreigners, and enslaved members of Greek society. The course will involve close reading and discussion of primary evidence (artworks and literature in translation), and introduce students to key archaeological sites in the Greek Aegean and broader Mediterranean world. Secondary literature will introduce students to major anthropological, art historical, and archaeological approaches and current topics of scholarly debate. As part of this course, students will be expected to present on several readings and develop a research paper on a topic of their choosing. Art History major/minor: Division I",
    "course_description": "Variable course topic means that supplemental topic/structure will be variable as well (options include but are not limited to film/museum/travel/lecture series/independent research/experiential learning). Alternate course to CL 329 which is variable topic without extra component.",
    "prerequisites": null,
    "instructors": "Andrew Ward - Primary Instructor",
    "schedule_location": "F 1pm-3:45pm in Emerson Chemistry Bldg. E103",
    "course_resources": null,
    "sections": "Class Nbr: 5344, Section #: 1, Type: LEC, Campus: ATL, Meets: F 1-3:45p, Instructor: A. Ward, Status: Open",
    "date_accessed": "2024-03-30"
}