{
    "course_code": "SPAN 150",
    "course_title": "Great Works: Hispanic Canon",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 4",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "This course is part of the Voluntary Course Curriculum.\nCONTENT: This course will explore some of the great works that have been written in Spanish across a wide range of historical periods, national traditions, and genres.  The course, taught in English, will provide an opportunity for students whose command of Spanish is not, yet!, sufficient to read them in the original Spanish. Authors will range from Cervantes and Sor Juana to Yuri Herrera; readings will be drawn from the plays and poetry of Spain's Golden Age, colonial Spanish America, the Latin American Boom, contemporary narrative and poetry, and other cultural production (including film).  Selected secondary readings will provide additional context, but the focus will be on close reading and discussion of the primary texts.\nThis course is part of the Voluntary Core Curriculum, Emory's Great Books Program.\n \nTEXTS: (available in the Emory College Barnes & Noble Bookstore; may also be purchased on line; additional texts available on CANVAS; students MUST come to class with a print copy of the reading): Cervantes, García Márquez, Sor Juana Inés de la Cruz, Neruda, Castellanos, Inca Garcilaso, Lope de Vega, Herrera, and others.\nPARTICULARS: This course it taught in English.\n \nEVALUATION will be based on attendance, preparation, and participation in class; short weekly written assignments; two short papers; final exam.\n PREREQUISITE: none",
    "course_description": "Great works from the Hispanic canon, understood broadly to mean literature and - to a lesser degree - other forms of cultural production such as films, art, and music - from Spain, Spanish America and Spanish-speaking US Latino communities.This course is part of Emory's Voluntary Core Curriculum program. This course is taught in English.",
    "prerequisites": null,
    "instructors": "Karen Stolley - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in Candler Library 101",
    "course_resources": null,
    "sections": "Class Nbr: 4571, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 10-11:15a, Instructor: K. Stolley, Status: Open",
    "date_accessed": "2024-03-30"
}