{
    "course_code": "SPAN 301W",
    "course_title": "Early Hispanic Texts & Contexts",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 4Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Language with Writing",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "CONTENT: Spanish 301W is a foundational course for the Spanish Major and Minor. This course engages in an in-depth study of Spanish and Colonial Spanish American cultures and societies from the Middle Ages through the seventeenth century. The course incorporates a variety of primary texts of all sorts (legal documents, chronicles, plays, poetry, exempla') in order to explore a wide range of topics, such as Islamic Spain, the Spanish Reconquest, the Inquisition, the origins of the Spanish language, picaresque and autobiographical narratives, golden age drama, pre-Columbian civilizations, chronicles of the encounter between Europeans and Amerindians in the New World and the establishment of colonial rule in Spanish America. The course also provides students with opportunities to develop their competencies in close textual readings and oral presentations.\n \nTEXTS: Selection of texts available on Canvas\n \nEVALUATION: Final grade is based on two textual analysis papers, one oral presentation, two exams, short daily tareas and class participation.\nPREREQUISITE: Spanish 212 or an Official Spanish Placement for a Foundational Course level (Span 300-318). Take the online Spanish Placement Exam at http://spanport.emory.edu/home/undergraduate/placement/index.html",
    "course_description": "A survey course in Spanish and Spanish American culture from the Middle Ages and Pre-Columbian periods to the seventeenth century.",
    "prerequisites": null,
    "instructors": "Persephone Hernandez-Vogt - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in Callaway Center S104",
    "course_resources": null,
    "sections": "Class Nbr: 4593, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: P. Hernandez-Vogt, Status: Open",
    "date_accessed": "2024-03-30"
}