{
    "course_code": "SPAN 331",
    "course_title": "The Spanish Civil War",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 8",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Language [Foreign Language]",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "FULL TITLE: The Spanish Civil War: Word and Image\nDESCRIPTION: The Spanish Civil War (1936-1939) was a national conflict that also played out on the international stage.  Often viewed as a prelude to World War II, the war pitted sharply drawn ideological factions against each other: conservatives vs. liberals; Fascists vs. Communists; religion vs. secularism; centralism vs. regionalism; the bourgeoisie vs. the working classes; rural values vs. urban society. Myths emerged on the Republican left and the Nationalist right, with each faction viewing the conflict as \"the good war\" worth fighting in order to save the nation. International intervention, the impassioned writings of intellectuals across Europe and the U.S. and the participation of volunteer combatants, reinforced these myths. Given the high stakes involved, the Civil War provoked an extraordinary response in the cultural arena, continuing to do so even today. This course will consider visual and written representations of the war and its aftermath in historical context, taking into account that this is the first war to be entirely documented by modern media. Topics will include the ethics of art in wartime; the uses of propaganda; religious violence; women's activism; history and memory.\n\n\nTEXTS: Written texts will include examples of theater, poetry, narrative fiction, journalism, and personal letters. Visual texts will include documentary and narrative films, paintings, propaganda posters, war photography, newsreels, and war monuments and memorials. \nEVALUATION: Class participation; midterm exam; short written assignments; oral presentation; final research project  \nPREREQUISITE: At least one 300-level foundational course for the Spanish Major and Minor",
    "course_description": "This course considers visual, written, and musical representations of the Spanish Civil War and its aftermath. Topics include the ethics of art in wartime; the uses of propaganda; women's activism; history and memory.",
    "prerequisites": null,
    "instructors": "Hazel Gold - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in Callaway S501",
    "course_resources": null,
    "sections": "Class Nbr: 4606, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 10-11:15a, Instructor: H. Gold, Status: Open",
    "date_accessed": "2024-03-30"
}