{
    "course_code": "SPAN 424",
    "course_title": "Culture of Human Rights",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 2Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "DESCRIPTION: Spain's transition to democratic rule beginning in 1978 brought profound changes to the ways in which political and social issues could be discussed. After nearly 40 years of authoritarian state control relying on censorship, violence, and other repressive measures, Spaniards gained the freedom to debate human rights questions in the press, television, literature, film, and the public sphere of digital media. How is the discourse of human rights represented in cultural practice?  Conversely, how can cultural production impact human rights concerns? In considering these questions, this course will explore the exchanges between political, legal, and ethical discourses on human rights in Spain and recent cultural texts. The course will focus on areas in the human rights arena that have gained prominence in contemporary Spain: for instance, domestic and global terrorism; immigration and racism; sex trafficking; and the memory wars that have emerged in recent decades among survivors and descendants of Spain's 20th-century history of civil war and the Franco dictatorship. In their final research projects students may explore these topics or pursue additional avenues of interest (language rights; women's/gay rights; children's rights; the Okupas and Indignados movement; environmental rights, etc.).\n\n\nTEXTS: Will include examples of numerous genres, including journalism, literature (novels, short stories, poetry, memoirs), film, popular music, and social media.  Representative authors/directors include Aramburu, Saizarbitoria, Ortiz, Cercas, Gutiérrez, El Fathi, Armendáriz, Pedrero, and others.  Background readings will provide an overview of the polemics surrounding humanitarian ethics in the age of globalization. \nEVALUATION: Active participation in class discussions; midterm exam; short response papers; final research paper \nPREREQUISITES: Either (a) two foundational courses at the 300-level for the Spanish Major or Minor; or, (b) one 400-level Spanish course. Students without these prerequisites should consult with the instructor.",
    "course_description": "This course explores exchanges between political, legal, and ethical discourses on human rights in Spain and recent cultural texts. The course will focus on select areas in the human rights arena that have gained prominence in post-Franco Spain.",
    "prerequisites": null,
    "instructors": "Hazel Gold - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Callaway Center S102",
    "course_resources": null,
    "sections": "Class Nbr: 4608, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 1-2:15p, Instructor: H. Gold, Status: Open",
    "date_accessed": "2024-03-30"
}