{
    "course_code": "SPAN 485",
    "course_title": "Topics in Hispanic Culture: Lat..Am. Music, Lit.&Perform.",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 9Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "Latin American and Latinx Music, Literature and Performance\nThis interdisciplinary course studies key Latin American music genres and their performers from the beginning of the Twentieth century to the present. It also examines their effect on the literature of the region. Although many musical traditions in the Caribbean and South America date from before the 1900s, we will start the course at the point in which music and performers engage new recording and archival methods and ensure music's broader dissemination. Minoritarian expressions migrate from the Americas to Europe. As we study both popular as well as difficult sonic expressions, the course doubles as an alternative Latin American cultural studies and literature survey--focusing on Tango, Rumba, Mambo, Samba, Bossa Nova, Calypso, Mozambique, Nueva Trova ,Timba, Rock en Español, Reggaetón and Trapp with paired literary readings as well as films that allow us to understand issues relating to reception, and social or historical context. No knowledge of instrumentation or musical theory is needed for this course.",
    "course_description": "Upper-level research seminar on topics related to the language, discourse, literature, and/or culture of the Hispanic world. Students may take multiple SPAN 485 courses provided that they focus on different topics.",
    "prerequisites": null,
    "instructors": "Jose Quiroga - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Candler Library 121",
    "course_resources": null,
    "sections": "Class Nbr: 4611, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: J. Quiroga, Status: Open",
    "date_accessed": "2024-03-30"
}