{
    "course_code": "SPAN 485",
    "course_title": "Topics in Hispanic Culture: Identity in Latin America",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "DESCRIPTION: This course seeks to examine how concepts like race, ethnicity, belonging, and difference have been conceptualized historically in the United States when constructing the category of Latin/o American from the mid-19th century to the present day. Throughout the semester, we will analyze various periods and events that inform the development of (ethno)racial categories in the Americas. Through a panoramic view of identity and belonging, students will explore and challenge the (geo)politics of words like \"Latinidad,\" \"Hispanic,\" \"Latinx,\" and \"American.\" The understanding of race and racial formations as culturally contextualized and situated within the politics of difference is a central goal of this course. Some of the questions that we will consider include: What terms and discourses have been constructed to refer to people of Latin American descent? What are the social and political implications of these terms and discourses? How have these terms been represented in U.S. and Latin/o American culture? How are these categories of identity embraced, modified, and disputed across the Americas? This course utilizes sources in the social sciences and humanities, including foundational theoretical texts and canonical literature. Topics include multiculturalism, mestizaje, anticolonialism, decoloniality and diaspora, border thinking, transnationalism, and panethnicity, among others.\n\n\nTEXTS: Course readings will be available through Canvas in PDF form.\nEVALUATION: Two exams, one short paper (approximately 5 pages), and short reflections (75-150 words and graded for completion) on each of the readings assigned\nPREREQUISITE: At least one Foundational Course (SPAN 300-318)",
    "course_description": "Upper-level research seminar on topics related to the language, discourse, literature, and/or culture of the Hispanic world. Students may take multiple SPAN 485 courses provided that they focus on different topics.",
    "prerequisites": null,
    "instructors": "Daniela Hernandez - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in New Psyc Bldg 225 (36 Eagle Ro",
    "course_resources": null,
    "sections": "Class Nbr: 4612, Section #: 2, Type: LEC, Campus: ATL, Meets: TTh 1-2:15p, Instructor: D. Hernandez, Status: Open",
    "date_accessed": "2024-03-30"
}