{
    "course_code": "ARTVIS 109",
    "course_title": "Intro Sculpture",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 14 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2021-06-28 through 2021-08-04",
    "class_notes": "This is an online course. Emory College Online summer courses have required synchronous/live sessions every week. Students must be available to sign into and virtually attend the course online during those times (noted as the course meeting times- all times listed are local to Atlanta). Each course will also involve significant asynchronous material that you access on your own time in addition to standard amounts of readings and course assignments. Students should plan to spend 15-20 hours/week on this course. Please also be aware that faculty will begin corresponding with students during Week Zero of the course (one week before the official start date of the course), and that some interaction with the course may be required at that time. Students should begin checking the Canvas course site regularly one week prior to the official start of the term.\n\n\nA course designed to provide a firm grounding in the rudiments of sculptural practice. Drawing on historical and contemporary modes of art making this course investigates aesthetic and technical strategies of generating and understanding sculpture. Students are guided toward the realization of three-dimensional form with an emphasis on developing formal language, acquiring basic skills of spatial, conceptual, and technical issues. Students are instructed in the safe use of power and hand tools.",
    "course_description": "Offered in rotation. Credit, four hours. A course designed to provide a firm grounding in the rudiments of sculptural practice. Students are exposed to an overview of processes, tools, and materials used in sculpture.",
    "prerequisites": null,
    "instructors": "Dana Haugaard - Primary Instructor",
    "schedule_location": "TTh 4:45pm-6:15pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 1610, Section #: 1, Type: ART, Campus: ATL, Meets: TTh 4:45-6:15p, Instructor: D. Haugaard, Status: Wait List",
    "date_accessed": "2024-03-30"
}