{
    "course_code": "ARTVIS 333R",
    "course_title": "Multidiscipline Design Studio",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 14 / Seats Avail: 9Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall",
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-05-17 through 2021-06-23",
    "class_notes": "This is an online course. Emory College Online summer courses have required synchronous/live sessions every week. Students must be available to sign into and virtually attend the course online during those times (noted as the course meeting times- all times listed are local to Atlanta). Each course will also involve significant asynchronous material that you access on your own time in addition to standard amounts of readings and course assignments. Students should plan to spend 15-20 hours/week on this course. Please also be aware that faculty will begin corresponding with students during Week Zero of the course (one week before the official start date of the course), and that some interaction with the course may be required at that time. Students should begin checking the Canvas course site regularly one week prior to the official start of the term.\n\n\nIn this course, students will create digital designs and drawings, both for graphic design and visual art purposes. Students will gain fluency in using the Adobe Creative Suite software, specifically Photoshop, Illustrator, and InDesign. Research and conceptual interests of design will also be explored, splitting the focus of the semester equally onto both the content and the creation of digital art. \nCourse notes: \nA student subscription to Adobe CC will be necessary for this course and can be purchased for $19.99/mo through the Adobe website. If the subscription cost is a barrier for you but you want to take this class, do not be deterred because there are other options for accessing the software for free including remote use of the Emory's MediaLab. Specifics of how and what to enroll in will be provided by the instructor at the beginning of the semester.",
    "course_description": "This course is a multi-disciplinary course that will teach students how to write an art proposal, how to gather field research, and how to talk with experts about important topics. This research will be woven into the process of creating visual models, designs, and drawings.",
    "prerequisites": null,
    "instructors": "Jane Foley - Primary Instructor",
    "schedule_location": "TTh 4:45pm-6:15pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 1614, Section #: 1, Type: ART, Campus: ATL, Meets: TTh 4:45-6:15p, Instructor: J. Foley, Status: Open",
    "date_accessed": "2024-03-30"
}