{
    "course_code": "CHN 285",
    "course_title": "Special Topics in Chinese: China/the West thru Travelers",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 2Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as HIST 285 3)\n(Complete topic:  China & the West through Travelers)\n(This course will meet synchronously on Wed. 6:00 PM - 7:15 PM)\n(This course covers a millennium of the history of interaction between China and the West by focusing on the adventures of travelers, missionaries, merchants, diplomats, and soldiers. The themes included in this course are states and empires, cross-cultural exchanges, identity formation, culture and religion, trade, plague, environment, and globalization.  We will examine how Chinese, Arabic, European, and Central Asian travelers witnessed the rise and fall of empires, trade routes, and extensive cultural interaction and confrontation. The timeline is loosely structured to be between 200 A.D. when the Han Empire and Roman Empire were connected through the silk road to the early twentieth century ending with Chinese laborers in the Western front and Jewish families in wartime China. This course is about stories of a shared human past. The reading of this course focuses primarily on travelers' writings while the lectures provide a broader historical context. No prior knowledge of Chinese language or history is required. This course enhances the students' understanding of the long history of global interaction and interconnection)",
    "course_description": "Study of Chinese language, literature, society, thought, or culture, alone or in conjunction with other literary or cultural trends. Topics to be announced in advance.",
    "prerequisites": null,
    "instructors": "Jiajun Zou - Primary Instructor",
    "schedule_location": "W 6pm-7:15pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 4770, Section #: 1, Type: LEC, Campus: ATL, Meets: W 6-7:15p, Instructor: J. Zou, Status: Open",
    "date_accessed": "2024-03-30"
}