{
    "course_code": "BIOS 591P",
    "course_title": "Biostatistics Methods II",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 185 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-01-10 through 2022-04-25",
    "class_notes": "EPI, GLEPI and EH-EPI Students Only.",
    "course_description": "Prerequisites: BIOS 500 or permission of instructor. For EPI students Only taken in the spring semester of their first year. The course covers fundamental concepts in applied simple and multiple linear regression analyses, one- and two-way analysis of variance and binary logistic regression. Concepts in survival analysis will also be introduced. Students will learn when and how to apply these methods. The emphasis will be on practical data analysis skills rather than statistical theory; however, wherever possible and feasible, mathematical details of regression models will be presented. In-class data analysis examples will employ SAS and R software. Homework assignments, quizzes and exams will include data analyses using SAS and R, as well as other questions designed to reinforce concepts and assess foundational competencies. Teaching assistant office hours will consist of organized review/recitation sessions, and will also include opportunities for student questions.",
    "prerequisites": "BIOS 500 or permission of instructor required prior to enrollment.This class is for students enrolled in EPIMPH, or EPIMSPH, or EOHEPIMPH, or EOHEPIMSPH, or GLEPIMPH, or GLEPIMSPH plans only.",
    "instructors": "Azhar Nizam - Primary Instructor",
    "schedule_location": "TTh 3pm-4:20pm in Claudia Nance Rollins AUD",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3402, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 3-4:20p, Instructor: Team, Status: Closed",
    "date_accessed": "2024-03-30"
}