{
    "course_code": "GER 375",
    "course_title": "Spec. Topics in German Studies: Walter Benjamin:Cul Prod & Rev",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 6 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Same as CPLT 389 4, JS 380 1, PHIL 385 5)\n(Complete Topic - Walter Benjamin: Cultural Production and Revolution)\n(The German-Jewish scholar Walter Benjamin (1892-1940) wore many hats: philosopher, translator, cultural critic, historian. During the course of his life Benjamin witnessed the rise of fascism in Germany, and was forced into exile in 1933. After fleeing from the Nazi invasion of France with the hope of making his way to America, Benjamin committed suicide at the Spanish-French border in 1940. Because of his many interests Benjamin's work has enjoyed an international and multidisciplinary reception, influencing a wide range of disciplines including philosophy, film and media studies, cultural studies, literary theory and philology. Benjamin's varied interests are at the heart of this survey course. We will explore the themes of violence and revolution; translation and language; education and theater; and technology and film in Benjamin's work, alongside his evolving political and religious interests in anarchism, Jewish messianism, and communism. The course considers the evolving relations between these guiding themes and interests of Benjamin's broad scholarship, and the historical influences that localize the author in the debates and political context of his times. The course aims to foster cross-disciplinary discussion about Benjamin's work. No prior knowledge of Walter Benjamin or related topics are required for enrollment.)\nProvisional reading list:\nThe Critique of Violence (1921)\nThe Task of the Translator (1923)\nExcerpts from One-Way Street (1928)\nThe Author as Producer (1934)\nThe Work of Art in the Age of Mechanical Reproduction (1935)\nEduard Fuchs, Collector and Historian (1937)\nIntroductions to the Arcades Project (1935, 1939)",
    "course_description": "Taught in English. An interdisciplinary course intended to provide in-depth study of formative elements, influences, and movements in German-speaking culture(s). May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Frank Voigt - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Anthropology Building 105",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 5423, Section #: 2, Type: SEM, Campus: ATL, Meets: MW 1-2:15p, Instructor: Voigt/Smith, Status: Closed",
    "date_accessed": "2024-03-30"
}