{
    "course_code": "AMST 285",
    "course_title": "Special Topics: American Questions: Legal Hist. of Native Peoples",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Same as HIST 285 5, ANT 285 3)\nInstructor is new History faculty, Prof. Malinda Maynor Lowery.\nThis course explores the histories of diverse Native American nations through the lens of both Native and European law from early times to the twenty-first century. We will study the relationship between law and a nation's culture, and how the law both reflects society and structures society. Texts will include oral traditions, national constitutions, treaties, a novel, podcasts, images, and films, as well as a secondary text (Richotte's Federal Indian Law and Policy). We will introduce you to the social and political organization of Native societies; concepts such as ethnocentricity, reciprocity, resistance, and sovereignty; the legacies of colonialism; citizenship in both tribal and U.S. contexts; and how Native people use the law to ensure their survival. We will discuss topics including: the relationship between tribes, states, and the federal government; race and racism; gender, marriage, and family life; political authority and conflict; and land and religion. This introductory course is ideal for anyone seeking to understand the challenges that Native people face today and how culture influences law.",
    "course_description": "Seminars arranged around current issues and controversies in American culture. May be repeated as topic changes.\n.",
    "prerequisites": null,
    "instructors": "Malinda Lowery - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Atwood Chemistry Bldg. 240",
    "course_resources": null,
    "sections": "Class Nbr: 5683, Section #: 4, Type: SEM, Campus: ATL, Meets: TTh 10-11:15a, Instructor: Lowery/Locklear, Status: Open",
    "date_accessed": "2024-03-30"
}