{
    "course_code": "AFS 270",
    "course_title": "Topic Seminar: Black Germany",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 6 / Seats Avail: 5",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Same as GER 285-1 and AAS 285-2. In this course, we will engage interdisciplinarily with a wide range of media and texts (films, documentaries, prose works, autobiographies, and essays) in examining the historical development of Black Germany and discuss diasporic and transnational influences instrumental to the formation of early Black German movements. The course is structured along a chronological axis, and into four units.\n\n\nWe will begin our discussion with German colonial occupations in Africa. Next, we will interrogate the different manifestations of this legacy, discussing autobiographies of select Black Germans during the Nazi period. Following, we will turn our attention to the Postwar era and the Postunification period. We will discuss how Blackness was constructed in relation to Germanness, nationality, gender, and race and how these conceptualizations shaped the experiences of Black persons living in Germany. Lastly, in looking to the contemporary, we will consider the importance of Black popular culture for Germany and highlight notable efforts in scholarship, activism, cultural production, and creativity that continue to make visible the multiplicity of the Black German experience more.\nThroughout the course, we will make comparative references to the US and critically pursue the broad agenda of decolonization. We will use various media and read essential texts by authors that include Franz Fanon, May Ayim, W.E.B. DuBois, Grada Kilomba, Tina Campt, Fatima El-Tayeb, William Gardner Smith, and others.\n\n\nGrading Scale\nAttendance and participation (20%)\nWeekly journal entries (30%)\nTwo papers of 3-5 pages (30%)\nTwo short presentations (10%)\nA creative group project (15%)",
    "course_description": "An introductory course on African Studies. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Richmond Embeywa - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Bowden Hall 118",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_AFS_270_2_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 4696, Section #: 2, Type: SEM, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: R. Embeywa, Status: Open",
    "date_accessed": "2023-10-30"
}