{
    "course_code": "FREN 190",
    "course_title": "Freshman Seminar: French",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Freshmen Seminar - Limited to First Year Students Only)\n\n\nFREN 190 Fairytales and Flourishing (V. Bruyère MW 10-11:15am in person)\nContent: This class has two objectives. The first one is to reevaluate the French fairytale tradition as a pedagogy of flourishing, of flourishing under duress to be precise. For even cautionary tales have something to tell us about flourishing as an unevenly distributed state, at once extremely codified and saturated with expectations, and yet, up for grab and infused with exhilarating sense of prospects.   \nThe second objective is to ask what literary and cultural studies would gain from including flourishing in its critical vocabulary. Literary scholars have a fairly refined vocabulary when it comes to accounting for negativity and anti-sociality but not so much when it comes to affirmative states like flourishing. Modernism has taught them that being scholarly and critical is to be suspicious; being literary is being subversive; being creative is being destructive. And that paranoia generates powerful claims about power. Is there a chance early modern stories featuring foundlings and freaks with a monstrous appetite for love and death have what it takes to empower scholarly claims to flourishing?\n\n\nI take the critical reception of the fairytale tradition as emblematic of a certain way of doing things in literary studies. Fairytales have been an object of choice for the constitution of literary studies as a scientific discipline with anthropological ambitions. After all, there is something extremely seductive about the all-encompassing Aarne-Thompson classification. At the same time, that kind of formalism feels like a dead-end. What if instead of looking back, that is, instead of thinking about fairytales exclusively in folkloristic terms as objects from the past, we were looking forward to the kind of flourishing they solicit, at the risk of being puzzled by what it means in them to flourish against the odds. In this class, looking forward will also mean reconnecting early modern storytelling practices with the work of contemporary artists and activists engaged in the redefinition of the good life.",
    "course_description": "This freshman seminar will focus on themes in French culture from social history, the arts, and current information media. Cross-cultural comparisons provide a rich basis for discussion.",
    "prerequisites": null,
    "instructors": "Vincent Bruyere - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in Candler Library 122",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2742, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 10-11:15a, Instructor: V. Bruyere, Status: Closed",
    "date_accessed": "2024-03-30"
}