{
    "course_code": "CHEM 204",
    "course_title": "Macromolecules",
    "credit_hours": "3",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Varies by section",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": "Science, Nature, Technology",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "This course explores the preparation, characterization, function and degradation of synthetic and biological polymers. Ranging from petroleum-based polyethylene and polyethylene terephthalate (PET) to bio-resourced polylactic acids and polysaccharides to cellular components including nucleic acid and proteins, macromolecules play essential roles but also present major challenges in today's world. The course emphasizes understanding the chemical and physical properties of the respective building blocks and their non-covalent interactions as the foundation for macromolecular properties and function.",
    "course_description": "The relationship between sequence, structure, and function of macromolecules. The course will progress from exploring these themes in the context of synthesis, characterization, and utility of simple organic polymers to understanding the properties of complex,chemically diverse biomolecules.",
    "prerequisites": "CHEM 203 or CHEM_OX 203 or CHEM 222 or CHEM_OX 222 or CHEM 222Z or CHEM 203Z or equivalent transfer credit as prerequisite.",
    "instructors": null,
    "schedule_location": "Varies by section",
    "course_resources": null,
    "sections": "Class Nbr: 2922, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 1-2:15p, Instructor: V. Conticello, Status: Open\nClass Nbr: This section is full 2923, Section #: 2, Type: LEC, Campus: ATL, Meets: TTh 9:40-10:55a, Instructor: M. Weinschenk, Status: Wait List\nClass Nbr: This section is full 2924, Section #: 3, Type: LEC, Campus: ATL, Meets: MW 9:40-10:55a, Instructor: R. Himes, Status: Wait List\nClass Nbr: This section is full 2925, Section #: 4, Type: LEC, Campus: ATL, Meets: MW 6-7:15p, Instructor: J. Heemstra, Status: Wait List",
    "date_accessed": "2024-03-30"
}