{
    "course_code": "CHEM 399R",
    "course_title": "Introduction To Research",
    "credit_hours": "1-4",
    "seats": "Seats: Maximum Enrollment: 100 / Seats Avail: 80",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Permission Required Prior to Enrollment)\n\n\nChem 399 and 499 are the classes students enroll in when they are conducting research in one of the research groups in the department. In a student's first semester of undergraduate research, while the student is learning the techniques of the lab, and becoming familiar with the project, they enroll in Chem 399. In subsequent semesters, when they are more experienced, research credit is given through Chem 499.\n \nTo find a research mentor to start doing research in the department, please look at individual faculty members: websites, and find people who are doing things that interest you. Research requires a significant time commitment, and you need to be passionate about your area in order for the experience to be rewarding for both you and your research advisor.\n \nIf you wish to receive credit in the department for research performed outside of the department you must submit a petition to the Undergraduate Committee in Chemistry no later than a week before the semester begins.",
    "course_description": "Introduces students to instrumental procedures and empirical techniques used in chemical research. Total credit not to exceed four hours. Cannot be used to meet course requirements for a chemistry major.",
    "prerequisites": null,
    "instructors": "Vincent Conticello - Primary Instructor",
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 2880, Section #: 1, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: V. Conticello, Status: Open",
    "date_accessed": "2024-03-30"
}