{
    "course_code": "CHEM 370",
    "course_title": "Special Topics in Chemistry: Biochem.:Systems Chem.Approach",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 60 / Seats Avail: 9Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "Systems Chemistry is emerging (https://en.wikipedia.org/wiki/Systems_chemistry) as a field that explores complex mixtures of interacting molecules, going beyond the sum of the characteristics of each individual component and drawing inspiration from the molecular evolution of living organisms. From chemical reaction networks maintained far from equilibrium to self-constructing and self-repairing dynamic systems responsive to biotic and abiotic inputs, we will explore the evolution of new function. Students will build on their foundations, Chem 204 and Biol 142, to gain a new understanding of health and disease in biological systems. We will move from feedback and cooperativity in chemical reaction networks so beautifully highlighted in biological metabolism to a system understanding of emerging frontiers in biochemistry. Knowledge gained through open dialog and discussion will highlight the diverse properties of biopolymer assemblies, smart materials, dynamic chemical networks underlying metabolism, spatiotemporal cellular rhythms, signal transduction in information networks, reaction networks across informational scales, and how changing geochemical cycles are impacting human resilience. The course will offer new and different ways of thinking about biochemistry that will be useful in future careers that extend chemistry, material science, biochemistry and synthetic biology to contribute to human well-being in our changing climate.",
    "course_description": "A seminar for advanced students on topics of current interest in chemistry.",
    "prerequisites": "CHEM 204 or CHEM_OX 204 or CHEM 205 or CHEM_OX 205 or equivalent transfer credit as prerequisite.",
    "instructors": "David Lynn - Primary Instructor",
    "schedule_location": "MW 9:40am-10:55am in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 2943, Section #: 3, Type: LEC, Campus: ATL, Meets: MW 9:40-10:55a, Instructor: D. Lynn, Status: Open",
    "date_accessed": "2024-03-30"
}