{
    "course_code": "PSYC 190",
    "course_title": "Fresh Sem: Psychology: Psychology of Fiction",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Freshmen Seminar - Limited to First Year Students Only)\n(This seminar will begin with a basic grounding in three areas of psychology: 1) psychoanalytic, behavioral, and interactional approaches to personality; 2) family dynamics; and 3) psychological and social development from childhood to old age. Using this information about real people, five current works of fiction will be read and analyzed. Emphasis will be on the manner in which psychological knowledge can be applied not only to the characters and plots in the novels, but to their writers as well. Further focus will be on the ways in which knowledge gained from fictional characters can be applied to the understanding of real-life people and situations. Students will be required to prepare three term papers and to participate actively in class discussions.)\n\n\n(Freshmen Only)",
    "course_description": "Small class experience on topics of current psychological interest that fosters a highly interactive and mutually collaborative learning environment involving freshmen and faculty members. Topics include clinical, neuroscience, animal behavior, social, development and cognition.",
    "prerequisites": null,
    "instructors": "Marshall P Duke - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in New Psyc Bldg 393 (36 Eagle Ro",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3228, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: M. Duke, Status: Closed",
    "date_accessed": "2024-03-30"
}