{
    "course_code": "HISP 720",
    "course_title": "Topics in Imperial & Post/Colonial Culture: Themes&Appr.Lat.Am.History",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 4 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Same as HIST 562R 1, RLR 700 6, ANT 585 4)\nComplete topic title: The Biographical Turn: Archival Lives, Microhistory & Speculation.\nThis course addresses a broad scope of Latin American history through the lens of the \"new biography.\" With the advent of social history in the 1970's, biography as a mode of engaging with the past, often associated with 'Big Man' history, fell out fashion. It returned through the back door as historians sought to recover the experiences of marginalized people whose lives and histories have remained largely invisible. Source material provides the central challenge for this new mode since women, laborers, and African and Indigenous-descent communities often left little paper trail. Practitioners of the new biography compensate for these archival silences by resorting to different kinds of sources, repurposing older methods like microhistory, and embracing controversial approaches at the boundaries between history and fiction. We will read cutting-edge biographies that made a historiographical impact in their time, and newer work that continues to push the limits of the discipline.",
    "course_description": "This course will focus on \"empire, colonialism & post-coloniality.\" Under this rubric, we will design and teach seminars that explore the discursive construction of empire/colony and postindependence nation-states, as well as how the Hispanic world has participated in and generated discussions about the relationship between coloniality and modernity, with particular emphasis on how those discussions have emerged at different times and in various places, along with their past and present impact.",
    "prerequisites": null,
    "instructors": "Karen Stolley - Primary Instructor",
    "schedule_location": "T 2:30pm-5:30pm in Bowden Hall 323",
    "course_resources": null,
    "sections": "Class Nbr: 4458, Section #: 1, Type: LEC, Campus: ATL, Meets: T 2:30-5:30p, Instructor: Stolley/Yannakakis, Status: Open",
    "date_accessed": "2024-03-30"
}