{
    "course_code": "HISP 510R",
    "course_title": "Understanding Hispanic Studies: Theories and Methods",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 6",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "Spanish as a Historical Problem  \nThis course proposes a review of various articulations of language and history; a reading against the grain \"at times perhaps ironic\" of the production of the object \"Spanish language\" under diverse disciplinary and political conditions. The glotto-political perspective invites us to approach in a reflexive and critical way the conceptualizations of language and the forms of knowledge production that identify objects \"objects of legitimate study\" such as the historical emergence of Spanish, its organic evolution, the selection of its correct form and the circumstances of its spread throughout the Iberian Peninsula, through the American continent and beyond.  The adoption of a critical and reflexive position will force us to examine the material conditions of production of these objects and to keep in mind our own position as university researchers. The goal is to address cultural discourse, disciplinary orders and political projects through the study of the Spanish language as a social practice and its ideological representations.\n\n\nThis course is co-taught with Prof. Jose del Valle of CUNY Graduate Center. The course will meet in person and connect with CUNY students virtually on Tuesdays. LGS students will then meet additionally to satisfy credit hour requirements.",
    "course_description": "Defining what is signified by the term 'Hispanism' presents an epistemological and ideological challenge to scholars. This seminar will introduce students to Hispanism's key disciplinary debates and controversies. Students will be equipped to develop and articulate their own positioning in these debates while cultivating their critical-analytical skills through a range of written and oral exercises.",
    "prerequisites": null,
    "instructors": "Donald Tuten - Primary Instructor",
    "schedule_location": "T 11:45am-1:45pm in Callaway S501",
    "course_resources": null,
    "sections": "Class Nbr: 5449, Section #: 1, Type: LEC, Campus: ATL, Meets: T 11:45a-1:45p, Instructor: D. Tuten, Status: Open",
    "date_accessed": "2024-03-30"
}