{
    "course_code": "CL 222",
    "course_title": "Art & Architecture of Ancient Rome",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 6Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "Humanities and Arts(*)",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(Same as ARTHIST 222 1)\n(Topic - Images of Power: The Art & Architecture of Ancient Rome)\n(Roman civilization, from the Republican through the Imperial periods, transformed the art and architecture of the ancient Mediterranean.  Innovations in engineering and technique, the introduction of new materials (like concrete), and the Roman genius for cultural assimilation all combined to create an art which was exciting as well as eclectic.  Indeed, Roman art has often been characterized as the first truly modern art.  The course will investigate the ways in which major achievements in sculpture, painting, numismatic and glyptic art, as well as architecture often reflected contemporary developments in Roman politics, society and religion.  In addition the course will explore the relationship of works of art and architecture erected in the city of Rome to those in the provinces, the interaction of public and official art to domestic art, as well as the impact of art commissioned by imperial and elite patrons on that commissioned by non-elite patrons.)\nArt History major/minor: Division I\nArchitectural Studies minor: elective",
    "course_description": "The Roman genius for cultural assimilation and innovative techniques transformed the art of the ancient Mediterranean. The course investigates major achievements in sculpture, painting, and architecture and their resonances with Roman politics, society, and religion.",
    "prerequisites": null,
    "instructors": "Eric Varner - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in White Hall 102",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_CL_222_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 4556, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: E. Varner, Status: Open",
    "date_accessed": "2023-10-31"
}