{
    "course_code": "CL 329R",
    "course_title": "Spec Stud in Classical Culture: Magic and Mysteries",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(Same as ANT 385 4, REL 370 3)\n\n\nMAGIC AND MYSTERIES\n                                                in the Greek and Roman world\nAncient gods were useful allies for falling in love, cursing an enemy, exacting revenge or nailing down your best outcomes for the afterlife (which included delaying your entry!).  Magical practices and mystery rites offer insight into some of the intimate hopes and nastier motivations for those who  drew close to the gods. In this course we will explore the archaeological, literary and epigraphic sources for these practices, from gemstones to graffiti, Mithraic caves to magnificent cult centers, and the magicians, necromancers, wizards and witches of the literary record. Our material will take us far beyond the boundaries of Greece and Rome, with parallels and possible sources in Egyptian, Hittite, Jewish and Christian contexts. Magical practices intersect with medicine, law, and conceptions of the boundary between human, animal, and cosmic entities; the mystery cults of Samothrace, Eleusis, and Mithras foreground the political power, practical benefits, and competition with Christianity that complicates their investigation as much as did the ancient vows to keep the rites themselves secret.",
    "course_description": "Topic changes to meet current interest of students and faculty. Course may be repeated for credit as topic varies.",
    "prerequisites": null,
    "instructors": "Sandra Blakely - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Anthropology Building 105",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_CL_329R_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: This section is full 2275, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: S. Blakely, Status: Closed",
    "date_accessed": "2023-10-31"
}