{
    "course_code": "ENGRD 380W",
    "course_title": "Topic: Writing/ Rhetoric/Literacy",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Continuing Writing Requirement",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "The Rhetoric of Misinformation - Misinformation is a complex and challenging facet of our current information and media ecosystems. Misinformation is, essentially, information that is incorrect, false, or misleading. But part of the complexity of misinformation stems from the many forms it can take. Misinformation can be intentional or unintentional, can appear in social media posts or full-scale campaigns aimed at obfuscation. In the 21st century, misinformation has adopted new forms and poses new challenges. This course will explore the rhetorical forms and features of misinformation to provide deeper insight into what it is, how it functions, and how we can overcome it. \nWe will unpack the media and information ecosystems that shape the forms of misinformation that we currently see, delve into the rhetorical trends, forms, and features of misinformation, and develop information and media literacy skills to better recognize and overcome misinformation. This course is organized in three distinct modules. In the first module we will look at the rhetoric of misinformation and evaluate how language is used to manipulate audiences. In the second module, we zoom out to understand how that rhetoric serves and is propagated in information ecosystems. Finally, in module three we look at the relationship between propaganda and truth. Assignments include regular reflections, analysis papers, and a multimodal final project which teaches and empowers regarding misinformation.",
    "course_description": "Course topics will vary but always will be focused on writing, rhetorical composition and analysis, or literacy skills. Topics possible include a variety of options such as journalistic writing, non-fiction, debate, argumentation, persuasion, digital writing, among others.",
    "prerequisites": null,
    "instructors": "Sarah Harsh - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Candler Library 121",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2965, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: Team, Status: Closed",
    "date_accessed": "2024-03-30"
}