{
    "course_code": "FREN 331",
    "course_title": "Temporalities",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 18Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "Intercultural Communication(*)",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "FR 331: \"La belle Époque\" \nC. Nouvet / TTh 1:00-2:15pm\nContent:  We will explore various facets of the \"belle époque,\" a term coined to name the period from 1871 (end of the Franco-Prussian war) to 1914 (beginning of WWI). Marked by socio-cultural changes, artistic and technological innovations, this period seemed retrospectively, after the horrors of WWI, \"beautiful,\" lively, exuberant even, although it had its sinister underside (antisemitism of the Dreyfus Affair, colonialism, poverty). We will focus on writers at the intersection of the new modes of expression which emerged in literature, music and dance. Apollinaire and Mallarmé (whose works were set to music by composers such as Debussy) saw in other media echoes of their own innovative practices: Apollinaire in avant-garde painting (such as Cubism) and Mallarmé in the beginning of modern dance (Loïe Fuller's veil dances). We will also address the question of sexuality. Colette explored in her novels her own version of a freer femininity. Female hysteria (and the question of feminine sexuality) captured the interest of the medical community (Charcot, Freud) and popular culture. The painter Toulouse-Lautrec advertised in his posters (which he turned into an art form) the marginal culture of the cabarets (Moulin Rouge, Folies bergères) and the performances, often deemed \"hysterical,\" of its dancers.\n\n\nTexts may include:\no\tZola: J'accuse\no\tDidi-Huberman: Invention of Hysteria: Charcot and the Photographic Iconography of the Salpêtrière [selections]\no\tFreud: Studies on Hysteria [selections]\no\tToulouse-Lautrec: selection of paintings and posters\no\tColette: La vagabonde \no\tApollinaire: Alcools [selections]; Calligrammes [selections]\no\tPoulenc [music]: Calligrammes - Sept Mélodies sur des poèmes de Guillaume Apollinaire \no\tMallarmé: \"L'après-midi d'un faune\" \n      \t      \"Autre étude de danse : Les fonds dans le ballet\"  \no\tDebussy [music]: Prélude à l'après-midi d'un faune\no\tRavel [music]: Trois poèmes de Stéphane Mallarmé\no\tLoïe Fuller: Serpentine dance [movie by the Lumière brothers]",
    "course_description": "This course focuses on the development of key concepts, ideas, or movements across historical periods and cultural contexts. By retracing their elaboration it serves to highlight continuities and discontinuities in the historical development of French and Francophone literatures and cultures.",
    "prerequisites": "FREN 310 or FREN_OX 310 and FREN 314 or FREN_OX 314 or equivalent transfer credit as prerequisite.",
    "instructors": "Claire Nouvet - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in Candler Library 121",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_FREN_331_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2979, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 1-2:15p, Instructor: C. Nouvet, Status: Open",
    "date_accessed": "2024-03-28"
}