{
    "course_code": "FREN 341",
    "course_title": "Intersections",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 9 / Seats Avail: 9Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "FREN 341 (Same as CPLT 389 1) Fictions of Photography\nE. Marder\nContent: Since its invention in 1839, photography has been a source of fascination, reflection, inspiration, and revulsion for many nineteenth and twentieth century thinkers and writers.  Because the medium of photography has the capacity to record images that are not available to the naked eye and to preserve and repeat them indefinitely, photography has given rise to many powerful written reflections about mourning, memory, time, history, fantasy, ghosts, death, and desire. In this course, we will examine a selection of literary, philosophical, and theoretical texts to help us think about  how photographic writing affects our understanding of images, events, and history. Readings may include works by: Charles Baudelaire, Nadar, Edgar\nAllan Poe, Villiers de L'Isle Adam, Frederick Douglass, Roland Barthes, Walter Benjamin, Danielle Arasse, Malek Alloula, Susan Sontag, and Marguerite Duras.\n\n\nRequired Course Texts:\n - Alloula, Malek. \"The Colonial Harem.\" - Arasse, Daniel. \"Selections from The Guillotine and the Imaginary of the Terror\"Barthes, Roland. Camera Lucida [La Chambre claire]\nBaudelaire, Charles.\n\"The Modern Public and Photography\" [\"Le public moderne et la photographie\"]\n\"Philosophy of Toys.\" [\"Morale du joujou\"]\nSelected Poems in verse & prose: \"To A Passer-by\" [\"A une passante\"]; \"The Swan\" [\"Le\nCygne\"]; \"The Widows\" [\"Les Veuves\"]; \"Miss Scalpel\" [\"Mademoiselle Bistouri\"];\n\"Beautiful Dorothy\" [\"La belle Dorothée\"]\nBenjamin, Walter. \"The Short History of Photography\"Champfleury, \"The Legend of the Daguerreotypist\"Duras, Marguerite. The Lover [L'Amant]\nDouglass, Frederick. \"Lecture on Pictures; 'Pictures and Progress'\nFreud, \"Screen Memories\"Holmes, Oliver Wendell. \"The Stereoscope and the Stereograph\"Maupassant, Guy de. \"The Hermit.\" [\"L'Hermite]\"Nadar, Félix. \"Balzac and the Daguerreotype\"Poe, Edgar Allan. \"The Oval Portrait.\" \"Daguerreotype\"Ponge, Francis. \"Snails\" [\"Escargots\"]\nProust, Marcel. (selections)\nSebbar, Leïla. \"La Photo d'Identité\"Maud Sulter, https://www.impressions-gallery.com/event/maud-sulter-passion/\nSontag, Susan. On Photography (selections)\nVilliers de L'Isle Adam. \"Snapshots of World History\" from Tomorrow's Eve and \"The Secret ofthe Scaffold\"",
    "course_description": "Through a variety of texts and artifacts, including but not restricted to literature, travelogues, legal documents, medical, historical, and political treatises, visual arts, students are introduced to specific interdisciplinary issues in French and Francophone Studies. Taught in English.",
    "prerequisites": "FREN 310 or FREN_OX 310 and FREN 314 or FREN_OX 314 or equivalent transfer credit as prerequisite.",
    "instructors": "Elissa Marder - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in MODERN LANGUAGE_128",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_FREN_341_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2996, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: E. Marder, Status: Open",
    "date_accessed": "2024-03-28"
}