{
    "course_code": "LAW 576",
    "course_title": "Leadership for Lawyers",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 25Waitlist Total: 0 of 1",
    "waitlist_total": ": 0 of 1",
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-08 through 2024-04-22",
    "class_notes": "Learning Objectives:\nAt the end of the course, your learning outcomes will include the development of:\n1) Understanding of major leadership theories, styles and types of leaders, critical leadership attributes, and of leaders¿ relationships with their constituents;\n2) Understanding of how leadership is important for lawyers and how leadership abilities influence and advance the work of lawyers; studying lawyers in leadership roles;\n3) Development of personal leadership competencies such as effective team-building and teamwork, communication to inspire and persuade, collaboration in groups and mediation of problems and disputes, executive decision-making, cross-cultural competencies, and others;\n4) Individual development of leadership path through design and implementation of plans for lifelong learning and lifelong leadership.",
    "course_description": "This course examines fundamental principles of leadership. The Leadership for Lawyers course is intended to provide an introduction to prevalent theories of leadership and leadership education and their relevance to lawyers and law students, and, second, to develop leadership competencies in all students enrolled in the course.\nThe course has three components: \nFirst, an introduction to theories and types of leadership with an emphasis on leadership practiced by lawyers. \nSecond, we will consider several of the key attributes and competencies (as briefly described above) that effective lawyer-leaders must possess and be able to demonstrate in their organizations. \nThird, the course will emphasize the development of your leadership abilities, including the creation of a plan for ¿lifetime¿ (or career) leadership. \nOne of the fundamental goals of the course is to identify your existing (and often demonstrated) leadership abilities, strengthen and build upon your leadership potential and assist you in planning for the growth of your leadership abilities throughout your careers.",
    "prerequisites": null,
    "instructors": "Mary Anne Bobinski - Primary Instructor",
    "schedule_location": "W 4pm-5:35pm",
    "course_resources": "https://emory.bncollege.com/course-material/course-finder?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_LAW_576_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2880, Section #: 001, Type: LEC, Campus: ATL, Meets: W 4-5:35p, Instructor: Bobinski/Bedzow, Status: Open",
    "date_accessed": "2023-10-31"
}