{
    "course_code": "LAW 609L",
    "course_title": "Internat'l Commercial Arbitration",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 30 / Seats Avail: 25Waitlist Total: 0 of 5",
    "waitlist_total": ": 0 of 5",
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-08 through 2024-04-22",
    "class_notes": "Final Assessment: Scheduled In-Class Exam",
    "course_description": "This course covers a wide variety of topics relating to international commercial arbitration and demonstrates why this is the preferred form of dispute resolution for knowledgeable international commercial actors. In this course, students will learn:\n- the different sources of authority used in international commercial arbitration;\n- the importance of international arbitration in a transnational commercial context;\n- how to draft international arbitration agreements;\n- how to navigate the intersection between litigation and arbitration;\n- how to identify issues relating to human rights and corruption in international commercial dispute resolution;\n- how international commercial mediation interacts with international commercial arbitration;\n- various procedural elements concerning the formation of the arbitral tribunal and the conduct of the proceedings; and\n- enforcement issues in an international context.\nThis course focuses primarily on arbitration seated or awards enforced in either the United States or the United Kingdom, but reference will be made to other jurisdictions. No special language skills are needed for this course.\nThe assessment methods will be both formative (research paper and presentation, potentially as part of a mock arbitration) and summative (final exam on items not covered by the mock arbitration). This class does not constitute a simulation, law clinic or field placement.",
    "prerequisites": null,
    "instructors": "Stacie Strong - Primary Instructor",
    "schedule_location": "TTh 8:30am-10am in Gambrell Hall - 1B",
    "course_resources": "https://emory.bncollege.com/course-material/course-finder?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_LAW_609L_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 5764, Section #: 001, Type: LEC, Campus: ATL, Meets: TTh 8:30-10a, Instructor: S. Strong, Status: Open",
    "date_accessed": "2024-03-30"
}