{
    "course_code": "LAW 606",
    "course_title": "Mediation Advocacy",
    "credit_hours": "2",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 3",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-08 through 2024-04-22",
    "class_notes": "Final Assessment: Take-home Final\nThis is an accelerated course. The class will meet six times on Thursdays and Fridays for 4 hours. The class will meet on: 25 January, 26 January, 1 February, 2 February, 15 February, 16 February.",
    "course_description": "Mediation is an alternative dispute resolution (ADR) method that has become an essential part of the legal systems. Its institutionalization, as well as widespread application - particularly in many civil disputes - requires lawyers to have a practical and theoretical understanding of mediation. In Georgia, like in other state and federal courts, parties are required to go to mediation before they go to trial. Mediation is also becoming a popular method to resolve disputes in other countries, as well as in the international arena, and thus it is a universal method for the resolution of many types of conflicts. Mediation is also an important part of effective legal representation - requiring a problem-solving approach to conflicts.\nThe course will make students familiar with the mediation rules and processes, as well as the international legal framework of mediation. Students will study mediation from a comparative perspective, including differences between court proceedings, arbitration, negotiation, and mediation, about the distinct role of a mediator, as opposed to a judge or arbitrator. The course will explore the mediation process from different perspectives - particularly parties, attorneys and mediators. During the course, students will discuss the use of mediation by lawyers, as well as the role of lawyers in mediation. Emphasis will be put on effective advocacy in mediation. Students will have an opportunity to practice effective communication skills and take part in mediation role-playing. During each class students will take part in role play. Teaching techniques including class discussion, presentation of video clips, skills exercises, and mediation role-playing will be utilized. Active participation in the class is required.",
    "prerequisites": null,
    "instructors": "Ewa Gmurzynska - Primary Instructor",
    "schedule_location": "Th 3:45pm-7:45pm in Gambrell Hall - 1C\nF 9am-1pm in Gambrell Hall - 1C",
    "course_resources": "https://emory.bncollege.com/course-material/course-finder?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_LAW_606_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 5910, Section #: 001, Type: LEC, Campus: ATL, Meets: Th 3:45-7:45p; F 9a-1p, Instructor: E. Gmurzynska, Status: Open",
    "date_accessed": "2024-03-30"
}