{
    "course_code": "LAW 659A",
    "course_title": "Doing Deals: Contract Drafting",
    "credit_hours": "3",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Varies by section",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-08 through 2024-04-22",
    "class_notes": "Registration for this class is only for students in the Transactional Certificate Program. Non-certificate students can try to enroll during Open Enrollment, if there are open seats.",
    "course_description": "This course teaches students the principles of drafting commercial agreements. Although the course will be of particular interest to students pursuing a corporate or commercial law career, the concepts are applicable to any transactional practice. In this course, students will learn how transactional lawyers translate the business deal into contract provisions, as well as techniques for minimizing ambiguity and drafting with clarity. Through a combination of lecture, hands-on drafting exercises, and extensive homework assignments, students will learn how to review and draft different types of contracts. The course will also focus on how a drafter can add value to a deal by finding, analyzing, and resolving business issues. Note: Open enrollment will be available to non-transactional certificate students on a space-available basis to students with required pre-reqs once open enrollment starts.",
    "prerequisites": "B.A. is a pre-/co-requisite for Contract Drafting. Only Certificate students are allowed to register at this time. All remaining seats will be released during the next open enrollment period.  Please contact Kelli.Pittman@emory.edu with all inquiries.",
    "instructors": null,
    "schedule_location": "Varies by section",
    "course_resources": null,
    "sections": "Class Nbr: 2848, Section #: 001, Type: LEC, Campus: ATL, Meets: M 4:15-7:15p, Instructor: R. Lewis, Status: Open\nClass Nbr: 2847, Section #: 002, Type: LEC, Campus: ATL, Meets: T 4:15-7:15p, Instructor: R. Saudek, Status: Wait List\nClass Nbr: 2850, Section #: 004, Type: LEC, Campus: ATL, Meets: T 4:15-7:15p, Instructor: S. Lawson, Status: Open",
    "date_accessed": "2024-03-30"
}