{
    "course_code": "LAW 659F",
    "course_title": "Doing Deals: General Counsel",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 0Waitlist Total: 0 of 3",
    "waitlist_total": ": 0 of 3",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-08 through 2024-04-22",
    "class_notes": "Registration for this class is only for students in the Transactional Certificate Program. Non-certificate students can try to enroll during Open Enrollment, if there are open seats.",
    "course_description": "In this course, students will develop transactional skills, with emphasis on possible differences in roles of in-house counsel and outside counsel in the context of a hypothetical transaction that will be the focal point of the entire semester. The class will be divided between the lawyers representing the buyer and the lawyers representing the seller. Students will interview the Professor (client) throughout the semester and develop goals, strategies, and documents that will meet the needs of the client. The semester will include the drafting and negotiation of a confidentiality agreement, a letter of intent, an employment agreement, a Master Services Agreement, and a Stock Purchase Agreement.",
    "prerequisites": "You do not meet the pre- or co-reqs as determined by the Transactional Law Program to register for this class at this time. Please contact Kelli.Pittman@emory.edu with all inquiries.",
    "instructors": "Gregg Notte - Primary Instructor",
    "schedule_location": "M 6pm-9pm in Gambrell Hall 5J",
    "course_resources": "https://emory.bncollege.com/course-material/course-finder?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_LAW_659F_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2792, Section #: 001, Type: LEC, Campus: ATL, Meets: M 6-9p, Instructor: G. Notte, Status: Wait List",
    "date_accessed": "2024-03-30"
}