{
    "course_code": "LAW 673",
    "course_title": "Securities: Brokers/Dealers",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 22 / Seats Avail: 22Waitlist Total: 0 of 2",
    "waitlist_total": ": 0 of 2",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-08 through 2024-04-22",
    "class_notes": "Final Assessment: Scheduled In-Class Exam",
    "course_description": "The primary participants in the securities industry are issuers, investors and the intermediaries acting between or on behalf of them, as well as, of course, regulators, This course focuses on the regulators and the intermediaries - broker-dealers and investment advisers, and a new class of intermediaries, crowdfunding portals. My goal is to provide an academic foundation of relevant law, as well as practical guidance relating to issues frequently arising in practice, whether in private practice or an industry participant. Course coverage will include the SEC and state securities regulators, as well as the Financial Industry Regulatory Authority (FINRA), a self-regulatory body that is the principal day-to-day regulator of broker-dealers and portals. In addition to the SEC and state regulators, FINRA is the entity with which broker-dealers and their counsel will commonly interact with regard to most regulatory matters. In addition, the course will examine the regulation of investment advisers, a segment of the securities industry that has been growing in size and importance in recent years. Investment advisers are regulated either by the SEC or by state regulators, depending upon their size.",
    "prerequisites": null,
    "instructors": "Bob Terry - Primary Instructor",
    "schedule_location": "MW 3:15pm-4:45pm",
    "course_resources": "https://emory.bncollege.com/course-material/course-finder?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_LAW_673_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2699, Section #: 001, Type: LEC, Campus: ATL, Meets: MW 3:15-4:45p, Instructor: B. Terry, Status: Open",
    "date_accessed": "2023-10-31"
}