{
    "course_code": "LAW 690B",
    "course_title": "Human Rights Advocacy",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 6 / Seats Avail: 0Waitlist Total: 0 of 2",
    "waitlist_total": ": 0 of 2",
    "grading_mode": "Graded",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-08 through 2024-04-22",
    "class_notes": "Final Assessment: Paper/Project",
    "course_description": "Human rights organizations and lawyers play essential roles in protecting and promoting human rights, the rule of law and democracy, both at home and abroad. They expose injustices and demand accountability for them; they pressure governments to fulfill their democratic and human rights obligations, and they help the voiceless reclaim their voice. This course is designed to build the skills of the budding human rights lawyer to achieve these goals. It will start with a brief overview of international human rights law and then will be divided between lectures focusing on skills development, examining the fundamentals of advocacy, and highlighting the ethical dilemmas and barriers to change human rights lawyers regularly face. To reinforce these lessons, each student will be assigned a research project on an issue supplied by human rights organizations from across the globe. Past participating organizations included Human Rights Watch, the Southern Poverty Law Center and The Carter Center. Some class time will be reserved for workshopping these projects.",
    "prerequisites": null,
    "instructors": "Hallie Ludsin - Primary Instructor",
    "schedule_location": "TTh 2pm-3:30pm in Gambrell Hall 5J",
    "course_resources": "https://emory.bncollege.com/course-material/course-finder?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_LAW_690B_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2896, Section #: 01, Type: LEC, Campus: ATL, Meets: TTh 2-3:30p, Instructor: H. Ludsin, Status: Wait List",
    "date_accessed": "2024-03-30"
}