{
    "course_code": "LAW 679",
    "course_title": "Access to Justice",
    "credit_hours": "2",
    "seats": "Seats: Maximum Enrollment: 14 / Seats Avail: 14",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-08 through 2024-04-22",
    "class_notes": "Final Assessment: Paper/Project\nThis course is eligible to be counted towards the requirements for the J.D. concentration in Criminal Litigation.",
    "course_description": "Access to Justice provides second and third year law students the unique opportunity to see how justice is actually administered in criminal cases in Georgia State Courts as well as to develop their courtroom oral advocacy skills in a real-world setting. We will examine, through readings and classroom discussion, the ways in which poor and underserved populations access justice within the framework of the traditional criminal justice system, including the barriers that may prevent justice from being served in those processes.  We will also discuss the increasing role of accountability courts for defendants experiencing drug, alcohol, mental health and other related challenges.\nHowever, this class extends beyond the conventional classroom in two significant ways.  First, students will take several off-campus trips, including touring the local jail facility and attending actual court sessions to observe criminal case proceedings. Second, students will receive real recent criminal case warrants and police reports and participate in mock classroom hearings designed to mirror in all aspects the actual legal proceedings of those cases. The goal is for students to leave the class with both a very real, hands-on understanding of the entire process a defendant charged with a crime will go through as well as a toolbox of courtroom skills for practicing criminal law.\nStudents will need to attend 4-6 court sessions (some in person, some virtual) throughout the semester.  Days and times of court proceedings will vary widely and the instructor will work to accommodate individual student schedules as much as possible.  Students will be graded on their performance in classroom exercises, participation in class discussion, and a final paper.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": "M 5pm-7pm",
    "course_resources": "https://emory.bncollege.com/course-material/course-finder?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_LAW_679_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2698, Section #: 001, Type: LEC, Campus: ATL, Meets: M 5-7p, Instructor: Staff, Status: Open",
    "date_accessed": "2023-10-31"
}