{
    "course_code": "LAW 689",
    "course_title": "Comparative Con Law",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 20",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-08 through 2024-04-22",
    "class_notes": "Final Assessment: Paper/Project",
    "course_description": "Most countries have a constituent law, or constitution, that establishes higher principles, rights, obligations and the state¿s institutional structure. Some constitutions are quite different. What can be learned about comparing constitutions? What methodology is used? How are constitutions formed, drafted, amended or replaced, and how does this differ? How do rights, obligations and structures differ? How are they similar? How are these constitutional principles developed and adjudicated? This course will discuss various forms of constitutions and concepts of constitutionality, and compare how constitutions evolve, develop or reflect national identities, and frame doctrine. The course will also consider constitutional performance, or how the constitution is serving its purpose. It will also consider how constitutional drafting and implementation, as well as transitional provisions, can support or hinder constitutional performance. Constitutions and constitutional authorities may also be undermined or lead to constitutional crises in various ways. This course will equip a student to better understand and learn from the variety of constitutional frameworks and doctrines.",
    "prerequisites": null,
    "instructors": "Jon Smibert - Primary Instructor",
    "schedule_location": "MW 4pm-5:30pm",
    "course_resources": "https://emory.bncollege.com/course-material/course-finder?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_LAW_689_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2841, Section #: 001, Type: LEC, Campus: ATL, Meets: MW 4-5:30p, Instructor: J. Smibert, Status: Open",
    "date_accessed": "2023-10-31"
}