{
    "course_code": "LAW 697C",
    "course_title": "Turner Environ Law Clinic",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Instructor Consent Required",
    "dates": "2024-01-08 through 2024-04-22",
    "class_notes": null,
    "course_description": "The Turner Environmental Law Clinic provides important pro bono legal representation to community groups and nonprofit organizations that seek to protect and restore the natural environment and promote environmental justice. Through its work, the Clinic offers students a hands-on introduction to environmental law and trains the next generation of environmental attorneys. The key matters occupying the Clinic's current docket - fighting for clean and sustainable energy; promoting regenerative agriculture and local food systems; and protecting our natural resources and communities - are among the most critical environmental issues for our city, state, region, and nation. The Clinic's students benefit and learn from immersion in these real-world representations, and they take part in all aspects of complex civil litigation, present arguments at administrative hearings, draft and negotiate transactional documents, and work on legislative and policy issues at the local, state, and national levels. Students will leave the Clinic with newfound skills, expertise, and confidence, all of which will serve them well in their future legal careers.",
    "prerequisites": null,
    "instructors": "Mindy Goldstein - Primary Instructor",
    "schedule_location": null,
    "course_resources": "https://emory.bncollege.com/course-material/course-finder?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_LAW_697C_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2678, Section #: 001, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: M. Goldstein, Status: Open",
    "date_accessed": "2024-03-30"
}