{
    "course_code": "LAW 699",
    "course_title": "Kids in Conflict with Law",
    "credit_hours": "2",
    "seats": "Seats: Maximum Enrollment: 24 / Seats Avail: 7Waitlist Total: 0 of 3",
    "waitlist_total": ": 0 of 3",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-08 through 2024-04-22",
    "class_notes": "Final Assessment: Paper/Project\nThis course is eligible to be counted towards the requirements for the J.D. concentration in Criminal Litigation.",
    "course_description": "The juvenile court was founded in 1899 on the philosophy that children are inherently different from adults, and that the state should take on the responsibility of protecting and rehabilitating young offenders. Beginning in the late twentieth century, the court has undergone both an ideological and an institutional change from its original form. This course will trace the trajectory of juvenile justice in the United States over the course of the last century, from its birth as a separate system in the early 1900s, through the due process revolution of the 1960s and 1970s and the widespread punitive reforms of the 1990s, to the recent rulings on the juvenile death penalty, juvenile life without parole, and juvenile interrogations. We will explore critical issues such as search, seizure, and interrogation of minors; waiver from juvenile to adult court; the unique procedural mechanisms of juvenile courts; sentencing and confinement; and implications of emerging scientific research on adolescent development. Finally, we will explore the relationship between the juvenile delinquency and school systems. Throughout the course, we will focus on two key questions:\n- How are juvenile offenders treated differently from adult offenders?\n- To what extent should they be?\"",
    "prerequisites": null,
    "instructors": "Randee Waldman - Primary Instructor",
    "schedule_location": "M 4:15pm-6:15pm in Gambrell Hall 5C",
    "course_resources": "https://emory.bncollege.com/course-material/course-finder?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_LAW_699_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2721, Section #: 001, Type: LEC, Campus: ATL, Meets: M 4:15-6:15p, Instructor: R. Waldman, Status: Open",
    "date_accessed": "2024-03-30"
}