{
    "course_code": "LAW 736A",
    "course_title": "Law in Public Health",
    "credit_hours": "2",
    "seats": "Seats: Maximum Enrollment: 40 / Seats Avail: 40",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-08 through 2024-04-22",
    "class_notes": "Final Assessment: Take-Home Final\nCross listed with School of Public Health.\nConstitutional Law will be helpful and is strongly encouraged!\nThis course is eligible to be counted towards the requirements for the J.D. concentration in Health Law.",
    "course_description": "Law and public health are tightly intertwined. Law school students can benefit from an improved understanding of the legal principles and laws underlying the complex and cross-disciplinary field of public health practice in the United States. This course surveys law as it defines public health and is used by local, state, and federal government agencies as a tool to address contemporary public health problems in the United States. The course specifically addresses foundational sources for public health law in the United States, including constitutional, statutory, regulatory, and case law. It provides an examination of controlling law and emerging legal issues associated with selected topics drawn from public health emergencies; public health surveillance and outbreak investigations; and key public health topical areas, such as environmental issues; vaccination; foodborne diseases; and tobacco use-related problems.",
    "prerequisites": null,
    "instructors": "Sudevi Ghosh - Primary Instructor",
    "schedule_location": "T 4:15pm-6:15pm",
    "course_resources": "https://emory.bncollege.com/course-material/course-finder?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_LAW_736A_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 5281, Section #: 001, Type: LEC, Campus: ATL, Meets: T 4:15-6:15p, Instructor: Team, Status: Open",
    "date_accessed": "2023-10-31"
}