{
    "course_code": "LAW 842A",
    "course_title": "Advanced International Negotiations",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 14 / Seats Avail: 14Waitlist Total: 0 of 5",
    "waitlist_total": ": 0 of 5",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-08 through 2024-04-22",
    "class_notes": "Final Assessment: Paper/Project\nThis course is eligible to be counted towards the requirements for the J.D. concentration in Civil Litigation and Dispute Resolution.",
    "course_description": "International negotiation is a process by which two or more protagonists (of different nationalities) dialogue with the aim of achieving certain goals or ends in resolving disputes to the satisfaction of all parties. This course will examine the styles and approaches to managing and resolving violent conflict at the international level. An emphasis will be placed on the peace processes in the Middle East, South America, and the African Great Lakes region, as well as current post-conflict discussions in Mali.\nThe course will provide students with the insight and knowledge needed to assess how negotiation can produce effective conflict settlement, political change, and international policy making. The course will start with an introduction to the concept of negotiation and its approaches. The negotiation dynamics, the theoretical analysis of bargaining, the psychological interference in negotiation, the multi-party negotiation, and the mediation will be covered as well.",
    "prerequisites": null,
    "instructors": "Roger-Claude Liwanga - Primary Instructor",
    "schedule_location": "Th 1pm-4pm",
    "course_resources": "https://emory.bncollege.com/course-material/course-finder?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_LAW_842A_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2794, Section #: 001, Type: LEC, Campus: ATL, Meets: Th 1-4p, Instructor: R. Liwanga, Status: Open",
    "date_accessed": "2023-10-31"
}