{
    "course_code": "LAW 843",
    "course_title": "SEM: International Environmental Law & Vulnerability",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 14 / Seats Avail: 8Waitlist Total: 0 of 3",
    "waitlist_total": ": 0 of 3",
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-08 through 2024-04-22",
    "class_notes": "Final Assessment: Paper/Project\nStudents must complete the Preselection form to be considered for this class.",
    "course_description": "This course will examine the development and current trajectory of international environmental law (IEL). We will focus on the major areas of global environmental protection including climate change, the ozone layer, biodiversity loss, water and the emerging global discourse on rights for nature. The course will also unpack the principles underlying IEL, including sustainable development, the ¿polluter pays¿ principle, precaution and vulnerability. We will discuss social justice aspects of the international environmental regime including responsibility towards future generations and offsetting environmental degradation through ¿green projects¿ in developing counties. The course will also analyze groundbreaking cases advancing the legal protection of Earth¿s atmosphere. At the end of this course, you will understand the major international environmental issues that law is grappling with on a global level and have a realistic grasp on the limitations and current possibilities for IEL today to protect the global environment.",
    "prerequisites": null,
    "instructors": "Atieno  Mboya Samandari - Primary Instructor",
    "schedule_location": "W 9am-11am in Gambrell Hall - 5K",
    "course_resources": "https://emory.bncollege.com/course-material/course-finder?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_LAW_843_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2899, Section #: 001, Type: LEC, Campus: ATL, Meets: W 9-11a, Instructor: A. Samandari, Status: Open",
    "date_accessed": "2024-03-30"
}