{
    "course_code": "LAW 850",
    "course_title": "SEM: Indigenous Religious Freedom and the Constitution",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 5Waitlist Total: 0 of 3",
    "waitlist_total": ": 0 of 3",
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-08 through 2024-04-22",
    "class_notes": "Final Assessment: Paper/Project\nStudents must complete the Preselection form to be considered for this class.",
    "course_description": "Religious liberty is a human right that in the United States legal system is also a constitutional value and the object of broad judicial protection. The story of oppressed religious communities finding freedoms of expression and practice in the New World is an essential part not only of the history but also the civic mythology that shapes American life and concepts of citizenship. However, rights to observe the various Indigenous religions found within the United States have largely been misunderstood, rejected, and marginalized by jurisprudence interpreting and applying the First Amendment. This course will examine the case history that, from the Supreme Court down to the lower federal and state courts, reveals a judiciary Eurocentric in its philosophy of religion and ignorant of the nuances that account for difference between Indigenous and non-Indigenous religious practice. It will draw from academic scholarship on Indigenous religion, works from practitioners and exponents of specific religions, political theory, social criticism, and legal commentary and research for context. The class will aim to ground what can be highly abstract legal questions with an awareness of the living spiritual communities that judicial rulings can and have impacted. Its primary goal will be to propound a knowledge of outstanding legal controversies in the field of Constitutional jurisprudence on Indigenous religion with a view to stimulating needed change.",
    "prerequisites": null,
    "instructors": "Douglas Waters Jr. - Primary Instructor",
    "schedule_location": "T 6:30pm-8:30pm",
    "course_resources": "https://emory.bncollege.com/course-material/course-finder?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_LAW_850_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 5597, Section #: 001, Type: SEM, Campus: ATL, Meets: T 6:30-8:30p, Instructor: D. Waters Jr., Status: Open",
    "date_accessed": "2024-03-30"
}