{
    "course_code": "LAW 895A",
    "course_title": "Journal of Law and Religion: Writing Workshop",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 11 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2024-01-08 through 2024-04-22",
    "class_notes": "This course meets biweekly alternating with LAW-895 (Journal of Law and Religion). The course time for Spring 2024 has been established in advance with the students for Wednesdays, 4:30pm - 6:00pm. There are 7 class sessions of 90 minutes, with additional instructions hours through a minimum of 3 x 30 minute individual or small group meetings with the instructor over the course of the semester.\nThe course meets in the Berman Library of the Center for the Study of Law and Religion.\nEnrollment is limited to students enrolled in LAW-895.",
    "course_description": "In this writing workshop, students will revise a draft of a paper written in ¿Law and Religion: Theories Methods and Approaches¿ into a publishable article following the method detailed in Wendy Belcher, Writing Your Journal Article in Twelve Weeks: A Guide to Academic Publishing Success (Chicago: University of Chicago Press, 2019).7 The Belcher text provides a program of exercises for revision of a draft paper along with an introduction to academic publishing that allows students to refine their draft into a substantive contribution to scholarship in a polished, academic style. The Belcher text will be supplemented with information specific to legal writing and publishing.",
    "prerequisites": null,
    "instructors": "Silas Allard - Primary Instructor",
    "schedule_location": null,
    "course_resources": "https://emory.bncollege.com/course-material/course-finder?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_LAW_895A_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: This section is full 5957, Section #: 001, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: S. Allard, Status: Closed",
    "date_accessed": "2024-03-30"
}