{
    "course_code": "LAW 897",
    "course_title": "Directed Research:Specific Topics",
    "credit_hours": "1-12",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Varies by section",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Varies by section",
    "dates": "2024-01-08 through 2024-04-22",
    "class_notes": "Varies by section",
    "course_description": "Students may register for directed study or directed research opportunities, with the approval of a sponsoring faculty member and the Associate Dean for Academic Programs & Students or their designee. Directed study and directed research projects may range from one to four credits each semester but are typically two credits. J.D. students may take a maximum of 18 credits of directed study and/or directed research over the course of the J.D. program. Students wishing to do directed research or directed study in excess of the 18-credit limit must petition the Associate Dean for Academic Programs & Students or their designee.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2733, Section #: 001, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: S. Allard, Status: Closed\nClass Nbr: This section is full 2727, Section #: 003, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Bobinski, Status: Closed\nClass Nbr: This section is full 2728, Section #: 004, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Broyde, Status: Closed\nClass Nbr: This section is full 2729, Section #: 005, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Zhang, Status: Closed\nClass Nbr: This section is full 2730, Section #: 006, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Tulibacka, Status: Closed\nClass Nbr: This section is full 2885, Section #: 007, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Broyde, Status: Closed\nClass Nbr: This section is full 2732, Section #: 008, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: I. Bedzow, Status: Closed\nClass Nbr: This section is full 2879, Section #: 009, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: K. Pinder, Status: Closed\nClass Nbr: This section is full 2734, Section #: 010, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Sybblis, Status: Closed\nClass Nbr: This section is full 6295, Section #: 011, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Lawrence, Status: Closed\nClass Nbr: This section is full 6309, Section #: 012, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. Howard, Status: Closed\nClass Nbr: 6310, Section #: 013, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: P. Koster, Status: Open\nClass Nbr: This section is full 6311, Section #: 014, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Goldstein, Status: Closed\nClass Nbr: This section is full 6313, Section #: 015, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: K. Cooper, Status: Closed\nClass Nbr: This section is full 6314, Section #: 016, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. Waters Jr., Status: Closed\nClass Nbr: This section is full 6315, Section #: 017, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: K. Pinder, Status: Closed\nClass Nbr: This section is full 6316, Section #: 018, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Bagley, Status: Closed\nClass Nbr: This section is full 6317, Section #: 019, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Carter, Status: Closed\nClass Nbr: This section is full 6318, Section #: 020, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: R. Freer, Status: Closed\nClass Nbr: This section is full 6319, Section #: 021, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: K. Quinn, Status: Closed\nClass Nbr: This section is full 6343, Section #: 022, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: G. Georgiev, Status: Closed\nClass Nbr: This section is full 6346, Section #: 023, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: G. Shepherd, Status: Closed\nClass Nbr: This section is full 6347, Section #: 024, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: N. Morris, Status: Closed\nClass Nbr: This section is full 6361, Section #: 025, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Sag, Status: Closed\nClass Nbr: This section is full 6365, Section #: 026, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: K. Levine, Status: Closed\nClass Nbr: This section is full 6366, Section #: 027, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Volokh, Status: Closed\nClass Nbr: This section is full 6367, Section #: 028, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: I. Ajunwa, Status: Closed\nClass Nbr: This section is full 6368, Section #: 029, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: P. Koster, Status: Closed\nClass Nbr: This section is full 6369, Section #: 030, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: T. Jacobi, Status: Closed\nClass Nbr: This section is full 6434, Section #: 031, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Dudziak, Status: Closed\nClass Nbr: This section is full 6435, Section #: 032, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: K. Cooper, Status: Closed\nClass Nbr: This section is full 6444, Section #: 033, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Tulibacka, Status: Closed\nClass Nbr: This section is full 6458, Section #: 034, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Volokh, Status: Closed\nClass Nbr: This section is full 6459, Section #: 035, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: P. Koster, Status: Closed\nClass Nbr: This section is full 6460, Section #: 036, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: S. Donaldson, Status: Closed\nClass Nbr: This section is full 6497, Section #: 037, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. Waters Jr., Status: Closed\nClass Nbr: This section is full 6528, Section #: 038, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: P. Koster, Status: Closed\nClass Nbr: This section is full 6581, Section #: 039, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Acevedo, Status: Closed\nClass Nbr: 6592, Section #: 040, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: K. Pinder, Status: Open\nClass Nbr: This section is full 6666, Section #: 041, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Lawrence, Status: Closed",
    "date_accessed": "2024-03-30"
}