{
    "course_code": "LAW 999",
    "course_title": "Georgia Law, Practice & Procedure",
    "credit_hours": "2",
    "seats": "Seats: Maximum Enrollment: 95 / Seats Avail: 55",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-08 through 2024-04-22",
    "class_notes": "Final Assessment: Take-home exam\nAttendance Policy: Attendance is expected at every class unless the student has talked with the professor beforehand. \nOther Information: This course is not intended to replace commercial bar preparation courses.",
    "course_description": "Georgia Law, Practice & Procedure is recommended for third-year JD students planning to take the Georgia bar exam. The course will address the distinctions between Georgia law and black-letter or federal law in the subjects commonly tested in Georgia bar exam essays an on the MBE. Each week will address an area or areas that can be tested on the Georgia bar, starting with the seven MBE subjects. Students will review a survey of bar-tested subjects and come to class prepared to discuss the Georgia distinctions on those subjects. Students will be required to complete practice questions outside of class, including mandatory participation in Multistate Bar Exam (MBE) practice exams and workshops, as well as weekly assigned practice essay questions. Grading will be based on a combination of attendance and participation (20%), completion of assigned assessment questions (20%), written work (20%), a midterm group project (20%), and a final exam (20%). Because this course includes a graded group project, this course is not subject to the mandatory mean. Please note; however, that the 3.30 mean is still recommended.",
    "prerequisites": null,
    "instructors": "Jeanette Holmes - Primary Instructor",
    "schedule_location": "M 6pm-8pm in Gambrell Hall - 1E",
    "course_resources": "https://emory.bncollege.com/course-material/course-finder?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_LAW_999_0_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2836, Section #: 000, Type: LEC, Campus: ATL, Meets: M 6-8p, Instructor: J. Holmes, Status: Open",
    "date_accessed": "2024-03-30"
}