{
    "course_code": "REL 100R",
    "course_title": "Introduction to Religion: Religion and Conflict",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 30 / Seats Avail: 4Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "This course will be taught online. It meets for two synchronous 75-minute sessions per week on MW.\nThis course satisfies the new Religion major requirement:- Theme.\nThis Introduction to Religion is centered on religious violence and conflict. We will also look at polemics and inter-religious disagreement, religious violence and terrorism, the relation of attacks on people and attacks on symbolic objects such as statues, and questions about religion and racial violence. The course will deal with several religious traditions. \nIs religion to blame for violence? Or, if a religion is violent, is that true religion? If people think killing others is 'religious' (or 'sacred'), what do we do with this claim? On the one hand, we are called to take sides, to make a judgement of our own. On the other hand, we can hardly understand the phenomena of religious violence if we simply condemn it as evil; we have to understand what we don't agree with. When that 'disagreement' involves mass murder, our capacity to understand is stretched to breaking point, not only by the horror of the acts, but also by our moral imperative to consider something wrong.",
    "course_description": "An exploration of diverse ways of being religious (for example, in thought, action, community, and experience) as they are displayed in several traditions and cultures.",
    "prerequisites": null,
    "instructors": "Eric Reinders - Primary Instructor",
    "schedule_location": "MW 9:40am-10:55am in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 4062, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 9:40-10:55a, Instructor: E. Reinders, Status: Open",
    "date_accessed": "2024-03-30"
}