{
    "course_code": "REL 212",
    "course_title": "Asian Religious Traditions",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as EAS 212 1) This course will be taught online. It meets for two synchronous 75-minute sessions per week on MW.\nThis course satisfies the new Religion major requirement:- Tradition-Buddhism, Theme. \nThis is an introduction to the major religious traditions (Confucianism, Daoism, Buddhism, Shinto and Christianity) in China and Japan. The course will contextualize the religions in the larger frame of popular religious practices. We will also examine the patterns of interactions among these traditions in different historical periods. Our themes will include: the invisible world of gods and spirits, worldly benefits, religion and state, and the lives of shrines, temples, and monasteries. We will also discuss the religious life in contemporary East Asia under the impact of modernization and globalization. \nThroughout the learning process, students will not only get familiar with the major religious traditions in East Asia, but also increase awareness of the different perspectives in understanding the role of religions in ancient and modern society. They should also develop interpretative and critical skills in reading primary sources and secondary sources. The students will also discuss the important aspects of religious life and the interplay of religion and politics in East Asia.",
    "course_description": "Thematic study of at least two Asian religious traditions. Thematic emphasis may include relationships of text and context, pilgrimage, gender, epic performance, religious institutions, visual arts, or colonial and post-colonial identities.",
    "prerequisites": null,
    "instructors": "Wei Wu - Primary Instructor",
    "schedule_location": "MW 11:20am-12:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 4065, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 11:20a-12:35p, Instructor: W. Wu, Status: Wait List",
    "date_accessed": "2024-03-30"
}