{
    "course_code": "REL 270",
    "course_title": "Special Topics in Religion: Depicting God in Hinduism",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 2Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Blended/Hybrid",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as ARTHIST 289 2)This course is being taught in-person and online simultaneously.  It is open to both sets of students. It meets for two synchronous 75-minute sessions per week on TTh.\nThis course satisfies the new Religion major requirement:- Tradition-Hinduism. \nIn this course, students will curate an exhibit of paintings and sculptures of the ten incarnations (avatara) of the Hindu god Vishnu. For years, the Carlos Museum at Emory has collected representations of the incarnations of Vishnu, and now students get to decide how they will be displayed at the museum. In the first part of the course, we will read texts on the incarnations of Vishnu and examine their worship today. We will read about the incarnation Rama, hero of the Indian epic the Ramayana, who saves his wife Sita from the clutches of a demon. We will examine how the Buddha has been understood as an incarnation of Vishnu. And we will read about the exploits of Krishna, the flute-playing, mischievous lover of cowherdesses. Our discussion of each incarnation of Vishnu will be paired with an examination of the paintings and sculptures of these deities at the Carlos, including medieval stone sculptures and over a dozen pre-modern paintings. These pieces will go on display at the Carlos in April 2021. We will work with experts to display the pieces and create museum labels, discussing the roles museums have in creating, preserving, and manipulating knowledge.",
    "course_description": "Variety of subjects pertaining to religion. Content will vary in successive offerings. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Ellen Gough - Primary Instructor",
    "schedule_location": "TTh 2:40pm-3:55pm in Carlos Museum - 303",
    "course_resources": null,
    "sections": "Class Nbr: 4073, Section #: 3, Type: LEC, Campus: ATL, Meets: TTh 2:40-3:55p, Instructor: E. Gough, Status: Open",
    "date_accessed": "2024-03-30"
}