{
    "course_code": "REL 270W",
    "course_title": "Special Topics in Religion: Harvey Milk's Life &Afterlives",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 7 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as WGS 285W , JS 273W )  This course will be taught online. It meets for two synchronous 75-minute sessions per week on MW.\nThis course satisfies the new Religion major requirement:- Theme, Region. \nHarvey Bernard Milk, a Jewish gay community activist, elected to the San Francisco Board of Supervisors on November 8, 1977, was assassinated in his office at San Francisco City Hall on the morning of November 27, 1978. This seminar course will explore who Harvey Milk was during his life (a \"New York Jew,\" a gay community activist, and a politician) and who he became after his death (a martyr and iconic figure). Through our focus on Milk's life and cultural \"afterlives,\" we will investigate the construction and interpretation of \"hero\" and martyr figures, the nature of collective memory, the ways in which religious language and imagery are used to honor \"secular saints,\" and how conflicting claims are made for cultural icons. Milk will be compared with other iconic martyrs, such as Abraham Lincoln, Hannah Senesh, Malcolm X, Martin Luther King Jr., Oscar Romero, and Yitzhak Rabin. Resources for our exploration of Milk's life and legacy will include biographical articles and books, the feature film \"Milk,\" an opera, and a variety of artistic images and cultural objects.",
    "course_description": "Variety of subjects pertaining to religion. Content will vary in successive offerings. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "William K Gilders - Primary Instructor",
    "schedule_location": "MW 4:20pm-5:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 4071, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 4:20-5:35p, Instructor: W. Gilders, Status: Open",
    "date_accessed": "2024-03-30"
}