{
    "course_code": "REL 270",
    "course_title": "Special Topics in Religion: Men in Black:Ultra-Orth. Jews",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 3Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as JS 273 2) This course will be taught online. It meets for two synchronous 75-minute sessions per week on TTh.\nThis course satisfies the new Religion major requirement:- Tradition-Judaism\nIn the midst of declining religiosity, rising individualism and smaller and less stable families in America, a small group of Ultra-Orthodox Jews - known as \"Haredim\" - are bucking these trends and showing remarkable growth and retention to their highly insular way of life. And yet, for all their separateness and severe criticism of modern life and mores, they are selectively integrated into the secular world, benefitting from many dimensions of modernity.  \nIn this course, we will examine who the Haredim are - their history, value system, social structure, and how they manage to balance tradition and modernity.  What motivates them?  How are they able to achieve success, and at what cost? How are men, women and children educated and socialized? How do they economically support themselves?  We will uncover the variety of Haredi communities in contemporary America and Israel, and take a look at those who've chosen to leave their families and communities and why.",
    "course_description": "Variety of subjects pertaining to religion. Content will vary in successive offerings. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Michael Berger - Primary Instructor",
    "schedule_location": "TTh 2:40pm-3:55pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 3577, Section #: 2, Type: LEC, Campus: ATL, Meets: TTh 2:40-3:55p, Instructor: M. Berger, Status: Open",
    "date_accessed": "2024-03-30"
}