{
    "course_code": "REL 370",
    "course_title": "Special Topics in Religion: Muslim Women's Storytelling",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 7",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as WGS 385 8)\n(This course will be taught online. It meets for one synchronous 75-minute session per week on Monday.The rest of the material will be delivered asynchronously.)\n(This course satisfies the new Religion major requirement:- Theme, Tradition-Islam.)\n(This class critically examines how Muslim women negotiate their experience, identity, and narrative in different genres and styles. Learning materials are multimodal, including written, visual, audio, and in-person (zoom) storytelling by Muslim women. Students will learn relevant analytical approaches from the field of religious studies and examine materials through the lens of feminist literary theory, Orientalism, and gendered islamophobia. In this class storytelling is both an object of analysis and a method for learning and presenting research. This class will rely heavily on public facing materials and teach skills for producing effective public scholarship. Major assignments will fall into the genres of Op-Ed writing, podcasting, developing infographics and/or other styles of public facing work.)",
    "course_description": "Variety of subjects pertaining to religion. Content will vary in successive offerings. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Rose Deighton - Primary Instructor",
    "schedule_location": "M 1pm-2:15pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 5584, Section #: 2, Type: LEC, Campus: ATL, Meets: M 1-2:15p, Instructor: R. Deighton, Status: Open",
    "date_accessed": "2024-03-30"
}