{
    "course_code": "REL 354RW",
    "course_title": "Ethics: Human Goodness",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "This course will be taught online. It meets for two synchronous 75-minute sessions per week on TTh.\nThis course satisfies the new Religion major requirement:- Theme. \nOur seminar will explore the questions:  \nWhat is human goodness?  What sorts of lives are good lives?  How does goodness relate to flourishing?  \nOur approach will be broadly philosophical. We will read and discuss together a range of texts as we pursue our questions about goodness, ethics, and forms of life.  Some texts will be philosophical and theological, some biographical, some literary, some filmic.   \nThis is a discussion class: we are in this together, and we learn from one another as well as from our readings.  Your attendance and participation will be essential to the work of this course.",
    "course_description": "Analysis of methods and/or texts pertaining to ethical decision-making for individual and social problems such as race, sex/marriage, justice, war, biomedical technology, and environmental pollution. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Pamela M Hall - Primary Instructor",
    "schedule_location": "Varies by section",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 4070, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 9:40-10:55a, Instructor: P. Hall, Status: Wait List\nClass Nbr: This section is full 3567, Section #: 2, Type: SEM, Campus: ATL, Meets: TTh 11:20a-12:35p, Instructor: P. Hall, Status: Wait List",
    "date_accessed": "2024-03-30"
}