{
    "course_code": "REL 490W",
    "course_title": "Senior Symposium:Critique of Religion",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 9Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Continuing Writing Requirement",
    "permission": "Department Consent Required",
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "This course will be taught online. It meets on Fridays.\nPermission required. \nAs the capstone seminar for majors in Religion, this course provides seniors with the opportunity to develop a research paper on a topic of their choice in conversation with critical themes in the study of religion as an academic discipline. Working through the primary sources in The Bloomsbury Reader in Cultural Approaches to the Study of Religion alongside the articles in its companion volume, students will be invited to consider a range of theories and methods and to consider how these may apply to their own research projects. Students will begin their research papers early on in the semester, and will work continuously on their projects through a series of scaffolded assignments throughout the semester. Simultaneously, students will also be asked to submit weekly critical reflection papers in which they consider the implications of the weekly readings for their own study of religion. The professor will provide support for both these vectors of the course, the research paper project and the critical reflection papers. By mid-semester, the research papers will be well under way, providing ample time for revision and refinement before the end of the term. The course will meet remotely once a week in the manner of a graduate seminar. One short assignment designed to assess how students are meeting the goals of the major will also be required.",
    "course_description": "Selected topics in religious studies. Required for majors.",
    "prerequisites": null,
    "instructors": "Sara L McClintock - Primary Instructor",
    "schedule_location": "F 2:40pm-5:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 3569, Section #: 1, Type: SEM, Campus: ATL, Meets: F 2:40-5:35p, Instructor: S. McClintock, Status: Open",
    "date_accessed": "2024-03-30"
}