{
    "course_code": "FREN 190",
    "course_title": "Freshman Seminar: French: Paris:City of Light /Darkness?",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Same as AFS 190 2)\nFREN 190 Paris: City of Light or Darkness? The Politics of Race in 20th-21st century Paris\n(Xavier / TT 10:00-11:15am).  Cross-listed with AFS 190 (5 seats).\n \nContent:  Throughout the 20th and 21st century, Paris has enjoyed a cosmopolitan reputation for racial and intellectual freedom. From African-American writers and jazz\nmusicians fleeing the Harlem Renaissance, to Martiniquan, Senegalese and Guyanese poets seeking higher education and Chinese painters looking to learn Modernist art. Paris of the 1920's welcomed a generation of artists and thinkers of color who would go on to make world history. Yet amidst the city's renowned climate of tolerance lurked the specter of French colonization and orientalism that exploited the creative work of artists like Josephine Baker and Pan Yuling. This course will examine the struggles of migrants in Paris  over the last century analyzing their vibrant artistic production to uncover both the light and darkness of racial politics in Paris.",
    "course_description": "This freshman seminar will focus on themes in French culture from social history, the arts, and current information media. Cross-cultural comparisons provide a rich basis for discussion.",
    "prerequisites": null,
    "instructors": "Subha Xavier - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Candler Library 101",
    "course_resources": null,
    "sections": "Class Nbr: 2560, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 10-11:15a, Instructor: S. Xavier, Status: Open",
    "date_accessed": "2024-03-30"
}