{
    "course_code": "AAS 285",
    "course_title": "Special Topics in African American Studies: Germany & the Black Diaspora",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 3 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as HIST 285 2, AFS 270 2, and GER 285 1)\n(What does it mean to study the historical relationship between Germany and the Black diaspora? Black individuals have maintained a presence in German-speaking Europe since antiquity, but their experiences have been actively silenced in mainstream German archives, collective memories, and public discourses. Even today, phrases such as \"Afro-German\" (Afrodeutsche) and \"Black German\" (Schwarze Deutsche) represent a foundational contradiction for many white Germans. In most European countries, to be Black inherently means to be \"foreign\" - an \"other from without.\" Since 1970, however, a wide range of Black activists have demanded recognition of Black German histories and identities, as well as experiences with persisting racism, sexism, and heteronormativity in German society.\nWith this background in mind, this class will explore how Black Germans experienced and contributed to developments in German, U.S., European, African, Caribbean, and global history from 1750 to the present. It will critically analyze the role of \"race,\" gender, sexuality, slavery, and colonialism in the making of \"modern\" Germany. It will examine the layered transformations of Black communities in Germany as they forged networks of diasporic resistance and belonging across the Atlantic World, actively influenced German culture, politics, and identity, and navigated overlapping forms of discrimination, deportation, everyday violence, and genocide which culminated in the rise of National Socialism.)",
    "course_description": "Wide range of topics pertinent to the African American experience.",
    "prerequisites": null,
    "instructors": "Alexander Compton - Primary Instructor",
    "schedule_location": "TTh 2:40pm-3:55pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 4767, Section #: 2, Type: LEC, Campus: ATL, Meets: TTh 2:40-3:55p, Instructor: A. Compton, Status: Wait List",
    "date_accessed": "2024-03-30"
}