{
    "course_code": "AAS 359",
    "course_title": "Studies in African American Literature: 1900 to Present",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 16Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as ENG 359 1)\n(Topic- :It sounded like the future: A Survey of Black Speculative Literature and Culture)\n(What freedoms are created or precluded when timelines can collapse and expand? Though the term `Afrofuturism' may have been coined in the early 1990s, the literary and cultural tradition has existed since the beginnings of Black authorship in North America. Borrowing from Quincy Troupe's description of the iconic Miles Davis, this course presents students with a survey of twentieth and twenty-first century speculative literature and music by Black North American artists. Texts encountered in this course will prompt students to interrogate identities and intersections of race, gender, sexuality, class, kinship, and power, through a series of dystopic and idyllic imagined futures. Texts will include Pauline Hopkins's Of One Blood, W.E.B. DuBois's The Comet, Octavia Butler's Kindred, and Nnedi Okorafor's Binti, among others, which will be read alongside thematically relevant music from the decades of publication.)",
    "course_description": "A topics course dealing with major traditions and issues in African American literature from 1900 to the present. Possible topics include passing and miscegenation, black novels since 1950, Afrofuturism, and black theater.",
    "prerequisites": null,
    "instructors": "Julian H. Currents - Primary Instructor",
    "schedule_location": "MW 11:20am-12:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 2429, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 11:20a-12:35p, Instructor: J. Currents, Status: Open",
    "date_accessed": "2024-03-30"
}