{
    "course_code": "AAS 326",
    "course_title": "Black Christian Thought",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as REL 326 1)  This course will be taught online. It meets for one synchronous 75-minute session per week on Wednesdays. The rest of the material will be delivered asynchronously.\nThis course satisfies the new Religion major requirement:- Tradition-Christianity, Theme.  \nThis virtual course exposes students to a wide range of contexts, socio-cultural environments and global arrangements that have shaped diverse expressions of Black Christian thought primarily in North America but also in Africa and the wider African diaspora, especially since the Civil Rights and Black Power Movements.  Given our current moment of domestic and global upheaval regarding legacies of chattel slavery, colonial conquest, anti-Black and anti-Brown racism and their collateral consequences, we will place emphasis upon Black Christian nationalism, Black liberation theology, womanist theology, Afro-Caribbean & Afro-Latin American/Latinx popular religion and theology and African theology.  Although we will engage diverse scholarly approaches to Black Christian thought, the course emphasizes liberation theological inquiry, methods and rhetorical styles, and asks students to engage across the semester an activist or activist organization involved in the struggle against anti-Blackness and racial oppression in the United States.",
    "course_description": "Spiritual transformations involving worship, magic and healing, ritual, and aesthetic performance in Black speech and literature, music, and drama; and spiritual uses of Biblical themes to empower social political movements.",
    "prerequisites": null,
    "instructors": "Dianne Stewart - Primary Instructor",
    "schedule_location": "W 11:20am-12:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 4798, Section #: 1, Type: LEC, Campus: ATL, Meets: W 11:20a-12:35p, Instructor: Team, Status: Wait List",
    "date_accessed": "2024-03-30"
}