{
    "course_code": "ENG 368W",
    "course_title": "Literature & Cultural Studies: Cooking with Chaucer,Hildegard",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 13Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2023-05-09 through 2023-05-26",
    "class_notes": "(Same as HIST 396W 1)\nTitle: Cooking with Chaucer, Hildegard of Bingen, Shakespeare, and Anne Hathaway. Course Description: \nIn this course, we will explore the culinary lives of people in the Middle Ages and the Early Modern period. Drawing from a range of readings, videos, guest speakers, and cooking experiments, we will look at the ways that socioeconomic differences, international trading, religious guidelines, and gender divisions influenced people's diets and appeared in contemporary writing. No prior experience with these authors is expected and students from all disciplines are welcome. Hildegard is included because cooking during these times was closely linked with medicine and she was deeply engaged with such activities, so students wishing to examine (or create) homemade remedies from the period will have that opportunity. Dietary options were changing rapidly due to a rapid increase in the availability of spices and other new food items, but there were also serious problems with food shortages. The material is fascinating and the cooking projects can be geared to individual interests and budgets. The course fulfills the Writing Requirement.",
    "course_description": "An introduction to the relationship between literary studies and the study of cultural theory and popular culture.",
    "prerequisites": null,
    "instructors": "Sheila Cavanagh - Primary Instructor",
    "schedule_location": "MTWThF 11am-12:30pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 1333, Section #: 1, Type: LEC, Campus: ATL, Meets: MTWThF 11a-12:30p, Instructor: S. Cavanagh, Status: Open",
    "date_accessed": "2024-03-30"
}