{
    "course_code": "ENG 359",
    "course_title": "Studies in African American Literature: 1900 to Present: The Amer.Dream/The Color Line",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 21Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "HAP w/Race & Ethnicity Req.",
    "permission": null,
    "dates": "2023-06-26 through 2023-08-02",
    "class_notes": "Topic: The American Dream and the Color Line.\nCourse Description: In 1931, early in the Great Depression, popular historian James Truslow Adams coined the phrase \"the American dream.\" The notion caught on quickly during a time of social and economic crisis to suggest the freedoms of society that were worth preserving. Yet Adams's use of the term was individualist and racially exclusive, calling the dream the invention of \"the English race\" and diminishing any involvement of people of color and recent immigrants with the dream. Black writers of the 1930s, 40s, 50s, and 60s would push back against this racist conception of the dream, critiquing and reimagining it as the dream of equality familiar to us today. This course will focus on a series of texts (full texts and selections) from the first generations of Black writers who became mainstream voices in American culture: Richard Wright, Zora Neale Hurston, Era Bell Thompson, Margaret Walker, Chester Himes, Ann Petry, Ralph Ellison, Langston Hughes, Lorraine Hansberry, Martin Luther King Jr., Malcolm X, and James Baldwin. These texts will be juxtaposed with selections from iconic depictions of the American dream by White writers such as John Steinbeck and Arthur Miller. For additional context, we will consider political speeches, news and opinion pieces, film, and radio. Class discussion and analysis papers will explore both the historical and contemporary significance of Black writers' reimagining of the American dream.",
    "course_description": "A topics course dealing with major traditions and issues in African American literature from 1900 to the present. Possible topics include passing and miscegenation, black novels since 1950, Afrofuturism, and black theater.",
    "prerequisites": null,
    "instructors": "Robert Birdwell - Primary Instructor",
    "schedule_location": "MTWThF 10am-11:20am in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 1470, Section #: 1, Type: LEC, Campus: ATL, Meets: MTWThF 10-11:20a, Instructor: R. Birdwell, Status: Open",
    "date_accessed": "2024-03-30"
}