{
    "course_code": "BIOL 247",
    "course_title": "Ecology",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 70 / Seats Avail: 45Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(Same as ENVS 247 1)  \n(This course provides a broad overview of ecology, ranging from evolutionary ecology to ecosystems ecology. The emphasis of the course is on data interpretation and experimental design in the context of the ecological concepts we are discussing. Students will work in small groups on applying basic ecological principles to data interpretation and experimental design. This course will fulfill the Column C requirement (or elective credit) for the Biology major. There will be three exams plus a cumulative final exam. Students will also be evaluated on class discussions. A separate, optional, 3 credit hour laboratory (Biology 247LW/ENVS 247LW) is associated with this course (in fall semester). The lab is not required.",
    "course_description": "This course provides an overview of the principles of ecology and the study of relationships between organisms and their environment. Processes and properties of individuals, populations, communities, and ecosystems will be emphasized. Lectures will emphasize active and collaborative learning.",
    "prerequisites": "(BIOL 142 and BIOL 142L) or BIOL_OX 142WE or equivalent transfer credit as a prerequisite.",
    "instructors": "Miguel Reyes - Primary Instructor",
    "schedule_location": "MW 8:30am-9:45am in 1462 Clifton Rd 230",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_BIOL_247_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 1688, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 8:30-9:45a, Instructor: M. Reyes, Status: Open",
    "date_accessed": "2023-10-31"
}