{
    "course_code": "BIOL 329",
    "course_title": "Coastal Biology with Lab",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 12",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "This course requires permission of the instructor AND a Laboratory/Field Course fee of $1275.00.  This lecture and laboratory course emphasizes basic principles of coastal biology, including the distribution and types of coastlines, coastal animals and plants, important ecological and physical processes, and the services, management, and threats for coastal areas (particularly the Georgia coast).  The course involves an eight-day laboratory/field trip to St. Simons Island, Georgia and other Georgia Sea Islands over Spring Break, which will require a lab/field course fee.  Prerequisites:  Biology 142 + 142L AND permission of instructor.  To gain permission for this course, fill out the following interest form (https://forms.gle/Qgt5dMpC1NFNpWTR6).  All submissions by October 31st at 11:59 p.m. will be equally considered.  Contact Lynda Bradley at lbradl8@emory.edu with additional questions.  A $600 NON-REFUNDABLE DEPOSIT (personal check or money order made out to the Emory University Department of Biology) will be required during registration, prior to receiving a permission number to enroll in the course.  The remaining balance will be due at the beginning of the Spring semester, before the end of add/drop/swap.  Non-payment will result in being dropped from the course.  Financial Aid scholarships from the Biology Department are available to eligible students who submit an application for the aid.  Contact Barbara Shannon at barbara.shannon@emory.edu for payment information.",
    "course_description": "Emphasizes basic principles of coastal ecology, human impact on coastal ecosystems, and the diversity of organisms living in these ecosystems. The course involves an eight-day laboratory/field trip to St. Simons Island, Georgia and other Georgia Sea Islands over Spring Break.",
    "prerequisites": "(BIOL 142 and BIOL 142L) or BIOL_OX 142WE or equivalent transfer credit as a prerequisite.",
    "instructors": "LM Bradley - Primary Instructor",
    "schedule_location": "W 1pm-4pm in 1462 Clifton Rd 113",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_BIOL_329_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3513, Section #: 1, Type: LEC, Campus: ATL, Meets: W 1-4p, Instructor: L. Bradley, Status: Open",
    "date_accessed": "2023-10-31"
}