{
    "course_code": "BIOL 372",
    "course_title": "Ecology of the Tropics Field Course",
    "credit_hours": "2",
    "seats": "Seats: Maximum Enrollment: 6 / Seats Avail: 6",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(Same as ENVS 372 1) \n[This 2-credit hour field course is part of the Office of International and Summer Programs (OISP) and will be taught during Spring Break week (March _____, 2024) in the Amazon River lowland rainforests of southern Peru (Tambopata Research Station), famous for its huge flocks of colorful Macaws. This field course will give the student a real hands-on rainforest experience complete with bromeliads, toucans, sloths, and the sounds of the night. Graduating Seniors and students who have previously completed BIOL 371/ENVS 371 have priority for this course. Cost for the trip is approximately $3200 (depending on airfare prices). Permission of instructor is required. This course is taught by Dr. Lawrence Wilson (lwilso3@emory.edu; adjunct faculty), is SHARED by the Biology and Environmental Science Departments, and may be taken as elective and upper-level laboratory credit for the biology major. Biology majors may submit an application to Barbara Shannon at barbara.shannon@emory.edu. Selected students will be notified and will have additional requirements by OISP. See the OISP website for additional information.  Financial Aid scholarships from the Biology Department are available to eligible students who submit an application for the aid.]",
    "course_description": "Permission required. This is the field course to accompany the lecture course on tropical ecology. Field trip will take place during the spring recess.",
    "prerequisites": "This course requires ENVS 371 or BIOL 371 as a prerequisite OR permission of instructor.",
    "instructors": "Lawrence Wilson - Primary Instructor",
    "schedule_location": null,
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_BIOL_372_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 1711, Section #: 1, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: L. Wilson, Status: Open",
    "date_accessed": "2023-10-31"
}