{
    "course_code": "FIN 520A",
    "course_title": "Managerial Finance",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 36 / Seats Avail: 36",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2024-05-17 through 2024-08-07",
    "class_notes": null,
    "course_description": "This course uses several quantitate tools and excel formulas to teach students to compute important concepts to determine fundamental values of assets and corporate financial decisions. This course is an introduction to the theory and practice of finance. The focus will be on the issues and responsibilities facing a financial manager, and the investment and financing decisions of corporations and individuals. The approach we will take to effectively make these decisions is to understand the creation of value through cash flow analysis and the study of the tradeoffs between and among risk, return, and impact. Specifically, the course covers topics such as the time value of money, net present value (NPV), internal rate of return (IRR), valuation, analysis of risk and return, capital markets, and a firm's capital structure. We will also at various times discuss the role of finance in a capitalistic economic system that accounts for both shareholder value and stakeholder value.",
    "prerequisites": null,
    "instructors": "JB Kurish - Primary Instructor",
    "schedule_location": null,
    "course_resources": "https://emory.bncollege.com/course-material/course-finder?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_FIN_520A_4401_A24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2180, Section #: 4401, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Kurish, Status: Open",
    "date_accessed": "2024-03-29"
}