{
    "course_code": "PHIL 385",
    "course_title": "Special Topics in Philosophy: Psychic Life of Anti-Blackness",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 2 / Seats Avail: 2Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Same as AAS 385 3, CPLT 389 3, FILM 385 1)\nThe seminar seeks to explore the structures and dynamics which bring about the key terms in the title of this course: psyche, life, and anti-black violence. Thought together and at other times respectively from one another, we will unpack what Frantz Fanon has called \"the collective unconscious\" and how it maintains some of the most enduring inequities and inequalities in dominant culture, institutions, politics, and language. At the same time, the course serves as a rigorous introduction that surveys several key concepts in psychoanalysis that engage or gesture to the topics of identity, race, and sexuality (e.g. the unconscious, drive, negation, mirror-stage, imago, Oedipus, etc.). Our starting point will be examining the emergence of the clinic in the U.S. and its reinforced and institutionalized segregation. From there, we will meditate on fundamental concepts in psychoanalysis as they relate, complicate, and/ or prove inadequate to the study of race and racism. The application of our analysis will be focused on film, visual art, and contemporary politico-cultural phenomena.",
    "course_description": "Selected topics and problems in philosophy. Content will vary in successive offerings of this course. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Linette Park - Primary Instructor",
    "schedule_location": "MW 4pm-5:15pm in Candler Library 121",
    "course_resources": null,
    "sections": "Class Nbr: 4767, Section #: 4, Type: LEC, Campus: ATL, Meets: MW 4-5:15p, Instructor: L. Park, Status: Open",
    "date_accessed": "2024-03-30"
}