{
    "course_code": "PHIL 789",
    "course_title": "Topics In Philosophy: From Simmel to Adorno",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 8 / Seats Avail: 4",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Same as CPLT 751R 3)\n\"From Simmel to Adorno\" | During his lifetime, Georg Simmel (1858-1918) was an internationally renowned philosopher. A riveting speaker whose lectures on Kant, Nietzsche, and Schopenhauer helped shape their reception and a prolific, best-selling author who published on everything from metaphysics to fashion to the arts, Simmel was a pioneering cultural theorist whose explorations of unconventional topics-money, space, secrecy, gender, metropolitan life, the aesthetics of the everyday-forged new philosophical possibilities. His innovative, emphatically modernist style of thought was widely influential, and it resonates in the writings of the better-known philosophers and cultural critics who were his students and readers. Yet a century later, his name has been largely erased from our disciplinary narratives, and Simmel is remembered today, if at all, as a sociologist.\nBy returning to Simmel's work and tracing the influence of his ideas and methods on better-known thinkers in the next generation, this course casts new light on the reception history of 19th century German philosophy, on the prehistory of modern social science, and on the genealogy of critical and cultural theory. Reading Simmel in conversation with successors such as Lukács and Heidegger, Kracauer, Benjamin, and Adorno illuminates a key trajectory in the history of modern thought, foregrounding the significance of the divergence of the social sciences and humanities around the turn of the twentieth century. However, in the spirit of an interdisciplinary philosophical tradition grounded in the realities of modern life, our principal objective will be to discover and explore how the imaginative, cosmopolitan style of philosophizing Simmel modeled and inspired can disclose new possibilities for contemporary thought.\nRequirements: Participation, Presentations, Seminar Paper\n*** ADVANCED UNDERGRADS ARE WELCOME TO ENROLL WITH PERMISSION. Please contact Kathy Ly-Nguyen (klynguy@emory.edu) for enrollment.",
    "course_description": null,
    "prerequisites": null,
    "instructors": "Geoffrey Bennington - Primary Instructor",
    "schedule_location": "W 1pm-4pm in Woodruff Library 422",
    "course_resources": null,
    "sections": "Class Nbr: 5828, Section #: 3, Type: LEC, Campus: ATL, Meets: W 1-4p, Instructor: Goodstein/Bennington, Status: Open",
    "date_accessed": "2024-03-30"
}