{
    "course_code": "JS 205",
    "course_title": "Biblical Literature",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 13 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "Topic:  Biblical Literature: Hebrew Bible and Its World(s)\nCourse description: This course surveys the varied contents, contexts, and perspectives contained in the Hebrew Bible (also called the \"Tanakh\" or the \"Old Testament\" by some). As an introduction to academic study of the Bible as ancient literature, we will use historical-critical methods to investigate its meaning in the ancient settings of its composition. This approach gives us the opportunity to learn about the historical world(s) of the biblical communities, authors, and compilers from about 1200-200 BCE, noting how major geopolitical events impacted their experiences and influenced their evolving sense of identity. Though we will occasionally explore questions about the reception of these texts as religious Scriptures in Jewish and Christian communities, no religious commitment is assumed or required, nor is any prior reading or study of the Bible expected. The only requirements are openness to modern scholarly approaches and willingness to read and engage the biblical documents themselves (in English translation), which will be the primary \"textbook\" for the course. A secondary help will be Marc Zvi Brettler's \"How to Read the Jewish Bible\" (OUP 2007). This is a highly participatory course, class sessions will be discussion oriented and graded assignments will include short essays and collaborative media (podcasting) projects.",
    "course_description": "The Hebrew scriptures (\"Old Testament\"), in translation, examined in their historical setting, and in their roles as sacred texts in Judaism and Christianity.",
    "prerequisites": null,
    "instructors": "Timothy McNinch - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Atwood Chemistry Bldg. 215",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 5117, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: T. McNinch, Status: Closed",
    "date_accessed": "2024-03-30"
}