{
    "course_code": "JS 354RW",
    "course_title": "Ethics: Jewish Ethics",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 7 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "This course satisfies the new Religion major requirement:- Tradition-Judaism, Theme. \nThis course will examine the ethical discussions within the Jewish tradition which have treated a wide range of issues relevant to human behavior.  This tradition is unique in two ways: it is constructed as a legal tradition, citing and normatively interpreting authoritative sources, and it is religious, in the sense that its assumptions and scope, at least until the modern period, were also theological, in contrast to secular ethical and legal traditions such as Greek ethics or American law.\nGiven the citation-interpretation nature of this discourse, we will take up a series of topics, examining the sources that are relevant to the various situations and discussing what inferences and principles emerge from the texts.  The emphasis will be less on the actual decision reached than on how texts are cited and what sort of reasoning  is employed.  While the topics I've chosen were meant to reflect a wide range of issues, I am open to the possibility of substituting one or two topics during the semester, if they are manageable and the class agrees.\n\n\nAs a writing course, this seminar will also train you in how to write an ethical argument (something like a legal brief).  We will build these skills steadily and incrementally over the course of the semester, using both regular writing assignments and revised drafts of your final paper.  Your submissions will be evaluated for their grammar and style as well as the coherence and cogency of your argument.\n\n\n(Same as REL 354RW 2)",
    "course_description": "Analysis of methods and/or texts pertaining to ethical decision-making for individual and social problems such as race, sex/marriage, justice, war, biomedical technology, and environmental pollution. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Michael Berger - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Candler Library 122",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 4063, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 1-2:15p, Instructor: M. Berger, Status: Wait List",
    "date_accessed": "2024-03-30"
}