{
    "course_code": "SOC 213",
    "course_title": "Sociology of the Family",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 10",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "Social Sciences(*)",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "This course is designed to challenge you to think about family in new ways by exposing you to sociological approaches to understanding the family as a social institution. Over the course of the semester, you will learn about how the family intersects with other social structures and inequalities such as those by social class, gender, sexuality, and race. In addition, you will learn about patterns of family change over time and the diversity of family forms and practices found around the world.\n\n\nThe objectives of this course are to: \n1.\tDevelop an understanding of how family life intersects with other social structures and identities \n2.\tRead and critically assess sociological research on the family \n3.\tLearn and be able to discuss the broad trends and patterns in family life within the US and globally.",
    "course_description": "Organization, functions, and present status of the family, primarily in the United States. Problems of partner selection and marital adjustment treated on the basis of recent and current research in the field.",
    "prerequisites": null,
    "instructors": "Megan Reed - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in White Hall 110",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_SOC_213_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3240, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 10-11:15a, Instructor: M. Reed, Status: Open",
    "date_accessed": "2024-03-29"
}