{
    "course_code": "SOC 275",
    "course_title": "Social Statistics",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 25Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Quantitative Reasoning(*)",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "This course introduces students to statistical methods used in social research. We will cover descriptive and inferential statistics for univariate, bivariate, and multivariate analyses. Specific topics include scales of measurement, central tendency and variability, sampling distributions, interval estimation, and hypothesis testing for both categorical and continuous variables. By the end of the semester you should be able to (1) identify appropriate procedures for analyzing different types of data, (2) critically evaluate statistical information from sources such as academic journals and the news media, (3) solve basic statistical problems by hand, and (4) use SPSS software to conduct your own quantitative research and interpret the results.\n\n\nRequired Text: Essentials of Statistics for a Diverse Society, Fourth Edition (2020). Anna Leon-Guerrero, Chava Frankfort-Nachmias and Georgiann Davis. Sage Publishing. Available as e-text or paperback.",
    "course_description": "Introduces students to statistical methods used in social research. Topics include scales of measurement, graphical displays, sampling distributions, interval estimation, and hypothesis testing.",
    "prerequisites": null,
    "instructors": "Jeff Mullis - Primary Instructor",
    "schedule_location": "TTh 8:30am-9:45am in Tarbutton Hall 105",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_SOC_275_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3291, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 8:30-9:45a, Instructor: J. Mullis, Status: Open",
    "date_accessed": "2024-03-29"
}