{
    "course_code": "SOC 245",
    "course_title": "Individual & Society",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 10",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Social Sciences(*)",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "How do groups-ranging from small friendship circles to ethnic groups to entire societies-affect the life of an individual and how does the individual, in turn, affect the group? This course examines the reciprocal relationship between individual-level and group-level phenomena, beginning with a focus on the nature of social psychology and its methodology. Attention turns to defining situations and the identity processes that unfold. The second part of the course examines the cognitions, attitudes, and feelings of individuals in social interaction. The course concludes with an analysis of dynamics of power, status, and fairness. Consideration of intergroup processes bring together components of the course and illustrate prejudice and discrimination. In doing so, the course exemplifies how inequalities that emerge in interaction have consequences for larger groups.\n\n\nBook: Hegtvedt, Karen A. and Cathryn Johnson. 2018. Social Psychology: Individuals, Interactions, and Inequality. Thousand Oaks, CA: Sage. (Required)\n\n\nPriority will be given to sophomores and juniors should a waitlist emerge.",
    "course_description": "Conditions and processes of group formation and change, and the effects of these on individual behavior and adaptation.",
    "prerequisites": null,
    "instructors": "Karen A Hegtvedt - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in White Hall 102",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_SOC_245_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3283, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 1-2:15p, Instructor: K. Hegtvedt, Status: Open",
    "date_accessed": "2024-03-29"
}