{
    "course_code": "SOC 560",
    "course_title": "Sociology of Culture",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 9",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "The course (1) provides students with grounding in cultural sociology and (2) prepares students for doing their own cultural research. To facilitate the first objective, we survey major themes and issues in the sociology of culture. We begin this survey by considering the sociological approach to culture, which entails answering the following questions: 'What is culture and what does it do?' and 'How are we to study culture?' We get at these broad questions via the case of music, including the important contributions of Du Bois.\n\n\nWe next turn to issues that Marx, Weber, and Durkheim respectively raised years ago. In particular, we inspect how current scholars (from a variety of theoretical perspectives) approach these enduring issues. Examples of issues that spring from the work of classical sociologists include the following: \"Do media messages shape our view of reality\" If so, \"how?\" and \"How do class and lifestyle intertwine to reproduce inequality?\" Finally, we turn to substantive questions that have come to the fore in recent decades, including \"How is market activity undergirded by cultural assumptions?\" and \"How does social context shape the production and consumption of expressive goods?\" To facilitate the second objective (i.e., doing research), we give special attention to methods and designs employed in current research, and we heed how theoretical ideas are translated into empirical projects. Thus, by the end of the semester, each student will have a grasp of the field and an understanding of how to do cultural sociology.\n\n\nPermission Only",
    "course_description": "The course (1) provides students with grounding in cultural sociology and (2) prepares students for doing their own cultural research. To facilitate the first objective, we survey major themes and issues in the sociology of culture. We begin this survey by considering the sociological approach to culture, which entails answering the following questions: \"What is culture and what does it do?\" and \"How are we to study culture?\" We get at these broad questions via the case of music. We next turn to issues that Marx, Weber, and Durkheim respectively raised. In particular, we inspect how current scholars (from a variety of theoretical perspectives) approach these seminal issues. Examples of issues that spring from the work of classical sociologists include the following: \"Do media messages shape our view of reality? If so, how?\" and \"How do class and lifestyle intertwine to reproduce inequality?\" Finally, we turn to substantive questions that have come to the fore in recent decades, including \"How is market activity undergirded by cultural assumptions?\" and \"How does social context shape the production and consumption of expressive goods?\" To facilitate the second objective (i.e., doing research), we give special attention to methods and designs employed in current research, and we heed how theoretical ideas are translated into empirical projects.",
    "prerequisites": null,
    "instructors": "Timothy J Dowd - Primary Instructor",
    "schedule_location": "T 4pm-6:45pm in Tarbutton Hall 206",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_SOC_560_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 5296, Section #: 1, Type: LEC, Campus: ATL, Meets: T 4-6:45p, Instructor: T. Dowd, Status: Open",
    "date_accessed": "2024-03-29"
}