{
    "course_code": "SPAN 202",
    "course_title": "Intermediate Spanish II",
    "credit_hours": "3",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Varies by section",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "Intercultural Communication(*)",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Spanish 202 is a continuation of Spanish 201 and is designed to further develop students' Spanish skills. Students refine their grammar usage through continued review of basic structures and study of complex structures, and they expand their spoken Spanish skills through discussion and analysis of cultural topics, personal experiences, and literary and journalistic texts. Students are provided ample opportunity for focused listening through use of recorded texts (conversations, music, video) and for oral expression through general classroom and small-group discussions and oral reports. Readings in the course focus on both historical and current cultural and social issues in the Hispanic World, and writing is also developed as a communicative endeavor, with emphasis on the preparation of written compositions/reports based on the cultural components of the course.\nPrerequisite: successful completion of Spanish 201 at Emory, at Emory at Oxford, transfer credit for Span 201 from another institution, or permission of the Director of Placement",
    "course_description": "The second half of a yearlong review, with emphasis on continued development of the four basic linguistic skills (speaking, listening, reading, and writing) and knowledge of Hispanic cultures and societies.",
    "prerequisites": "SPAN 201 or SPAN_OX 201 or equivalent transfer credit as prerequisite.",
    "instructors": null,
    "schedule_location": "Varies by section",
    "course_resources": null,
    "sections": "Class Nbr: 3563, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 8:30-9:45a, Instructor: C. Sierra, Status: Wait List\nClass Nbr: 3566, Section #: 2, Type: LEC, Campus: ATL, Meets: MW 10-11:15a, Instructor: C. Sierra, Status: Wait List\nClass Nbr: 3933, Section #: 3, Type: LEC, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: B. Gravely, Status: Wait List\nClass Nbr: 3934, Section #: 4, Type: LEC, Campus: ATL, Meets: TTh 8:30-9:45a, Instructor: W. Hurst, Status: Open\nClass Nbr: 3935, Section #: 5, Type: LEC, Campus: ATL, Meets: TTh 10-11:15a, Instructor: L. Lozier, Status: Wait List\nClass Nbr: 3937, Section #: 6, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: L. Varela Mejia, Status: Wait List\nClass Nbr: 3939, Section #: 7, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: B. Gravely, Status: Wait List",
    "date_accessed": "2024-03-31"
}