{
    "course_code": "SPAN 111",
    "course_title": "Intensive Spanish",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "Blended/Hybrid",
    "typically_offered": "Spring",
    "requirement_designation": "Intercultural Communication(*)",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "** This class will meet in person on MW and online on Fridays** \nSpanish 111 is an accelerated beginning-level language course designed to advance students towards a higher level of proficiency in both communication in the Spanish language and cultural knowledge of Hispanic communities. The course is intended for students with previous education in Spanish who need additional review and practice before advancing to the intermediate level. The goals of this course include the following: \n1. Further improving communicative ability through speaking, listening, reading and writing skills;  \n2. Developing a more complex understanding of the tools of communication: basic linguistic units (words, idioms, verb forms, sounds) and grammar (rules which permit you to combine the units meaningfully);  \n3. Facilitating advancement from a primarily receptive to a productive use of the language; \n4. Expanding cultural awareness, familiarity with and understanding of Hispanic cultures. and understanding of the relationship of culture to language. \nPrerequisite: Official Spanish Placement into Span 111 is required to remain in the course. (Take the Spanish placement exam online at http://spanport.emory.edu/home/undergraduate/placement/index.html)",
    "course_description": "Accelerated beginning-level language course intended for students with previous education in Spanish who need additional review and practice before advancing to the intermediate level.",
    "prerequisites": null,
    "instructors": "Brian Gravely - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in North Decatur Bldg 112\nF 2:30pm-3:20pm in ONLINE",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_SPAN_111_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 4105, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 2:30-3:45p; F 2:30-3:20p, Instructor: B. Gravely, Status: Wait List",
    "date_accessed": "2024-03-31"
}