{
    "course_code": "SPAN 385",
    "course_title": "Topics in Language and Culture: Archipelagic Latin American",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 10",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "In this course we will approach Latin American cultural history from the perspective of its oceanic communities, ecologies, and poetics. We will be guided by the following questions: how do Pacific and Caribbean islands, archipelagos, and their histories reconfigure our spatial and temporal understanding of continental Latin America? How is the agency of coastal and oceanic ecosystems expressed in the cultural, aesthetic, and environmental history of Latin America? Does thinking about coastal environments as sites of knowledge production require specific conceptual and methodological shifts? To respond to these questions, the course will adopt an interdisciplinary approach that combines environmental humanities, Caribbean and Transpacific Studies (with an emphasis on race, indigeneity and diaspora), and will engage with historical, literary, and artistic analyses of primary materials, as well as conversations with guest speakers.\n\n\nPREREQUISITES: At least one foundational course (SPAN 300-318W) is required of all students.",
    "course_description": "Advanced study of a topic related to the language, discourse, literature, and/or culture of the Hispanic world. Students may take multiple SPAN 385 courses provided that they focus on different topics.",
    "prerequisites": null,
    "instructors": "Laura Torres-Rodriguez - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in North Decatur Building 111",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_SPAN_385_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 4111, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 1-2:15p, Instructor: L. Torres-Rodriguez, Status: Open",
    "date_accessed": "2023-10-31"
}