{
    "course_code": "SPAN 300W",
    "course_title": "Introduction to Hispanic Cultural History",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 4Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Intercultural Communication w.Cont.Comm(*)",
    "permission": "Department Consent Required",
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "This Foundational Course prepares students for upper-level course work in the department by focusing on literacy about Hispanic cultures and developing critical thinking skills in Spanish. \nWith the intention of improving these two skills, students read and write about the histories, geographies, values, and artistic and cultural productions of the Hispanic world. The course fulfills a Continuing Communication requirement and as such will incorporate assignments that focus on multimodal communication across different genres. Ultimately, this course helps students develop skills related to the following three learning outcomes of the major or minor in Spanish:\n1.\tApply fundamental critical reading skills to the analysis and interpretation of a variety of styles and genres from a range of texts in Spanish, such as film, political discourse, online media, essays, novels, and journalistic writing;\n2.\tProduce written communications in academic Spanish;\n3.\tUse spoken Spanish in an academic setting in formal communicative modes, such as presentational, interpretative, interpersonal.\n\n\nTEXTS: Fuentes, Carlos. El espejo enterrado: reflexiones sobre España y América. Mexico, \nD.F.: Alfaguara/Penguin Random House Grupo Editorial, 2016. Available online through Emory Libraries after login with Emory credentials.\nPARTICULARS: A Foundational Course that counts towards the major or minor in Spanish. Evaluation is based on class participation, written homework, exams, class presentations and attendance at or participation in events related to Hispanic cultures. Communication is integral to the course and students will engage in peer revisions and a process of reflection across assignments.\nPREREQUISITE: Spanish 212 or official placement into our Foundational Course level (courses numbered 300-318). If you haven't taken our placement exam yet, please visit https://spanport.emory.edu/undergraduate/placement/spanish-placement.html.",
    "course_description": "The foundation course for the major and minor. A course in Hispanic cultural literacy that also strengthens written and oral language skills.",
    "prerequisites": null,
    "instructors": "Gui Silva Von Streber - Primary Instructor",
    "schedule_location": "MW 4pm-5:15pm in Candler Library 121",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_SPAN_300W_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 6330, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 4-5:15p, Instructor: G. Silva Von Streber, Status: Open",
    "date_accessed": "2024-03-31"
}