{
    "course_code": "SPAN 304",
    "course_title": "Introduction to Spanish Linguistics",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "Intercultural Communication(*)",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(Same as LING 304 1)\n\n\nDeborah Tannen, a Distinguished University Professor of Linguistics at Georgetown, shared at a talk she gave at Emory that her mother once asked her, \"Deborah, do you like your hair like that?\"  Is that really a question?  How do we know?  Does like have the same meaning in both uses?  Was the question yelled or whispered, and with what kind of accent?  Why don't we ask, \"Deborah, your hair do like you like that?\"  Now, think of a similar example in Spanish and ask some questions about it!  These are the types of things we'll discuss in Span/Ling 304, starting with a general history of the field of linguistics and what human communication entails before moving into detailed discussions of the production and organization of the sounds of Spanish (fonética y fonología); the formation, structure, and meanings of words (morfología); the structure and organization of sentences (sintaxis); analyses of meaning of words, sentences and conversations (semántica y pragmática); and examples of linguistic variation.\n\n\nTEXT: Hualde, José Ignacio, et. al. Introducción a la lingüística hispánica (2da edición).  New York: Cambridge University Press, 2013.\nPARTICULARS: No previous study of Linguistics is required. Evaluation is based on active class participation, exams (midterms and a final) and homework assignments.\n \nPREREQUISITE: Span 212 or permission from instructor.",
    "course_description": "Foundational course for the major and the minor that introduces students to the field of Hispanic linguistics, including phonetics, phonology, morphology, pragmatics, and linguistic variation in the Spanish-speaking world.",
    "prerequisites": null,
    "instructors": "Robyn Clarke - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Callaway Center C203",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_SPAN_304_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3575, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: R. Clarke, Status: Wait List",
    "date_accessed": "2024-03-31"
}