{
    "course_code": "SPAN 405W",
    "course_title": "Language and Discourse on the Web",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 3",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Continuing Communication(*)",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(Same as LING 405W 1)\n\n\nThis course incorporates a theoretical frame in linguistics, with a specific focus in pragmatics, and applies it to electronic communications. Students will examine different tools for Internet communication and will explore the form and uses of Spanish language in them. The course provides with a specific discourse analysis methodology that will be used for the study of different online media, such as web pages, discussion forums and social networks. Special attention is given to the recognition of the main features of specific Internet genres (e.g. web ads, electronic news articles, blogs), as well as the analysis of their language functions and intercultural content. In addition to the theoretical frame, the course incorporates extensive practice that will allow students to develop their own intercultural research project by analyzing electronic texts related to their professional interests (e.g. health, film, journalism, business, law). A background on general Linguistics is strongly recommended, such as the one provided in Span/Ling 303, Span/Ling 304 or Ling 201.\nTEXTS: Selection of readings available in Canvas.\nPARTICULARS: Evaluation will be based in class participation, daily assignments, two exams, one research project and online activities.\nPREREQUISITE: At least one foundational course for the Spanish Major and Minor",
    "course_description": "This course incorporates a general theoretical frame in linguistics, with a specific focus in discourse analysis and pragmatics, and applies it to electronic communications. Students will develop an intercultural research project by analyzing digital texts in a systematic way",
    "prerequisites": null,
    "instructors": "Jose Luis Boigues-Lopez - Primary Instructor",
    "schedule_location": "TTh 4pm-5:15pm in Ignatius Few Building_131",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_SPAN_405W_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3943, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 4-5:15p, Instructor: J. Boigues-Lopez, Status: Open",
    "date_accessed": "2024-03-31"
}