{
    "course_code": "SPAN 411W",
    "course_title": "Translation Theory and Practice",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Continuing Communication(*)",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(Same as LING 411W 1)\nTranslators are both skilled writers and excellent readers, as the process involves textual analysis, interpretation and creativity. It is a process richer than its final product and requires choices with important political and cultural implications. This course will examine these issues, challenge your syntax, and compel you to consider linguistic nuances in English and Spanish. You'll learn the history and theories of translation, and methods/techniques of translating English and Spanish. Time will be devoted to translation practice, comparing multiple translations of a text, and discussing translations done both by students and professional translators. Advanced Spanish is required.",
    "course_description": "This course presents the history and multiple theories of translation, as well as basic methods/techniques and problems of translating between English and Spanish. A portion of class time will be devoted to translation practice and the comparison of multiple translations of a single text.",
    "prerequisites": null,
    "instructors": "Lisa Dillman - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in COX 230A",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_SPAN_411W_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3580, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 10-11:15a, Instructor: L. Dillman, Status: Wait List",
    "date_accessed": "2024-03-31"
}