{
    "course_code": "SOC 389",
    "course_title": "Spec. Tops in Sociology: Soc Causes & Cons Health Ineq",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 40 / Seats Avail: 26Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Inequalities in social life determine how long people live, how often they get sick, and whether they can receive medical care. We will apply sociological theories to examine paths that lead social inequities to health disparities and how poor health, in turn, can reinforce social disadvantage. Our readings and discussions will cover how inequities cycle between health and social status, which creates a system of injustice that can echo throughout the life-course and across generations.\nThe course is organized by dimensions of social inequality, social capital, education, gender, social networks, race/ethnicity, neighborhood, and immigration status. Each dimension is vastly complex and is worthy of numerous years of study. This semester-long course aims to introduce you to the major themes, theories, and empirical findings in inequality and health. We will practice applying sociological tools to real-life situations. We will explore how social standing affected health outcomes during notable events such as pandemics, natural disasters, and policy changes. By the end of the semester, you will be able to engage in public discourse that would expand our knowledge on how health and social status can influence each other.",
    "course_description": "A seminar or lecture series on topics of special sociological concern.",
    "prerequisites": null,
    "instructors": "Heeju Sohn - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in Callaway Center C101",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_SOC_389_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3517, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: H. Sohn, Status: Open",
    "date_accessed": "2023-10-31"
}