{
    "course_code": "SOC 348",
    "course_title": "Aging in Society",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 40 / Seats Avail: 26Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Course description: Aging and the life course -- from birth to death -- in sociological perspective.  The aging and development of individuals takes place in societies that are stratified by age.  What are the personal, social, economic, and structural factors and resources that determine an individual's life chances as they age?\n\n\nThis lecture-discussion course will introduce the student to the field of the sociology of aging and the life course.  Society is ordered by age, and as we get older we move through society¿s age strata, from infancy to childhood, to adolescence, to young adulthood, to middle age, and late life.  The social structures into which we are born, grow up, live, work, and age are entirely determined for us in infancy and childhood, but become somewhat open to choice as we mature.  We will think about age and aging from a life course perspective, from the perspective of birth cohorts, and in the context of the current historical period in which we live.",
    "course_description": "Study of age and the aging process. Social aspects of growing old are examined with attention to the problems of the elderly and to the consequences for society.",
    "prerequisites": null,
    "instructors": "Ellen Idler - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in Math & Science Center - N304",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_SOC_348_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3507, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: E. Idler, Status: Open",
    "date_accessed": "2023-10-31"
}