{
    "course_code": "SOC 355W",
    "course_title": "Research Methods in Sociology",
    "credit_hours": "4",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Continuing Communication(*)",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Course Description: This course introduces students to the research methods commonly used in sociology and related fields. Topics include measurement validity and reliability; random and nonrandom sampling; experimental and quasi-experimental designs; survey research and questionnaire construction; ethnographic methods such as participant observation and intensive interviewing; evaluation research versus traditional social research; and ethical issues such as informed consent, privacy, and conflicts of interest. The course has four basic objectives. First, you will learn how to translate abstract theoretical ideas into testable hypotheses. Second, you will be able to identify the strengths and limitations of different methods and determine which methods are most appropriate for answering your particular research questions. Third, you will become better equipped to critically assess the methodological soundness of research presented in scholarly journals and the news media. Fourth, you will develop a detailed understanding of research ethics, including how ethical guidelines have evolved historically and how they potentially vary across different methods and fields of study. The overarching goal of this course is to provide you with the necessary practical skills for being a discerning consumer and producer of social research. The course is required for sociology majors and fulfills a continuing writing requirement.",
    "course_description": "Introduction to research design and data analysis, including logic of research, methods of data collection, elementary statistics, and computer analysis.",
    "prerequisites": "Any SOC or SOC_OX  or equivalent transfer credit as prerequisite.",
    "instructors": null,
    "schedule_location": "Varies by section",
    "course_resources": null,
    "sections": "Class Nbr: 3515, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 10-11:15a, Instructor: M. Reed, Status: Open\nClass Nbr: 3516, Section #: 2, Type: LEC, Campus: ATL, Meets: TTh 8:30-9:45a, Instructor: J. Mullis, Status: Open",
    "date_accessed": "2023-10-31"
}