{
    "course_code": "SOC 350",
    "course_title": "Sociology of Law",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 40 / Seats Avail: 18Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Course Description: Law has always received a great deal of attention from sociologists. Classical theorists such as Émile Durkheim and Max Weber pioneered the sociological study of law, and contemporary researchers continue to examine law's deep connection to both consensus and conflict in society. In this course we'll see how the sociology of law is situated within a larger interdisciplinary field of legal scholarship that includes the work of philosophers, historians, anthropologists, economists, and others. We will also explore the practical relevance of the sociology of law for legal reformers seeking to correct perceived flaws in the system. Other topics will include the evolutionary origins of morality; formal versus informal social control; the history and culture of the police; the socialization of law school students; and current legal controversies regarding the insanity defense, drug use, gun control, campus speech codes, religious expression, and capital punishment.",
    "course_description": "An introduction to the sociological study of law, this course deals with the organization, profession, and practice of law and with the relationships between law and social change.",
    "prerequisites": null,
    "instructors": "Jeff Mullis - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Candler Library 114",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_SOC_350_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3514, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: J. Mullis, Status: Open",
    "date_accessed": "2023-10-31"
}