{
    "course_code": "SOC 289",
    "course_title": "Special Topics in Sociology: Sociology of Creativity",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 40 / Seats Avail: 0Waitlist Total: 7",
    "waitlist_total": ": 7",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "The readings and discussion for this class will be ground in sociological research and theory on creativity, creative production, and the arts (with a slight focus on literary arts). Together, we will explore concepts, theories, and perspectives in order to apply them to the analysis of the social world and towards the generation of our own creative work and thought. More specifically, discussion will center around understanding the social factors that shape creativity.\n\n\nWe will also explore the idea of ¿creativity¿ broadly, as it pertains to professional development, our personal lives and towards the engagement with our communities. Creativity can be seen as essential to asking new questions of our relationships, solving community and political problems, improving our institutions, facilitating personal growth and happiness. We will explore why popular images of creativity typically involve an isolated genius toiling towards their next breakthrough and look at the art worlds that make creative work possible. What is creativity, and how does one become creative? Is it possible to generate creativity? How common or rare is creativity? And, more importantly, what is the social nature of creative work? We will explore these questions through sociological perspectives and focus on literary, culinary, and artistic fields.\n\n\nThis course is organized around discussion, field trips, and very active class participation. Students will be expected to do all the readings and come prepared to discuss them critically in class. Students will also have a significant final project that will involve research, reflection, and creative work. The focus of this class is to develop an approach to life-long learning informed by the subject matter.",
    "course_description": "A seminar or lecture series on topics of special sociological concern.",
    "prerequisites": null,
    "instructors": "Sonal Nalkur - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in White Hall 102",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_SOC_289_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: This section is full 3505, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: S. Nalkur, Status: Open",
    "date_accessed": "2023-10-31"
}