{
    "course_code": "SOC 389",
    "course_title": "Spec. Tops in Sociology: Soc.Approaches Mental Illness",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 2Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Topic:  Social Approaches to Mental Illness\n\n\nThis course aims to provide an overview of a sociological approach to mental illness. Approaching mental illness from a sociological lens provides important insights, and challenges many taken-for-granted assumptions about how mental illnesses are diagnosed, treated, and even created. This course will examine and challenge notions about solely biological or genetic explanations for the development and treatment of mental illness, and will instead look at how mental illnesses are socially constructed.\n\n\nWe will examine topics ranging from how definitions of mental illness are made, the complexity of individual illness experiences, social determinants of mental illness, global comparative perspectives of mental illness, social policy of mental illness, and the subject of dying while mentally ill. Because this is such a broad subject area, all topics cannot be properly covered. However, this course will attempt to provide an introduction to some of the most important sociological contributions to the study of mental illness. By the end of the course, you will effectively be able to articulate the myriad ways in which mental illness is socially constructed, from development, diagnosis, and treatment, all the way through to recovery.",
    "course_description": "A seminar or lecture series on topics of special sociological concern.",
    "prerequisites": null,
    "instructors": "Melissa Uehling - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Tarbutton Hall 111",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_SOC_389_8_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3822, Section #: 8, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: M. Uehling, Status: Open",
    "date_accessed": "2024-03-31"
}