{
    "course_code": "SOC 389",
    "course_title": "Spec. Tops in Sociology: Origins of Racial Inequality",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 19 / Seats Avail: 9Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Race and Ethnicity(*)",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Topic: The Origins of Racial Inequality in Education\n\n\nWhere and when do we begin to see racial inequality in education? In the case of many modern societies, these fissures can be traced back to racial exclusion through legally segregated education systems. Although the physical and legal remnants of these separate and unequal institutions exist only in the backdrop of the educational milieu, the legacies of state mandated racially segregated education loom large in our present. These legacies manifest themselves not only in terms of educational outcomes, but also along the social dimensions of the educational experience for people of color.\n\n\nThe last decade in higher education is exemplar. In the U.S., major universities such as Emory, Brown, Harvard, Georgetown, Columbia, and Princeton, to name a few, have launched formal university-wide inquiries into their ties to racial slavery. These initiatives have led to the establishment of research centers, commemorative monuments, and platforms for more serious dialogues about the relationship between historic forms racism and contemporary institutional aspirations for ethno racial diversity, inclusion, and belonging in higher education. At the same time, students around the world continue to lead movements to \"decolonize the university\"-from the \"Rhodes Must Fall\" movement (South Africa, Zimbabwe, and the U.K.), to \"Royall Must Fall\" (Harvard), to the \"White Curriculum\" movement (U.K. and the U.S.)-essentially recasting the discourse on the historical entanglements between race and the university by situating conversation within a global historical frame. Inspired by this rallying cry to \"decolonize the university\" , the overarching question guiding this book asks: Exactly how was it colonized in the first place?\n\n\nActive Learning Approach: This course will engage students in vigorous dialogues, leveraging primary documents, case studies, and oral histories. The format will not only be lecture-based but also highly participatory, emphasizing collaborative projects and peer-led discussions.\n\n\nReading Intensive: Prepare to immerse yourself in an array of academic texts, firsthand accounts, legal documents, and essays, as well as archival documents historical figures involved in the education sector. This wide array of resources will illuminate how segregated systems were formed, what moral narratives were spun around them, and what implications these legacies continue to have in the modern-day schooling experience for Indigenous, Black and brown communities.\n\n\nOff-Site Visits: Supplementing our classroom learning, we will visit key historical locations and modern institutions wrestling with their historical legacy-mirroring similar initiatives by schools across the country to acknowledge and atone for their historical ties to racial segregation and slavery.\n\n\nTopics and Key Questions:\n1.\tThe Legal Blueprint of Segregated Education: What constituted segregated education systems as legal entities? How did they operate?\n2.\tThe Ideological Backdrop: What were the educational philosophies and moral compasses of the architects behind these systems-ranging from educationists and missionaries to philanthropists and the State?\n3.\tThe Long Shadow: How do the footprints of legally segregated schooling affect current perceptions and cultural dynamics in communities of color-like parental involvement, societal role of schools, and cultural transmission?\n4.\tDecolonizing The Academy: Drawing inspiration from global movements like \"Rhodes Must Fall\" and \"White Curriculum,\" what does it mean to decolonize a university today?\n\n\nCourse Goals:\n1.\tTo engage students in active, reflective, and participatory learning about racial inequality in education.\n2.\tTo foster a deeper understanding of the historical complexities that continue to shape education for Indigenous, Black, and Brown communities.\n3.\tTo encourage critical thought on what it means to decolonize educational spaces, and how students can be active agents in this process.",
    "course_description": "A seminar or lecture series on topics of special sociological concern.",
    "prerequisites": null,
    "instructors": "Karida Brown - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in 1462 Clifton Rd 101",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_SOC_389_3_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3519, Section #: 3, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: K. Brown, Status: Open",
    "date_accessed": "2024-03-31"
}