{
    "course_code": "SOC 489",
    "course_title": "Special Topics in Sociology: Historical and Archival Method",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 3Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Topic:  Historical and Archival Methods\n\n\nThis course will review a suite of methods available to scholars engaged in historical and archival research; particularly in research that focuses on histories that are not centered in the metanarrative frame, underrepresented in the institutional archive, or simply hidden in plain sight. Substantively, we will focus on five modes of inquiry: (1) traditional archival methods, (2) legal history, (3) oral history methodology, (4) digital archives, (5) postcolonial and global historical sociology. Throughout the semester, we will collectively interrogate these approaches through a holistic approach to social scientific inquiry; namely through a lens of theory, praxis, and ethics. To that end, the course will be comprised of deep discussion of texts centered on questions of the theory of history, site visits to archives and research centers, guest lecturers, close readings of contemporary empirical research that employ these methods, and participatory reflection on your own research projects.\n\n\nWho Should Take This Course: Ideal for students currently in the research or research-design phase of their projects who aim to integrate historical, archival, or oral history methods into their work.\n\n\nPracticum & Off-Site Travel: This class includes visits to archives, where you'll gain practical skills in historical research methods. Be prepared for off-site travel and fieldwork, as we delve into the nitty-gritty of archival sleuthing.\n\n\nHolistic Approach: Our discussions will be anchored in theory, praxis, and ethics, as we critically examine each approach. Expect robust dialogues about the theory of history, augmented by guest lectures, site visits, and participatory reflections on your own research endeavors.\n\n\nCourse Goals:\n1.\tCritical Discourse: To build a community engaged in deep intellectual discussions about the production of knowledge, critical methodologies, and research design.\n2.\tReflexive Praxis: To guide you in understanding how these methods can be applied to your own research, fostering a self-reflective research practice.\n3.\tEffective Communication: To elevate your skills in articulating complex research designs to a diverse scholarly audience.\n4.\tRigorous Research: To impart the 'how-tos' of meticulous historical research, a facet often overlooked yet foundational to our academic endeavors.\n\n\nResearch Design Focus: Significant time will be dedicated to research design-addressing the pivotal question: how do you plan to analyze your object of study?",
    "course_description": "A seminar or lecture series on topics of special sociological concern.",
    "prerequisites": null,
    "instructors": "Karida Brown - Primary Instructor",
    "schedule_location": "T 2:30pm-5:15pm in Tarbutton Hall 206",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_SOC_489_2_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3561, Section #: 2, Type: LEC, Campus: ATL, Meets: T 2:30-5:15p, Instructor: K. Brown, Status: Open",
    "date_accessed": "2023-10-31"
}