{
    "course_code": "SOC 461",
    "course_title": "Moon Bound in the 60s",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 19 / Seats Avail: 7Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Irregularly",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Seminar on sociological aspects of Apollo space era (1961-1972), focusing on social and cultural aspects of four new realities: \"Spaceflight,\" \"Astronaut,\" \"Astronaut Family,\" and \"NASA.\" Students use primary source material from the Stuart A. Rose Library and the Apollo 15 Learning Hub to create final projects.\n\n\nClass Notes \nOnly 12 humans have walked on the Moon; only 24 have orbited the Moon. No human has been beyond Earth's orbit since the last Apollo lunar mission in 1972. The Apollo missions were extraordinary scientific achievements; they were also historical events located in particular social contexts. This seminar course takes a sociological approach to explore the Apollo era (1961-1972), focusing on four main areas: \"Spaceflight\" \"Astronaut,\" \"Astronaut Family,\" and \"NASA.\"\n\n\nWe will begin with brief background on the political, technological, and broader social contexts of the time. Then we will delve deeper into various social and cultural aspects of these four new realities: \"Spaceflight\" (e.g., media constructions and projections), \"Astronaut\" (e.g., links to test pilot culture; gendered construction of a new occupation), \"Astronaut Family\" (e.g., relationship with the press; the unpaid work roles of wives; creating new NASA communities) and \"NASA\" (e.g., PR efforts and image constructions; early organizational culture).\n\n\nStudents will work with primary source material from the Stuart A. Rose Manuscript and Rare Book Library, the Emory Center for Digital Scholarship's Apollo 15 Learning Hub as well as other digital archival material (from data collected by Professor Scott) to create their own projects on one of the main topic areas. \nRequirements: Three short research assignments that will build into a final project, in the form of an op-ed article. Drafts of the final project will be peer reviewed and discussed in class. Class attendance and discussion are integral to this course. \nPrerequisite: one Sociology course.",
    "course_description": "Seminar on sociological aspects of Apollo space era (1961-1972), including political (Cold War), technological (early digital) and cultural (media; astronaut families; work culture). Students use primary source material from Apollo 15 Learning Hub and Stuart A. Rose Library to create final projects.",
    "prerequisites": null,
    "instructors": "Tracy L Scott - Primary Instructor",
    "schedule_location": "W 4pm-6:45pm in New Psyc Bldg 220 (36 Eagle Ro",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_SOC_461_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3554, Section #: 1, Type: SEM, Campus: ATL, Meets: W 4-6:45p, Instructor: T. Scott, Status: Open",
    "date_accessed": "2024-03-31"
}