{
    "course_code": "SOC 585",
    "course_title": "Advanced Topics in Sociological Research: Racism and Ethnoracial Health",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 8 / Seats Avail: 8",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(Same as AAS 720 1)\nTopic:  Racism and Ethnoracial Health Disparities\n\n\nThis course is designed to provide a broad overview of racism and its relationship with ethnoracial (racial and ethnic) health disparities. Despite medical advances over the past century, ethnoracial disparities persist. Black, indigenous, Latinx, and people of color in the United States carry an inequitable burden of chronic disease and have higher mortality rates compared to their white counterparts. Since the publication of the Institute of Medicine's report, Unequal Treatment (2003), eliminating health disparities has become a fixture on the \"front-burner\" of America's health policy agenda. The persistence of ethnoracial health disparities is concerning as Census projections indicate that Whites will become the demographic minority before mid-century, with Latinx, Asian, and Black populations leading the change in population growth. The resistance of ethnoracial health inequities to current health policy solutions, thus, poses non-ignorable social problems that threaten the economic vitality of our nation and contribute to the propagation of social stratification. As the United States continues to diversify and stratify, it will become increasingly important that we, as a nation, begin to address racial and ethnic inequities in health systematically. This course not only speaks to these underlying conditions and nuances, but also provides tools and mechanisms to consider interdisciplinary responses to mitigating ethnoracial inequities in health and healthcare outcomes.\n\n\nThis course deliberately considers the potential of sociological and social science frameworks to changing the current narratives and interventions about racism as a sociopolitical determinant of health.",
    "course_description": "Various topics in Sociology.",
    "prerequisites": null,
    "instructors": "Abigail Sewell - Primary Instructor",
    "schedule_location": "Th 1pm-3:45pm in Tarbutton Hall 313",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_SOC_585_3_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3814, Section #: 3, Type: SEM, Campus: ATL, Meets: Th 1-3:45p, Instructor: A. Sewell, Status: Open",
    "date_accessed": "2023-10-31"
}