{
    "course_code": "SOC 585",
    "course_title": "Advanced Topics in Sociological Research: Moon Bound in the '60s",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 9",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Topic:  Moon Bound in the '60s: Doing Archival Research\n\n\nCourse Description\nResearch seminar on sociological aspects of Apollo space era (1961-1972). Students will be \"doing sociology\" through original research on a social or cultural aspect of \"Spaceflight,\" \"Astronaut,\" or \"Astronaut Family,\" using primary source material from the Stuart A. Rose Library as well as other digital archival material (from data collected by Professor Scott).\n\n\nOnly 12 humans have walked on the Moon; only 24 have orbited the Moon. No human has been beyond Earth's orbit since the last Apollo lunar mission in 1972. The Apollo missions were extraordinary scientific achievements; they were also historical events located in particular social contexts. While much research has been done on the scientific, technological, and political aspects of the Apollo era (1961-1972), far less has been done the social and cultural aspects of the space program during this time, particularly on the cultural roots of the astronaut occupation, as well as on the astronaut wives and families, their connections to NASA, and their relationships with the media - all integral to the success of the space program.\n\n\nStudents will ¿do sociology¿ by developing their own archival research project focused on illuminating a sociological aspect of the Moonshot era. We will be concerned with practical issues that arise at different stages of the research process, reviewing empirical studies that employ archival and qualitative methods. Assignments will focus on gaining research experience by conceptualizing a research question, articulating the methodological rationale to answer the question, choosing the appropriate archival data, and analyzing a sample of that data.\nParticulars: Students will be required to meet individually with Professor Scott to discuss their projects. Required coursework will be 3 short assignments and one final research project. Because this research will be exploratory, there will be different options for the final project, for example: a research presentation; a research proposal; an op-ed essay (public scholarship).\n\n\nSpecifically, the archival sources available for projects are:\n· The Anne Lurton Scott and David R. Scott Papers at Emory¿s Stuart A. Rose MARBL (David R. Scott was in Astronaut Group 3, and flew on Gemini 8, Apollo 9, and Apollo 15. Anne Lurton Scott was his wife during this era.)\n· Digital selections from LIFE magazine reporter Dora Jane Hamblin¿s Papers at the University of Iowa. (Hamblin was the main journalist assigned to cover the astronaut families for LIFE.)\n· Digital selections from LIFE Editorial Records from the New York Historical Society. (LIFE magazine had an exclusive contract for the ¿personal stories¿ of the first groups of astronauts.)\n· Digital selections from Tom Wolfe¿s Papers at the New York Public Library. (Wolfe did extensive interviews and research for his book, ¿The Right Stuff,¿ and his earlier Rolling Stone articles on the early astronauts.)",
    "course_description": "Various topics in Sociology.",
    "prerequisites": null,
    "instructors": "Tracy L Scott - Primary Instructor",
    "schedule_location": "W 4pm-6:45pm in New Psyc Bldg 220 (36 Eagle Ro",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_SOC_585_4_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3816, Section #: 4, Type: SEM, Campus: ATL, Meets: W 4-6:45p, Instructor: T. Scott, Status: Open",
    "date_accessed": "2023-10-31"
}