{
    "course_code": "ARTHIST 190",
    "course_title": "Freshman Seminar:Art History: Whose Antiquity?",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 14 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "\"Whose Antiquity? Looting and the Evolution of Cultural Heritage\"The looting of antiquities over the course of the twentieth and twenty-first centuries, whether clandestine activities in Italy and Cambodia, or openly during recent conflicts across the globe, have led to a broad reassessment of how we understand, value, and the material remains of the past. Yet, how we understand and conserve this heritage today has its roots in the distant past. From Sargon and Thutmoses III to Charlemagne and Saladin, this first half of the course will trace evolving ideas of cultural heritage in the premodern world, the creation of antiquity in early modern Europe, and the establishment of international conventions up to and including UNESCO. The second half of the course will consider a range of contemporary controversies and debates surrounding the ownership of cultural heritage around the world, and will give students an opportunity to develop a research project on a case study of their choice.\nCourse readings will be provided online through the course's Canvas, with no advanced purchases necessary.",
    "course_description": "Limited to freshmen and introductory in nature, these seminars may feature discussion, readings, museum visits, and presentations.",
    "prerequisites": null,
    "instructors": "Andrew Ward - Primary Instructor",
    "schedule_location": "T 1pm-3:45pm in Carlos Hall Conference",
    "course_resources": null,
    "sections": "Class Nbr: 5496, Section #: 1, Type: SEM, Campus: ATL, Meets: T 1-3:45p, Instructor: A. Ward, Status: Open",
    "date_accessed": "2024-03-30"
}