{
    "course_code": "ARTHIST 259R",
    "course_title": "Historical Perspective/ Europe Art Topics",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 30 / Seats Avail: 19Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "\"The Global Baroque & The Digital Humanities\"The word \"Baroque\" typically conjures notions of European masters creating theatrical displays celebrating the absolute monarchs and religious leaders of Europe. However, the political, cultural, and religious sentiments that formed on the European continent traveled well beyond its shores on the ships of merchants, missionaries, and colonists. In this course we will examine Baroque art and architecture in its global context, considering how artistic styles and practices spread to and from the \"four corners of the world.\" Particular attention will be paid to Rome as the diplomatic center of this global exchange through the study of early modern materials at Emory's Rose Library, Michael C. Carlos Museum, and Pitts Theology Library. \nSimultaneously, we will consider how ideas and information spread from the ivory towers of academia to the public in the twenty-first century through exemplary museum exhibitions and digital projects that seek to engage a broad audience. Each week students will draw meaningful connections between the history of baroque art and advances in the public humanities today through weekly discussion posts and written assignments. At the end of the semester, students will submit a project proposal for their own public humanities project.\nArt History major/minor: Division II\nArchitectural Studies minor: core requirement",
    "course_description": "The cultural context of selected traditions of European art and architecture, from ancient Mediterranean to eighteenth century, exploring the interplay of culture with historical circumstances. May be repeated when topic changes.",
    "prerequisites": null,
    "instructors": "Annie Maloney - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Carlos Hall 211",
    "course_resources": null,
    "sections": "Class Nbr: 3688, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: A. Maloney, Status: Open",
    "date_accessed": "2024-03-30"
}