{
    "course_code": "ARTHIST 329W",
    "course_title": "Topics: Art of Class Antiquity: Greek Sculpt in Age of Kings",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Same as CL 329RW 1)\nGreek Sculpture in an Age of Kings, 370-30 BCE\nFrom the King's Peace in 370 BCE that ushered in the Late Classical Period through to the Roman conquests that marked the end of the Hellenistic Period in 30 BCE, ancient Greek sculpture underwent a radical evolution. Beginning with Late Classical masters like Praxiteles and Lysippos, we will consider how foreign rulers instigated an artistic revolution that only intensified with Alexander the Great and the Hellenistic kings that followed. This course will study how the art of the period embraced previously uninteresting, or even inappropriate, themes like beggars, prostitutes, and foreigners even as more traditional subjects like gods, athletes, and rulers were represented in new ways.\nAs a writing-intensive course, over the course of the semester students will compose an argumentative paper as well as a research paper on the topic of their choice. There are no prerequisites for the course, although some familiarity with ancient art is encouraged.  \nArt History major/minor: Division I",
    "course_description": "Topics could include ancient sanctuaries; early Greece: real and imagined and religious festivals; myth and art in ancient Greece; and Greek architecture. May be repeated for credit when topic changes, up to a maximum of twelve hours.",
    "prerequisites": null,
    "instructors": "Andrew Ward - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in Carlos Hall 212",
    "course_resources": null,
    "sections": "Class Nbr: 3682, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 10-11:15a, Instructor: A. Ward, Status: Open",
    "date_accessed": "2024-03-30"
}