{
    "course_code": "ARTHIST 480RW",
    "course_title": "Sem:Late18th Cont Eur&Am Art: Landmark Exhibitions",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 5Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "\"Landmark Exhibitions\"This course will consider defining exhibitions through the lenses of their stated curatorial aims, their contemporary reception, and their retrospective assessment. Case studies include Lucy Lippard's 1969 exhibition of conceptual art, 557,087, at the Seattle Art Museum; William Rubin's 1984 Primitivism in 20th Century Art at the Museum of Modern Art, New York; Thelma Golden's 1993 Black Male exhibition at the Whitney Museum of Art; and Okwui Enwezor's 2002 installment of Documenta in Kassel. What narrative of art's past, present, or future did such curatorial undertakings put forth? Did they reinscribe entrenched definitions of art, synthesize new developments in art practice, mark widespread social changes, and/or effect transformations in the cultural sphere? Although our case studies will largely focus on specific exhibitions, we will also consider broader phenomena, such as the advent of blockbuster exhibitions and the rise of art biennials in the 1990s. The seminar will travel to the Institute of Contemporary Art, Boston, MA, to tour its Simone Leigh exhibition with its curator Eva Respini, who also commissioned the artist's 2022 Venice Biennale presentation.\nArt History major/minor: Division III\nArt History major with Museums Concentration: elective",
    "course_description": "Advanced seminar with emphasis on critical texts, methods, and techniques of art historical investigation. Permission from instructor required.",
    "prerequisites": null,
    "instructors": "Lisa Lee - Primary Instructor",
    "schedule_location": "F 10am-12:45pm in Woodruff Library 214",
    "course_resources": null,
    "sections": "Class Nbr: 3760, Section #: 1, Type: SEM, Campus: ATL, Meets: F 10a-12:45p, Instructor: Lee/Goldberg, Status: Open",
    "date_accessed": "2024-03-30"
}