{
    "course_code": "ARTHIST 470RW",
    "course_title": "Sem:Ancient Mediterr/Anatolian Art: Curatorial Practicum",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 4Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "\"Curatorial Practicum in Ancient Egyptian Art\" will be taught in connection with the spring 2023 exhibition, \"Life and the Afterlife: Ancient Egyptian Art from the Senusret Collection at the Michael C. Carlos Museum.\" Students will study objects from the Senusret Collection, which the Georges Ricard Foundation gifted to the MCCM in 2018. We will explore current debates in the field of museology in Egyptology. Using a selection of objects, individual student projects will incorporate all aspects of an exhibition, from object research, creating an object list and exhibition theme/subthemes to writing labels, panels, catalog descriptions, and producing social media content. Individual course assignments will be used to create a digital exhibition. Students will receive Shorthand and/or ArcGIS training as part of the course.\nArt History major/minor: Division I\nArt History Museums Concentration: elective",
    "course_description": "Advanced seminar with emphasis on critical texts, methods, and techniques of art historical investigation. For art history majors; open to others with permission from the instructor.",
    "prerequisites": null,
    "instructors": "Melinda Hartwig - Primary Instructor",
    "schedule_location": "W 2:30pm-5:15pm in Carlos Museum - Tate",
    "course_resources": null,
    "sections": "Class Nbr: 3714, Section #: 1, Type: SEM, Campus: ATL, Meets: W 2:30-5:15p, Instructor: M. Hartwig, Status: Open",
    "date_accessed": "2024-03-30"
}