{
    "course_code": "ARTHIST 480RW",
    "course_title": "Sem:Late18th Cont Eur&Am Art: New Directions in Art History",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 8 / Seats Avail: 4Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "\"New Directions in Art History\"Art History has undergone dramatic changes over the last decade. This course considers the state of the field of 20th century art history over the last ten years or so. What are the current stakes of the field? How has it changed? What, if anything, remains unchanged? What are the kinds of questions that scholars are asking today? Largely comprised of guest lectures, each week will introduce a new speaker, providing a unique approach to the discipline, and new ideas about what matters in art history today. In advance of each week, we will read a scholar's recent work and discuss it with them (either in person or via Zoom). In the end, the aim is to offer a broad sweep of art historical thinking today and gain some insight into what matters and what should matter in art history today. For a list of the ten invited speakers and topics please contact Professor Cronan. \nArt History major/minor: Division III",
    "course_description": "Advanced seminar with emphasis on critical texts, methods, and techniques of art historical investigation. Permission from instructor required.",
    "prerequisites": null,
    "instructors": "Todd S Cronan - Primary Instructor",
    "schedule_location": "W 5:15pm-8pm in Carlos Hall Conference",
    "course_resources": null,
    "sections": "Class Nbr: 3761, Section #: 2, Type: SEM, Campus: ATL, Meets: W 5:15-8p, Instructor: T. Cronan, Status: Open",
    "date_accessed": "2024-03-30"
}