{
    "course_code": "ARTHIST 759R",
    "course_title": "Seminar: 17th c./18th c. Art/Arch: Roman Landscapes and Gardens",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 7 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "\"Roman Gardens and Landscapes\"This seminar will consider Roman landscape from the ancient descriptions of Pliny the Younger and the vast complex of Hadrian's villa at Tivoli, to the literary gardens of the Renaissance humanists and the papal villas of Baroque Rome. Exploring the seven hills and their environs, themes will include: shaping the landscape--design and emulation; the ideology of the villa and landscape in poetry and prose; the iconographical programs of imperial and humanist gardens; hydraulics and automata in garden grottoes; fountains and sculpture programs; botany and the culture of curiosity; the changing relationship of the garden with the natural world. Throughout, we will consider the dialogue between the ancient and early modern worlds. The seminar will work closely with rare books, etchings and maps held in the Rose Manuscript, Archive and Rare Book Library and the Michael C. Carlos Museum.",
    "course_description": "Advanced seminar on 17th and 18th century art and/or architecture with emphasis on critical texts, methods, and techniques of art historical investigation. For art history majors; open to others with permission from the instructor.",
    "prerequisites": null,
    "instructors": "Sarah C. McPhee - Primary Instructor",
    "schedule_location": "T 1pm-3:45pm in Carlos Museum - Tate",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3764, Section #: 1, Type: SEM, Campus: ATL, Meets: T 1-3:45p, Instructor: McPhee/Varner, Status: Closed",
    "date_accessed": "2024-03-30"
}