{
    "course_code": "HISP 710",
    "course_title": "Topics in Identity and Citizenship: Feminist and Anti-Patriarchal",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 11",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Topic:  Feminist and Anti-Patriarchal Theory in Latin America and the Caribbean\nThis course will discuss feminist contributions to key critical developments in Latin American and Caribbean theoretical traditions. We will analyze these contributions in their historical configurations and in connection with antipatriarchal movements that refuse and diverge from hegemonic exclusive feminisms. We will develop an understanding of feminist and antipatriarchal practices as actions that produce new frameworks of intelligibility of neoliberal precariousness at multiple spatial and temporal scales that generate new political vocabularies, destabilize affects and sensibilities, and demand new resources. The seminar will turn around the transformations these feminist practices and conceptualizations elicit on the notions of subjectivity, temporality, agency, affect, political economy, organization, fabulation, authorship, and writing. We will study the work of theorists, writers, artists, activists, and feminist collectives such as Gloria Anzaldúa, Dahlia de la Cerda, Cristina Rivera Garza, Alejandra Castillo, Rita Segato, Nelly Richard, Paul Preciado, Lucí Cavallero, Verónica Gago, Raquel Gutiérrez Aguilar, Gayatri Spivak, Silvia Rivera Cusicanqui, María Lugones, Lorena Cabnal, Gladys Tzul Tzul, Denise Ferreira Da Silva, Helena Silvestre, Luisa Capetillo, Yomaira Figueroa Vásquez, Ochy Curiel, Rita Indiana Hernández, Rocío Zambrana, Hilda Lloréns, Judith Butler, Saidiya Hartman, Sara Ahmed, Bolívar Echeverría, Gilles Deleuze, Jasbir Puar, among others.",
    "course_description": "Students engage in in-depth study of a particular issue or set of issues relating to a general theme. This course directly addresses the program's research focus on \"narratives/performances of identities and citizenship.\" Under this rubric, we will design and teach seminars that explore stories, histories and performances of belonging and exclusion in the Hispanic world, with reference to contemporary questions of local, national, and global citizenship.",
    "prerequisites": null,
    "instructors": "Laura Torres-Rodriguez - Primary Instructor",
    "schedule_location": "W 1pm-4pm in Callaway Center TBA",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_HISP_710_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 4090, Section #: 1, Type: LEC, Campus: ATL, Meets: W 1-4p, Instructor: L. Torres-Rodriguez, Status: Open",
    "date_accessed": "2023-10-31"
}