{
    "course_code": "EH 520",
    "course_title": "Human Toxicology",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 75 / Seats Avail: 3",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "EH department students only.",
    "course_description": "Prerequisites: college-level biology and chemistry or instructor's permission. The goal of this course is to introduce the student to the basic principles of toxicology. Humans are exposed to a variety of dangerous substances through occupational and environmental exposures. In order to interpret the public health implications of these exposures one must have a good understanding of how these compounds get into the body, how they are processed in the body, and how they damage particular organ systems. To accomplish this, students will gain practical knowledge of the workings of specific organ systems and will be able to identify particular environmental chemicals and their mechanisms of action that underlie organ toxicity. This information will be conveyed through lecture material and reinforced by relevant readings, in-class discussion, and additional assignments that are focused on ensuring that the toxicological topics are further evaluated and considered in the context of current environmental and human health concerns and do not simply exist as standalone facts.",
    "prerequisites": "Only EOHMPH, EOHIHMPH, EOHEPIMPH, and EHSPHD students have permission to enroll in this course.",
    "instructors": "William Michael Caudle - Primary Instructor",
    "schedule_location": "TTh 10am-11:20am in Claudia Nance Rollins 1000",
    "course_resources": null,
    "sections": "Class Nbr: 3068, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 10-11:20a, Instructor: Team, Status: Open",
    "date_accessed": "2024-03-30"
}