{
    "course_code": "FILM 385",
    "course_title": "Special Topics: Film and Media: TV Economics",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 14 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Over the last 12 years, streaming content has radically changed how television content is made, released, and monetized. According to Variety, in 2022, there were over 2,000 shows released, which is more than double what was in place a decade earlier. As many brands play catch-up to Netflix, a great emphasis will be placed on how decisions are made regarding green lights, series renewals, and overall content-spend amortization models.\nThis special topic course is a hybrid of in-class and zoom-based learning. Students will meet once a month on-campus with the instructor, and the remaining classes will be conducted via zoom as the instructor is LA-based. This course provides in-depth insight into\n· Understand the history and evolution of the television industry, including key technological and market developments.\n· Analyze the various business models used by television broadcasters, cable and satellite providers, and streaming platforms.\n· Explore the economic factors that influence television content's production, distribution, and consumption.\n· Examine the role of government regulation in the television industry.\n· Analyze the impact of globalization and new digital technologies on the television industry.\n· Understand the economic principles behind advertising and marketing on television.\n· Analyze the economic implications of different pricing strategies and revenue models.\n· Explore the economic impact of television on other industries.",
    "course_description": "Rotating topics in film and media. May be repeated for credit when the topic varies.",
    "prerequisites": "FILM 102 and (FILM 201 or FILM 202 or FILM 203 or FILM 204 or FILM_OX 204 or FILM 205) or equivalent transfer credit as prerequisites.",
    "instructors": "Scott Garner - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 3378, Section #: 2, Type: LEC, Campus: ATL, Meets: TTh 10-11:15a, Instructor: S. Garner, Status: Wait List",
    "date_accessed": "2024-03-30"
}