{
    "course_code": "HIST 190",
    "course_title": "Freshman Seminar: Fake News: 2020-2022 Edition",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Freshmen Seminar - Limited to First Year Students Only)\n\n\nFake news, hoaxes, \"truthiness,\" lies, spin rooms, bots, leaks, deniers, deep fakes, and propaganda:  Fake news has become important part of our daily political culture, whether in the United States or elsewhere around the globe.  Elections and public policy have been influenced by them. Our course will delve into several historical cases of hoaxes, history \"deniers,\" and media exploitation before turning to the recent past and even daily events in the US and elsewhere.  Most especially we will probe the many fake news stories that emerged from 2020 through 2022, among others, including stories related to voter fraud, political figures, COVID19, the insurrection at the US Capitol and international crises such as Ukraine. What dynamics have historians identified that can illuminate the contemporary world? We will explore the place of social media such as Twitter and Facebook, as well as darker parts of the web, in purveying false information.  For instance, how do \"fake news\" authors use language, music, and images to make their ideas more persuasive? How has technology increased the power of \"fake news\"? Why have certain kinds of societies been more or less vulnerable to propaganda? How have courts understood the principles of \"free expression,\" \"burden of proof,\" and a \"free press\"? How have politicians and journalists contributed to and struggled with the recent intensifying \"fake news\" phenomenon?",
    "course_description": "Introduces first-year students to the discipline of history, particularly historical sources and methods; aims to improve critical reading, analytical, and writing skills in small group discussion.",
    "prerequisites": null,
    "instructors": "Judith Miller - Primary Instructor",
    "schedule_location": "W 6pm-8:45pm in Bowden Hall 118",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3901, Section #: 4, Type: SEM, Campus: ATL, Meets: W 6-8:45p, Instructor: J. Miller, Status: Closed",
    "date_accessed": "2024-03-30"
}