{
    "course_code": "HIST 150",
    "course_title": "Great Books: History",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 4Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "For 1st years and Sophomores only.\n\n\nThis course is one of the foundational courses for Emorys Voluntary Core Curriculum.  The aim is to help teach you how to read and analyze works which, from ancient times to the present, have shaped human understanding of the past and their place in the world.  Topics include: the role of human agency in history; conceptions of divine and human authority; the relationship between self and society; the natural world and the laws governing it; the development of economics; and changing notions of what constitutes a good political system.\nWe will read parts of some of the most famous books ever written: Machiavelli's The Prince, Adam Smith's Wealth of Nations, Thomas Malthus, Essay on Population, Karl Marx's Communist Manifesto, Charles Darwin's On the Origin of Species and Sigmund Freud's Civilization and its Discontents. Two short papers, a midterm, and a final. This course is a discussion-based seminar.",
    "course_description": "Part of Emory's Voluntary Core Curriculum. Certain great books have been influential across the centuries, and continue to influence the way we think, act, and understand ourselves today. Major themes of the course are the history of religion, politics, economics, biology, and psychology.",
    "prerequisites": null,
    "instructors": "Joseph Crespino - Primary Instructor",
    "schedule_location": "MWF 10am-10:50am in Atwood Chemistry Bldg. 316",
    "course_resources": null,
    "sections": "Class Nbr: 3897, Section #: 1, Type: SEM, Campus: ATL, Meets: MWF 10-10:50a, Instructor: J. Crespino, Status: Open",
    "date_accessed": "2024-03-30"
}