{
    "course_code": "HIST 285",
    "course_title": "Topics: Historical Analysis: Intro to Native American Hist.",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 30 / Seats Avail: 24Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "This course examines the history of Native peoples in North America before 1900. Integrating the materials and methods of Native American and Indigenous Studies, the class takes an interdisciplinary approach to the past and considers themes such as resistance to colonialism, maintenance of political sovereignty, and adaptation to cultural change. \nBecause Emory University occupies Muscogee (Creek) land, this course grounds its panoramic investigation of diverse yet interconnected Native American histories with a special focus on the Indigenous peoples who lived, worked, produced knowledge on, and nurtured the land where the university's Oxford and Atlanta campuses are now located. Course lectures, assigned media, primary sources, class discussions, and experiential learning opportunities develop both foundational knowledge of Native North American history while also contributing to campuswide efforts to (re)establish meaningful and improved relations with Southeastern tribal nations.\n\n\nInstructor is Prof. Michael Mortimer, Postdoctoral Fellow in Native North American History.",
    "course_description": "An introductory course on the nature and methods of history. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Loren Michael Mortimer - Primary Instructor",
    "schedule_location": "MW 4pm-5:15pm in Atwood Chemistry Bldg. 316",
    "course_resources": null,
    "sections": "Class Nbr: 4740, Section #: 5, Type: LEC, Campus: ATL, Meets: MW 4-5:15p, Instructor: L. Mortimer, Status: Open",
    "date_accessed": "2024-03-30"
}