{
    "course_code": "HIST 308",
    "course_title": "Revolutionary France,1750-1815",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 35 / Seats Avail: 8Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": ": This course will cover the turbulent decades of the French Revolution--from a cat massacre in 1739, through the pre-revolutionary crises of the 1750s, to Bonaparte's overthrow of the revolutionary republic in 1799.  This period continues to be one of the most controversial for historians of France.  There is still no clear consensus about the causes of the Revolution, or why it followed the course that it did.  As students of the Revolution, however, we can dive into the material and identify the issues that caused some French citizens to march off to war and that sent others to the guillotine.  We will investigate the economic and financial crises of the monarchy and the distress of the peasantry and working classes. We will look at the impact of the Revolution on Caribbean slavery. More recent work has investigated the cultural dimensions of the Revolution, melodramatic theater before the Revolution, battles in the salons, the female symbol of Liberty, even adultery and scandal in the courtrooms, in order to explain the Revolution's outbreak and its violence.  \nThis course fulfills the following History concentrations: Europe Post 1750, Empires, Nations, and Citizenship Concentration (Modern period); Women, Gender, and Sexuality Concentration (Modern period); Law, Economics, and Human Rights Concentration (Modern period); and General Studies in History (Modern period) \nAssignments: Mid-term exam and comprehensive final; active class participation and pop quizzes.",
    "course_description": "Causes, events, and consequences of the Revolution in France, and spread of the revolutionary movement through the Western world. The personality, statecraft, military triumphs and defeats, and significance of Napoleon.",
    "prerequisites": null,
    "instructors": "Judith Miller - Primary Instructor",
    "schedule_location": "TTh 5:30pm-6:45pm in Atwood Chemistry Bldg. 260",
    "course_resources": null,
    "sections": "Class Nbr: 3911, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 5:30-6:45p, Instructor: J. Miller, Status: Open",
    "date_accessed": "2024-03-30"
}