{
    "course_code": "HIST 385",
    "course_title": "Spec Topics: History: Indigenous Americas",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 22Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Same as AMST 385 4, LACS 385 2)\nInstructor is Postdoctoral Fellow, Prof. Samantha Billing.\n\n\nThis course provides an overview of Indigenous history in the Americas by centering the experiences of Indigenous actors before, during, and after the period of European colonialism. We begin by exploring the immense diversity of Indigenous societies prior to European contact and then shift to the colonial period, examining how Indigenous groups actively shaped and resisted European colonial processes. The final part of the course will focus on some of the legacies of European colonialism, including Indigenous nationalism, slavery, removal, historical memory, genocide, and decolonization. Students will be exposed writings by scholars of Indigenous history (secondary sources) and introduced to material written by Indigenous individuals (primary sources). By the end of the semester, students should be able to answer the following questions: How did Indigenous peoples shape the environmental, political, cultural, and social landscape of the Americas? Why do Indigenous peoples feel that colonization never really ended? How do Indigenous voices tell a different story of the Americas?\nGrading structure: Participation: 20%; Primary source reflections: 10%; Discussion questions: 5%; Hometown/state assignment: 5%; Historicizing genocide assignment: 5%; Decolonization assignment: 5%; Two exams: 20 %; Research project (bibliography: 5%, outline: 10%, final paper: 15%)\nThis course is appropriate for first year students.",
    "course_description": "Selected topics in history for advanced students. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Samantha Billing - Primary Instructor",
    "schedule_location": "TTh 4pm-5:15pm in Math & Science Center - N306",
    "course_resources": null,
    "sections": "Class Nbr: 5492, Section #: 5, Type: LEC, Campus: ATL, Meets: TTh 4-5:15p, Instructor: S. Billing, Status: Open",
    "date_accessed": "2024-03-30"
}