{
    "course_code": "HIST 385",
    "course_title": "Spec Topics: History: US Women's History to 1800",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 9Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Same as AMST 385 3, WGS 385)\nInstructor is Visiting Assistant Professor, Dr. Jennifer Morgan.\n\n\nIn this course, we will investigate women's history in North America through the lens of myth. We will examine narratives or notions that powerful men have created about women as well as those that women have created about themselves or other groups of women. Some of the more expansive categories include the dangerous woman, the virtuous woman, the hysterical woman, etc. \nApproaching our readings from an Atlantic perspective, we will consider the relation of such ideas to beliefs about women's roles and their origins in specific cultures and societies. We will then ask how these beliefs and ideas about women shifted or transformed over time and space. Most importantly, we will examine how narratives about certain groups of women have served larger political, social, cultural, and economic ends in ways that have shaped the trajectory of North American history from the seventeenth century to the end of the eighteenth century. Our readings will focus on the ways in which women of various social, cultural, and racial groups have been portrayed in the writing of North American histories. We will also question what \"women's history\" is, how it has been written, and continuing discussions around it.",
    "course_description": "Selected topics in history for advanced students. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "J.E. Morgan - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in Math & Science Center - N306",
    "course_resources": null,
    "sections": "Class Nbr: 4784, Section #: 3, Type: LEC, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: J. Morgan, Status: Open",
    "date_accessed": "2024-03-30"
}