{
    "course_code": "HIST 487RW",
    "course_title": "Jr/Sr Colloquium: Europe: Race/Migration in 20C Britain",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 8 / Seats Avail: 2Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Continuing Writing Requirement",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Same as IDS 489W 1)\nWhat is \"race\" and how did it shape postimperial Britain? What is the relationship between the end of the empire and the politics of race? How were popular understandings of citizenship and community relations transformed by the politics of race? This course will explore key themes in the history of race and migration in twentieth century Britain including: migration and refugee control, the relationship between welfare politics and migration, the political project of 'blackness' and the relationship between the black power organizations and the feminist movement. From the anti-colonial politics of the 1920s until the emergence of so-called multicultural society in the 1980s, we will take a transnational approach that will consider the British history of race and migration as a product of late and post-imperial politics.",
    "course_description": "All history majors except those who complete the Honors Program must take two colloquia (HIST 487, 488 or 489). Each colloquium treats a special theme by reading, discussion, and writing of papers. Enrollment in each is limited to twelve; non-majors are welcome within space limitations.",
    "prerequisites": null,
    "instructors": "Tehila Sasson - Primary Instructor",
    "schedule_location": "M 1pm-3:45pm in Ignatius Few Building_129",
    "course_resources": null,
    "sections": "Class Nbr: 3922, Section #: 1, Type: SEM, Campus: ATL, Meets: M 1-3:45p, Instructor: T. Sasson, Status: Open",
    "date_accessed": "2024-03-30"
}