{
    "course_code": "HIST 488RW",
    "course_title": "Jr./Sr. Colloquium: U.S.: Race & Labor in the U.S.",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Continuing Writing Requirement",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "\"The relationship between slavery and race, race and unfreedom, unfreedom and labor, is one that we constantly try to untangle: Racial capitalism, which is to say all capitalism, is not a thing. It's a relation.\" \n- Ruth Wilson Gilmore, \"Geographies of Racial Capitalism\" \n \nThis advanced seminar centers the histories and intersections of race and labor in the U.S over the course of the twentieth and early twenty-first centuries. Course readings will help us consider how labor has functioned as a site of racialization and for reproducing varied hierarchies of desirability and belonging along ethnic, gender, legal, and class lines.  We will also consider the radical possibilities that have emerged from workers, laboring lives at local and (trans)national scales. Throughout the semester students will develop the reading, research, analytical, and writing skills necessary to producing an original 20-page research paper related to course themes.",
    "course_description": "All history majors except those who complete the Honors Program must take two colloquia (HIST 487, 488 or 489). Each colloquium treats a special theme by reading, discussion, and writing of papers. Enrollment in each is limited to twelve; non-majors are welcome within space limitations.",
    "prerequisites": null,
    "instructors": "Iliana Rodriguez - Primary Instructor",
    "schedule_location": "T 2:30pm-5:15pm in Candler Library 125",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3923, Section #: 1, Type: SEM, Campus: ATL, Meets: T 2:30-5:15p, Instructor: I. Rodriguez, Status: Wait List",
    "date_accessed": "2024-03-30"
}