{
    "course_code": "HIST 799R",
    "course_title": "Advanced Research",
    "credit_hours": "1-9",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": null,
    "course_description": null,
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3939, Section #: 1, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: T. Andrade, Status: Closed\nClass Nbr: This section is full 5717, Section #: 10, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: C. Crais, Status: Closed\nClass Nbr: This section is full 5800, Section #: 12, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Tullos, Status: Closed\nClass Nbr: This section is full 5952, Section #: 13, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Lesser/Rogers, Status: Closed\nClass Nbr: This section is full 5649, Section #: 2, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Crespino/Tullos, Status: Closed\nClass Nbr: This section is full 5657, Section #: 3, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Evans-Grubbs, Status: Closed\nClass Nbr: This section is full 5658, Section #: 4, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Eckert, Status: Closed\nClass Nbr: This section is full 5659, Section #: 5, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. LaChance, Status: Closed\nClass Nbr: This section is full 5660, Section #: 6, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Payne, Status: Closed\nClass Nbr: This section is full 5661, Section #: 7, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Tullos/Ward, Status: Closed\nClass Nbr: This section is full 5715, Section #: 8, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Villa-Flores, Status: Closed\nClass Nbr: This section is full 5716, Section #: 9, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Y. Yannakakis, Status: Closed",
    "date_accessed": "2024-03-30"
}