{
    "course_code": "MDP 507",
    "course_title": "Interdisciplinary Field Seminar I",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 14",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": null,
    "course_description": "This seminar prepares MDP's aspiring development professionals for their summer field practicum, during which they work as \"embedded practitioners\" with ongoing projects at organizations like CARE, UNICEF, TNC, FAO, etc. Through this course, students prepare by examining several case studies of major development interventions and the very different kinds of impacts the same intervention may have according to the context in which it is implemented. Through extensive use of case studies, this course exposes students to broad-ranging discussion and debate about the effectiveness of the most important forms of development intervention that are and have been employed around the world by major development organizations. The examination of distinct cases brings out the importance of issues of scale, both spatial and temporal, in understanding the impact of development interventions. A primary goal of the course is to provide students with conceptual frameworks that allow them to identify the context-specific factors that affect the on-the-ground implementation of general development plans and strategies. The focus on context, scale, and on the factors that shape both, compels students to school themselves in the broad, interdisciplinary approach to development upon which the MDP program is based.",
    "prerequisites": null,
    "instructors": "Hilary King - Primary Instructor",
    "schedule_location": "T 2:30pm-5:30pm in Registrar Room Pool",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_MDP_507_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2379, Section #: 1, Type: SEM, Campus: ATL, Meets: T 2:30-5:30p, Instructor: H. King, Status: Open",
    "date_accessed": "2023-10-31"
}