{
    "course_code": "MDP 585",
    "course_title": "Special Topics: Survey Design for Evaluation",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 6",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2024-01-02 through 2024-01-14",
    "class_notes": "This class will take place on Thursday 1/11 and Friday 1/12.\n\n\nCourse Description: This course provides a thorough exploration of survey principles and practical skills for program evaluation. It covers a wide range of topics, such as the significance of surveys, survey types, survey design, crafting effective survey questions based on evaluation objectives, data collection techniques, survey administration, data analysis, and dissemination considerations.  Participants will actively engage in hands-on activities and assignments, applying their knowledge. This includes learning how to formulate precise evaluation questions, select appropriate survey criteria, create unbiased questions, and explore deployment strategies. The course emphasizes data quality assurance and strategies to reduce bias during data collection. It also focuses on the nuances of question construction and logic to avoid common survey pitfalls.   Through practical case examples and collaborative breakouts, students will have the opportunity to peer review evaluation questions and surveys. The course deliverable will allow students to practice the design and planning for surveys, gaining practical experience in the field. Ultimately, this course equips students with the knowledge and skills necessary to conduct high-quality surveys for program evaluation, enabling them to produce valuable and dependable data for program monitoring and decision making.",
    "course_description": "MDP 585 courses are used to cover topics of interest to students, particularly those taught by outside development experts. Examples of special topics couses may include Social Network Analysis, Building Inclusive Markets, Non-Profit Management and Organizational Behavior, Refugee Resettlement and Displacement, or a host of other topics. These classes can be one to three credits depending on the topic and duration.",
    "prerequisites": null,
    "instructors": "JoAnna Hillman - Primary Instructor",
    "schedule_location": "ThF 9am-5pm in New Psyc Bldg 225 (36 Eagle Ro",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_MDP_585_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3568, Section #: 1, Type: LEC, Campus: ATL, Meets: ThF 9a-5p, Instructor: J. Hillman, Status: Open",
    "date_accessed": "2024-03-30"
}