{
    "course_code": "MDP 585",
    "course_title": "Special Topics: Disaster Recovery",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 18",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2024-03-05 through 2024-04-29",
    "class_notes": "Course Title: Disaster Recovery, Climate Change, and Government Response\n\n\nCourse Location: 1599 Clifton Rd room 5c\n\n\nThis course will be held on the following dates: Mar 18, Mar 25, Apr 1, Apr 8, Apr 15, Apr 22, Apr 29\n\n\nAs climate change accelerates, human communities are faced with unprecedented weather and climate disasters. These threaten community well-being, people's aspirations for the future, and the very livability of different parts of the planet. How do governments respond to these growing calamities? Through a case study of the US Federal Disaster Recovery & Mitigation process, this course will provide students insight into the practice, management and implementation of federal disaster response programs.\nDisaster response includes both addressing immediate hardships and long-term recovery programs that cover infrastructure, housing, and economic development needs. In this course, students will gain concrete skills by considering these challenges through a case scenario: they will create an Action Plan to demonstrate community needs following a disaster and future disaster risks and prepare for the implementation of a disaster recovery program of their choosing.\nTaught by consultant practitioners working in Disaster Recovery, the course provides unique insight into federal grant management processes, monitoring and auditing, and the role of specialized consultants. Given the increasing pace of climate disasters, such skills will be sure to serve students with many development interests.",
    "course_description": "MDP 585 courses are used to cover topics of interest to students, particularly those taught by outside development experts. Examples of special topics couses may include Social Network Analysis, Building Inclusive Markets, Non-Profit Management and Organizational Behavior, Refugee Resettlement and Displacement, or a host of other topics. These classes can be one to three credits depending on the topic and duration.",
    "prerequisites": null,
    "instructors": "Marinangeles Gutierrez Rivera - Primary Instructor",
    "schedule_location": "M 9am-11am",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_MDP_585_3_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 5233, Section #: 3, Type: LEC, Campus: ATL, Meets: M 9-11a, Instructor: Reef/Gutierrez Rivera, Status: Open",
    "date_accessed": "2024-03-30"
}