{
    "course_code": "MDP 510",
    "course_title": "Gender and Development",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 22",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": null,
    "course_description": "MDP 510 is designed to familiarize students with approaches to gender in development practice. This requires an understanding of how gender serves as a vector of difference that shapes people's access to and use of power in different settings and to examine how and why this matters in \"doing development.\" The course will consider gender analyses from both within and outside of development literature. The purpose of this course is to familiarize students with the history of gender and development; prominent tensions that continue to impact and shape the field; theoretical and practical approaches to understanding gender and development; an array of institutions, approaches and people addressing these issues in specific ways. The course is divided into three sections. During the first section, we examine the history of gender and development, including major conceptual shifts in approach, institutional interventions and national and international agreements that have sought to address gender concerns. The second section uses sector-based case studies and guest experts to examine specific ways that gender analyses have been adopted and the kinds of insights that such analysis has provided in varied development sectors. In the final section of the course, we draw on additional feminist critiques to examine how different development actors are pushing beyond institutionalized tools of gender analysis to address critiques from within and outside of development organizations.",
    "prerequisites": null,
    "instructors": "Alyssa Bovell - Primary Instructor",
    "schedule_location": "W 4pm-7pm in Candler Library 114",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_MDP_510_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2377, Section #: 1, Type: LEC, Campus: ATL, Meets: W 4-7p, Instructor: A. Bovell, Status: Open",
    "date_accessed": "2023-10-31"
}