{
    "course_code": "REL 210R",
    "course_title": "Classic Religious Texts: Grief/Mourning Sanskrit Trad.",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 3Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Same as MESAS 270 4)\n(Complete Topic:  Grief and Mourning in the Sanskrit Tradition)\n(This course satisfies the Religion major requirement:- Tradition-Hinduism, Region.)\n(This course examines theories of grief and mourning recorded in Sanskrit religious and literary texts. Our concern with these theories will be psychological as well as ethical. Accordingly, the questions guiding our reading include the following: How is grief related to other emotions, such as anger and love? What do these theories of grief presume about the nature of the self? How much choice do we have in how we mourn? What distinguishes a loss \"worthy of mourning\"(ocya) from an unworthy loss? More generally, on what basis are certain ways of mourning considered to be more rational, healthy, or ethical than others? The primary readings for this course include selections from the Bhagavadgita, the Mahabharata, and the works of Asvaghosha, Kalidasa, Bharavi, and Bhavabhuti. As instructive points of comparison, we will also explore understandings of grief proposed by authors outside the Sanskrit tradition, such as Augustine, Emerson, and Freud.)",
    "course_description": "This course will explore classic religious texts in depth, developing skills to interpret sacred, philosophical and ethical works. Social, cultural, and/or philosophical contexts at work will provide interpretive frameworks.",
    "prerequisites": null,
    "instructors": "Shiv Subramaniam - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in New Psyc Bldg 235 (36 Eagle Ro",
    "course_resources": null,
    "sections": "Class Nbr: 3479, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: S. Subramaniam, Status: Open",
    "date_accessed": "2024-03-30"
}