{
    "course_code": "REL 200R",
    "course_title": "Religion & Contemporary Experience: Sacred Drugs",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 450 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(This course will be taught online. It meets for two synchronous 75-minute sessions per week on MW.)\n(This course satisfies the Religion major requirement:- Theme. )\n(The link between drug ingestion and religious cultures, medicinal therapies and sacred realities, altered states and spiritual awakenings is a common feature of social life in many cultures through time and around the globe. Drugs of all kinds, initially drawn from the plant world in the form of mushrooms or tobacco, jimsonweed or opium, have been considered powerful and invaluable because they combine medicinal and spiritual goods; are embedded in meaningful, socially vital rituals and myths; and heal by way of cosmic revelation and personal as well as social regeneration. Today multibillion-dollar pharmaceutical companies provide millions and millions of prescription drugs that promise to cure whatever ails us, often in distinctly yet fascinatingly subtle religious terms.\n\n\nAt the most fundamental level, I am hoping in this class you will learn something about how religious life and psychoactive substances are surprisingly intertwined, through history and across cultures, and most especially across the contemporary American religious landscape. At a more complex level, another goal is to be sure you leave the course more confused about American religious identities than when you entered, but with a better understanding of the politics and indeterminacies of the two key terms we will focus on throughout: \"religion\" and \"drugs.\")",
    "course_description": "Religion and contemporary issues of human existence, the role of religion in politics and international conflicts, or the nature of contemporary religious movements such as fundamentalism.",
    "prerequisites": null,
    "instructors": "Gary Laderman - Primary Instructor",
    "schedule_location": "MW 4pm-5:15pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 3477, Section #: 2, Type: LEC, Campus: ATL, Meets: MW 4-5:15p, Instructor: Team, Status: Open",
    "date_accessed": "2024-03-30"
}