{
    "course_code": "REL 200R",
    "course_title": "Religion & Contemporary Experience: Bible in Current Controversies",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "This course satisfies the Religion major requirement:- Tradition-Christianity, Theme. \nTopic: The Bible in Current Controversies\nThere has been no such time as the present when faith has become viewed as the most contradictory way to make sense of the world. Many people claim to espouse biblical values to support such beliefs. Then, is the Bible itself the root of controversies? In attempting to answer, this course will examine what the Bible has to say about several controversial issues such as Bible vs. science, abortion, homosexuality, violence, and gun control. Students will reflect on the difficulty of identifying a single, or even a dominant, biblical perspective on such issues. In addition to the Bible itself, the class will survey diverse articulations and current receptions of the Bible, including verbal, visual, ritual, and in-person accounts. Through this public-facing observation, students will develop skills to assess the (ir-)relevance of the biblical texts to the modern debates.",
    "course_description": "Religion and contemporary issues of human existence, the role of religion in politics and international conflicts, or the nature of contemporary religious movements such as fundamentalism.",
    "prerequisites": null,
    "instructors": "Hyun Woo Kim - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Math & Science Center - N215",
    "course_resources": null,
    "sections": "Class Nbr: 5629, Section #: 3, Type: LEC, Campus: ATL, Meets: TTh 10-11:15a, Instructor: H. Kim, Status: Open",
    "date_accessed": "2024-03-30"
}