{
    "course_code": "REL 200R",
    "course_title": "Religion & Contemporary Experience: Insta-Religion",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 35 / Seats Avail: 5Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Complete Topic -  Insta-Religion: Finding the Sacred on Instagram, Twitter, and Serial TV)\n(This course satisfies the Religion major requirement:- Theme.)\n(In this contemporary era, people seek spirituality and experience religion well beyond the hallowed walls of churches, mosques, synagogues, temples, and monasteries. Indeed, religion now has a massive presence on the airwaves, TV, and our social media feeds. In this course, we will examine the relationship between religion and media, raising important questions about how digital and social media offer new ways to understand ourselves, explore our spirituality, and engage in the most pressing social and political debates of our age. We will examine both how traditional religions have adapted to the presence of digital and social media as well as how new media afford novel ways for people -- especially younger generations -- to explore their own ideas about religion, articulate how these relate to their personal and moral convictions, and extend their religious ideas to the real world through activism and intervention into a range of social and political problems today.)",
    "course_description": "Religion and contemporary issues of human existence, the role of religion in politics and international conflicts, or the nature of contemporary religious movements such as fundamentalism.",
    "prerequisites": null,
    "instructors": "James Hoesterey - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in 1462 Clifton Rd 126",
    "course_resources": null,
    "sections": "Class Nbr: 3271, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 10-11:15a, Instructor: J. Hoesterey, Status: Open",
    "date_accessed": "2024-03-30"
}