{
    "course_code": "REL 270",
    "course_title": "Special Topics in Religion: Diversity/Dissent Muslim Soc.",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 5Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Complete Topic: Diversity and Dissent in Muslim Societies)\n(This course will be taught online. It meets for two synchronous 75-minute sessions per week on TTh.) \nThis course satisfies the Religion major requirement:- Tradition- Islam, Theme. \nTopic: Diversity and Dissent in Muslim Societies \nThis course offers an exploration of doctrinal, ritual, social, and cultural plurality across the Islamic societies. It starts with a general survey of the question of religious plurality in Islam. After examining the Sunni, Shi`ite, and Sufi forms of Islam, we will continue with an investigation of the question of orthodoxy and heterodoxy in Islam and explore the lesser known minority groups in the Islamic world. In the second half of the course, we will focus on diverse traditions and religiosities among contemporary Muslims living both in the Muslim-majority countries and the West. We will also explore how modern Muslims deal with the questions of race, gender, feminism, LGBT, and cultural pluralism.\n\n\n(Same as MESAS 270 5)",
    "course_description": "Variety of subjects pertaining to religion. Content will vary in successive offerings. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Riza Yildirim - Primary Instructor",
    "schedule_location": "TTh 5:30pm-6:45pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 3644, Section #: 7, Type: LEC, Campus: ATL, Meets: TTh 5:30-6:45p, Instructor: R. Yildirim, Status: Open",
    "date_accessed": "2024-03-30"
}