{
    "course_code": "REL 370",
    "course_title": "Special Topics in Religion: Federal Indian Law",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 2 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures",
    "permission": "Department Consent Required",
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "Topic: Law and Religion: Federal Indian Law\nThis course satisfies the Religion major requirement: - Theme, Region.\nPermission Required Prior to Enrollment. To request permission to register, contact Prof. María M. Carrión - mcarrio@emory.edu\nLaw school schedule: Monday & Wednesday: 10:30am- 12:00pm\n\n\nGRADING: Participation, Attendance and Paper \nDESCRIPTION: The course will encompass a survey of the governmental policies, court cases, statutes, regulations, treaties, and executive orders that together have set the legal framework between the U.S. government and the 574 sovereign tribal nations currently recognized under federal law. It will chart the historical development of Federal Indian Law beginning with the jurisprudence of the Marshall Court and continuing to the contemporary era of tribal self-determination and nation-building. Included within the curriculum will be discussion of issues such as land rights, criminal jurisdiction, gaming, religious freedom, and international law. Attendance will be mandatory for all classes. \nATTENDANCE POLICY: Attendance will be mandatory for all classes.",
    "course_description": "Variety of subjects pertaining to religion. Content will vary in successive offerings. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Douglas Waters Jr. - Primary Instructor",
    "schedule_location": "MW 10:30am-12pm in Gambrell Hall 5J",
    "course_resources": null,
    "sections": "Class Nbr: 5639, Section #: 5, Type: LEC, Campus: ATL, Meets: MW 10:30a-12p, Instructor: D. Waters Jr., Status: Open",
    "date_accessed": "2024-03-30"
}