{
    "course_code": "REL 370",
    "course_title": "Special Topics in Religion: 1st Amendment:ReligiousFreedom",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 4 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures",
    "permission": "Department Consent Required",
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "Topic: Law and Religion: First Amendment: Religious Freedom\nThis course satisfies the Religion major requirement: - Theme, Region.\nPermission Required Prior to Enrollment. To request permission to register, contact Prof. María M. Carrión - mcarrio@emory.edu\nLaw school schedule - Tuesday & Thursday, 12:00pm- 1:30pm\n\n\nDESCRIPTION: Religious liberty is one of the hallmarks of modern constitutional democracies, though it has come under considerable attack in recent years. This course analyzes the historical formation and current interpretation of the religious liberty guarantees of the First Amendment to the United States Constitution. Part I of the course explores the original meaning of the First Amendment guarantees of no establishment and free exercise of religion viewed in colonial and broader Western context. Part II analyzes the guarantees of free exercise and expression of religion guaranteed by First Amendment free exercise and free speech clauses and recent complementary statutes.\n\n\nTopics include religious liberty claims to polygamy, proselytism, Sabbath day observance, religious worship, ritual, and dress, and claims by religious individuals and groups to exemptions from general laws. It also includes the heated clashes between religious liberty and sexual liberty claims. Part III traces the requirements of no establishment of religion, particularly in cases concerning the role of religion in public education, the place of government in religious education, and the place of religious symbols and ceremonies in public and political life. Part IV analyzes the complex relationships between religious organizations and government. Topics include tax funding and exemptions for religious groups, the powers and limits of religious organizations to resolve their own internal disputes over polity and property, and their power to discipline their leaders and members for their beliefs, moral behavior, or sexual orientation.\n\n\nThe readings will consist of selected United States Supreme Court cases and a textbook, John Witte, Jr. and Joel A. Nichols, Religion and the American Constitutional Experiment, 4th ed. (Oxford University Press, 2016). There will be a final take home examination, handed out the last class of the semester. The exam will offer a choice of three or four questions that explore different major course themes; students will pick one question and prepare a 3000- word answer based on their course notes and readings. The course has no prerequisites, and does not presuppose detailed knowledge of American history or constitutional law.",
    "course_description": "Variety of subjects pertaining to religion. Content will vary in successive offerings. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "John Witte Jr. - Primary Instructor",
    "schedule_location": "TTh 12:15pm-1:45pm in Gambrell Hall 5B",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 5637, Section #: 3, Type: LEC, Campus: ATL, Meets: TTh 12:15-1:45p, Instructor: J. Witte Jr., Status: Closed",
    "date_accessed": "2024-03-30"
}