{
    "course_code": "REL 370",
    "course_title": "Special Topics in Religion: Race/Religion/Law Making Amer.",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 2 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures",
    "permission": "Department Consent Required",
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "Topic: Race, Religion, and Law in the Making of America\nThis course satisfies the Religion major requirement: - Theme, Region.\nPermission Required Prior to Enrollment. To request permission to register, contact Prof. María M. Carrión - mcarrio@emory.edu\nLaw school schedule- Monday: 9:00am-12:00pm\n\n\nDESCRIPTION: Race and religion have both played an integral part in the creation of the United States as a nation and a state. Through primary legal and historical documents, as well as secondary literature on these themes, this seminar will examine the way that race and religion shaped U.S. law, particularly the law of sovereignty, citizenship, and territory, as well as how law has shaped the American nation along racial and religious lines. While many of the laws and court decisions grounded in racial and religious animus have been repealed or overturned, others have not. Even in those cases where a particular law or case is no longer applied on its original terms, many of the legal concepts, such as the plenary power in immigration, dependent sovereignty, and alienage, remain important elements of our legal vocabulary. Furthermore, the narratives of who and what \"America\" is or should be as a nation or people, continue to haunt contemporary law and politics. Thus, it is important to trace and critique this legal history, which the U.S. has not left behind. \nATTENDANCE POLICY: Regular class attendance is expected. Absences will be factored into the class participation grade.",
    "course_description": "Variety of subjects pertaining to religion. Content will vary in successive offerings. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Silas Allard - Primary Instructor",
    "schedule_location": "M 9am-12pm in Gambrell Hall - 5K",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 5733, Section #: 6, Type: LEC, Campus: ATL, Meets: M 9a-12p, Instructor: S. Allard, Status: Closed",
    "date_accessed": "2024-03-30"
}