{
    "course_code": "ANT 331",
    "course_title": "Cross-Cult Issues In Mental Health",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 35 / Seats Avail: 3Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "This course provides an opportunity to examine issues of health, illness and healing cross-culturally from anthropological perspectives, in particular with critical engagement with our notion of 'mental' health. We will discuss mental health from three perspectives. First, we will explore how psychiatric anthropologists have critiqued Western notions of mental health and psychiatry. In Western societies, we 'know' about our health predominantly through biomedicine. We will discuss the benefits and limitations of biomedicine in how we view, study and construct mental health. Second, using Japan as a case for comparison with the US, we will situate the biomedical model in cross-cultural perspective, examining how pathologies are culturally constructed and dealt with, and addressing such questions as what it means to be mentally ill; what are the differences between Japanese and Western approaches to health, healing, and the mind-body relationship; and the role of religion in concepts of health and healing. Third, this course will also explore global mental health issues, the collision of cross-cultural mental health models, and humanitarian psychosocial programs for populations affected by trauma. This course offers both theoretical and engaged practice-oriented approaches.",
    "course_description": "Focuses on cultural approaches to mental health and illness.",
    "prerequisites": null,
    "instructors": "Chikako Ozawa-de Silva - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in Tarbutton Hall 218",
    "course_resources": null,
    "sections": "Class Nbr: 2612, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 1-2:15p, Instructor: Ozawa-de Silva/Chang, Status: Open",
    "date_accessed": "2024-03-30"
}