{
    "course_code": "ANT 285W",
    "course_title": "Anthropology: Special Topics: Engaging the Visual",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "Continuing Writing Requirement",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "Engaging the Visual: Photos, Videos, and Memes\nThe visual is vital to how each of us makes sense of the world around us and online. Engaging the Visual offers tools to think critically about photography, film, art, theatre, memes, material objects, as well as collective cultural practices. Using the still photograph as a launching point and prioritizing aspects of culture that are made to be seen, this course introduces students to forms of `visual literacy' - the ability to think as analytically about images as one does about text by focusing on how visual media is created, circulated, and consumed. Central to this course are student-driven 'visual experiments' informed by anthropological and interdisciplinary theory, methods, and concrete examples. Assignments and class discussion open avenues for students to engage media and the visual world in relation to their own experiences as well as issues of identity, race, gender, globalization, and development.",
    "course_description": "Seminar or lecture series on topics of anthropological interest at an intermediate level. Maybe repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Aubrey Graham - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in MODERN LANGUAGE_128",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 5851, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: A. Graham, Status: Wait List",
    "date_accessed": "2024-03-30"
}