{
    "course_code": "ANT 351W",
    "course_title": "Sustainable Dev:Anthro Perspective",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 4Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "The field of sustainable development engages some of the most pressing and challenging issues in the world today, including poverty and inequality, environmental threats, social justice, food insecurity and hunger. Sustainable development lies at the intersection of social, environmental, and political economic systems whether one works in the USA or elsewhere in the world. This course explores the field of sustainable development by examining different theories that underlie it, key areas of study, and major domains of application and intervention. While sustainable development covers a vast range of topics, the course will focus on themes of population growth, food supply, micro-credit, land reform and social justice movements. These issues will be explored against a background of growing poverty and inequality. The course encourages high levels of student participation and discussion and is writing intensive.",
    "course_description": "Anthropological perspectives on social change and economic development in the Third World today. Population growth, agricultural development, political instability, colonialism, imperialism, and urban problems in cultural context.",
    "prerequisites": null,
    "instructors": "David L Nugent - Primary Instructor",
    "schedule_location": "W 6pm-8:45pm in New Psyc Bldg 225 (36 Eagle Ro",
    "course_resources": null,
    "sections": "Class Nbr: 2614, Section #: 1, Type: LEC, Campus: ATL, Meets: W 6-8:45p, Instructor: D. Nugent, Status: Open",
    "date_accessed": "2024-03-30"
}