{
    "course_code": "ANT 585",
    "course_title": "Spec Tops: Anthropology: On Care and Its Limits",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 2 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Same as WGS 589 1)\nCourse Description:\nWhat constitutes care, particularly care for the body, is often demarcated by a tension between institutionally capacitated care, and projects of radical care that are located in spaces beyond these institutions. When medicine or the law or the state in its many guises falls short of provision of care, what and who emerges to meet these needs? How do these distinctive approaches to care sustain life, orient our relations to death, and frame our notions of a good life? As care structures our relationships to the self and to racial/sexual/and differently embodied others, how does it also generate our epistemological orientations and prescribe, restrict, or challenge knowledge making structures? And in the practice and theory of provisioning care for humans, how might care be recruited into a project of discerning between different forms of the human, and generating a boundary between the human and non-human? Drawing on an interdisciplinary literature that ranges from critical indigenous studies, anthropology, disability studies, to Black feminist theory, we explore the possibilities, limits, ethics, and practices through which care is harnessed for its worldmaking potential.",
    "course_description": null,
    "prerequisites": null,
    "instructors": "Sameena Mulla - Primary Instructor",
    "schedule_location": "M 1pm-3:45pm in Candler Library 125",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 4352, Section #: 3, Type: SEM, Campus: ATL, Meets: M 1-3:45p, Instructor: S. Mulla, Status: Closed",
    "date_accessed": "2024-03-30"
}