{
    "course_code": "ANT 562",
    "course_title": "Ethnographic Methods & Writing",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": null,
    "course_description": "This course explores methods of ethnographic fieldwork, proposal writing, and ethnographic write-up and representation in cultural anthropology.  The course is designed for first and second year graduate students in cultural anthropology who intend to conduct long-term ethnographic doctoral research in a field setting. The course construes \"methods\" as the professional skills associated with practically conducting and completing doctoral fieldwork, on the one hand, and issues of writing and representation before, during, and following fieldwork, on the other. This includes techniques and methods used to collect information in the field as well as the configuration and analysis of information for purposes of proposal writing, write-up, and various forms of media representation. The course considers pilot studies, proposal writing, full fieldwork, and subsequent write-up as stages of professional development that are integrally linked and yet in important ways disjoined or disjunctive in our lived experience as researchers.\nThe course draws heavily on the specific research agendas and field plans of the individual students taking the course.  Classes are structured in a seminar format that privileges engaged discussion, student presentation, and instructor analysis and commentary on student projects, both individually and collectively.  Reading includes highly selected classic and recent works concerning ethnographic methods, fieldwork experience, and ethnographic writing as well as successful field work funding proposals written in previous years by students and faculty.  Major attention is given to student proposal writing.  The course is not designed as a survey or literature review of available works concerrning field methods or ethnography.  The larger goal is rather to critically cultivate strategies whereby students can successfully implement and carry out their own doctoral field research projects.",
    "prerequisites": null,
    "instructors": "Sa'ed Atshan - Primary Instructor",
    "schedule_location": "M 4pm-7pm in Emerson Chemistry Bldg. E103",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2617, Section #: 1, Type: LEC, Campus: ATL, Meets: M 4-7p, Instructor: S. Atshan, Status: Closed",
    "date_accessed": "2024-03-30"
}