{
    "course_code": "ANT 497R",
    "course_title": "Undergraduate Research",
    "credit_hours": "1-4",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": null,
    "course_description": "Consultation with faculty prior to registration required.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 5625, Section #: 1, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: C. Quave, Status: Open\nClass Nbr: 6383, Section #: 10, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: E. Lonsdorf, Status: Open\nClass Nbr: 6415, Section #: 11, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: R. Paul, Status: Open\nClass Nbr: 6424, Section #: 12, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: P. Little, Status: Open\nClass Nbr: 6427, Section #: 13, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: S. Atshan, Status: Open\nClass Nbr: 5818, Section #: 2, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Lindo, Status: Open\nClass Nbr: 5908, Section #: 3, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Rilling, Status: Open\nClass Nbr: 6254, Section #: 4, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: D. Stout, Status: Open\nClass Nbr: 6255, Section #: 5, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: C. Hadley, Status: Open\nClass Nbr: 6288, Section #: 6, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: K. Phillips, Status: Open\nClass Nbr: 6289, Section #: 7, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Ham, Status: Open\nClass Nbr: 6314, Section #: 8, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: M. Benitez, Status: Open\nClass Nbr: 6315, Section #: 9, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: A. DeNicola, Status: Open",
    "date_accessed": "2024-03-30"
}