{
    "course_code": "ANT 500",
    "course_title": "Proseminar in Anthropology",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 4",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": null,
    "course_description": "Anthropology 500 provides a graduate introduction to the field of Anthropology, especially as practiced here at Emory University.  We begin with a brief introduction to some of the debates and issues surrounding the analytical scope, theories, and methods of the field of Anthropology.The bulk of the semester will be spent exploring how these wide ranging approaches to Anthropology, epistemology, methodology, theory, and inter-disciplinarity are reflected, translated, and applied in Anthropological research. These engagements with Anthropological scholarship will be enacted in several forms: (1) a pro-seminar, in which various faculty members of the Emory Anthropology Department visit the class to present and discuss their \"sub-field\" of anthropology and their own scholarly research; (2) weekly précis papers summarizing a selected text from the assigned readings; (3) individual research projects (annotated bibliographies as well as a more integrative \"review essay\") engaging a range of theories and methodological approaches within their chosen area of scholarship. Students are also strongly encouraged to attend scholarly presentations sponsored within the department as well as related campus talks, seminars and workshops as they arise over the course of the semester. In sum, the course engages new members of the field in ongoing conversations and debates about the big questions, competing perspectives, and telling insights of anthropology.\nParticulars: Only students registered in the Anthropology PhD program may enroll. All enrollments are processed through Anthropology.",
    "prerequisites": null,
    "instructors": "Elizabeth Lonsdorf - Primary Instructor",
    "schedule_location": "W 10am-1pm in Anthropology Building 108",
    "course_resources": null,
    "sections": "Class Nbr: 2615, Section #: 1, Type: SEM, Campus: ATL, Meets: W 10a-1p, Instructor: E. Lonsdorf, Status: Open",
    "date_accessed": "2024-03-30"
}