{
    "course_code": "HISP 720",
    "course_title": "Topics in Imperial & Post/Colonial Culture: Intro to Latin American Cinema",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 5",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as HIST 585 6) Introduction to Latin American Cinema\n \nThis introductory, graduate-level course on Latin American cinema familiarizes students with the three fundamental areas of expertise that shape scholarship in the field: 1) the techniques of filmic analysis; 2) film theory; and 3) the history of film production in the region from the silent period through contemporary cinema. This overview will both consider Latin America's filmic production as a triangulated phenomenon with respect to production in the US and Europe, as well as interrogate its national and regional implications. Students will produce 2 written papers, article summaries, and an oral presentation. The course will be conducted in Spanish, but upon consulting with the professor, students may intervene and write their assignments in English.\n \nDepartmentConsent Required. Please reach out to Rosana Philips (rsphil2@emory.edu )",
    "course_description": "This course will focus on \"empire, colonialism & post-coloniality.\" Under this rubric, we will design and teach seminars that explore the discursive construction of empire/colony and postindependence nation-states, as well as how the Hispanic world has participated in and generated discussions about the relationship between coloniality and modernity, with particular emphasis on how those discussions have emerged at different times and in various places, along with their past and present impact.",
    "prerequisites": null,
    "instructors": "Mónica García Blizzard - Primary Instructor",
    "schedule_location": "T 2:40pm-5:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 1867, Section #: 1, Type: LEC, Campus: ATL, Meets: T 2:40-5:35p, Instructor: M. García Blizzard, Status: Open",
    "date_accessed": "2024-03-30"
}