{
    "course_code": "IDS 190",
    "course_title": "Fresh Sem: IDS: The Power of Storytelling",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 19 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Freshmen Seminar - Limited to First Year Students Only)\n\n\nHuman beings are storytellers -- whether of great myths and legends, heart wrenching dramas or heartwarming comedies, we all tell stories all the time. Stories connect us, transform us, and allow us to express our deepest understanding of ourselves and the world we live in.  In this seminar, we will explore the world of stories -- stories we tell about ourselves, stories we listen to told by the people around us, and stories we are surrounded by in our culture -- novels, movies and even tweets. Through scholarly reading and group research projects, we will learn what stories are and what they mean, how stories bring people together and tear them apart, and how we can all become more effective communicators by learning to tell our story.  \nAs part of the first-year flourishing seminar program, this course will require three out-of-class meetings on the following dates and times: September 21, 6 - 7:15 pm; October 26, 6 - 8 pm; November 2, 6 - 8 pm.",
    "course_description": "Variable topics using interdisciplinary approaches from the humanities and social sciences. Topics represent current interests of the instructor.",
    "prerequisites": null,
    "instructors": "Robyn Fivush - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in Callaway Center S420",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 4115, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 1-2:15p, Instructor: Fivush/Loudermilk, Status: Closed",
    "date_accessed": "2024-03-30"
}