{
    "course_code": "IDS 200W",
    "course_title": "Interdisciplinary Foundations",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 22 / Seats Avail: 9",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "IDS 200W in fall 2022 will be co-taught by Professor Lisa Dillman, 2022-23 Interdisciplinary Faculty Fellow in the Institute for the Liberal Arts (ILA), and Professor Peter W. Wakefield, ILA. In this collaborative class, based in the humanities, we will examine human identity, as it relates to body, mind, migration, gender and race. Works to be studied will span ancient intellectual traditions and consider contemporary issues with a focus on the Americas. Texts may include Sophocles' Antigone, Plato's Apology, Patricia Engel's Vida, Yuri Herrera's Signs Preceding the End of the World, F. Scott Fitzgerald's The Great Gatsby, Toni Morrison's The Bluest Eye, and Eduardo Halfon's Monastery.\nWe will examine the life of the mind and the body's experience thereof: what abstract dimensions of human existence such as intellect, dignity, and love shape identity? How do concrete realities, including one's experience of race, gender, migration and religion, alter or nuance identity? Does identity influence or determine our understanding of the world? The unique methods of the humanities within university education will be considered as we examine these questions and works.",
    "course_description": "IDS 200 examines the origins and development of distinct disciplines in contemporary universities through the lens of what counts as evidence in different fields of human knowledge.",
    "prerequisites": "ENGRD 223 or equivalent transfer credit as co-requisite.",
    "instructors": "Lisa Dillman - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Callaway Center S420",
    "course_resources": null,
    "sections": "Class Nbr: 1492, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: Wakefield/Dillman, Status: Open",
    "date_accessed": "2024-03-30"
}