{
    "course_code": "IDS 290R",
    "course_title": "Interdisciplinary Sidecar: Reading for Pleasure",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "In a typical college schedule filled with mandatory assignments, reading for pleasure 'diving into another world simply for the joy of it' can fall by the wayside. This course helps you to carve out time for literary fiction picked by your peers. Our undergraduate TAs will each choose books for the class to vote on and will lead a class discussion on the selected books. The first class will be held on September 9, and we will meet for a total of 10 weeks over the course of the semester. Our class format will vary; in addition to the three sessions devoted to group discussion of the books we're reading, we'll have three sessions in which students and faculty briefly present favorite books, while\nanother three will entail more creative endeavors, such as a bookmaking workshop, a visit to the Rose Library's collection of handmade books, or a book or poetry reading. For the last class of the semester, we will celebrate our love of the literary 'and the ways it enhances our connection to others and ourselves' over dinner together. Some sessions may take place outside the scheduled class time.",
    "course_description": "A side-car course brings together a subset of students from two courses that overlap in methodologies, topics, etc., to create a short interdisciplinary course that runs simultaneously with its two sponsoring courses. One credit, S/U only. Schedule and format arranged by sponsoring professors.",
    "prerequisites": null,
    "instructors": "Cynthia Blakeley - Primary Instructor",
    "schedule_location": "F 1pm-2:15pm in Callaway Center S420",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 5651, Section #: 1, Type: SEM, Campus: ATL, Meets: F 1-2:15p, Instructor: Team, Status: Closed",
    "date_accessed": "2024-03-30"
}