{
    "course_code": "IDS 290R",
    "course_title": "Interdisciplinary Sidecar: Miyazaki and Fascism",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 4",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "One theme of the films of Hayao Miyazaki is the tension of individual autonomy and the authoritarian state, and three films address modern fascism directly. The protagonist of Porco Rosso (1992) resists the efforts of the Italian fascists to force him to rejoin the Air Force. Famously he says he'd rather be a pig than a fascist. In Howls' Moving Castle (2004), again the state pressures Howl to fight, despite their jingoistic propaganda and the fundamental absurdity of the war. The Wind Rises (2013) tells the story of Jiro Horikoshi, an airplane engineer who dreams only of the beauty of flight but is also designing the Japanese air force's fighter plane. He visits Germany and sees signs of political violence; In Japan, he meets a German Jewish exile called Castorp who criticizes the Nazis. When taken together with Studio Ghibli's Grave of the Fireflies (1988), this film provoked accusations of a politically problematic victim's history.  We will analyze the memories of fascism, militarism, and totalitarianism in Miyazaki's films, and contextualize them within the different cinematic memory cultures that have arisen in the wake of the Second World War in Japan and Germany. Drawing on discussions surrounding German postwar Vergangenheitsbewältigung (working through the past) and its relation to Japanese memory culture, we will consider how Miyazaki's films approach the questions of collective guilt, victimhood, trauma, and the persistence of hypernationalism globally.",
    "course_description": "A side-car course brings together a subset of students from two courses that overlap in methodologies, topics, etc., to create a short interdisciplinary course that runs simultaneously with its two sponsoring courses. One credit, S/U only. Schedule and format arranged by sponsoring professors.",
    "prerequisites": null,
    "instructors": "Paul Buchholz - Primary Instructor",
    "schedule_location": "Th 1pm-1:50pm in Math & Science Center - W307C",
    "course_resources": null,
    "sections": "Class Nbr: 5739, Section #: 4, Type: SEM, Campus: ATL, Meets: Th 1-1:50p, Instructor: Team, Status: Open",
    "date_accessed": "2024-03-30"
}