{
    "course_code": "IDS 385W",
    "course_title": "Special Topics",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 9 / Seats Avail: 4",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Continuing Writing Requirement",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Same as RUSS 375W 1, AMST 385W 1)\nAtlas description:\nWith strong contrasts in political and class structures, economies, and geographies, Russia and America were fundamentally affected by the experiences of slavery. Was there, as scholars frequently claim, a tangible cross-pollination between the emerging Russian self-consciousness in the nineteenth century and African American writing? How significant was it that, in contrast to the emphasis on rationality in the philosophical discourse of Western Europe, both the Russian intelligentsia and educated African American writers embraced the concept of ?soul??  Did Russian writers share the themes of self-reliance, civil disobedience and nonviolent resistance so characteristic of American transcendentalists? Through a close examination of fictional short stories and philosophical essays of American, African American and Russian writers in the 19th century, this course will address the emerging emphasis on citizenship ? its calling, changing content, and ensuing responsibility.\nRequired work: short writing assignments, blog posts, 7-page midterm, 15-page final, participation and attendance.",
    "course_description": "Highly focused courses, drawing on multiple disciplines of the humanities and social sciences; may be repeated for credit when topics vary.",
    "prerequisites": null,
    "instructors": "Elena Glazov-Corrigan - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in Modern Language 201",
    "course_resources": null,
    "sections": "Class Nbr: 4370, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 10-11:15a, Instructor: Wakefield/Glazov-Corrigan, Status: Open",
    "date_accessed": "2024-03-30"
}