{
    "course_code": "IDS 290R",
    "course_title": "Interdisciplinary Sidecar: Social Justice through Art",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "Title: Exploring Social Justice through Art \nPoetry is not a luxury. It is a vital necessity for our existence. It forms the quality of light from which we predicate our hopes and dreams toward survival and change, first into language, then into idea, then into more tangible action.\nAudre Lorde, Sister Outsider: Essays and Speeches. Trumansburg, NY: Crossing Press, ©1984.  \n This field-trip based course will explore the links between art and social justice in Atlanta. The deaths of Georgia residents Rayshard Brooks and Ahmaud Arbery are publicly known incidents that represent systemic cultural norms of racism.  They represent a fraction of hidden injustices that vulnerable populations face within the intersections of race, class, and sexuality. Atlanta has one of the highest rates of sex trafficking in the nation. Exploited migrant workers labor in Georgia's fields. Many of Georgia's residents are invisible. Many are hungry. Their stories would be untold without art.   \n Audre Lorde's statement \"poetry is not a luxury\" extends to additional art forms we will explore in this class. Students will visit places and organizations that delve into social justice through art such as: The Krog Street Tunnel, The Komansé Dance Theater, The Hammonds House, Living Walls, the City Speaks, Art on the Beltline, Dope Coffee, 7 Stages Theatre, and The Highlander School. \nWe will poll students to determine our meeting dates at the beginning of the semester.",
    "course_description": "A side-car course brings together a subset of students from two courses that overlap in methodologies, topics, etc., to create a short interdisciplinary course that runs simultaneously with its two sponsoring courses. One credit, S/U only. Schedule and format arranged by sponsoring professors.",
    "prerequisites": null,
    "instructors": "Nikki Graves - Primary Instructor",
    "schedule_location": "F 2:30pm-5:30pm in Callaway Center S102",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 6105, Section #: 6, Type: SEM, Campus: ATL, Meets: F 2:30-5:30p, Instructor: Team, Status: Closed",
    "date_accessed": "2024-03-30"
}