{
    "course_code": "LING 303",
    "course_title": "Phonetics: The Sounds of Spanish",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 4",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Intercultural Communication(*)",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Same as SPAN 303-1\n\n\nThis course, taught in Spanish, focuses on the linguistic study of the diverse pronunciations of Spanish. It explores how sounds are produced (articulatory phonetics), how they are organized in Spanish (phonology), and how these compare and contrast with typical pronunciations of English. The course also considers how speakers use the sounds of Spanish to perform and interpret regional/social identities and roles in communitive interactions within Spanish-speaking communities of Latin America, the US, and Spain.\n\n\nTEXT:Tuten, D. N., Tejedo-Herrero, L. F., R. Rao, & H. R. Clarke. 2022. Pronunciaciones del espanol(Routledge).PARTICULARS: This course is designed for a wide variety of students, including those for whom Spanish is a primary or heritage language as well as for those who are learning Spanish as a second language. This is an introductory course in Hispanic Linguistics and therefore no background in Linguistics is required. Span/Ling 303 is a core course for the Spanish and Linguistics Joint Major and a Foundational Course for the Spanish Major and Minor.\n\n\nEVALUATION is based on attendance/participation, homework assignments, exams, and dialect exploration projects.\nPREREQUISITE: SPAN 212 or an Official Spanish Placement into our Foundational Course level (Span 300-318). Take the online Spanish Placement Exam at http://spanport.emory.edu/home/undergraduate/placement/index.html. For more information on Foundational Courses, please go to www.spanport.emory.edu)",
    "course_description": "Foundational course for the major and the minor that focuses on the description and production of the sounds of Spanish while also introducing students to the study of linguistic variation.",
    "prerequisites": null,
    "instructors": "Donald Tuten - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in Math & Science Center - N301",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_LING_303_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 4658, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: D. Tuten, Status: Open",
    "date_accessed": "2023-10-31"
}