{
    "course_code": "LING 340",
    "course_title": "Topics in Sociolinguistics: African American Language",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 3Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "HSC w/Race & Ethnicity Req.",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(Same as ANT 340 1 and AAS 385 8)\n\n\nAfrican American Language (AAL) is by far the most researched, the most publicly recognized, and most controversial language variety in the United States. AAL has long been a central object of study in North American sociolinguistics, where researchers have investigated its structure, its origins, and its current trajectories of change relative to Mainstream American English, and have simultaneously sought to combat misunderstandings about AAL (and all language differences) held by the public and the press. This course will be broken into four major sections: 1) Present-Day Features of AAL, with a focus on its vocabulary (lexicon), pronunciation features (phonetics and phonology) and grammar (morphology and syntax); 2) The History of AAL and its ongoing trajectory of change, focusing on earlier examples of AAL, its possible origins and whether or not AAL is diverging from Mainstream American English (MAE) and other varieties of English; 3) AAL as a Living Art will discuss AAL as it is employed as an expression of art by writers, musicians, as well as its use in African American speech events, and avenues for outreach; 4) AAL, Education and Society will examine issues related to AAL and education, the justice system, linguistic profiling and discrimination in other areas of society such as housing and employment.",
    "course_description": "This course studies relations between language and society, relations between language and sociocultural context. Topics may include: language variation; multilingualism; verbal interaction; discourse analysis; ethnography of communication; sociolinguistics of Spanish.",
    "prerequisites": null,
    "instructors": "Erica Britt - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in Modern Language 201",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_LING_340_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2049, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 1-2:15p, Instructor: E. Britt, Status: Open",
    "date_accessed": "2024-03-30"
}