{
    "course_code": "LING 385",
    "course_title": "Special Topics in Linguistics: Teach. Methodology Eng. Lang.",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 3",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(Complete Title: Teaching Methodology for English Language Learners)\nStudents will discuss texts and teaching materials, as well as observe classes designated for English Language Learners (ELLs), to acquire knowledge about the English language learning process and associated pedagogy. Various teaching techniques will be modelled during class sessions.\nObjectives/Learning Outcomes: Through this directed study, the student will be able to: (1) Explain the first and second language acquisition process. (2) Develop knowledge of multiple instructional methods, techniques, styles, and strategies for teaching ELL students. (3) Understand and recognize ELL students in terms of their background, learning styles, and language competence.",
    "course_description": "Investigation of a particular issue or topic in the study of language, linguistics, and communication. May be repeated when topic varies. Topics may include: the Romance languages; intercultural communication; words and the world; language and human nature.",
    "prerequisites": null,
    "instructors": "Jane O'Connor - Primary Instructor",
    "schedule_location": "F 11:30am-12:45pm in Modern Language 201",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_LING_385_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 4010, Section #: 1, Type: LEC, Campus: ATL, Meets: F 11:30a-12:45p, Instructor: J. O'Connor, Status: Open",
    "date_accessed": "2024-03-30"
}