{
    "course_code": "WGS 285",
    "course_title": "Variable Topics in Women, Gender & Sexuality Studies: Gender/Sex: Imperial Europe",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 6 / Seats Avail: 4Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Same as HIST 285 1)\n(This course will examine changes to the social, political, and legal constructions of gender and sexuality in modern Europe between 1789 and the present. This course approaches Europe through an imperial lens; therefore, this course will foreground the relationship between ideas of gender and sexuality in Europe and the overseas territories claimed by various European states. We will start from an understanding of gender and sexuality as historically contingent concepts which takes on meanings specific to a given time and place. Throughout the semester, we will focus on how articulations of gender and sexuality have evolved in response to historical events and interrogate the significance of these shifts. How does analyzing major events in modern European history through the lens of gender inform the actors and forces which actors we consider to be the key drivers of change or of stasis? How have the meanings of gender and sexuality been shaped by the interactions between metropole and colonies? How does looking to the past change the way we think about the social and political significance of gender today? Throughout, we will see evidence of the many ways in which European histories are necessarily imperial histories' the history of gender therefore played out at the intersection of events in Europe and in the overseas territories of empire.)",
    "course_description": "Offerings vary each semester.",
    "prerequisites": null,
    "instructors": "Olivia Cocking - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in Candler Library 122",
    "course_resources": null,
    "sections": "Class Nbr: 3806, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 10-11:15a, Instructor: O. Cocking, Status: Open",
    "date_accessed": "2024-03-30"
}