{
    "course_code": "WGS 285W",
    "course_title": "Variable Topics in Women, Gender & Sexuality Studies: Feminist Science Studies",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "\"Science\" and \"feminism\" are not terms that go together very easily. Stemming from the Enlightenment, science has historically placed high value on what is seemingly apolitical - objectivity, neutrality, and reproducibility - values that appear in deep tension with feminism as a radically politicized way of understanding the world. This course offers an introduction to the major histories, debates, and questions that constitute the field situated at this tense nexus. In it, we will read key texts to map the interdisciplinary formation and methodologies of feminist science studies. We will discuss science's relationships to gender, race, class, and nationality; body politics; how nature and culture have been gendered as feminine and masculine; the relationship between self and other in global dis/ease; questions of reproduction, replication, and cloning; politics of the laboratory; violence inherent in disembodied, vision-centric forms of knowledge production; and the future of feminist science itself. Students will become familiar with important figures and case studies such as Sarah Baartman, the \"Venus Hottentot\" , and Henrietta Lacks of the HeLa cell line; analyze how power, identity, and politics shape the development of scientific knowledge; and evaluate how important events in biology, neuroscience, physics, and medicine produce gendered and racialized effects. The course emphasizes reading, discussion, and peer-review workshops, culminating in a final research paper.",
    "course_description": "Offerings vary each semester.",
    "prerequisites": null,
    "instructors": "Mitchell Murtagh - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in Anthropology Building 107",
    "course_resources": null,
    "sections": "Class Nbr: 2917, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 10-11:15a, Instructor: M. Murtagh, Status: Open",
    "date_accessed": "2024-03-30"
}