{
    "course_code": "WGS 385W",
    "course_title": "Spec Topics: Women, Gender, & Sexuality Studies: Phil. of Reproductive Justice",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "In June 2022, the U.S. Supreme Court overturned Roe v. Wade, the landmark decision that affirmed the constitutional right to abortion. In the aftermath, many took to social media to insist that if women no longer had a constitutional right to abortion, the ethical response from men should be vasectomy. Others emphatically resisted, drawing attention to the history of mandatory and involuntary sterilization of Black and Indigenous, poor, and developmentally disabled people in the U.S. In the spirit of this resistance, this course thinks through ways of calling for contraception and pregnancy prevention that do not invoke eugenics and that insist on full bodily autonomy for all. We will begin by drawing a distinction between reproductive rights and reproductive justice. Revolutionary rather than reformist, reproductive justice refuses a single-issue framework. Paying close attention to discourses of life, sex, and reproduction with a feminist and anti-racist lens, we will contextualize the historical and philosophical conditions in which different bodies have become sites of engineering, or \"living technologies.\" Discussions will involve birth control, eugenics, and forced sterilization, in addition to access, safety, and self-advocacy regarding domestic violence assistance, comprehensive sex education, intersex justice, and trans-affirming healthcare. This course emphasizes reading, discussion, and peer-reviewed writing assignments, culminating in a final research paper.",
    "course_description": "Offerings vary each semester.",
    "prerequisites": null,
    "instructors": "Mitchell Murtagh - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in Candler Library 123",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2927, Section #: 2, Type: SEM, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: M. Murtagh, Status: Wait List",
    "date_accessed": "2024-03-30"
}