{
    "course_code": "WGS 312",
    "course_title": "User's Guide to Freud",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "Penis envy? Castration? Narcissism? Super-Ego? Repression? What do all these Freudian terms mean, and what is their relevance for everyday life? The aim of this course is two-fold: (i) to introduce students to the core concepts of psychoanalysis, and (ii) to relate these to feminist theories of gender and sexuality. The course will introduce students to the central theoretical concepts in Freud's metapsychology: instincts, repression, the ego, the unconscious, dream interpretation, the symptom. In the final weeks of the course, we will survey some contemporary feminist, cultural, global responses to psychoanalysis. It is expected that this course will be of value to students in a wide variety of humanities and social science majors where psychological issues, gender, and sexuality are discussed.\n\n\nThis class fulfills the 300 level WGSS major and minor requirement. If you are a WGS student who need a seat, please email Clare Sterling at ecsterl@emory.edu for a permission number.",
    "course_description": "The aim of this course is two-fold: (i) to introduce students to the core concepts of Freudian psychoanalysis, and (ii) to relate these to feminist theories of gender and sexuality.",
    "prerequisites": null,
    "instructors": "Elizabeth Wilson - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in Emerson Chemistry Bldg. E363",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2924, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 10-11:15a, Instructor: E. Wilson, Status: Wait List",
    "date_accessed": "2024-03-30"
}