{
    "course_code": "WGS 385",
    "course_title": "Spec Topics: Women, Gender, & Sexuality Studies: Manhood in the Middle Ages",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Same as HIST 385 1)\n(Rioting university students. Knights. Artisans. Merchants. Pirates. Priests. Peasants and enslaved men. Medieval society was far from homogenous: it was Christian, Muslim, and Jewish; it was elite, bourgeois, lower class, and enslaved, secular and religious, rural and urban, learned and non-literate. This course explores the spectrum of masculinity in medieval society by looking at profession, education, social status, ethnicity, race, and religious identity. How is it that celibacy and spiritual prowess marked the clergy as masculine and men who engaged in too much sex as feminine? We will also consider the roles of religious minorities in Christian societies and how contact with Islam in the Crusades affected the gender identity of men in European society. In addition, we will study how Christian ideas about the proper gender roles for men and women intersected with religious ideas about men's sexuality and consider how gender difference in the Middle Ages produced gender inequality. Although the stereotypical images of knights and ladies gives the impression that medieval society was strictly heterosexual, the image of the Don Juan and the aggressive masculinity of warriors must be viewed against the spaces for deep friendships among men, queer desire, and men who lived as women. Please note that topics such as physical brutality, sexual violence (including gang rape), enslavement and human-trafficking, and same-sex relationships will be part of our class discussion.)",
    "course_description": "Offerings vary each semester.",
    "prerequisites": null,
    "instructors": "Michelle Armstrong-Partida - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Rich Building 108",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3813, Section #: 2, Type: SEM, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: M. Armstrong-Partida, Status: Closed",
    "date_accessed": "2024-03-30"
}