{
    "course_code": "WGS 385",
    "course_title": "Spec Topics: Women, Gender, & Sexuality Studies: The Sexual Politics of Hate",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 2Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "In recent years the intractable nature of hatred has charged into the forefront of our cultural consciousness through racist and misogynistic acts of mass violence, transphobic laws, the popularization and intensification of white supremacist/misogynist protests and online spaces, and intense forms of anti-woman and anti-Black backlash in politics and culture. This applied humanities WGSS undergraduate course takes sexuality as its starting point and engages with and in public scholarship to expose the roots of and, importantly, respond to various forms of identity-based hatred, such as misogyny, sexism, racism, homophobia, transphobia, and classism. The course begins by introducing the critical theoretical frameworks necessary to ground a public scholarship approach by reading canonical feminist and anti-racist texts as well as material that closely examine the social/emotional workings of identity-based hatred. Materials include but are not limited academic texts, public speeches, opinion pieces, albums, documentaries, and investigative journalism. Throughout, students will engage in both individual and collectivized forms of public scholarship through a variety of assignments, culminating in a collaborative group project in which they will chose to make a zine, a podcast, or a longer YouTube video. Together we will think critically about the nature of hate and how public scholarship can be used to effectively respond to and neutralize hate in the public sphere.",
    "course_description": "Offerings vary each semester.",
    "prerequisites": null,
    "instructors": "Samantha Wrisley - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Woodruff Library 875",
    "course_resources": null,
    "sections": "Class Nbr: 2925, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 1-2:15p, Instructor: S. Wrisley, Status: Open",
    "date_accessed": "2024-03-30"
}