{
    "course_code": "WGS 485R",
    "course_title": "Internship In Women, Gender, & Sexuality Studies: Camp Media",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 5Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "Same as FILM 485 2\nThe term \"camp\" has developed complex connotations in relation to contemporary media, often used in popular press both as a derogatory synonym for \"unserious\" and as an ill-defined superlative to elevate \"subversive\" queer-themed content. This course, however, will trace the evolutions of camp coding in film and television through a variety of aesthetic, narrative, and ideological iterations, and we will critically assess its valuation and affective significance for numerous lesbian, gay, bisexual, transgender, and queer (LGBTQ+) audiences. Through a diverse selection of exercises, students will grapple with the slippery nature of camp iconography, identification, and authorship via film media studies methodologies including formal, press discourse, genre, production, and reception analyses. This seminar will be centered around workshopping and revision processes, culminating with either an oral history about camp television's queer influence or a primary-source based research project on a camp-oriented text.",
    "course_description": "Offers students the opportunity to learn across boundaries by combining a weekly seminar with hands-on work experience in a variety of possible organizations dealing with gender issues in such areas as law, politics, health care, labor, environment, family, and sexuality.",
    "prerequisites": null,
    "instructors": "Ben Kruger-Robbins - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Rich Building 103\nW 7:30pm-10pm in White Hall 208",
    "course_resources": null,
    "sections": "Class Nbr: 6417, Section #: 1, Type: DIS, Campus: ATL, Meets: MW 1-2:15p; W 7:30-10p, Instructor: B. Kruger-Robbins, Status: Open",
    "date_accessed": "2024-03-30"
}