{
    "course_code": "GH 536",
    "course_title": "Religion & Health in Context: HiV",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Closed",
    "instruction_method": "Distance Learning",
    "typically_offered": "Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-01-11 through 2021-01-24",
    "class_notes": "Course will meet Jan 11, 12, 13, 14, 15, 16 from 9:00 am - 4:00 pm.",
    "course_description": "This course will explore the ways in which religion has been utilized over the last twenty-five years to make sense of the HIV epidemic and to mobilize or hinder productive responses. These processes of making meaning and responding have occurred in a variety of contexts; the course will critically explore a broad spectrum of religious, political, and public health contexts to demonstrate the ways in which religion is invoked in response to questions and practices of health and wellness. The readings for the course are designed to introduce the class topic and students are expected to complete assigned readings prior to class. In many instances, class time will include lecture and discussion of readings but at other times, the class sessions will function to develop ideas introduced in the readings more fully. In other words, students should not expect the class sessions merely to fully summarize assigned readings. Written assignments are designed to test not only students' knowledge of the material but also their ability to integrate that knowledge with critical reflection on both theory and practice.",
    "prerequisites": null,
    "instructors": "John Blevins - Primary Instructor",
    "schedule_location": "MTWThFSaSu 9am-4pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 4568, Section #: 1, Type: LEC, Campus: ATL, Meets: MTWThFSaSu 9a-4p, Instructor: J. Blevins, Status: Closed",
    "date_accessed": "2024-03-30"
}