{
    "course_code": "ST 652",
    "course_title": "Global Feminist Theologies",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 0 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-08-08 through 2022-08-23",
    "class_notes": "(AUGUST TERM ENROLLMENT ENDED JULY 15) (ON CAMPUS)",
    "course_description": "This course introduces students to global Christian feminist theology through an indepth study of feminist/women's theological movements from different regions of the Global South and their respective theological movements in the US. We will address key theological concerns of these Global South feminist movements, in particular theological anthropology (e.g., women's identity, agency, and attitudes toward the body); the gendered nature of sin, suffering, and redemption; pneumatology and indigenous spiritual traditions. In addition, we will grapple with the major social and gender justice concerns of these feminist/women's movements, in particular, gender-based violence, sex trafficking, women's poverty, and sexist institutions and practices in the church and wider society. The class will explore these theological and ethical issues through various media: indigenous theological scholarship, liturgical resources, popular religious practices and sacred art, documentaries and in-class/Skype dialogues with guest theologians when possible. (Race, Ethnicity, and Gender)",
    "prerequisites": null,
    "instructors": "Joy McDougall - Primary Instructor",
    "schedule_location": "MTWThF 9am-1pm in Rita Anne Rollins Building_447",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 5145, Section #: 800, Type: SEM, Campus: ATL, Meets: MTWThF 9a-1p, Instructor: J. McDougall, Status: Closed",
    "date_accessed": "2024-03-30"
}