{
    "course_code": "PSYC 111",
    "course_title": "Intro To Psyc II",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 16Waitlist Total: 0, Auto-Enroll",
    "waitlist_total": ": 0, Auto-Enroll",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Social Sciences(*)",
    "permission": null,
    "dates": "2024-05-17 through 2024-06-26",
    "class_notes": "(Permits High School enrollment).  (There will be small group discussions. This second semester of introductory psychology will cover in broad brushstrokes the major areas of research design, social psychology, social and emotional development, personality measurement and theory, psychopathology, and therapeutic interventions. Emphasis will be on the empirical foundations of psychological knowledge, and on fostering students' scientific thinking about behavior. Particulars: There will be one primary textbook and supplemental readings. Participation in research projects or equivalent is required.)\n\n\nThis is an online course. Emory College Online summer courses have required synchronous/live sessions every week. Students must be available to sign into and virtually attend the course online during those times (noted as the course meeting times- all times listed are local to Atlanta). Each course will also involve significant asynchronous material that you access on your own time in addition to standard amounts of readings and course assignments. Students should plan to spend 15-20 hours/week on this course. Please also be aware that faculty will begin corresponding with students during Week Zero of the course (one week before the official start date of the course), and that some interaction with the course may be required at that time. Students should begin checking the Canvas course site regularly one week prior to the official start of the term.",
    "course_description": "Introduction to social behavior, development, and individual differences.",
    "prerequisites": "Students completing PSYC_OX 100 or equivalent cannot enroll in PSYC 111. For concerns, please contact the Psychology department.",
    "instructors": "Chaela Nutor - Primary Instructor",
    "schedule_location": "MWF 9:15am-10:15am in ONLINE",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_PSYC_111_1_A24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 1237, Section #: 1, Type: LEC, Campus: ATL, Meets: MWF 9:15-10:15a, Instructor: C. Nutor, Status: Open",
    "date_accessed": "2024-03-29"
}