{
    "course_code": "PSYC 799R",
    "course_title": "Doctoral Dissertation Research",
    "credit_hours": "1-12",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Varies by section",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2024-05-17 through 2024-08-07",
    "class_notes": "(S/U Only)\n\n\n(Permission Required Prior to Enrollment)",
    "course_description": null,
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 1732, Section #: 1, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: L. Nygaard, Status: Open\nClass Nbr: 1733, Section #: 10, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: P. Palmer, Status: Open\nClass Nbr: 1734, Section #: 11, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: E. Walker, Status: Open\nClass Nbr: 1735, Section #: 12, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Klin, Status: Open\nClass Nbr: 1736, Section #: 13, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: R. Hampton, Status: Open\nClass Nbr: 1737, Section #: 14, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: B. Wilson, Status: Open\nClass Nbr: 1738, Section #: 15, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: I. Waldman, Status: Open\nClass Nbr: 1739, Section #: 16, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Treadway, Status: Open\nClass Nbr: 1740, Section #: 17, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: S. Lourenco, Status: Open\nClass Nbr: 1741, Section #: 18, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: P. Rochat, Status: Open\nClass Nbr: 1742, Section #: 19, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: L. Craighead, Status: Open\nClass Nbr: 1743, Section #: 2, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Manns, Status: Open\nClass Nbr: This section is full 1949, Section #: 20, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. McKay, Status: Closed\nClass Nbr: 1744, Section #: 3, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Bachevalier, Status: Open\nClass Nbr: 1745, Section #: 4, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. Maney, Status: Open\nClass Nbr: 1746, Section #: 5, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: P. Bauer, Status: Open\nClass Nbr: 1747, Section #: 6, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Kelly, Status: Open\nClass Nbr: 1748, Section #: 7, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. McDowell, Status: Open\nClass Nbr: 1749, Section #: 8, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: S. Hamann, Status: Open\nClass Nbr: 1750, Section #: 9, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: P. Brennan, Status: Open",
    "date_accessed": "2024-03-29"
}