{
    "course_code": "ANT 285W",
    "course_title": "Anthropology: Special Topics: Gender Politics & Muslim World",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 4Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Spring",
    "requirement_designation": "Continuing Writing Requirement",
    "permission": null,
    "dates": "2023-06-26 through 2023-08-02",
    "class_notes": "We live in a time when headlines about the Taliban in Afghanistan, the Islamic Republic in Iran, and human rights transgressions in Muslim majority nations dominate representations of everyday life in the Muslim World. However, these representations often ignore the political roots propelling these transgressions, and the everyday forms of agency displayed by women and gender minorities in the Muslim world. Taking a multidisciplinary look at gender and cultural politics in the Muslim world, this course introduces students to contemporary scholarship on the politics of gender in Muslim majority nations and the lived experiences of ordinary Muslims though a lens of culture and social action. \nUsing ethnographic texts, films, and media from the Middle East, South and Southeast Asia regions, this course highlights social action, activism, and women and gender minorities' everyday engagements in the public sphere in the new millennium. In this course, students will explore how anthropologists have approached the study of gender and politics in the Muslim world, and what we have learned from this scholarship about everyday Islam, piety, popular culture, and social justice. We will touch on a range of subjects including civil society movements in Indonesia, women's struggle for security and rights in urban Pakistan, Islamic feminism in Malaysia, and youth cultures in the Middle East.",
    "course_description": "Seminar or lecture series on topics of anthropological interest at an intermediate level. Maybe repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Sana Noon - Primary Instructor",
    "schedule_location": "TTh 1:15pm-2:45pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 1520, Section #: 2, Type: LEC, Campus: ATL, Meets: TTh 1:15-2:45p, Instructor: S. Noon, Status: Open",
    "date_accessed": "2024-03-30"
}