{
    "course_code": "EHS 799R",
    "course_title": "Dissertation Research",
    "credit_hours": "1-9",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Varies by section",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "EHS PhD students only",
    "course_description": "EHS doctoral students engage in research after entering candidacy; research must contribute to students' overall training and allow them to make progress in the program. Examples of typical student research activities include: writing a dissertation proposal, writing a dissertation chapter, or preparing a grant proposal.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2576, Section #: 1, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: B. Caruso, Status: Closed\nClass Nbr: 2577, Section #: 2, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. Barr, Status: Open\nClass Nbr: 2578, Section #: 3, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: T. CLASEN, Status: Open\nClass Nbr: This section is full 2579, Section #: 4, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Freeman, Status: Closed\nClass Nbr: This section is full 2580, Section #: 5, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Leon, Status: Closed\nClass Nbr: 2581, Section #: 6, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Y. Liu, Status: Open\nClass Nbr: This section is full 2582, Section #: 7, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: B. Lopman, Status: Closed\nClass Nbr: This section is full 2583, Section #: 8, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: C. Marsit, Status: Closed\nClass Nbr: 2584, Section #: 9, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: W. Caudle, Status: Open",
    "date_accessed": "2024-03-30"
}