{
    "course_code": "EHS 790R",
    "course_title": "Research Design and Management",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "EHS PhD students only. This class will have online and in-person components",
    "course_description": "Conducting high-impact science goes beyond data analysis and laboratory research. Early stage scientists need to identify research projects, design studies, conduct experiments, critically evaluate relevant literature, publish papers, and present their findings. They also need to be aware of how their research practices and conduct, and those of their peers, can impact the field. EHS 790 focuses on key skills that unify doctoral students and scientists across scientific disciplines. This course is designed to provide students with specific training at the nexus of scientific methods and practice, building skills that are fundamental to the scientific enterprise, which support the ethical and responsible conduct of science. The course will address the program competencies by training students in the range of skills needed to conduct research in the areas of exposure science, biological mechanisms of disease, and environmental determinants of population health. Importantly, we also envision that this class will serve as a key forum for EHS community-building. Our weekly meetings will allow us to interact with other EHS students and program faculty, exchange and develop new ideas in research and mentoring, and share relevant difficulties and opportunities encountered during your doctoral training. EHS 790 is required for all students during their pre-candidacy training, however, all doctoral students in the program are permitted and encouraged to attend.",
    "prerequisites": null,
    "instructors": "Stefanie Ebelt - Primary Instructor",
    "schedule_location": "M 9am-9:50am in Claudia Nance Rollins 6001",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2573, Section #: 1, Type: LEC, Campus: ATL, Meets: M 9-9:50a, Instructor: S. Ebelt, Status: Closed",
    "date_accessed": "2024-03-30"
}