{
    "course_code": "AAS 385",
    "course_title": "Topics in Afr American Studies: Black Culture and Capitalism",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 13Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(This course examines the theory of Black capitalism within a wide range of American contexts, varied by place and time. First, students are exposed to a tradition of radical scholarship that analyzes the intersections - or articulations - between racism and capitalism. We will explore some seminal texts by WEB DuBois, Manning Marable, and Cedrick Robinson, among others. Then students will also gain an understanding of how local economic development works to support or obstruct Black capitalism. Particular attention will be paid to how growth versus redistribution strategies impact Black communities. It will end by considering the intersection of race and class in struggles for economic and social justice - from Black celebrities to voters, to activists and politicians.)\n(This class is not for Freshmen students)",
    "course_description": "This course explores one of a wide range of topics pertaining to the African American experience in the fields of human and civil rights, social and literary texts, and the social sciences.",
    "prerequisites": null,
    "instructors": "Jessica Lynn Stewart - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in New Psyc Bldg 220 (36 Eagle Ro",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_AAS_385_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3182, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: J. Stewart, Status: Open",
    "date_accessed": "2023-10-30"
}