{
    "course_code": "AAS 385",
    "course_title": "Topics in Afr American Studies: African Amer.&Underground Econ",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 7Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "HAP w/Race & Ethnicity Req.",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(Complete Topic - African Americans and the Underground Economy)\n(This course delves into the reasons and repercussions of African Americans' participation in the informal economy. We will explore both historical and modern instances of employment discrimination faced by the Black community. Key theories on labor supply, wage determination, rational choice, and harm reduction will be discussed. No prior knowledge of economics is necessary. Students will hone their analytical abilities to evaluate the dynamics of the underground economy in various American cities. Emphasis will be placed on understanding personal implications, policy interventions, and media representations of the informal sector. Topics to be explored include the war on drugs, sex work, gun trafficking, unregulated labor, the legalization of marijuana, and the realm of organized crime.)\n(This class is not for Freshmen students)",
    "course_description": "This course explores one of a wide range of topics pertaining to the African American experience in the fields of human and civil rights, social and literary texts, and the social sciences.",
    "prerequisites": null,
    "instructors": "Jessica Lynn Stewart - Primary Instructor",
    "schedule_location": "MW 4pm-5:15pm in Candler Library 122",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_AAS_385_4_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3212, Section #: 4, Type: LEC, Campus: ATL, Meets: MW 4-5:15p, Instructor: J. Stewart, Status: Open",
    "date_accessed": "2023-10-30"
}