{
    "course_code": "AAS 710",
    "course_title": "Topics in Gender and Sexuality: Global Black Feminism",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 4 / Seats Avail: 2",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(Same as WGS 730R 1)\n\n\nThis course will examine the broad and interdisciplinary field of what scholars have called global Black feminism. At its core are the political struggles, theoretical interventions, and worldmaking possibilities that Black feminists have created in and for a variety of global contexts, particularly in the Global South. Focusing on the histories and legacies of colonialism and the transatlantic slave trade, this course will examine the ways in which feminist and queer thinkers of African descent have theorized, imagined, and innovated beyond the violent structures of western modernity. In so doing, the course will expand the contours of how we understand Black feminism, paying particular attention to the ways in which transnational, diasporic, and decolonial frameworks have produced critical, but often-understudied genealogies of Black feminist thought. Central to this polyglot field of study will be the study of feminist knowledge-making in a variety of global contexts; queer and trans theorizations of Black life; Black women's histories of radicalism and internationalism; and transnational activist critiques of gendered, racial, and sexual violence.",
    "course_description": "This course introduces students to critical readings in African American gender and sexuality studies.",
    "prerequisites": null,
    "instructors": "Aisha Finch - Primary Instructor",
    "schedule_location": "M 1pm-3:45pm in Candler Library 125",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_AAS_710_3_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 4555, Section #: 3, Type: SEM, Campus: ATL, Meets: M 1-3:45p, Instructor: A. Finch, Status: Open",
    "date_accessed": "2023-10-30"
}