{
    "course_code": "HISP 740",
    "course_title": "Topics in Texts and Culture: Memory Maps",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 6 / Seats Avail: 2",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "This seminar will explore the ramifications of Carlos Fuentes's injunction to \"remember the future, imagine the past\" by mapping the relationship between history and memory as configured in Hispanic texts of the 19th-21st century. In the context of cultural memory studies, and taking into account the evolving nature of historical inquiry (e.g., the shift from positivist to genealogical historical models, differing conceptions of what constitutes historical evidence, the replacement of History by microhistories), the course will examine the rewriting of contested pasts in Spain and Latin America through a variety of media: fiction and nonfiction narratives, films, memorial monuments and museums, digital platforms. In what ways do these texts, as alternative modes of knowing, legitimate or undermine a mythic vision of national history? What is the role of private and collective memory --an arena of symbolic-cultural display-- in contemporary \"memory wars\"? Theoretical readings address the politics of memory; nostalgia and mourning; forms and technologies of embodied and mediated memory; modernist and postmodern critiques of historical knowledge. Note: For HISP graduate students, this iteration of the course in Spring 2023 fulfills the program requirement for HISP 520. Primary texts in Spanish (English translations available); students from other programs may opt to write in English.",
    "course_description": "Prepare students for the study of the language, discourse and cultural production of the Hispanic world.",
    "prerequisites": null,
    "instructors": "Hazel Gold - Primary Instructor",
    "schedule_location": "T 10:30am-1:30pm in Callaway S501",
    "course_resources": null,
    "sections": "Class Nbr: 5606, Section #: 1, Type: LEC, Campus: ATL, Meets: T 10:30a-1:30p, Instructor: H. Gold, Status: Open",
    "date_accessed": "2024-03-30"
}