{
    "course_code": "ENVS 190",
    "course_title": "Fresh Sem:Environmentl Studies: Earth 2.0 Geospacial Insights",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 0 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First Year Seminar",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "In this class, students embark on a transformative journey across the vast expanse of our digitally represented planet. This course bridges the gap between ancient cartographic traditions and today's cutting-edge geospatial technologies, providing students with a comprehensive introduction to the tools, techniques, and trends shaping the future of digital exploration. Through this course, you will acquire a foundational grasp of geospatial data principles, study the cutting-edge tech in modern cartography like GIS and satellite imagery, understand its diverse applications from urban planning to conservation, and engage in projects that hone critical thinking and creativity through real-world challenges.",
    "course_description": "The topics for freshman seminars are variable and change every semester. Past offerings include Climate Change, Global Earth Systems, Interpreting Behavior That You Can't See, Ecological Economics, Plants, People and Places and Ecological Restoration.",
    "prerequisites": null,
    "instructors": "Xiao Huang - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in New Psyc Bldg 225 (36 Eagle Ro",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ENVS_190_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: This section is full 2509, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 10-11:15a, Instructor: X. Huang, Status: Closed",
    "date_accessed": "2024-03-28"
}