{
    "course_code": "ENVS 285",
    "course_title": "Special Topics: Climate Solutions Soc.Justice",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 25Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "ENVS 120 or ENVS 130 or ENVS 131 or ENVS_OX 131 or ENVS 140 or equivalent transfer credit as prerequisite.\nENVS 285: Climate Solutions and Social Justice - In this course, we will explore the latest climate change risks and impacts across different parts of the world as well as adaptation and mitigation strategies (projects, plans, and solutions) designed to address these risks. We would particularly focus on the equity and justice impacts of solar panels, wind turbines,  electric vehicles, floating cities, nature-based solutions, managed retreat, including policy and financial options such as catastrophic bonds, green bonds, resilience bonds, carbon taxes, etc. The central goal of this course is to prepare students to work in inter-disciplinary teams focused on designing, evaluating and/or implementing climate solutions with a social justice lens. Students will also learn how to engage frontline communities, public agencies, businesses, and NGOs in finding just and effective climate solutions.",
    "course_description": "A course designed for second year students on topics of interest in environmental sciences. This course may count as elective credit for the ENVS major and minor; relevant topics may count towards the ENVS Sustainability Sciences or Earth and Atmospheric Sciences minors. See current course atlas.",
    "prerequisites": null,
    "instructors": "Jola Ajibade - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Math & Science Center - W502",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ENVS_285_2_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3346, Section #: 2, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: J. Ajibade, Status: Open",
    "date_accessed": "2024-03-28"
}