{
    "course_code": "ENVS 485",
    "course_title": "Special Topics: Community Resilience-Disasters",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 10",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "ENVS 485/585: Community resilience in complex socio-ecological systems\n\n\nIn this course, students will engage in collaborative learning focusing on a variety of theoretical, empirical, and methodological approaches to resilience planning from a social science perspective. We will investigate what it means to be \"resilient\" - drawing on principles from human health, geography, urban studies, system science, political ecology, disaster studies, and sustainability science. We will draw on case studies from these disciplines to answer the question of resilience to what? And for whom, when, and how?  We will also explore how resilience is (or can be) built over time and space, and across scales. Overall, this course aims to train students to be effective members and/or leaders of interdisciplinary professional teams working to design, evaluate, and implement resilience plans, strategies, actions, and policies in collaboration with public agencies, businesses, and NGOs.",
    "course_description": "A course designed for advanced students on topics of interest in environmental sciences. This course may count as elective credit for the ENVS major and minor; relevant topics may count towards the ENVS Sustainability Sciences or Earth and Atmospheric Sciences minors. See current course atlas.",
    "prerequisites": null,
    "instructors": "Jola Ajibade - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in Math & Science Center - N301",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ENVS_485_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3348, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 1-2:15p, Instructor: J. Ajibade, Status: Open",
    "date_accessed": "2024-03-28"
}