{
    "course_code": "SR 698",
    "course_title": "Special Topics in Sociology of Religion: Religion in Urban Landscape",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 9",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(ONLINE:  synchronous live sessions Friday 9am-11:00am; remaining contact time fulfilled via online asynchronous engagement.)\n(As cities have often been loci of spiritual innovation, this course will examine the unique characteristics of spiritual communities embedded in urban contexts.  Our class will explore questions of 'urban religion' from two sides:  1.)  It will examine the manner in which spiritual communities contribute to and shape the life of the city.  2.)  It will examine the ways that urban realities influence spiritual communities.  As such, 'urban religion,' echoing Robert Orsi, will be framed as more than just religion which happens to be in the city, but rather as religion which is complexly intertwined with the realities of the modern cityscape.  Particular attention will be given to spiritual communities and practices that serve marginalized communities in the city.  Course material will primarily draw from the social sciences and will examine not only formal religious institutions, but also informal spiritual communities.  To that effect, we will employ a \"lived religion\" approach which privileges the voice of the everyday person above that of institutional authorities.)",
    "course_description": "Special topic or one-time offering courses led by Candler regular and visiting faculty. Prerequisites may be required and are noted on the course schedule when applicable.",
    "prerequisites": null,
    "instructors": "Jonathan Calvillo - Primary Instructor",
    "schedule_location": "F 9am-11am in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 5427, Section #: 1, Type: LEC, Campus: ATL, Meets: F 9-11a, Instructor: J. Calvillo, Status: Open",
    "date_accessed": "2024-03-30"
}