{
    "course_code": "HIST 100",
    "course_title": "Perspectives on the Past",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 10",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "This entry-level course introduces students to the academic study of History. How do historians discover and use evidence? How do they research past cultures? What is the relationship between the past and the present? Over the course of the semester, students will hear compelling lectures by a number of Emory History professors that will acquaint students with the many and varied approaches historians use to make sense of the past. The course explores the ways historians scrutinize evidence, use digital methods, analyze images, conduct oral histories, and use the tools of other disciplines to understand the past. Topics vary from the historical construction of race, the history of pandemics and the political uses of degenerate art and so much more! The lectures cover different world regions and time period; it constitutes an ideal introduction to the study of History at Emory.",
    "course_description": "This course introduces students to the academic study of History and the varied approaches historians use to make sense of the past. It explores the ways historians scrutinize evidence, use digital methods, analyze images, conduct oral history and borrow from other disciplines to study the past.",
    "prerequisites": null,
    "instructors": "Daniel LaChance - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in White Hall 112",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_HIST_100_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3296, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: D. LaChance, Status: Open",
    "date_accessed": "2024-03-28"
}