{
    "course_code": "HIST 207",
    "course_title": "Medieval Europe and the World",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 35 / Seats Avail: 35",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "Humanities and Arts with Race & Ethnicity(*)",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "This course is an introduction to the Middle Ages (500 to 1500 CE) and Europe's place in the world. It provides a survey of interactions with pagans (Germanic tribes and the Vikings) and the Byzantine, Islamic, and Mongol empires that shaped medieval society, particularly how medieval Europeans viewed the world and why they believed themselves to be religiously and culturally superior. Special attention will be given to the enslavement of people, the Muslim and Jewish communities living within medieval Europe, and European involvement in the Mediterranean through the crusades, conquest, and trade. The history of Muslim-Christian-Jewish relations in this region meant that contact facilitated the spread of ideas, food, technology, art, and architecture. We will read accounts of Christian merchants and missionaries who traveled throughout the Middle East, to the Mongol empire in Central Asia, to Africa and as far as the Indian Ocean. Other topics covered in the course include forced conversions, knightly culture during the Crusades, the power of queens and noblewomen to influence religious life, courtly culture, and to rule.",
    "course_description": "This course is an introduction to the Middle Ages (500 to 1500 CE) and Europe's place in the world. It provides a survey of interactions with pagans (Germanic tribes and the Vikings) and the Byzantine, Islamic, and Mongol empires that shaped medieval society.",
    "prerequisites": null,
    "instructors": "Michelle Armstrong-Partida - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Rich Building 108",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_HIST_207_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 4424, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: M. Armstrong-Partida, Status: Open",
    "date_accessed": "2024-03-28"
}