{
    "course_code": "HIST 296",
    "course_title": "Special Topics: Cross-listed: Religion and the Constitution",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 10Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "(Same as REL 270 4)\nThis course satisfies the new Religion major requirement: - Region, Theme. \nThis course offers an introduction to thinking historically about the evolution of legal thought about religion in the United States. What do the First Amendment's religious clauses mean, and how have interpretations of their meanings changed over time? How has the judicial system applied the First Amendment to oftentimes controversial issues of religion? We'll use courtroom contests and public debates to examine clashes between believers of the same and of different faiths, between believers and the state, and between believers and non-believers. We will investigate efforts to determine the meaning of the free exercise and establishment clauses while questioning to what extent they operate in tandem or at odds with each other. We will also probe how the very act of legal decision-making renders definitions of and creates boundaries for religion. The course is not a comprehensive survey of religion in American law, but rather, an opportunity to explore particular moments, contests, people, and issues at the intersection of American legal and religious history.",
    "course_description": "Selected topics in history for students in non-history originating (cross-listed) courses. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Katherine Rosenblatt - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in New Psyc Bldg 230 (36 Eagle Ro",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_HIST_296_3_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 4120, Section #: 3, Type: LEC, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: K. Rosenblatt, Status: Open",
    "date_accessed": "2024-03-28"
}