{
    "course_code": "HIST 296",
    "course_title": "Special Topics: Cross-listed: Rel.&Soc. Memory in Latin Am.",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 0 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "(Same as REL 270 3,, ANT 285 3, SOC 289 )\nThis course satisfies the new Religion major requirement: - Theme, Region.\nComplete Topic: Religion and Social Movements in Latin America\nThe connection between religious radicalism and social-political dissent in colonial and modern Latin America remains to this day one of the most fascinating areas of historical inquiry. This course explores the persistent return of the millenarian and messianic impulse in Latin America from the colonial times to the national era. We will discuss the formation, diffusion, and ?defeat? of these movements in the context of important social, economic and political changes in the history of Iberoamerica. Central to this course will be the analysis of the nature of millennial rhetoric, and more generally the nature of authority, persuasion, and the social construction of reality in each of these movements. Finally, we will address issues of race, class, and gender oppression in our discussion of millennial projects, cataclysmic expectations, and utopian visions of hope and redemption.",
    "course_description": "Selected topics in history for students in non-history originating (cross-listed) courses. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Javier Villa-Flores - Primary Instructor",
    "schedule_location": "T 2:30pm-5:30pm in Registrar Room Pool",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_HIST_296_2_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: Canceled section 4118, Section #: 2, Type: LEC, Campus: ATL, Meets: T 2:30-5:30p, Instructor: J. Villa-Flores, Status: Open",
    "date_accessed": "2024-03-28"
}