{
    "course_code": "HIST 360",
    "course_title": "History of Mexico",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 35 / Seats Avail: 35Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "HSC w/Race & Ethnicity Req.",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "This course engages the broad sweep of Mexican history from the twilight of the Aztec Empire through the drug wars of today. We will key in on major themes and turning points in the development of Mexican society, including Spanish conquest and colonialism, independence and modernization, the Mexican Revolution, migration from Mexico to the United States, and narco-trafficking. Throughout, students will hone analytical and writing skills by interacting with diverse materials, including primary documents (i.e. letters, testimony, and travel accounts), visual sources (i.e. paintings, photographs, and political cartoons), fiction, and journalism. Major questions include: How can we understand the relationship between state and society from a historical perspective?  How do certain state forms, such as a \"revolutionary state\" or a \"narco-state\" emerge, and why do they endure or fail?\nGrading structure: Class Participation: 20%, Mexican codices assignment 5%, Primary Source facilitation 5%, Mexico in the News presentation 5%, 2 exams 20%, 1 short essay: 10%; Research presentation: 5%; Research project: 30%\nThis course is appropriate for first year students.",
    "course_description": "This course examines 500 plus years of Mexican history, from the Aztec Empire to the \"Narco State.\" Major themes include empire; colonialism; neocolonialism; class and ethnic relations; modernization; popular resistance; revolution; national identity; migration; neoliberalism; and drug trafficking.",
    "prerequisites": null,
    "instructors": "Yanna Yannakakis - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in Tarbutton Hall 106",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_HIST_360_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3403, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: Y. Yannakakis, Status: Open",
    "date_accessed": "2024-03-28"
}