{
    "course_code": "HIST 438W",
    "course_title": "Professions in U.S. History",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 12Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Continuing Communication(*)",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "What is a profession? What is professionalism? Who are professionals? Combining attention to theoretical issues and case studies, and leaving room for independent research by students, History 438 seeks to answer these questions in the context of American history from the Revolution to the present. But at a deeper level the course seeks to explore the nature of professional authority and the meaning of expertise as these have evolved in America. The course thus seeks to examine how and why a key form of non-elected power and influence developed in a nation supposedly dedicated to democracy. And it seeks to examine how and why certain individuals known as professionals came to have that power and influence. \nNo examinations. Grading is based on research essay and class participation.",
    "course_description": "Jr/Sr Colloquium. \nThe Colloquium will consider the origins, development, and meaning of the professions in America from the Revolution to the present. Emphasis will be placed on the evoluion of professional lawyers, doctors, ministers, artists, and sports figures.",
    "prerequisites": null,
    "instructors": "Jonathan Prude - Primary Instructor",
    "schedule_location": "T 4pm-6:45pm in Bowden Hall 116",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_HIST_438W_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3477, Section #: 1, Type: SEM, Campus: ATL, Meets: T 4-6:45p, Instructor: J. Prude, Status: Open",
    "date_accessed": "2024-03-28"
}