{
    "course_code": "HIST 585",
    "course_title": "Special Topics in History: Race, Religion & Enslavement",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 12",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "Complete topic title: Race, Religion and Enslavement in Premodern Mediterranean\n\n\nThis course is designed to introduce students to the most recent scholarship on the Christian, Muslim, and Jewish societies of the premodern Mediterranean. Medieval race-thinking is distinct from modern racism; it is not based entirely on skin color or the biological markers of difference created during the era of scientific racism, but relied heavily on religious and socio-cultural classifications to target groups of people and establish power. Through the lens of premodern critical race theory, we will read work that tackles the racialization of religion, enslavement, and the gendered experience. We will also consider how the field's insistence on a pre-racial Middle Ages has led to racist appropriations of the past and address how scholars have responded to white nationalists and their use of the Middle Ages to perpetuate the myth of white European supremacy. Course readings are designed to illustrate the racial diversity and religious plurality of the Mediterranean and to think about how we can incorporate a framework of premodern critical race theory into our scholarship and teaching.",
    "course_description": null,
    "prerequisites": null,
    "instructors": "Michelle Armstrong-Partida - Primary Instructor",
    "schedule_location": "Th 2:30pm-5:30pm in Registrar Room Pool",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_HIST_585_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3489, Section #: 1, Type: SEM, Campus: ATL, Meets: Th 2:30-5:30p, Instructor: M. Armstrong-Partida, Status: Open",
    "date_accessed": "2024-03-28"
}