{
    "course_code": "SPAN 101",
    "course_title": "Elementary Spanish I",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 2 / Seats Avail: 2",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Blended/Hybrid",
    "typically_offered": "Fall",
    "requirement_designation": "Intercultural Communication(*)",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "CONTENT: Spanish 101 is a beginning-level integrated skills language course for students with no background in Spanish or only one year of high-school Spanish. The goals of this course include learning to use Spanish to communicate, learning of and about the tools of communication and studying Hispanic cultures to begin to understand how culture affects language use. Students participate in paired, small-group and whole-class conversation/listening activities that focus on meaningful communication and are required to do short readings and complete writing assignments.\nREQUIRED COURSE MATERIAL: Contraseña: Your Passport to Foundational Spanish (LingroLearning) + LinguaMeeting. Contraseña is a completely mobile and digital immersive experience, so there is no required printed textbook. Access is available for purchase directly from LingroLearning at www.lingrolearning.com\nPARTICULARS: Classes are conducted in Spanish to maximize exposure to the language. Evaluation is based on daily and active participation, online homework assignments, and portfolio projects. Friday classes will meet via Zoom for 50 minutes when there are no LinguaMeetings scheduled.\nPREREQUISITE: None, but students must take the Spanish Placement Exam and receive an Official Placement for SPAN 101 from the Department of Spanish and Portuguese. Take the online Spanish Placement Exam at http://spanport.emory.edu/home/undergraduate/placement/index.html.",
    "course_description": "The first half of a yearlong introductory course designed to train students to understand, speak, read, and write Spanish.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": "Varies by section",
    "course_resources": null,
    "sections": "Class Nbr: 1788, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 10-11:15a; F 10-10:50a, Instructor: Staff, Status: Open\nClass Nbr: 1980, Section #: 2, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p; F 11:30a-12:20p, Instructor: Staff, Status: Open\nClass Nbr: 1981, Section #: 3, Type: LEC, Campus: ATL, Meets: TTh 1-2:15p; F 1-1:50p, Instructor: Staff, Status: Open\nClass Nbr: 1982, Section #: 4, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p; F 2:30-3:20p, Instructor: R. Clarke, Status: Open",
    "date_accessed": "2024-03-29"
}