{
    "course_code": "SPAN 485",
    "course_title": "Topics in Hispanic Culture: Latin American Cinema",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 10",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "Description: This course explores the intersection between family, patriarchy, and violence in 21st-century Latin American film. The course will examine how various family configurations are portrayed on film, and to what extent they construe, challenge, and/or reproduce influential categories (such as work, motherhood, \"decency,\" heteronormativity, masculinity, \"promiscuity,\" or childhood) across gender, racial, and/or class-based lines. In examining these issues, we will look at how People of Color, women, children, and members of the LGBTQIA+ collective bear the brunt of abuse and generalized violence brought against them. We will also explore the concept of patriarchy paying attention to the many traits that turns masculinity in particular and cisheteronormativity in general (as well as insidious forms of white supremacy) into vigilance vectors bent on building \"the normal\" by neutralizing and destroying any detectable \"deviance\" from an established (often State-sponsored) desideratum for docile and malleable citizens.\nEvaluation: Participation in class, written critical responses, an oral presentation, and a final research essay.",
    "course_description": "Upper-level research seminar on topics related to the language, discourse, literature, and/or culture of the Hispanic world. Students may take multiple SPAN 485 courses provided that they focus on different topics.",
    "prerequisites": null,
    "instructors": "Hernan Feldman - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in Anthropology Building 105",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_SPAN_485_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2226, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: H. Feldman, Status: Open",
    "date_accessed": "2024-03-29"
}