{
    "course_code": "OAM 440",
    "course_title": "Leading with Evidence",
    "credit_hours": "3",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Varies by section",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "This course allows students to develop skills in how to interpret available evidence and how to gather evidence when it doesn't already exist.  These skills will help students make personal/life decisions to get where they want to be, make professional decisions that benefit a team or organization, and demonstrate problem solving skills to future employers.  Class will consist of discussions, interactive exercises, and mini-projects.  Topics will include your brain's power and its limits, leveraging the available evidence around us (restaurant reviews, social media likes, political polls, and more), using evidence to make life decisions (where to live, how to spend your money, what job to take), using evidence to make professional decisions (what strategy to adopt, should I start my own business), and methods for gathering evidence to persuade various audiences.  Skills gained in this class will be valuable for those interested in consulting or leadership (in any field), or who are simply curious about living their best life.",
    "course_description": "This course allows students to develop skills to interpret available evidence & gather evidence when it doesn't already exist. These skills will help students make personal/life decisions to get where they want to be, make professional decisions that benefit a team or organization, & demonstrate problem solving skills to future employers. Class will consist of discussions, interactive exercises, & projects. Topics include your brain's power & its limits, leveraging available evidence around us (restaurant reviews, social media likes, political polls, & more), using evidence to make life decisions (where to live, how to spend your money, what job to take), using evidence to make professional decisions (what strategy to adopt, should I start my own business), & methods for gathering evidence to persuade various audiences. Skills gained in this class will be valuable for those interested in consulting or leadership (in any field), or who are simply curious about living their best life.",
    "prerequisites": "This section is reserved for students in the BBA program.",
    "instructors": "Melissa Williams - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Goizueta Business School 208",
    "course_resources": null,
    "sections": "Class Nbr: 6349, Section #: 1167, Type: LEC, Campus: ATL, Meets: TTh 10-11:15a, Instructor: M. Williams, Status: Open\nClass Nbr: This section is full 6350, Section #: 1467, Type: LEC, Campus: ATL, Meets: TTh 10-11:15a, Instructor: M. Williams, Status: Closed",
    "date_accessed": "2024-03-30"
}