{
    "course_code": "WR 698",
    "course_title": "Special Topics in World Religions: Islamic Finance",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 2 / Seats Avail: 2",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-14 through 2023-11-20",
    "class_notes": "(Concurrent listing from Emory Law School) (ON CAMPUS; TOPIC: Islamic Finance: Islamic finance is an increasingly important sector of the international finance market. No longer limited to the Middle East or Southeast Asia, there is growing interest in this market on the part of non- Muslim customers, investors, and financial institutions, and sharia-compliant financial services and products are currently offered more than 70 countries, including in the U.K. and the U.S. Yet despite its dynamic growth and future potential, the Islamic financial industry remains relatively unknown in the United States. This course is designed as an intensive basic introduction to Islamic (or sharia-compliant) finance and banking. It will explore the hows and whys behind the industry, its ethical and legal underpinnings, and how it interacts with the U.S. and other legal systems. No previous familiarity with the field is necessary. All readings will be in English.)",
    "course_description": "Special topic or one-time offering courses led by Candler regular and visiting faculty. Prerequisites may be required and are noted on the course schedule when applicable.",
    "prerequisites": null,
    "instructors": "Lee Ann Bambach - Primary Instructor",
    "schedule_location": "TTh 10:30am-12pm in Gambrell Hall 5A",
    "course_resources": null,
    "sections": "Class Nbr: 6047, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 10:30a-12p, Instructor: L. Bambach, Status: Open",
    "date_accessed": "2024-03-30"
}