{
    "course_code": "POLS 190",
    "course_title": "Fresh Sem: Poli Sci: The Pacific War",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "This class addresses several aspects of World War II in the Pacific, and then draws comparisons to contemporary political issues.  For example, the class compares Japan's 1930s pursuit of natural resources with the current conflict in the South China Sea; intelligence failures before Pearl Harbor with intelligence failures before the 9/11 attacks and 2003 Iraq War; Japan's policies of sexual slavery in World War II with sexual assault in civil wars; the postwar reconstruction of Japan with the reconstruction of Afghanistan after 2001; the development of new weapons systems during the war with the invention of the iPhone; the internment of Japanese-Americans during the war with contemporary racial profiling in the US; American treatment of Japanese prisoners of war with post-2001 torture of war on terror detainees; and others.  The class is interdisciplinary, drawing on political science and history.\n\n\n(Freshmen Seminar - Limited to First Year Students Only)",
    "course_description": "For first-year students only. Entry level seminar focusing on a specific topic. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Dan Reiter - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in Anthropology Building 107",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 1845, Section #: 4, Type: SEM, Campus: ATL, Meets: MW 10-11:15a, Instructor: D. Reiter, Status: Wait List",
    "date_accessed": "2024-03-30"
}