{
    "course_code": "POLS 190",
    "course_title": "Fresh Sem: Poli Sci: Comparative Political Inquiry",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Freshmen Seminar - Limited to First Year Students Only)\n\n\nThis Freshman Seminar focuses on logical considerations about the systematic study of comparative politics. Developed for students with broad interests in the social sciences, it goes beyond some of the fundamental substantive topics covered in PS 120 \"Introduction to Comparative Politics\" to ask how we know what we know about its major areas of study. Class sessions will question the use of the scientific method, variable-oriented analysis, quantitative versus qualitative investigations, and cross-sectional versus historical inquiry. The seminar also considers a series of related questions: Does variable-level hypothesis testing capture the essence of comparative political behavior? How do we overcome the 'too few cases' problem? And, can we generalize from a case study? The seminar meetings, the readings, and the assignments will thus challenge students to think comparatively, empirically, and systematically. In terms of instructional style, the seminar's inquiry-based learning take a very 'hands on' approach, it will be highly personalized, and students are encouraged to explore their own political interests.",
    "course_description": "For first-year students only. Entry level seminar focusing on a specific topic. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Thomas D Lancaster - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in Callaway Center S104",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 1842, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: T. Lancaster, Status: Wait List",
    "date_accessed": "2024-03-30"
}