{
    "course_code": "POLS 190",
    "course_title": "Fresh Sem: Poli Sci: Conflict & Cooperation",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Freshmen Seminar - Limited to First Year Students Only)\n\n\nThis course is about why individuals sometimes manage to cooperate-to act in the group's best interests-even when doing so may be contrary to their short-term self-interest. Under what conditions does such collective action or cooperation occur? We explore this question in many social settings, e.g., \"altruistic\" behavior in various animal species; loyalty and betrayal among criminals; the willingness of soldiers to risk their lives in battle; participation in, and collective action to resist, crimes against humanity; conflict among different ethnic and racial groups; sources and change in community poverty and development; voting; conservation of limited environmental resources; strategic behavior and alliances among corporations; and more.\n\n\nThrough these examples, the course will examine a variety of different explanations for cooperative behavior. These include, among others: institutions, interests, power, culture, natural selection, and deliberation. As a freshman seminar, the class consists primarily of discussion, based on your reading and writing. There will be no lectures. We shall discuss some theory, but most of the readings focus on specific topics. Although the course is about politics, broadly defined, it is not designed only for those intending to major in political science. Instead, its purpose is to get you thinking hard about the issues of cooperation and conflict in whatever area you choose as a major. It is also designed to encourage better reading, writing, and speaking.",
    "course_description": "For first-year students only. Entry level seminar focusing on a specific topic. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Eric Reinhardt - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Anthropology Building 107",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 1844, Section #: 3, Type: SEM, Campus: ATL, Meets: MW 1-2:15p, Instructor: E. Reinhardt, Status: Wait List",
    "date_accessed": "2024-03-30"
}