{
    "course_code": "POLS 370A",
    "course_title": "Community Building and Social Change I - Principles and Perspectives",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 3Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "History, Society, Cultures",
    "permission": "Department Consent Required",
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "Written permission of the instructor is required for enrollment. Class will be taught in person. Interested students should complete a short application form, available at https://emory.campuslabs.com/engage/submitter/form/start/475707.\n\n\n(Same as CBSC 370A 1, ENVS 370A 1, and SOC 370A 1)\n(How communities of all sizes and types (e.g., neighborhoods, cities, metropolitan regions) solve important public problems. Our focus will be on understanding how, why, and to what effects, collaborative, community-based, cross-sector (public-private-nonprofit) initiatives are crafted to assist in the revitalization of low-income communities and their residents.)\n\n\n2. We will examine several tensions and issues that affect the practice of collaborative governance, and the processes through which community stakeholders attempt to overcome these obstacles to foster social change comprehensively (e.g., reduce poverty and promote economic mobility) as well as within specific policy domains such as education, economic development, workforce development, health, and the environment, among others. We will explore the course material through lectures, individual and group exercises, and the examination of a variety of case studies of comprehensive community/place-based initiatives launched over the past 30 years.\n\n\n3. This course is a requirement for participation in Emory's Community Building and Social Change Fellows Program, though students do not need to commit to participating in the CBSC program to enroll. For more information on the CBSC program see https://www.emorycbsc.com/ or contact the CBSC program director, Kate Grace, at kdgrace@emory.edu.",
    "course_description": "Open only to undergraduate students by permission of the instructor. Additionally, this course is required for all students seeking to apply for the fellowship in Community Building and Social Change.",
    "prerequisites": null,
    "instructors": "Michael Rich - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Tarbutton Hall 111",
    "course_resources": null,
    "sections": "Class Nbr: 1856, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 10-11:15a, Instructor: M. Rich, Status: Open",
    "date_accessed": "2024-03-30"
}