{
    "course_code": "POLS 394W",
    "course_title": "Research Topics in Political Science: Oppression/Resistance-Mid East",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "Continuing Writing Requirement",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "This course focuses on the dynamic cycles of oppression and resistance between a state and her citizenry. We begin with a study of state use of force and attempts to (legally and illegally) constrain and control their citizenry and then move on to study how citizens attempt to resist state power and oppression. We will study these topics with reference to the Middle East, specifically focusing on Saudi Arabia, Iran, the Arab Spring, Syria, Yemen, and Israel/Palestine. Specific topics discussed include legal structures of oppression, surveillance, detention, torture, boycotts, strikes, protest movements, Islamic nonviolent resistance, terrorism, and insurgency. The primary means of evaluation for the course is systematic a research paper related to course topics. POLS 208 is a required prerequisite for this course.",
    "course_description": "Research on selected topics and problems in political science. Class will fulfill the \"research\" requirement for the political science major. May be repeated for credit when the topic varies.",
    "prerequisites": "POLS 208 or POLS_OX 208 or equivalent transfer credit as prerequisite.",
    "instructors": "Emily Gade - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Tarbutton Hall 106",
    "course_resources": null,
    "sections": "Class Nbr: 1886, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 10-11:15a, Instructor: E. Gade, Status: Open",
    "date_accessed": "2024-03-30"
}