{
    "course_code": "POLS 494W",
    "course_title": "Research Topics Seminar in Political Sciences: Political Monitoring",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Continuing Writing Requirement",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "Scholars, journalists, and everyday people frequently use the term 'monitoring.' As a concept, however, it is not fully investigated in the social sciences, especially its impact on political behavior and effective governance. This upper-division research seminar systematically studies monitoring in political affairs, governance, and public policy. First, monitoring as a concept is defined, especially in relation to other important concepts such as accountability and within the context of collective action problems. Second, by utilizing the scientific method we question the most meaningful explanations of why people tend to change their behavior when being watched. Third, seminar participants will ask \"How can monitoring be most effectively institutionalized?\" Finally, students will investigate monitoring's importance within such contexts as the institutionalization of collective decision-making in both democratic and non-democratic practices and as in 'top-down' as well as 'bottom-up' forms. In seeking to provide explanations as to why people and other actors change their behavior and to question how such 'watching' is best institutionalized for 'good governance,' we will identify related factors such as transparency, costs, and trust in political affairs. Given the seminar's format, students should bring specific examples of interest to this study of political monitoring.",
    "course_description": "Research Seminar on selected topics and problems in political science. Class will fulfill the \"research\" requirement for the political science major. May be repeated for credit when the topic varies.",
    "prerequisites": "POLS 208 or POLS_OX 208 or equivalent transfer credit as prerequisite.",
    "instructors": "Thomas D Lancaster - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Callaway Center S104",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 1887, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: T. Lancaster, Status: Wait List",
    "date_accessed": "2024-03-30"
}