{
    "course_code": "PSP 789",
    "course_title": "Special Topics in Psychoanalytical Studies: France &Algeria:Fic.as Archive",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 3 / Seats Avail: 3",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Same as FREN 785 1, CPLT 751R 5)\nContent: At its heart, the seminar is concerned with the works of fiction and aesthetic creations that relay a failing archive in the context of the Algerian War of Independence against the French (1954-62). Whether because of state censorship or generalized shame, historical archives and methods fail to account for the past and perpetuate colonial violence. Hence, remembering happens through aesthetic creations. In a troubling yet necessary intermediality, fiction writers and filmmakers become historians, historians rely on personal memories, psychoanalysts call upon literature, literary critics write with emotion.  In its inclusion of protagonists from both sides of the War (often women who prove that war is not just a man's business), the seminar highlights the necessity of a synergy of memories, towards healing, reconciliation, and action.\n\n\nCourse Material:  Readings will include works of fiction and autofiction by Maïssa Bey, Hélène Cixous, Mohammed Dib, Zahia Rahmani, Leila Sebbar, Alice Zeniter; films by Yasmina Adi, Jacques Demi, Assia Djebar, Medine, Gillo Pontecorvo, Alain Resnais; essays and theories by Lia Brozgal, Albert Camus, Saidiya Hartman, Jill Jarvis, Karima Lazali, Frantz Fanon, Achille Mbembe, Jacques Derrida, Michael Rothberg, Benjamin Stora. \nRequired Books (to be purchased with indicated ISBN only. If you read French, please buy the French version)\n1.\tBey, Maïssa. Entendez-vous dans les montagnes (1997) 2815950987 / Do You Hear in the Mountains? (2018) 081394029X\n2.\tLazali, Karima. Le Trauma colonial (2018) 2707199168 / Colonial Trauma (2021). 1509541039. \nParticulars:  Sustained participation, 3 short response papers, oral presentation, and research paper with annotated bibliography. The course is taught in French.  Papers can be written in French or English.",
    "course_description": "Special Topics in Psychoanalytical Studies",
    "prerequisites": null,
    "instructors": "Valérie Loichot - Primary Instructor",
    "schedule_location": "Th 1pm-4pm in Callaway Center C202",
    "course_resources": null,
    "sections": "Class Nbr: 6229, Section #: 3, Type: LEC, Campus: ATL, Meets: Th 1-4p, Instructor: V. Loichot, Status: Open",
    "date_accessed": "2024-03-30"
}