{
    "course_code": "SPAN 210",
    "course_title": "Spanish For Reading Comprehension",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 7Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Summer",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2021-06-28 through 2021-08-04",
    "class_notes": "1.\tThis course is open to graduate students. Contact emills9@emory.edu for enrollment. CONTENT: This is an intensive course introducing fundamental vocabulary, grammar, and reading strategies to develop the reading skill. No previous knowledge of Spanish is necessary. In some departments this course may be substituted for the GSLFT or departmental reading exam in Spanish. Students will read/translate texts of diverse levels of difficulty. Initially these will be supplied by the professor; later in the semester, the students will be responsible for bringing texts related to their fields and personal interests. PARTICULARS: This course is designed for graduate students in other departments and has no correlation with undergraduate studies in Spanish. Evaluation is based on participation, classwork, and homework (readings and translations). Emory College Online summer courses have required synchronous/live sessions every week. Students must be available to sign into and virtually attend the course online during those times. Each course will involve significant asynchronous material that you access on your own time plus standard amounts of readings and course assignments. Students should plan to spend 15-20 hours/week on this course. Faculty will  correspond with students during Week Zero of the course; some interaction with the course may be required at that time. Students should begin checking the Canvas course site regularly one week prior to the official start of the term.\n\n\nThis is an online course. Emory College Online summer courses have required synchronous/live sessions every week. Students must be available to sign into and virtually attend the course online during those times (noted as the course meeting times- all times listed are local to Atlanta). Each course will also involve significant asynchronous material that you access on your own time in addition to standard amounts of readings and course assignments. Students should plan to spend 15-20 hours/week on this course. Please also be aware that faculty will begin corresponding with students during Week Zero of the course (one week before the official start date of the course), and that some interaction with the course may be required at that time. Students should begin checking the Canvas course site regularly one week prior to the official start of the term.",
    "course_description": "This course, intended for graduate students, introduces fundamental vocabulary, grammar, and comprehension strategies to develop reading ability. No previous knowledge of Spanish is necessary.",
    "prerequisites": null,
    "instructors": "Sergio Delgado Moya - Primary Instructor",
    "schedule_location": "TTh 1:15pm-2:45pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 1317, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 1:15-2:45p, Instructor: S. Delgado Moya, Status: Open",
    "date_accessed": "2024-03-30"
}