{
    "course_code": "AFS 270",
    "course_title": "Topic Seminar: Genocide: Internat'l Reponses",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as HIST 285 1)\n(Complete topic: The Politics of Genocide and International Responses)\n(This class will meet synchronously on Tues 1:00 PM - 2:15 PM)\n(In September 1998, the 1948 Genocide Convention was used for the first time to convict an individual, fifty years after it became a law. Very rarely has a genocide been called as such while it happened; instead, policymakers in both the United Nations and individual countries, like the United States, describe genocides as war or \"acts of genocide\" in the moment to avoid their legal responsibilities. This course explores the international politics of genocide, focusing on the policy, action, and (more often) inaction of international bodies, like the UN, and individual countries. Using case studies including the Holocaust, Cambodia, and Rwanda, we will examine the ways that politics influences humanitarianism, aid, and intervention. This course will complicate our understanding of genocide itself as a legal category and the political ramifications of \"never again\" narratives and subsequent inaction. \nWe will be examining speeches, memos, laws, and secondary source material to understand what policymakers knew about genocides when they were happening and what they did with that knowledge. Students will use a variety of materials to better understand why policymakers made the decisions that they did and what loopholes or problems existed and still persist in international systems to allow the \"problem of the twentieth century\" to persist today)",
    "course_description": "An introductory course on African Studies. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Georgia Brunner - Primary Instructor",
    "schedule_location": "T 1pm-2:15pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 4766, Section #: 1, Type: SEM, Campus: ATL, Meets: T 1-2:15p, Instructor: G. Brunner, Status: Open",
    "date_accessed": "2024-03-30"
}