{
    "course_code": "AFS 263",
    "course_title": "Intro to African Studies",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as IDS 263 1)\n(This class will meet synchronously on Tues. 1:00 PM - 2:15 PM)\n(This course is an introduction to Africa from diverse disciplinary perspectives: history, anthropology, geography, economics, film, religion, and literature (both written and oral traditions).  We will explore major historical trends: including the slave trade, colonialism, and the postcolonial political economy - and their impact on contemporary political, economic, and social life. A second major objective of the course is for students to come away with a sense of the profound diversity of social and cultural life on the African continent and an understanding of the complexity of the issues that face African people, individually and as groups, in their daily lives.  Through reading ethnography, fiction, and a variety of other historical and contemporary texts and engaging film and music from the continent, we will encounter a range of perspectives on ethnicity, gender, power, urban and rural life, environment, family, politics, and religion. Additionally, we will examine a range of analytical themes that explore the very lenses and categories through which Africa has been studied and understood - for example: tribe, kinship, tradition - and discuss the implications of using those concepts.)\n\n\nThis course is an introduction to Africa from diverse disciplinary perspectives: history, anthropology, geography, economics, film, religion, and literature (both written and oral traditions).  We will explore major historical trends: including the slave trade, colonialism, and the postcolonial political economy - and their impact on contemporary political, economic, and social life. A second major objective of the course is for students to come away with a sense of the profound diversity of social and cultural life on the African continent and an understanding of the complexity of the issues that face African people, individually and as groups, in their daily lives.  Through reading ethnography, fiction, and a variety of other historical and contemporary texts and engaging film and music from the continent, we will encounter a range of perspectives on ethnicity, gender, power, urban and rural life, environment, family, politics, and religion. Additionally, we will examine a range of analytical themes that explore the very lenses and categories through which Africa has been studied and understood (for example: tribe, kinship, tradition) and discuss the implications of using those concepts.",
    "course_description": "Introduction to the African humanities and social sciences through in-depth study of three African regions. Explores major historical trends and their impact on culture, including the slave trade, colonialism, and postcolonial international contacts. Content is drawn from literature (both written literature and oral traditions), film, history, religion, anthropology, sociology, and art.",
    "prerequisites": null,
    "instructors": "Kristin D Phillips - Primary Instructor",
    "schedule_location": "T 1pm-2:15pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2870, Section #: 1, Type: LEC, Campus: ATL, Meets: T 1-2:15p, Instructor: K. Phillips, Status: Wait List",
    "date_accessed": "2024-03-30"
}