{
    "course_code": "POLS 190",
    "course_title": "Fresh Sem: Poli Sci: E. European Politics thru Film",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First Year Seminar",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Freshmen Seminar - Limited to First Year Students Only)\nCOURSE TITLE: The Radiant Future and After: Eastern European Politics through Film\n\n\nClass Format:  The class will consist of a two-hour seminar (Thursdays, 1p-3:45p in TBD) and, on select dates, a two-hour (approx.) film screening (Mondays, 8-10pm in TBD). You will be required to attend both the seminars and the film screenings.\n\n\nCommunism may seem like something that happened long ago and far away, the stuff of grainy newsreels and chapters in history textbooks: images of military parades, smoke-belching factories and peasant villages that may be forty, but might as well be a hundred years old. This era is so far removed from our everyday experience that it may be difficult to believe that it happened at all. At the same time, our television screens are filled with daily accounts of economic hardships, rampant crime, ethnic violence and political demagoguery that appear to prevail in the post-communist world. This course will seek to bridge the gap between the almost fictional quality of pre-1989 communism and its real, present-day consequences for the lives of ordinary people. It will explore the nature of communist and post-communist politics by combining seminar discussions with weekly screenings of full-length, nondocumentary films. In doing so, it will bring into sharp focus the types of choices, dilemmas and commitments that were part of everyday life in communist systems and which continue to shape the mindsets of many people to this day.",
    "course_description": "For first-year students only. Entry level seminar focusing on a specific topic. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Hubert Tworzecki - Primary Instructor",
    "schedule_location": "Th 1pm-3:45pm in New Psyc Bldg 493 (36 Eagle Ro\nM 8pm-10pm in White Hall 110",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2643, Section #: 1, Type: SEM, Campus: ATL, Meets: M 8-10p; Th 1-3:45p, Instructor: H. Tworzecki, Status: Closed",
    "date_accessed": "2024-03-30"
}