{
    "course_code": "POLS 190",
    "course_title": "Fresh Sem: Poli Sci: Pol Visions of Utopia/Dystopia",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First Year Seminar",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Political theorists often ask, \"how can we imagine our collective and individual futures?\" This course serves as an investigation to this question through the framework of dystopia and utopia. Indeed, both utopia and dystopia, seen as opposites, both grapple with images of an alternative world and can serve as valuable tools for imagining and shaping the future. To examine this question, we will engage in several mediums: works of literature, art, film, and most notably political theory. We will critique these mediums through a variety of perspectives including: ecology, gender and sexuality, economics, technology, and various forms of governmental organization.\n\n\nSome specific goals of this course include: introducing students to classic and lesser-known works of utopian and dystopian literature and theory, introduce students to key political concepts with reference to the above frameworks, give students a broader sense of the history of ideas and how those ideas have informed theory of the past, present, and future, and training students to analyze and discuss complex arguments. \n \nWe will spend most of this class grounding our analysis in theory, addressing fundamental questions such as: what do dystopian/utopian society require of citizens and seek as a goal? To what extent are dystopia/utopia possible? What is sacrificed by dystopia/utopia? We will also look towards real-world applications of dystopian/utopian ideals and consider questions such as, can dystopian/utopian projects be achieved on large scale, how should success or failure be defined, and by what means are dystopia/utopia pursued?",
    "course_description": "For first-year students only. Entry level seminar focusing on a specific topic. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Steve Del Visco - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in New Psyc Bldg 220 (36 Eagle Ro",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 6470, Section #: 6, Type: SEM, Campus: ATL, Meets: MW 10-11:15a, Instructor: S. Del Visco, Status: Closed",
    "date_accessed": "2024-03-30"
}