{
    "course_code": "POLS 352",
    "course_title": "Constitutional Law",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 90 / Seats Avail: 22",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "This course examines the provisions of the United States Constitution that establish the legislative, executive and judicial powers of the federal government, place limitations on those powers, and allocate power between the federal government and the states. The principal focus of the course will be issues involving the growth in the power of the judicial branch, Congress' power under the Commerce Clause, Congress' power to tax and spend, the president's authority in domestic issues and foreign affairs and issues of \"federalism\"-the allocation of governmental powers and authority between the federal government and the states. Although the specific sections of the Constitution that deal directly with questions of civil liberties, civil rights and criminal procedure are covered in much greater detail in other courses, this course also will examine examples of how Congress has used the Commerce Clause to enact a series of historic civil rights legislation and how the Supreme Court's interpretation of the 13th and 14th Amendments and the \"incorporation\" of the Bill of Rights against the states have dramatically impacted the relationship between the federal government and the states, and between the federal government and the people.",
    "course_description": "Suggested prerequisite: Political Science 100. Basic principles of the Constitution and powers of the national and state governments, examined through Supreme Court decisions and secondary works.",
    "prerequisites": null,
    "instructors": "Charles Olney - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in White Hall 112",
    "course_resources": null,
    "sections": "Class Nbr: 2861, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 10-11:15a, Instructor: C. Olney, Status: Open",
    "date_accessed": "2024-03-30"
}