{
    "course_code": "POLS 347",
    "course_title": "Latino Politics in the U.S.",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 65 / Seats Avail: 18Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "HSC w/Race & Ethnicity Req.",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "This course examines the past, present, and future of Hispanic and Latino politics in the United States. Topics include the history of conquest, colonization, and immigration that gave rise to the Latina/o/x population in the United States, cultural and institutional forces that generate and sustain Latina/o/x identities, differences and similarities in the experiences of Mexican, Puerto Rican, Cuban, Dominican, Central American, and other national origin groups, the historical and contemporary political preferences, behaviors, and representation of Latina/o/x potential voters, and how the growing Latina/o/x population will shape American politics going forward. Throughout the course, special emphasis will be placed on how Latinas/os/xs are incorporated into an American racial hierarchy historically defined by the Black-White binary, the intersection of Latina/o/x identity with gender, sexuality, national origin, citizenship status, and age, and the role Latinas/os/xs play in the politics of the South in general and Georgia in particular.",
    "course_description": "Examination of the past, present, and future of Latino politics in the U.S. Analyzes historical and contemporary political preferences, voting, and representation of Mexican, Puerto Rican, Cuban, Dominican, Central American, and other Latino populations, and how Latinos shape U.S.politics broadly.",
    "prerequisites": null,
    "instructors": "Bernard Fraga - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in White Hall 111",
    "course_resources": null,
    "sections": "Class Nbr: 2654, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: Fraga/Wakefield, Status: Open",
    "date_accessed": "2024-03-30"
}