{
    "course_code": "POLS 385",
    "course_title": "Special Topics: Political Science: Technology,Society,Governance",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 50 / Seats Avail: 44",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "This course will consider the latest issues pertaining to rapidly accelerating technologies, their social impact, and their consequences for governance. We'll take a comparative perspective, with examples from the Americas, Europe and Asia.  We'll begin with the history of technologies & public perceptions of technology, including ancient technologies, with students visiting The Carlos Museum. Topics covered in the course will include artificial intelligence; outer space technologies; technology and great power competition; biometric identification and payment systems; surveillance and privacy; crypto & blockchain; automation, robotics, and the future of work; social media and mental health; new political campaigning technologies, climate change & public health technologies; developments in technology law and regulation; as well as technologically-enabled meddling in elections and in the information space, including the impact of bad actors and deep fakes.",
    "course_description": "Selected topics and problems in political science. Content will vary in successive offerings of this course. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Holli A Semetko - Primary Instructor",
    "schedule_location": "W 4pm-6:45pm in White Hall 112",
    "course_resources": null,
    "sections": "Class Nbr: 3115, Section #: 4, Type: LEC, Campus: ATL, Meets: W 4-6:45p, Instructor: H. Semetko, Status: Open",
    "date_accessed": "2024-03-30"
}