{
    "course_code": "POLS 495W",
    "course_title": "Research: Honors Tutorial",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "Experience and Application with Cont.Comm(*)",
    "permission": "Department Consent Required",
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "The Honors Tutorial in Political Science is a course designed especially for senior Political Science and International Studies majors who are pursuing an honors degree. The goal of the course is straightforward: to help students transform their research topics into clear questions and to design a project that analyzes those questions through rigorous, original research using the methods of political science. By the end of this course, each student will have carefully prepared a full introduction to their honors thesis, the main elements of which are: (1) a clearly stated research question; (2) a review and analysis of relevant literature; (3) theory and hypotheses to be tested (when applicable); and (3) a detailed research plan. Thus, students will be well on their way in the preparation of well-reasoned, feasible, rigorous, and interesting honors theses.",
    "course_description": "Open only to students selected to participate in the department's Honors Program. Basic social science research methods and preparation of an honors thesis on some previously uninvestigated or insufficiently investigated area of political science. This course is required for completion of the Honors Program in political science.",
    "prerequisites": null,
    "instructors": "Alexander Bolton - Primary Instructor",
    "schedule_location": "MW 4pm-5:15pm in White Hall 208",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2686, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 4-5:15p, Instructor: A. Bolton, Status: Closed",
    "date_accessed": "2024-03-30"
}