{
    "course_code": "POLS 494",
    "course_title": "Research Topics Seminar in Political Science: Civilians in Conflict",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "This course is an advanced seminar that examines the role of civilians in interstate and civil conflict, as legally protected victims of violence, supporters and resisters of armed groups, and active participants in conflict. We will cover three primary topics: 1) protection of civilians in conflict and humanitarian intervention; 2) interactions between combatants and civilians; 3) responses of civilians to conflict. The course begins by examining laws and norms that dictate how combatants treat civilians. We will then consider the consequences of conflict for civilians, covering topics like indiscriminate violence, rebel governance, conscription, and child soldiers. The course also assesses how civilians exercise agency in conflict by studying protest, non-violent resistance, and migration and refugees.",
    "course_description": "Research Seminar on selected topics and problems in political science. Class will fulfill the \"research\" requirement for the political science major. May be repeated for credit when the topic varies.",
    "prerequisites": "POLS 208 or POLS_OX 208 or equivalent transfer credit as prerequisite.",
    "instructors": "Jessica Sun - Primary Instructor",
    "schedule_location": "MW 5:30pm-6:45pm in Candler Library 123",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2685, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 5:30-6:45p, Instructor: J. Sun, Status: Closed",
    "date_accessed": "2024-03-30"
}