{
    "course_code": "POLS 494",
    "course_title": "Research Topics Seminar in Political Science: Evidence-Based Policymaking",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 5",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": "Department Consent Required",
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Permission of Instructor required; please follow application process outlined in Course Atlas.)\n\n\nThis course introduces students to policymaking in the American states with a focus on Georgia. It will cover the transformation of ideas into public policies, with attention to three key phases of the policymaking process-advocacy (issue framing and agenda setting), policy design (formulating policy options), and policy evaluation (assessing the effects of public policies). For each of these phases we will pay close attention to the types of actors engaged in this phase of policymaking and how-if at all-they use and provide evidence to support their claims. While our focus is on Georgia, we will also examine how Georgia's political institutions and policymaking processes compare with other states.\n\n\nIn-person work with state legislators and their staff and community and advocacy organizations will be a substantial component of the course. Students will work in teams of 3-4 students, matched with one or more sponsoring organizations, on an important state policy issue. We will aim to have a reasonable balance between students working on topics being addressed by state legislative study committees (upper and lower chambers) drawn from a variety of policy areas (e.g., health, environment, early learning, education, mental health, workforce development, economic development, voting rights, immigration, etc.).\n\n\nStudent experiential work will focus on assembling and presenting credible and persuasive evidence to better inform state policymakers on matters pertaining to needs assessment, policy design/analysis, and program evaluation. Students will also participate in online/national network opportunities available through the ENACT Network (Educational Network for Active Civic Transformation), based at Brandeis University (https://www.brandeis.edu/ethics/ENACT/index.html). There also should be opportunities for co-learning across campuses facilitated by the ENACT network that will allow students to compare the issues we are addressing in Georgia with those being examined in ENACT courses in other states.\n\n\nThis course is open to Emory undergraduates and enrollment is by permission of the instructor, primarily to ensure that enrolled students have taken some previous coursework or had work or internship experiences directly related to the course objectives.\nStudents interested in enrolling in this course should complete a short application, which can be found at this link: https://polisciemory.qualtrics.com/jfe/form/SV_74zIgKVGez0WCZn",
    "course_description": "Research Seminar on selected topics and problems in political science. Class will fulfill the \"research\" requirement for the political science major. May be repeated for credit when the topic varies.",
    "prerequisites": "POLS 208 or POLS_OX 208 or equivalent transfer credit as prerequisite.",
    "instructors": "Matthew Gunning - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in Anthropology Building 105",
    "course_resources": null,
    "sections": "Class Nbr: 2859, Section #: 2, Type: SEM, Campus: ATL, Meets: TTh 1-2:15p, Instructor: M. Gunning, Status: Open",
    "date_accessed": "2024-03-30"
}