{
    "course_code": "LING 413",
    "course_title": "Spanish in the US",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Irregularly",
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Same as SPAN 413 1)\nDESCRIPTION: This course provides a descriptive and critical overview of the linguistic practices of different Spanish-speaking communities in the United States, as well as a methodology for the study of these practices. Students will learn about the linguistics characteristics of the different Spanish varieties spoken by these communities, including phonetic, morphological, syntactic and lexical aspects. Special attention is given to the relationship between language and society, particularly on topics such as ethnic and cultural identity, multilingualism and language policy. The course also presents a theoretical and practical approach to the ethnographic research method. Students will read and analyze studies carried out by different scholars and will design their own research project on the topic of their preference. Special attention is given to ethical principles, for this reason students will need to complete the web-based Collaborative IRB Training Initiative (CITI) Program in the Protection of Human Subjects in Research.\nBackground on general Linguistics is recommended, such as the one provided in Span/Ling 303, Span/Ling 304 or Ling 201.This course meets the sociocultural requirement of the Linguistics Major and can be used as one of the required 400-level courses for the Joint Major in Spanish & Linguistics or for the Major/Minor in Spanish.\n\n\nTEXTS: \n- Escobar, Anna María and Kim Potowski. 2015. El español de los Estados Unidos. Cambridge: Cambridge University Press.\n- Selection of articles available in Canvas.\nEVALUATION: Evaluation will be based on class participation, weekly assignments, two exams, one research project and five written practices.\nPREREQUISITES: One Foundational Course, preferably SPAN/LING 303 or SPAN/LING 304.",
    "course_description": "This course provides a descriptive and critical overview of the linguistic practices of differentSpanish-speaking communities in the United States, as well as a methodology  for the study of these practices. Special attention is given to the relationship between language and society.",
    "prerequisites": null,
    "instructors": "Jose Luis Boigues-Lopez - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Ignatius Few Building_129",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 4610, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: J. Boigues-Lopez, Status: Closed",
    "date_accessed": "2024-03-30"
}