{
    "course_code": "EAS 190",
    "course_title": "Freshmen Seminar: Who is a Barbarian?",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "FSEM w/Race & Ethnicity Req",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "Atlas Description: Who is a Barbarian? Cultural Identity and the World Order in Pre-modern East Asia.   \nIn this course, we study how pre-modern East Asians had perceived and conceptualized themselves as a collective cultural entity, created and developed a hierarchical order of their own world, and prescribed and imposed a strict boundary between themselves and outsiders. First, students will review theoretical perspectives on the concept of nation, national identity, and ethnicity, mostly proposed and developed by Euro-American scholars, and critically think of its relevancy and applicability to pre-modern East Asian cases. Then, we will examine how early East Asians had described barbarians in their conception and imagination of the world by reading and discussing some foundational writings on peoples beyond their politico-cultural boundaries. This issue is necessarily related to the ways in which the ancestors of the peoples we now too simplistically call Chinese, Korean, and Japanese had developed their own ideas and accounts of who they are and where they are from. We will approach this important topic by closely reading and discussing pre-modern East Asians' own writings about their forefathers and themselves. Finally, students will discuss how maps of the world produced and handed down in East Asia represented their understandings of the world and its order.",
    "course_description": "Focus on selected topics in East Asian studies.",
    "prerequisites": null,
    "instructors": "Tae Hyun Kim - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Callaway Center S101",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 5378, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 1-2:15p, Instructor: T. Kim, Status: Closed",
    "date_accessed": "2024-03-30"
}