{
    "course_code": "EAS 250",
    "course_title": "Introduction to East Asian Studies",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "This introductory course aims to introduce students to major topics and methodologies in East Asian Studies in the US and Europe today. First, we start by critically reflecting on what the notion of 'Asia(n)' or 'East Asia(n)' really means. From the beginning, the concept only signified the eastern landmass of Europe's military and cultural enemies and, more importantly, nameless, unknown fearful 'others' as non-Greco/Roman descendants and non-Christians in the Eurocentric imagination of the world. For this, students will discuss many old maps and written descriptions of the world, produced, shared, and transmitted by pre-modern and modern European travelers, cartographers, writers, and intellectuals. In the second part of the course, we will read, from a comparative perspective, primary and secondary writings on how traditional East Asian minds had understood and explained some critical notions and categories, such as God, self, family, gender, nation, nature, history, and culture, differently from modern Euro-American ones. Lastly, we will discuss some representative literary and philosophical or religious writings about humanity, the world, and the cosmos by important pre-modern East Asian writers and thinkers and think about how they have shaped the basis of what we may call the East Asian mindset or mentality.    \nNo prior exposure to East Asian literature or history is assumed. \nThis course places a strong emphasis on writing, research, and critical thinking.",
    "course_description": "Required for East Asian Studies Majors and Minors. An interdisciplinary course that introduces students to major topics and methodologies in East Asian Studies, with an emphasis on writing, research, and critical thinking. Themes include history, literature, religion, and the arts.",
    "prerequisites": null,
    "instructors": "Tae Hyun Kim - Primary Instructor",
    "schedule_location": "MW 4pm-5:15pm in Callaway Center S109",
    "course_resources": null,
    "sections": "Class Nbr: 1351, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 4-5:15p, Instructor: T. Kim, Status: Open",
    "date_accessed": "2024-03-30"
}