{
    "course_code": "PORT 301W",
    "course_title": "Portuguese Texts and Cultures",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 7",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Intercultural Communication w.Cont.Comm(*)",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(Same as AFS 389W 2)\n\n\nCONTENT: This course examines 20th Century Portuguese literature (novels, short-stories and poetry) and cinema (fiction and documentary). As we explore the artistic achievements of Portuguese writers and filmmakers over the last one hundred years, students examine Salazar's Estado Novo and Portugal's transition to democracy. The selected literary and cultural texts serve as vehicles for a deeper understanding of contemporary Portuguese society. Our goal is to evaluate how literature and film contest hegemonic accounts, to investigate how artistic productions play a role in interpreting Portugal's past and to examine the interconnections between history, memory, and national identity. TEXTS: Course Packet PARTICULARS: Evaluation is based on daily and active participation; journals; short essays, oral presentations, comparative analytical project; and Portuguese program activities. PREREQUISITES: Port 201 or equivalent (including courses taken during a study abroad program).",
    "course_description": "This course examines 20th Century Portuguese literature (novels, short-stories and poetry) and cinema (fiction and documentary). Students formulate responses in Portuguese to the various themes addressed in the different texts and films, both orally and in writing.",
    "prerequisites": "PORT 201 or equivalent transfer credit as prerequisite.",
    "instructors": "Ana Catarina Teixeira - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in Callaway Center S103",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_PORT_301W_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 1836, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 1-2:15p, Instructor: A. Teixeira, Status: Open",
    "date_accessed": "2023-10-31"
}