{
    "course_code": "BSHES 710",
    "course_title": "Research Designs in the Behavioral and Social Sciences",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "BSHES STUDENTS ONLY",
    "course_description": "This course is designed to provide doctoral students with a solid understanding of research designs that are commonly used for the implementation of etiological and experiemntal research studies in the behavioral and social sciences. The course will cover examples from the field, as well examples conducted by faculty in the department. The course provides students with the fundamental language, concepts, and construts associated with the scientific approach as well as intruction in the design and implementation of health promotion research studies. Examples of appropriate applications are critical to this course and will be provided by the instructor, as well as relevant BSHE faculty. This course is intended to complement other required courses in theory, intervention development, epidemiology and advanced statistical analysis. This course meets one time per week, and students are expected to attend each class. Assigned readings serve to augment the classes. Therefore, students are expected to complete readings before the class for which they are scheduled. Classes consist of example-based didactic lecture and student-led problem solving and discussion.",
    "prerequisites": null,
    "instructors": "Kelli Komro - Primary Instructor",
    "schedule_location": "W 9am-12pm",
    "course_resources": null,
    "sections": "Class Nbr: 4525, Section #: 1, Type: LEC, Campus: ATL, Meets: W 9a-12p, Instructor: Komro/Spencer, Status: Open",
    "date_accessed": "2024-03-30"
}