{
    "course_code": "PSYC 190",
    "course_title": "Fresh Sem: Psychology: Brain Challenge/Sport Perform.",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 0 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First Year Seminar",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "(Freshmen Seminar - Limited to First Year Students Only) (This course addresses how the human brain responds and adapts to conditions of challenge (injury, stress, recovery, and deliberate strategies for optimization) as they pertain to athletic performance. Topics of focus include sports concussions, the impact of fatigue, scheduling, and psychosocial factors on brain and performance, and effects of practice strategies and exercise per se on the brain. Students will learn some basic neuroscience, explore scientific literature on brain plasticity, and consider implications for best practices for youth sports, training regimens, and regulations and policies in entities such as the NFL. Relative emphasis on specific sports and domains of athletic performance will be determined to a significant degree by the interests of class members.)",
    "course_description": "Small class experience on topics of current psychological interest that fosters a highly interactive and mutually collaborative learning environment involving freshmen and faculty members. Topics include clinical, neuroscience, animal behavior, social, development and cognition.",
    "prerequisites": null,
    "instructors": "Hillary R Rodman - Primary Instructor",
    "schedule_location": "W 1pm-3:30pm in New Psyc Bldg 393 (36 Eagle Ro",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_PSYC_190_3_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: This section is full 2547, Section #: 3, Type: SEM, Campus: ATL, Meets: W 1-3:30p, Instructor: H. Rodman, Status: Closed",
    "date_accessed": "2024-03-29"
}