{
    "course_code": "PSYC 499R",
    "course_title": "Directed Research",
    "credit_hours": "1-12",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 10",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Experience and Application(*)",
    "permission": "Department Consent Required",
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "(Permission Required Prior to Enrollment) Psychology majors only. Credit is variable, 1.00 - 12.00 (For 3.00 hrs/week = 1.00 credit). Students must have consent of faculty member (inside or outside of the department) and agreement on a research, expectations and responsibilities in the lab. Students are required to complete a PSYC 498R/499R Contract with a faculty member or principal investigator detailing their research. Contract is available through Lorenza Houser (lhouser@emory.edu). Please e-mail Ms. Houser to obtain a copy of the contract to complete and sign along with your faculty supervisor and/or principal investigator inside or outside the department before returning it to her. Enrollment in PSYC 499R are done administratively; Ms. Houser will enroll you in directed research herself.\nFor students conducting research outside of the Department of Psychology, the contract must be approved by Dr. Andrew Kazama (akazama@emory.edu) as the department's director of undergraduate research before submitting it to Ms. Houser.",
    "course_description": "Credit variable. Psychology majors only, registration by permission of faculty supervisor.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 2443, Section #: 1, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Barber, Status: Open\nClass Nbr: 2452, Section #: 10, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: W. Craighead, Status: Open\nClass Nbr: 2453, Section #: 11, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: L. Craighead, Status: Open\nClass Nbr: 2454, Section #: 12, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. Dilks, Status: Open\nClass Nbr: 2455, Section #: 13, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. Edwards, Status: Open\nClass Nbr: 2456, Section #: 14, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: E. Emory, Status: Open\nClass Nbr: 2457, Section #: 15, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: R. Fivush, Status: Open\nClass Nbr: 2458, Section #: 16, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: S. Goodman, Status: Open\nClass Nbr: 2459, Section #: 17, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: H. Gouzoules, Status: Open\nClass Nbr: 2461, Section #: 19, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: S. Hamann, Status: Open\nClass Nbr: 2444, Section #: 2, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: P. Bauer, Status: Open\nClass Nbr: 2462, Section #: 20, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: R. Hampton, Status: Open\nClass Nbr: 2463, Section #: 21, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: P. Hitchcock, Status: Open\nClass Nbr: 2464, Section #: 22, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: E. Johnson, Status: Open\nClass Nbr: 2465, Section #: 23, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Kazama, Status: Open\nClass Nbr: 2466, Section #: 24, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: E. Kim, Status: Open\nClass Nbr: 2467, Section #: 25, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Kelly, Status: Open\nClass Nbr: 2468, Section #: 26, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: P. Kragel, Status: Open\nClass Nbr: 2469, Section #: 27, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: S. Lourenco, Status: Open\nClass Nbr: 2470, Section #: 28, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. Maney, Status: Open\nClass Nbr: 2471, Section #: 29, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Manns, Status: Open\nClass Nbr: 2445, Section #: 3, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: G. Berns, Status: Open\nClass Nbr: 2472, Section #: 30, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Medina, Status: Open\nClass Nbr: 2473, Section #: 31, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: L. Nygaard, Status: Open\nClass Nbr: 2474, Section #: 32, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: P. Palmer, Status: Open\nClass Nbr: 2475, Section #: 33, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Rilling, Status: Open\nClass Nbr: 2476, Section #: 34, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: P. Rochat, Status: Open\nClass Nbr: 2477, Section #: 35, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: H. Rodman, Status: Open\nClass Nbr: 2478, Section #: 36, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: C. Saulnier, Status: Open\nClass Nbr: 2479, Section #: 37, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Siller, Status: Open\nClass Nbr: 2480, Section #: 38, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Tasimi, Status: Open\nClass Nbr: 2481, Section #: 39, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Treadway, Status: Open\nClass Nbr: 2446, Section #: 4, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: N. Bliwise, Status: Open\nClass Nbr: 2482, Section #: 40, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: I. Waldman, Status: Open\nClass Nbr: 2483, Section #: 41, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: E. Walker, Status: Open\nClass Nbr: 2484, Section #: 42, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: B. Wilson, Status: Open\nClass Nbr: 2485, Section #: 43, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: P. Wolff, Status: Open\nClass Nbr: 2487, Section #: 44, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: B. Yamasaki, Status: Open\nClass Nbr: 2447, Section #: 5, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: S. Botto, Status: Open\nClass Nbr: 2448, Section #: 6, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: P. Brennan, Status: Open\nClass Nbr: 2449, Section #: 7, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: V. Brown, Status: Open\nClass Nbr: 2450, Section #: 8, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Y. Cheong, Status: Open\nClass Nbr: 2451, Section #: 9, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Cohen, Status: Open",
    "date_accessed": "2024-03-29"
}