{
    "course_code": "POLS 326",
    "course_title": "Western European Politics",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 35 / Seats Avail: 15",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "This course examines the contextual, institutional, and developmental variations of politics in Western Europe. Theoretically and substantively it focuses on two parallel trends in which contemporary Europe appears to be \"pulling in two directions\": its increasing economic and political integration; and its heightened emphasis on regionalization, including social identity and political activity. The course will consider the causes and consequences of these simultaneous although, at times, somewhat contradictory tendencies of \"pulling in two directions.\" As an upper-division course in Political Science, the class will analyze five major European political systems: the United Kingdom, the Federal Republic of Germany, France, Italy, and Spain. The course will also devote a significant amount of time to the European Union and these countries' relationship to it. As well, frequent references will also be made to other European political systems. Throughout the semester, students will be encouraged to draw comparisons between the governmental institutions and political processes of these and other European systems.",
    "course_description": "Suggested prerequisite: Political Science 120. Comparative examination of the contemporary political systems of democratic Europe.",
    "prerequisites": null,
    "instructors": "Thomas D Lancaster - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Candler Library 114",
    "course_resources": null,
    "sections": "Class Nbr: 2591, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: T. Lancaster, Status: Open",
    "date_accessed": "2024-03-30"
}