{
    "course_code": "POLS 313W",
    "course_title": "Rch: Intl.Organizations",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 4",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "International institutions: including formal inter-governmental organizations (IGOs), laws, and rules, as well as informal arrangements; are the centerpiece of inter-state interactions. Why do states choose to organize their interactions using international institutions of various types? Why do such institutions take on the form that they do? How do they work? How effective are they in shaping outcomes and behaviors in world politics, and under what circumstances? This course pursues a theoretical approach to answering these questions, and applies those insights in comparative analysis of international organizations and institutions in a variety of settings, from security arrangements, such as alliances and the collective security operations of the United Nations Security Council, to global and regional financial, development, and trade organizations, international courts, and international organizations in areas such as human rights and global economic cooperation.",
    "course_description": "Suggested prerequisite: Political Science 110. Nature and development of international organization, with emphasis on the interaction between international systems and organizations.",
    "prerequisites": "POLS 208 or POLS_OX 208 or equivalent transfer credit as prerequisite.",
    "instructors": "Eric Reinhardt - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in Tarbutton Hall 105",
    "course_resources": null,
    "sections": "Class Nbr: 3116, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: E. Reinhardt, Status: Open",
    "date_accessed": "2024-03-30"
}