{
    "course_code": "POLS 494W",
    "course_title": "Research Topics Seminar in Political Sciences: Gender, Race, & Pol. Rep.",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 6 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Same as WGS 475RW 1)\nSAME AS POLS 494W\nHow do race, gender, and sexuality affect who runs for and wins election to public office? What difference does the election of more women, people of color, and LGBTQ individuals really make? Would it mean that women and minorities (racial, ethnic, and/or sexual) are better represented? What does it mean to represent women, racial/ethnic minorities, or sexual minorities? This course will address these questions from the perspective of legislative politics in the United States, at both the national and state levels. We will begin with a brief examination of the meaning and value of political representation. Then we will explore the empirical research on the politics of race, gender, sexuality, and representation as it relates to: candidate emergence, elections, legislative behavior, and the policymaking process. Throughout the course, in readings, discussions, and assignments, students will compare \"single-axis\" approaches to studying the politics of race, gender, and sexuality to more intersectional approaches.",
    "course_description": "Research Seminar on selected topics and problems in political science. Class will fulfill the \"research\" requirement for the political science major. May be repeated for credit when the topic varies.",
    "prerequisites": "POLS 208 or POLS_OX 208 or equivalent transfer credit as prerequisite.",
    "instructors": "Beth Reingold - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Anthropology Building 107",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 4237, Section #: 2, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: B. Reingold, Status: Wait List",
    "date_accessed": "2024-03-30"
}