{
    "course_code": "POLS 494W",
    "course_title": "Research Topics Seminar in Political Sciences: Israel/Palestine WorldPolitics",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 3 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Same as JS 471W 1, HIST 496W 1 and MESAS 470W 1)\n\n\nEver since the emergence of the Zionist movement in the late 19th century, the political future of the land known as both Israel and Palestine has been the subject of fierce international debate. This seminar will examine how, exactly, this land has been discussed in international forums and in various countries, as well as how leaders of both Israelis and Palestinians have worked to chart a foreign policy for their respective peoples. Students will be given an overview of Israeli foreign policy and Palestinian attempts at global outreach since 1948 before the course moves on to explore the politics of the Israeli-Palestinian conflict in various regions of the world.\nCourse requirements include regular preparation and participation, facilitating one classroom discussion, one short review essay, and a final original research paper. While there is no fixed prerequisite for the course, students should either have some background in the politics and history of Israel or the Middle East, or have previous studied another country or region that they plan to examine in their research.\n\n\nNote: this is not an introductory course. Students without any background on the topic may wish to instead enroll in the \"Israeli-Palestinian Conflict\" taught in Spring 2024 or other 200-level courses on Israel/Palestine.",
    "course_description": "Research Seminar on selected topics and problems in political science. Class will fulfill the \"research\" requirement for the political science major. May be repeated for credit when the topic varies.",
    "prerequisites": "POLS 208 or POLS_OX 208 or equivalent transfer credit as prerequisite.",
    "instructors": "Geoffrey Levin - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in Callaway Center N204",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 4819, Section #: 3, Type: LEC, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: G. Levin, Status: Wait List",
    "date_accessed": "2024-03-30"
}