{
    "course_code": "SPAN 111",
    "course_title": "Intensive Spanish",
    "credit_hours": "4",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Varies by section",
    "instruction_method": "Blended/Hybrid",
    "typically_offered": "Spring",
    "requirement_designation": "Humanities, Arts, Language [Foreign Language]",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "** This class will meet in person on MW and online on Fridays**\n(Spanish 111 is an accelerated beginning-level language course designed to advance students towards a higher level of proficiency in both communication in the Spanish language and cultural knowledge of Hispanic communities. The course is intended for students with previous education in Spanish who need additional review and practice before advancing to the intermediate level. Because class meetings are reserved for hands-on practice in this integrated skills course that strives to develop students: listening, reading, speaking, and writing skills, students are required to study concepts and complete online activities before coming to class. Evaluation is based on timely completion of assigned online activities, end-of-unit projects, exams, and participation. Text Lord, Gillian and Amy Rossomondo. Contraseña: Your Password to Foundational Spanish. Lingrolearning: New York. 2019). Access must be purchased directly from www.lingrolearning.com Prerequisite: Placement into Span 111. Take the exam at http://spanport.emory.edu/home/undergraduate/placement/index.html)",
    "course_description": "Accelerated beginning-level language course intended for students with previous education in Spanish who need additional review and practice before advancing to the intermediate level.",
    "prerequisites": null,
    "instructors": "Begona Claveria - Primary Instructor",
    "schedule_location": "Varies by section",
    "course_resources": null,
    "sections": "Class Nbr: 1268, Section #: 1, Type: LEC, Campus: ATL, Meets: MWF 11:30a-12:45p, Instructor: B. Claveria, Status: Open\nClass Nbr: This section is full 2432, Section #: 2, Type: LEC, Campus: ATL, Meets: MWF 1-2:15p, Instructor: B. Claveria, Status: Wait List",
    "date_accessed": "2024-03-30"
}