{
    "course_code": "SPAN 304",
    "course_title": "Introduction to Spanish Linguistics",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 14 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "Humanities, Arts, Language [Foreign Language]",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "(What are the building blocks of the Spanish language, and how are they arranged and used to comprise what we now define as \"Spanish\"? This course, taught in Spanish, explores answers to these questions by presenting students with fundamental concepts of Spanish Linguistics through examination of a brief history of the field of Linguistics, a brief presentation of the sounds of Spanish (phonetics and phonology), the structure of words (morphology), sentence structure (syntax), the study of meaning (semantics and pragmatics) and linguistic variation in the Spanish-speaking world (sociolinguistics, or how speakers vary their use of the system in different contexts and for different purposes). (Particulars: No previous study of Linguistics is required. Evaluation is based on active class participation, exams (midterms and a final) and homework assignments. Prerequisite: SPAN 212 OR Placement into a Foundational Course, or permission from instructor. Take the online placement exam at http://spanport.emory.edu/home/undergraduate/placement/index.html)\n\n\nSame as LING 304-1",
    "course_description": "Foundational course for the major and the minor that introduces students to the field of Hispanic linguistics, including phonetics, phonology, morphology, pragmatics, and linguistic variation in the Spanish-speaking world.",
    "prerequisites": null,
    "instructors": "Robyn Clarke - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in Callaway Center C203",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 1281, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: R. Clarke, Status: Wait List",
    "date_accessed": "2024-03-30"
}