{
    "course_code": "SPAN 302W",
    "course_title": "Modern Hispanic Texts & Contexts",
    "credit_hours": "4",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Varies by section",
    "instruction_method": "Varies by section",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Language with Writing",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "CONTENT: The topic of this course is cultural production in Spanish-speaking countries from the 18th century to the present. In the 18th century, ideas of the Enlightenment influenced Spanish speakers to challenge ruling structures, including Spain's monarchic rule in the Americas. Over the course of the 19th century, the majority of Spain's former colonies would become independent nations while others transitioned into different colonial regimes. We will look at the efforts of Latin American and Spanish artists and intellectuals who lived through these historical changes to define national, regional, and individual identities through writing and other means. \nTEXT: There is no required textbook. Course readings will be made available online. PARTICULARS: Evaluation is based on active class participation, short writing assignments, and four essays, to be revised with peer feedback. SPAN 302W is a Foundational Course for the Spanish major and minor and satisfies the Continuing Writing Requirement. PREREQUISITE: Spanish 212 or Official Spanish Placement for a Foundational Spanish Course.",
    "course_description": "A survey course in Spanish and Spanish American culture from the eighteenth century to the present.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": "Varies by section",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 1271, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 4-5:15p, Instructor: K. Ostrom, Status: Wait List\nClass Nbr: 2463, Section #: 2, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: D. Nichols, Status: Open",
    "date_accessed": "2024-03-30"
}