{
    "course_code": "SPAN 410",
    "course_title": "Topics in Spanish Linguistics: Language and Migration",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "CONTENT: In the last decade different media outlets have circulated discourses (e.g. images, sounds, videos) depicting an \"asylum crisis\" worldwide. These discourses portray the asylum seekers as benevolent and in need of help, or as invaders that would take away resources. The dialectical of the \"good\" and \"bad\" asylee are embedded in discourse of ethical responsibility, national borders, and xenophobia among many other ideologies. This course will investigate the politics of representation that let some people in, while keeping others out. We begin by setting out important questions: Why do people migrate across international borders? Can states control migration, including \"unwanted\" migrants? How do we understand the politics of immigration? What is the language of the law and who interprets it? Focusing on linguistic and discursive practices this course will analyze how language construct national identities and a sense of belonging. Throughout the course, we will be reading and discussing some foundation works around temporariness, refugees and forced migration, on the key questions of citizenship, rights, and nationalism. The course will require students to pick a transnational community and to develop reflective projects focusing on these key questions. PREREQUISITE: At least one Foundational Course (300-318W)\n\n\nSame as LING 410-1",
    "course_description": "Upper-level research seminar on topics of Hispanic linguistics and communication, such as history of the language, bilingualism, or translation. Students may take multiple SPAN 410 courses provided that they focus on different topics.",
    "prerequisites": null,
    "instructors": "Xochiquetzal Marsilli-Vargas - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in New Psyc Bldg 225 (36 Eagle Ro",
    "course_resources": null,
    "sections": "Class Nbr: 1279, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: X. Marsilli-Vargas, Status: Open",
    "date_accessed": "2024-03-30"
}