{
    "course_code": "SPAN 485",
    "course_title": "Topics in Hispanic Culture: Transpacific Latinidad",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 4Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "The Pacific is the largest ocean on Earth separating the Americas and Asia, and a contact zone where peoples, cultures, commodities, and ideas have circulated for centuries. This course considers Latinidad in transpacific connections between Latin/x America and Asia from the Spanish colonial era to the present. Focusing on how Latin/x America has been shaped by its real and imaginary relations with Asia, we will examine cultural productions related to historical events including Manila galleon trade, traffic in Chinese indentured workers, Latin American modern nation-building, Japanese immigration, Sendero Luminoso in Peru, Cold War armed conflicts in Korea and Vietnam, and East Asian maquiladoras in the U.S-Mexico border. Exploring multiple genres of texts, novels, poems, short stories, political essays, and film, students will learn the importance of Latin/x American-Asian relations in regional and transregional formation of race, gender, nation, and (anti)capitalistic system.\nPrerequisite: at least one Foundational Course (SPAN 300-318W)",
    "course_description": "Upper-level research seminar on topics related to the language, discourse, literature, and/or culture of the Hispanic world. Students may take multiple SPAN 485 courses provided that they focus on different topics.",
    "prerequisites": null,
    "instructors": "Yeongju Lee - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Candler Library 121",
    "course_resources": null,
    "sections": "Class Nbr: 2979, Section #: 3, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: Y. Lee, Status: Open",
    "date_accessed": "2024-03-30"
}