{
    "course_code": "SPAN 485",
    "course_title": "Topics in Hispanic Culture: Race and Latin American Cinema",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 13Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "This course explores the role of cinema in constructing and mediating ideas about race throughout Latin America from the early 20th century through the 21st. As a popular visual medium central to the processes of nation building, cinema in the region provides a unique vantage point to understand the multiple and vying proposals regarding the role of racial plurality in local projects of identity. Students will study films from Mesoamerica, the Andes, Brazil and Cuba with attention to both their production contexts within the broad history of filmmaking in Latin America and the social and historical processes unfolding in the places of production. Critical race theory and film theory about race will ground discussions about the relationship between race and cinematic representation in this course. Students will acquire knowledge of the periods of Latin American cinema history and a familiarity with critical approaches to the study of race and cinema. Students will also develop the capacity to speak and write about film analysis in both narrative and technical terms in Spanish. In this discussion-based seminar students are expected to lead class discussions and deliver oral presentations. Students will also produce written essays in Spanish including 2 short technical analyses and 2 research papers.) (Pre-requisites include 2 courses taken at the 300 level or equivalent credits. Students interested in this course should attend class from the first day of the semester.)",
    "course_description": "Upper-level research seminar on topics related to the language, discourse, literature, and/or culture of the Hispanic world. Students may take multiple SPAN 485 courses provided that they focus on different topics.",
    "prerequisites": null,
    "instructors": "Mónica García Blizzard - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Callaway Center S102",
    "course_resources": null,
    "sections": "Class Nbr: 2985, Section #: 5, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: M. García Blizzard, Status: Open",
    "date_accessed": "2024-03-30"
}