{
    "course_code": "PRS 580D",
    "course_title": "Research Design & Grant Preparation",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-01-07 through 2022-04-10",
    "class_notes": "EMPH Students Only; Outside permission to enroll in course must be approved by EMPH leadership. Additional meeting times on Saturday of Opening & Saturday of Closing  from 4:30-6:00pm. EMPH Opening Weekend is 1/7-1/9 and Closing Weekend is 4/8-4/10.",
    "course_description": "Explores the basics of the scientific methods used in public health research. Covers how to state hypotheses, critique the scientific literature, develop a research design to test stated hypotheses, and write a research proposal. Compares and contrasts proposal writing and grant writing. This course will cover the basics of the scientific methods used in public health research. The course will describe different types of research designs and statements of hypotheses or research questions. Discussions and assignments will include critiquing scientific literature, developing a research design to test stated hypotheses, and writing a proposal for a research study or an intervention program. Assignments will allow students to evaluate research designs, describe elements of a study proposal, distinguish between research proposal writing and program grant writing, and write a competitive grant proposal in their field of work or study.",
    "prerequisites": null,
    "instructors": "Johanna M Hinman - Primary Instructor",
    "schedule_location": "FSa 8:30am-11:30am in Grace Crum Rollins 105\nSa 4:30pm-6pm in Grace Crum Rollins 105",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3293, Section #: 901, Type: SEM, Campus: ATL, Meets: FSa 8:30-11:30a; Sa 4:30-6p, Instructor: J. Hinman, Status: Closed",
    "date_accessed": "2024-03-30"
}