{
    "course_code": "THEA 289",
    "course_title": "Special Topics: Theatre: Ancient Drama",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 8",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Same as CL 214 1)\nA survey of classical drama in its social context with particular attention to Greek tragedy in the formative period of the fifth century BCE. We will begin by reading and discussing representative dramas from the three major Greek tragedians, Aeschylus, Sophocles, and Euripides. We will also consider the only surviving satyr-drama and a few comedies by Aristophanes, two influential critiques of drama by Plato and Aristotle and will also consider the social, political and religious context of drama, including drama's origins in a festival for the god Dionysus. In the last part of the course, we will examine the surprise ending to the history of Greek tragedy in the invention of a new form of comedy that influenced Shakespearean comedy, by reading several examples of the so-called New Comedy from Rome. We will finish up by reading a few plays from the Roman philosopher Seneca, whose tragedies seem to revel in the bizarre and unnatural. I hope and expect to spend a good portion of most classes in discussion rather than lecturing. \nPrerequisites: There is no specific prerequisite to the course, but some previous background in Greek literature, mythology or history will be helpful.",
    "course_description": "Individual courses on special topics in theater at the 200-level. This course may be repeated.",
    "prerequisites": null,
    "instructors": "Louise Pratt - Primary Instructor",
    "schedule_location": "TThF 1pm-1:50pm in Atwood Chemistry Bldg. 316",
    "course_resources": null,
    "sections": "Class Nbr: 4462, Section #: 2, Type: LEC, Campus: ATL, Meets: TThF 1-1:50p, Instructor: L. Pratt, Status: Open",
    "date_accessed": "2024-03-30"
}