{
    "course_code": "WGS 285W",
    "course_title": "Variable Topics in Women, Gender & Sexuality Studies: Feminist Science Studies",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "\"Science\" and \"feminism\" are not terms that go together very easily. Science has long held Enlightenment values of apolitical objectivity, and neutrality that seem deeply in tension with \"feminism\" as a radically politicized way of understanding the world. This course offers an introduction to the major histories, debates, and questions that constitute the field of feminist STS. We will read key feminist texts to help us understand the relationship between science and gender, race, class, and nationality. Students will become familiar with important concepts and case studies; analyze how power, identity, and politics shapes the development of scientific knowledge; and evaluate and critique events in the history of biology, neuroscience, physics, technology, and medicine. In this course, we will pay close attention to discourses of life, sex, and reproduction, tracking how these concepts have evolved with the rise of molecular biology and biotechnologies. We will investigate the historical and philosophical conditions in which biological bodies have become sites of engineering, or \"living technologies.\" Discussions will center topics such as genetics, eugenics, forced sterilization, abortion, birth control, psycho-pharmacology, and hormone replacement theory in the context of feminist analyses of safety, justice, racialization, and self-determination. This course emphasizes readings, class discussion, and development of a final research paper.",
    "course_description": "Offerings vary each semester.",
    "prerequisites": null,
    "instructors": "Mitchell Murtagh - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Math & Science Center - N301",
    "course_resources": null,
    "sections": "Class Nbr: 6021, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: M. Murtagh, Status: Open",
    "date_accessed": "2024-03-30"
}