{
    "course_code": "WGS 315",
    "course_title": "The Sex of Race",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 2Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Irregularly",
    "requirement_designation": "HSC w/Race & Ethnicity Req.",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "Does race have a sex, that is, an embodied gender as well as a sexuality? This course proposes that it does. Bodies are gendered and sexualized at one and the same time as they are racialized. This process is historically and conceptually inseparable from a history of racisms.\nThis course frames racialized gender and sexuality from a global world-historical perspective. We will explore how the modern history of imperialism, settler colonialism, and enslavement, in tandem with racial science, has durably ascribed deviant gender and sexuality to racialized bodies. We will see how postcolonial states have, at times, responded by embracing Euro-Christian ideals of heterosexual monogamy and projecting sexual deviance onto the West. We will ask, throughout, how these histories continue to haunt us today, and we will close by considering how we might both survive and rewrite them.",
    "course_description": "This interdisciplinary course demonstrates how histories of settler colonialism, imperialism, racial \"science,\" and enslavement generated racial categories that were inherently sexed and gendered. It asks how these histories influence the contemporary experience of racialized sexuality.",
    "prerequisites": null,
    "instructors": "Kadji Amin - Primary Instructor",
    "schedule_location": "TTh 5:30pm-6:45pm in Candler Library 121",
    "course_resources": null,
    "sections": "Class Nbr: 2491, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 5:30-6:45p, Instructor: K. Amin, Status: Open",
    "date_accessed": "2024-03-30"
}