{
    "course_code": "WGS 347",
    "course_title": "Gender and Global Health",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Same as SOC 347 1)\nCourse Name: Gender, Society, and Health: Global Perspectives \nCourse Description:\n \nWhat are the global patterns and perspectives on gender and health? How do societal contexts and factors shape gender and health around the world? And what are people's aspirations for their health and wellbeing? This lecture-discussion based course will address these questions through a presentation of interdisciplinary theories, research, and case studies across diverse settings, with a particular focus on low and middle-income countries. \nWe begin with an overview of global patterns of gender and health in terms of mortality, morbidity, and mental health. We move on to understanding the societal factors that shape these patterns. We then hear testimonies and case studies about people's aspirations and activism for gender and health. We end with learning about ways in which governments, research, activism, and society can collectively work towards improving health. \nBy the end of this course, you will be able to:\nExplain global patterns of gender and health\nAssess societal factors that affect gender and health in diverse global settings\nEvaluate empirical evidence, apply theoretical knowledge, and learn research skills to topics related to gender and health.",
    "course_description": "Overview of theories, case studies, and social policies related to men and women's health in resource-poor countries.",
    "prerequisites": null,
    "instructors": "Kanika Sharma - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Tarbutton Hall 105",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 4357, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 10-11:15a, Instructor: K. Sharma, Status: Wait List",
    "date_accessed": "2024-03-30"
}