{
    "course_code": "WGS 490RW",
    "course_title": "Senior Sem in Women, Gender, & Sexuality Studies",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": "Department Consent Required",
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "This course explores trans, queer and feminist traditions of care. Students will focus on what distinguishes radical care from other forms of care work. Theory and practice of care have traversed feminist, queer, and trans spaces, intersecting with disability studies to inform a crip theory that ties together race, sexuality, and disability. Drawing on a diverse array of thinkers, we take up the interventions of thinkers such as Audre Lorde, S. Lochlann Jain, Marty Fink, Christen Smith, Juno Parreñas, Hi'ilei Julia Kawehipuaakahaopulani Hobart, and Tamara Kneese to examine the ways in which care for ourselves, our kin, our communities, our non-human kin, and our planet is both capacitated and limited by structure. We ask what conditions are necessary to produce radical care?\nThe course will be taught as a discussion-based, writing-intensive seminar. The course will encourage you to think about how a body of theoretical work is constructed, how it can be read, and how it can be used in a number of different contexts to produce both scholarly texts and critique, as well as trans, feminist and queer practices. Over the course of the semester, you will write a research paper; emphasis will be on developing the skills necessary for writing about complex material, and on encouraging you to build an independent and nuanced critical position about contemporary issues in relation to care. Research papers from this course will be showcased in the WGSS Undergraduate Senior Symposium.",
    "course_description": "Exploration of selected topics pertaining to women, gender, and feminist theory. Each year the seminar has a specific theme that is designed to integrate central questions, topics, and problems of method. This course is offered only in the fall and is open to seniors who are Women's, Gender, and Sexuality Studies majors or minors.",
    "prerequisites": null,
    "instructors": "Sameena Mulla - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in Tarbutton Hall 111",
    "course_resources": null,
    "sections": "Class Nbr: 2496, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 10-11:15a, Instructor: S. Mulla, Status: Open",
    "date_accessed": "2024-03-30"
}