{
    "course_code": "WGS 700",
    "course_title": "Women, Gender, & Sexuality Studies  Pro-Seminar",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 8",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "Course Description:\nWhat is Womens, Gender, and Sexuality Studies Is it necessary to commit to one of these categories in order to be a WGSS scholar? Is it possible to understand oneself as a WGSS scholar in a radically different way, e.g. through (an)other field/discipline altogether? Designed for WGSS doctoral students, this course explores the question of WGSS in the current North American context. Related themes will include the location/relation of studies in gender, sexuality, race, and feminism in relation to WGSS; the meaning and role of interdisciplinary scholarship; the question of feminist politics in relation to scholarship, and form and function of identity in being a WGSS scholar. Other questions may include the following: how should we understand race and gender in relation to each other? Does prioritizing one over the other change one's relation to WGSS? What places do political structures, from empire, capitalism, liberalism, corporate institutions have in shaping our understandings of the WGSS? What is the relationship between theory in relation to questions of scholarship and/or justice? We will read mostly contemporary pieces that address these questions, and readings may shift as the conversation shifts through the term.\n\n\n(Permission Required Prior to Enrollment)",
    "course_description": null,
    "prerequisites": null,
    "instructors": "Aisha Finch - Primary Instructor",
    "schedule_location": "W 1pm-3:45pm in Candler Library 125",
    "course_resources": null,
    "sections": "Class Nbr: 2533, Section #: 1, Type: LEC, Campus: ATL, Meets: W 1-3:45p, Instructor: A. Finch, Status: Open",
    "date_accessed": "2024-03-30"
}