{
    "course_code": "WGS 752R",
    "course_title": "Queer Theory",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 7 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Same  as ENG 789 4)\nCourse Description:\nWhen queer theory emerged in US English Departments around 1990, 'high' theory held significant cultural capital in the Humanities, the \"linguistic turn\" was in full force, gays and lesbians could not legally marry or even have sex in many states, homophobia was the norm, and LGBT culture and sexuality were considered scandalous. By contrast, today in the US, the heyday of high theory is over, many have turned away from the linguistic turn, gays and lesbians can legally marry and have sex, homosexuality is increasingly acceptable, and LGBT people have become the figureheads for \"homonationalist\" politics. What is the place of queer theory in this changed landscape?\nBy now, early queer theory has been thoroughly critiqued for its implicit whiteness, its US-centrism, its linguistic basis, and its bias towards humanistic methods and habits of thought. At the same time, the interdisciplinary and increasingly global field of Queer Studies is flourishing. What aspects of queer theory still have a future? What is the relationship between queer theory and Queer Studies? Does queer theory itself need to be radically remade for a changed world? \nThis course will explore the career of queer theory in its material context. It will attend to key critiques of queer theory and foreground provocative new works proposing a different way forward for the field.\n\n\nInstructor Consent Required",
    "course_description": null,
    "prerequisites": null,
    "instructors": "Kadji Amin - Primary Instructor",
    "schedule_location": "Th 2:30pm-5:15pm in Candler Library 125",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2532, Section #: 1, Type: LEC, Campus: ATL, Meets: Th 2:30-5:15p, Instructor: K. Amin, Status: Closed",
    "date_accessed": "2024-03-30"
}