{
    "course_code": "REL 170",
    "course_title": "Special Topics in Religion: The Bible",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 0 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "This course satisfies the Religion major requirement:- Tradition-Christianity. \nWhat is the Bible? Answering this deceptively simple question will be the focus of this course, which will provide an introduction to and overview of the Bible in its various forms and versions, Jewish and Christian, with a special focus on the Bible's role in the so-called \"Western\" tradition. While the course will give significant attention to how various communities identify, interpret, and appeal to the Bible as a sacred and authoritative book, no particular position of belief about the Bible will be assumed or required for participation in the course, nor will any prior knowledge of the Bible be expected. The course is for students who have been reading the Bible all their lives as well as those who will be opening its covers for the first time. Emphasis will be placed on the primary reading of biblical texts and class discussion.\nThis course is part of the ECAS Voluntary Core Curriculum Program. First year students are enrolled first.",
    "course_description": "Variety of subjects pertaining to religion at an introductory level. Content will vary in successive offerings. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "William K Gilders - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Candler Library 122",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_REL_170_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: This section is full 3168, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: W. Gilders, Status: Closed",
    "date_accessed": "2023-10-31"
}