{
    "course_code": "REL 210R",
    "course_title": "Classic Religious Texts: Grief/Mourning Sanskrit Trad.",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 13Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities and Arts(*)",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Complete Topic: Grief and Mourning in the Sanskrit Tradition\nThis course satisfies the Religion major requirement:- Tradition-Hinduism, Region.\nAn exploration of how Sanskrit authors understood grief, and how they proposed we cope with it. The grief we will be concerned with ranges from sorrow at the loss of a loved one to everyday disappointment.\n\"Here I am, sir, a man full of grief,\" declares sage Narada in the Chandogya Upanishad. \"Please, sir, take me across to the other side of grief.\" Narada's request, simple and devastating, raises a number of questions. Where exactly is \"the other side of grief\"? Is it a real place, or just a fantasy land? If it's real, how do we get there? If griefless life were even possible, would such a life be worth living? Sanskrit authors tackled such questions head-on, and in this course we will explore some of the answers they came up with. The texts we shall discuss are drawn primarily from Hindu and Buddhist scripture and literature, and include the Bhagavad Gita, The Life of Buddha, selections from the Mahabharata and Ramayana, and laments in the works of Kalidasa. Throughout the course, we will also be interested in how these texts' ideas about grief were received by authors outside the Sanskrit tradition (such as Emerson, Nietzsche, and Freud), and how they compare with the most popular ideas about grief and mourning in our own culture.",
    "course_description": "This course will explore classic religious texts in depth, developing skills to interpret sacred, philosophical and ethical works. Social, cultural, and/or philosophical contexts at work will provide interpretive frameworks.",
    "prerequisites": null,
    "instructors": "Shiv Subramaniam - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in Callaway S107",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_REL_210R_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 6230, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: S. Subramaniam, Status: Open",
    "date_accessed": "2024-03-31"
}