{
    "course_code": "REL 341",
    "course_title": "Medieval Jewish Thought",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 8",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Title: Moral and Political Thought of Maimonides\nSame as JS 341-1 and PHIL 385-3\n\n\nMoses Maimonides (1135-1204) was the single most influential Jewish philosopher and Jewish law authority of the Middle Ages. He is also still invoked today on a wide variety of topics including religion and race, science and superstition, the balance between social order and individual autonomy. That is all the more amazing because he spent his early years as a refugee from Spain, to Morocco, to Egypt. In this class we will seek first of all to understand Maimonides: moral and political thought in the context of its own time through reading of primary sources (all in English translation) and some secondary sources. We will also touch on his relationship to contemporary Muslim thinkers, like Alfarabi, Al-Ghazali, and Averroes-- as well as Talmud, Bible, Plato and Aristotle. At the same time, we will constantly pause to ask whether or not this great medieval thinker may still have some relevance for our own society today. What, if anything, can Maimonides teach us about the political and religious role of philosophy, universalism and particularism, ideas about race and nationality, or the relationship between law and spirituality? This class does require reading, but it has no prerequisite. You do not need to know Hebrew. You do not need to know medieval philosophy. You do not need to have a Jewish background in order to do well in this class. You just need to show up prepared to discuss the readings each week and bring your moral imagination.\n\n\nThis course satisfies the new Religion major requirement:- Tradition- Judaism, and can count as a JS major or minor Elective.",
    "course_description": "Intensive study of a major work on an important theme in medieval Jewish thought such as Maimonides' Guide for the Perplexed, Saadia's Beliefs and Opinions, and medieval Jewish exegesis of the Bible.",
    "prerequisites": null,
    "instructors": "Don Seeman - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in White Hall 200",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_REL_341_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 4549, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 10-11:15a, Instructor: D. Seeman, Status: Open",
    "date_accessed": "2024-03-31"
}