{
    "course_code": "REL 371",
    "course_title": "Special Topics in Religion and Law: Religion and Law: Arts",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 20Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "This course satisfies the Religion major requirement:- Theme.\nTopic: Religion and Law: Arts\nTo many, 'religion and law' is a field of study limited only to lawyerly engagement in constitutional conversations about religious freedom, or guidance from clergy concerning religious codes.  This is part of it, but it's not the full story. The field contemplates all manner of questions, issues, topics, events that mark our deeply diverse and divided society. More than just a distant field, law and religion meets us where we are, contributing - often in subtle ways -  to our stories as citizens, group members, and individuals.\n\n\nIn this course, we will engage the way in which law and religion shows up in our cultural conversations, media, and any number of artistic mediums.  Through film, literature, art, architecture, and more, this course will explore the ways in which 'religion and law' intersect and are used to pursue diverse ends in several spheres, including in political life, social justice struggles, and in community conversations and spaces.   Each week we will explore these themes through different artistic mediums and representations, paying particular attention to the ways in which law and religion are employed to convey distinct messages and achieve certain aims, and, reciprocally, how societal preoccupation with religion and law pushes development and innovation in various forms of artistic expression.",
    "course_description": "Through variables such as arts, politics, freedom, race, nd coloniality, this repeatable special topics course will explore various ways in which religion and law intersect and pose questions in political life, social justice struggles, community conversations and spaces, and cultural consciousness.",
    "prerequisites": "REL 250 or equivalent transfer credit as prerequisite.",
    "instructors": "Ariel Liberman - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in Woodruff Library 875",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_REL_371_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 5340, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: A. Liberman, Status: Open",
    "date_accessed": "2023-10-31"
}