{
    "course_code": "REL 354RW",
    "course_title": "Ethics: Human Goodness",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 0Waitlist Total: 54",
    "waitlist_total": ": 54",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "This course satisfies the Religion major requirement:- Theme.\nOur seminar will explore a single, though not a simple, question:  \nWhat is human goodness?  What sorts of lives are good lives?  How might goodness relate to our flourishing?  \n- Our approach will be broadly philosophical. We will read and discuss together a range of texts as we pursue our questions about goodness, ethics, and forms of life.  Some texts will be philosophical and theological, some biographical, some literary, some filmic.   \n- This is a discussion class: we are in this together.  We learn from one another as well as from our readings, so bring yourselves to the table.  Your attendance and participation are essential to the success of this course and to its learning goals.  We build these conversations together, as an activity in community.  I do not have content to \"download.\"Requirements include attendance and participation, a short weekly journal, and one final written project.\n\n\nSelected essays will be on electronic reserve accessible through our course¿s Canvas site.  \nThe following texts will be available through Emory Bookstore: \n- Plato, Trial and Death of Socrates, trans. Grube (Hackett ed.)\n- Douglass, Frederick.  Narrative of the Life of Frederick Douglass (Norton ed.)\n- Kidder, Mountains Beyond Mountains",
    "course_description": "Analysis of methods and/or texts pertaining to ethical decision-making for individual and social problems such as race, sex/marriage, justice, war, biomedical technology, and environmental pollution. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Pamela M Hall - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in Callaway S107",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_REL_354RW_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: This section is full 3200, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 10-11:15a, Instructor: P. Hall, Status: Wait List",
    "date_accessed": "2023-10-31"
}