{
    "course_code": "REL 371",
    "course_title": "Special Topics in Religion and Law: Federal Indian Law",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 2 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Topic: Federal Indian Law\nThis course satisfies the Religion major requirement: - Theme, Region \nPermission Required Prior to Enrollment. To request permission to register, contact Prof. María M. Carrión - mcarrio@emory.edu\nThe prerequisite for this course will be waived.\nLaw school schedule: Tuesday and Thursday 10:15 am-11:45 am\nThe course will encompass a survey of the governmental policies, court cases, statutes, regulations, treaties, and executive orders that together have set the legal framework between the U.S. government and the 574 sovereign tribal nations currently recognized under federal law. It will chart the historical development of Federal Indian Law beginning with the jurisprudence of the Marshall Court and continuing to the contemporary era of tribal self-determination and nation-building. Included within the curriculum will be discussion of issues such as land rights, criminal jurisdiction, gaming, religious freedom, and international law. Attendance will be mandatory for all classes.",
    "course_description": "Through variables such as arts, politics, freedom, race, nd coloniality, this repeatable special topics course will explore various ways in which religion and law intersect and pose questions in political life, social justice struggles, community conversations and spaces, and cultural consciousness.",
    "prerequisites": null,
    "instructors": "Douglas Waters Jr. - Primary Instructor",
    "schedule_location": "TTh 10:15am-11:45am in Gambrell Hall 5C",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_REL_371_3_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 5807, Section #: 3, Type: LEC, Campus: ATL, Meets: TTh 10:15-11:45a, Instructor: D. Waters Jr., Status: Open",
    "date_accessed": "2024-03-31"
}