{
    "course_code": "HLTH 343",
    "course_title": "Science of Integrative Health",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 19 / Seats Avail: 19Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "The Science of Integrative Health explores approaches to health and medicine integrating practices from contemporary biomedicine models and various healing traditions that have existed for thousands of years. In the recent convergence of conventional medical therapies and complementary and alternative practices, this course reviews various modalities used in therapeutic care models focused on the whole person: body, mind and spirit, and for which there is scientific basis for safety and efficacy. In evidence-informed study, the course examines a range of integrative modalities applied to the physical, emotional, mental, social, spiritual and environmental determinants of health and healing. Important elements related to philosophy, practice, and policy are addressed as underpinnings to this integrative health paradigm)(Prerequisite: HLTH 210)",
    "course_description": "This course explores the convergence of conventional medical therapies and complementary and alternative practices in therapeutic care models focused on the whole person: body, mind, and spirit. Discussions will explore physical, mental, social, spiritual and environmental determinants of health.",
    "prerequisites": "HLTH 210 or ANT 231 or equivalent transfer credit as prerequisite.",
    "instructors": "Carolyn Accardi - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in 1462 Clifton Rd 101",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_HLTH_343_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2684, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: C. Accardi, Status: Open",
    "date_accessed": "2024-03-28"
}