{
    "course_code": "HLTH 376",
    "course_title": "Health and Science Podcasting",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 19 / Seats Avail: 19Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Irregularly",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "Podcasting is one of the fastest-growing content channels in media today, reaching more than 183 million Americans. It's one of the most effective platforms through which to tell impactful true stories about health and science, whether one aims to work as a clinician, policymaker, journalist, educator or in any other form of science communication. In this course, students will report, produce and edit their own episode of the HealthierU podcast, pursuing topics of interest to them and to our audience. Students will learn how to research and outline their episodes, write a podcast script, record interviews and ambient sound, select and incorporate music, and edit it all together to create professional-sounding works of audio journalism. Every week, we'll listen critically to a variety of health and science podcasts to identify different podcast formats, analyze the quality of scientific information presented, and understand the techniques used to craft impactful, accurate and educational content for the ear. Guest speakers from across the Atlanta audio community provide expert tips on topics ranging from interview tips to story structure to podcast marketing. Join us in making HealthierU!",
    "course_description": "We will analyze current news stories and podcasts to understand the shared tenets identifying and outlining a story, conducting research and interviews, crafting an argument, organizing a narrative, and gathering quality audio.  Students will apply these techniques in both written and audio pieces.",
    "prerequisites": null,
    "instructors": "Maya Kroth - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in 1462 Clifton Rd 100A",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_HLTH_376_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2993, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: M. Kroth, Status: Open",
    "date_accessed": "2024-03-28"
}