{
    "course_code": "HLTH 381W",
    "course_title": "Health Writing and Narratives",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 15",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "Continuing Communication(*)",
    "permission": "Department Consent Required",
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "Writing clearly about health and medicine is an essential skill for aspiring scientists, policymakers, science communicators, and physicians and health professionals, as well as for future journalists planning to work in any medium. Communicating health and science requires learning to identify new developments, conduct an interview, craft an argument, and organize a narrative, while translating professional jargon into everyday language. This class, taught by a professional journalist, trains you in journalism's norms and standards: speed, thoroughness, accuracy, novelty and evidentiary rigor. Students read new scientific papers and compare them to news coverage, while interrogating the storytelling strategies of different journalistic genres. Guest speakers include text journalists working in short and long forms, audio and video creators, data specialists and interview strategists. Assignments include writing short and long pieces in a range of genres; completed work may be published in the CSHH online journal, Exploring Health. (Application and permission of instructor; no prerequisites.)",
    "course_description": "Communicating health and science requires learning to identify new developments, conduct interviews, and craft an argument, while translating professional jargon into everyday language. You¿ll also learn journalism's norms and standards: speed, thoroughness, accuracy, novelty and evidentiary rigor.",
    "prerequisites": null,
    "instructors": "Maryn McKenna - Primary Instructor",
    "schedule_location": "MW 4pm-5:15pm in 1462 Clifton Rd 100A",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_HLTH_381W_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 4458, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 4-5:15p, Instructor: M. McKenna, Status: Open",
    "date_accessed": "2024-03-28"
}