{
    "course_code": "HLTH 373",
    "course_title": "Delivering Health",
    "credit_hours": "2",
    "seats": "Seats: Maximum Enrollment: 40 / Seats Avail: 40Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "This course provides an overview of key parts of the health care delivery system and their ability to deliver health. We will focus on the role of insurance, the government-sponsored Medicare and Medicaid programs, and the hospital and mental health sectors. We will analyze the organization of and financing mechanisms for these sectors and the incentives faced by health care providers in terms of the volume and type of services they provide. We will also examine consumer access barriers, particularly those of disadvantaged groups, to seeing care. We will identify how each sector attempts to measure its impact on individual's health, whether these measures are meaningful and what they indicate about sector performance. Practical examples will be explored throughout the semester, such as how does the Medicaid program deliver mental health services to extremely vulnerable and marginalized populations. We will also have lectures provided by experts in the field, such as the Director of Georgia Families, Amerigroup Inc. and physician practice managers.",
    "course_description": "This course employs multiple perspectives, including organizational theory, business, and economics, to examine the structure, financing, and performance of the US health care system and its ability to deliver health. Mental health, long-term care, and public health sectors are explored in depth.",
    "prerequisites": null,
    "instructors": "Victoria L Phillips - Primary Instructor",
    "schedule_location": "T 2:30pm-4:10pm in Registrar Room Pool",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_HLTH_373_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2703, Section #: 1, Type: LEC, Campus: ATL, Meets: T 2:30-4:10p, Instructor: V. Phillips, Status: Open",
    "date_accessed": "2024-03-28"
}