{
    "course_code": "HLTH 431",
    "course_title": "Stigma & Health",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 19 / Seats Avail: 19Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "This course explores the sociocultural process of stigma as a fundamental determinant of health that shapes a wide range of health conditions and illness experiences. As situated within the context of biomedicine, we closely consider ways in which stigma produces illness (manifested as uneven patterns of disease at the population level), as well as ways in which illness produces stigma (whereby people experiencing illness become the targets of exclusion). Specific areas of focus include non-normative body appearance, impaired mobility, chronic disease, mental health, and reproductive health. Toward the end of the course, we examine the effectiveness of various anti-stigma interventions at the intrapersonal, interpersonal, and institutional/structural levels.",
    "course_description": "This course explores stigma as a social construct that shapes many different health conditions and illness experiences. Focus areas include non-normative body appearance, impaired mobility, chronic disease, mental health, and reproductive health. Various anti-stigma interventions are also examined.",
    "prerequisites": null,
    "instructors": "Sydney Spangler - Primary Instructor",
    "schedule_location": "T 4pm-6:45pm in 1462 Clifton Rd 109",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_HLTH_431_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2716, Section #: 1, Type: LEC, Campus: ATL, Meets: T 4-6:45p, Instructor: S. Spangler, Status: Open",
    "date_accessed": "2024-03-28"
}