{
    "course_code": "MD 920",
    "course_title": "Translation: Elective: Research",
    "credit_hours": "4",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2023-01-03 through 2023-05-06",
    "class_notes": "Varies by section",
    "course_description": "Innovations in clinical care are increasingly impacted by the development and implementation of machine learning (ML) and artificial intelligence (AI). As future clinicians, medical students should be informed and prepared for technological changes that will affect how they provide care for their patients. The goals of this senior elective are to demystify AI and ML in healthcare, enabling students to have informed conversations about these technologies and participate in their clinical advancement.",
    "prerequisites": null,
    "instructors": "Stacy M Higgins - Primary Instructor",
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 2179, Section #: APR, Type: CLN, Campus: ATL, Meets: Does Not Meet, Instructor: S. Higgins, Status: Open\nClass Nbr: 2177, Section #: FEB, Type: CLN, Campus: ATL, Meets: Does Not Meet, Instructor: S. Higgins, Status: Open\nClass Nbr: 2176, Section #: JAN, Type: CLN, Campus: ATL, Meets: Does Not Meet, Instructor: S. Higgins, Status: Open\nClass Nbr: 2178, Section #: MAR, Type: CLN, Campus: ATL, Meets: Does Not Meet, Instructor: S. Higgins, Status: Open\nClass Nbr: 2180, Section #: MAY, Type: CLN, Campus: ATL, Meets: Does Not Meet, Instructor: S. Higgins, Status: Open\nClass Nbr: 2079, Section #: RSCH, Type: CLN, Campus: ATL, Meets: Does Not Meet, Instructor: S. Higgins, Status: Open\nClass Nbr: 2209, Section #: RSH1, Type: CLN, Campus: ATL, Meets: Does Not Meet, Instructor: S. Higgins, Status: Open\nClass Nbr: 2298, Section #: RSH2, Type: CLN, Campus: ATL, Meets: Does Not Meet, Instructor: S. Higgins, Status: Open\nClass Nbr: 2299, Section #: RSH3, Type: CLN, Campus: ATL, Meets: Does Not Meet, Instructor: S. Higgins, Status: Open",
    "date_accessed": "2024-03-30"
}