{
    "course_code": "ENGRD 221RW",
    "course_title": "Advanced Writing Workshop: Translanguaging in Multiling.C",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Humanities and Arts with Cont.Communication(*)",
    "permission": "Department Consent Required",
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(Permission Required Prior to Enrollment)\n(Complete Topic: Translanguaging in Multilingual Classrooms)\n\n\nIn this course, we will critically read and discuss a variety of texts and scholarly articles about how multilingual learners engage in discursive communicative practices from a unitary fluid linguistic repertoire and make meaning of their multilingual world, and how denial of emergent multilingual learners' use of full linguistic capacities negatively impacts their academic success. Translanguaging refers to multilingual learners' use of full linguistic repertoire without regard for socio-political boundaries between named languages in meaning making. As a pedagogy, translanguaging promotes multilingual learners' social, cultural, and linguistic rights and helps them realize their transformative potential to ensure social justice by eliminating inequalities and discriminations based on languages and cultures. Throughout the semester, students will respond to a variety of writing tasks and assignments along with in-class discussions aiming at developing their written communication skills for different rhetorical situations. This course takes a process writing approach to narrative writing, research project (conducting primary research), multimodal composition, and reflection essay. Critical reading of articles and texts will help students understand the rhetorical process, analyze the audience and its cultural contexts, and foresee the audience's response.\nEnrollment by permission only from Jane O'Connor.",
    "course_description": "Prerequisites: English 101 or 181 and written permission of instructor. Practical introductions to various kinds of media and professional writing. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Md Nesar Uddin - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Emerson Chemistry Bldg. E103",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ENGRD_221RW_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: This section is full 3967, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: M. Uddin, Status: Closed",
    "date_accessed": "2024-03-30"
}