{
    "course_code": "ENGRD 221RW",
    "course_title": "Advanced Writing Workshop: Multi-Genre Writing",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 16",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Humanities and Arts with Cont.Communication(*)",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "This course offers an introduction to various genres of nonfiction writing, including memoir, personal essay, literary journalism, multimedia writing, and flash nonfiction. We will study and practice different primary research methods, including archival research, interviewing, and oral history. Together, we will experiment with breaking and blending genres; engage in critical discussion of the modes of composition that shape and support justice-oriented work; and consider the following questions: How does interweaving personal narrative with research help writers connect with their audiences? How might storytelling techniques and rhetorical analysis strengthen our writing across disciplines and contexts? How do we infuse our writing with the knowledges and communication practices we often leave at home when we go to school? What daily habits comprise a lifelong writing practice? Students will leave the class with a portfolio of writing across genres.",
    "course_description": "Prerequisites: English 101 or 181 and written permission of instructor. Practical introductions to various kinds of media and professional writing. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Vani Kannan - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in Registrar Room Pool",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ENGRD_221RW_2_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3968, Section #: 2, Type: LEC, Campus: ATL, Meets: MW 10-11:15a, Instructor: V. Kannan, Status: Open",
    "date_accessed": "2023-10-31"
}