{
    "course_code": "ENGRD 328W",
    "course_title": "Race, Gender, and Media-Making",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 14 / Seats Avail: 3",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Continuing Communication(*)",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Topic: Periodical Facts & Fictions\nIntroduced by Stephen Colbert and now an entry in the Oxford Dictionary, \"truthiness\" is defined as \"the quality of appearing to be true while not actually or necessarily being so\" and the act of \"accepting or presenting something which is not true as the truth.\" Certainly, the perils and possibilities of truthiness seem pressing today. Mass-circulated and popular media has long been a purveyor of facts intermingled with fictions. We will undertake an historical survey of U.S. periodicals--publications like newspapers, magazines, and cartoons--through an emphasis on their truthiness. Course work will include practice with media formats like editorials, cartoons, and advice columns; development of an information literacy flowchart; curation of a digital exhibit; and research with historical media from Emory and Atlanta.\nOur exploration of social/cultural identity and serial publication will pose the following questions: What are the relations between documentation, circulation, and perception? Why does fact shade into fiction when representations of an \"Other\" are at stake? What are the relations between institutionalized conditions (such as structural racism) and social fictions (like the idea that race is a biological fact) in the US? We will also seek answers to questions related to journalistic and print histories: How did people create, use, and describe historical mass media? How do the possibilities and limitations of digital media affect serial publications?",
    "course_description": "Students will learn about media studies and cultural studies frameworks to analyze popular media throughout the century. Students write in class daily, blog to larger audiences weekly, draft and revise multiple multimodal projects, and respond meaningfully to peers' work in structured workshops.",
    "prerequisites": null,
    "instructors": "Sarah Salter - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in Candler Library 114",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ENGRD_328W_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3972, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: S. Salter, Status: Open",
    "date_accessed": "2023-10-31"
}