{
    "course_code": "AAS 359W",
    "course_title": "Studies in African American Literature: 1900 to Present: African American Theater",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 4 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "HAPW w/Race & Ethnicity Req.",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Same as THEA 316RW 1, ENG 359W 1)\nThis course is a survey of African American theatre and performance from the early 20th century to the present. Plays will be read in the context of African American history and Black political thought. We will investigate larger social, political, philosophical, religious, and artistic movements and their impact on African American theatre. Major issues including double consciousness, color politics, cultural nationalism, racial stereotypes, civil rights, and social protest will be explored. Students will be exposed to the fundamentals of Black Feminist/Womanist thought; and locate the Black female dramatists, voice in within Black theatre theory. Additionally, students work with archival materials from the Stuart A. Rose Manuscript, Archives, and Rare Book Library to not only enhance their learning but will also develop skills and confidence in archival research. By examining drama from Black playwrights, this course aims to expand the students, understanding of the complexity of the systems of disadvantage affecting African Americans in the United States.",
    "course_description": "A topics course dealing with major traditions and issues in African American literature from 1900 to the present. Possible topics include passing and miscegenation, black novels since 1950, Afrofuturism, and black theater.",
    "prerequisites": null,
    "instructors": "Lydia Fort - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Rich Building 201",
    "course_resources": null,
    "sections": "Class Nbr: 5656, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: L. Fort, Status: Open",
    "date_accessed": "2024-03-30"
}