{
    "course_code": "ITAL 470",
    "course_title": "Topics in Italian Literature: Outside, Looking in",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 12Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "HAL w/Race & Ethnicity Req.",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "Class is taught in Italian.\nComplete Topic - Outside, Looking in: Migrant Literature, Italian Language and Personal Identity\nThis advanced Italian language course will analyze a compilation of creative fiction and non-fiction short stories that provide a window into the social dynamics of immigrants in Italian society.  These authors documented in compelling and captivating Italian language the transformational effect that the transmigrational experience exerted through their own identity on Italian culture and society. \nStarting from authors emigrating from Africa, the Middle East, and the Americas into Italy, the class will explore borders both geographical and sociological. This course posits that these migrants occupy a liminal space which they inhabit, which surrounds them, and which they are able to make wholly their own, that is, they possess characteristics of their culture of origin and elements of their adoptive culture which they meld into what I call a third culture, which they have unintentionally but nonetheless created. Source material for the class will include original works of literature, films, and cultural artifacts to better define and understand these liminal spaces and the people and cultures who inhabit them.",
    "course_description": "In Italian. Intensive study of a single author, genre, literary movement, or period. Topic to be announced in advance. May be repeated for credit when topic varies. Prerequisite: Italian 302 or permission of program director.",
    "prerequisites": null,
    "instructors": "Simona Muratore - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Candler Library 121",
    "course_resources": null,
    "sections": "Class Nbr: 4021, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: S. Muratore, Status: Open",
    "date_accessed": "2024-03-30"
}