{
    "course_code": "ITAL 302W",
    "course_title": "Language & Culture; Adv. II",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 9Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "Humanities, Arts, Language with Writing",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "ITAL 302W Advanced Italian II (Muratore / MW 1:00-2:15pm in person sessions) \nContent: This course is designed to assist advanced students in Italian Studies in fully developing their Italian language skills while exploring the culture. Thus, in addition to your continuing work in grammar and emphasis on writing, you will learn about Italian civilization: art, history, literature, film, and politics, through the 20th century. In a content-based learning environment students will acquire, strengthen, and consolidate their ability to understand and produce in the target language, increasing at the same time their cultural and intercultural competence. \nAssessment: The final grade is based on weekly assignments, oral presentation, and final portfolio. Prerequisites: Italian 301 or instructor's approval.",
    "course_description": "Utilizing authentic texts, this engaging content-based approach to language learning focuses on a historically sequenced in-depth study of Italian art, history, and literature, developing analytical-critical skills, cross-cultural competency and higher than norm linguistic fluency.",
    "prerequisites": null,
    "instructors": "Simona Muratore - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in Candler Library 121",
    "course_resources": null,
    "sections": "Class Nbr: 3973, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: S. Muratore, Status: Open",
    "date_accessed": "2024-03-30"
}