{
    "course_code": "ITAL 375W",
    "course_title": "Tops in Ital Lit in Trans: Queering Italian Renaissance",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 5Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Summer",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Same as WGS 385W 5)\nITAL 375W-2 Queering the Italian Renaissance\nWaters (TTh 10-11:15am, in person)\nContent:  This class takes as it's starting point the queer subject and will explore the various ways in which it constitutes itself in the context of the Italian Renaissance. We have two goals, the first of which will be to understand the queer subject in and of itself. Through the lens of psychoanalysis and a materialist framework, we will look at the playful ways in which sixteenth century authors problematized both sex and gender. Our second goal will be to explore queer desire and how it destabilizes heteronormativity through the totality of its oppositions. We will use both primary and secondary sources to examine the concepts of queer subjectivity, the rigidity (or lack thereof) of the gender binary in Renaissance thought, and the performativity of gender and sexuality through various works. In the end, we will question and examine our current understanding of the etiology of queer identity.)",
    "course_description": "Topics to be announced each semester. Course taught in English. May be repeated for credit when syllabus changes. Focus on developing critical analysis and reasoning skills.",
    "prerequisites": null,
    "instructors": "Garrett Waters - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Woodruff Library 422",
    "course_resources": null,
    "sections": "Class Nbr: 4023, Section #: 2, Type: LEC, Campus: ATL, Meets: TTh 10-11:15a, Instructor: G. Waters, Status: Open",
    "date_accessed": "2024-03-30"
}