{
    "course_code": "LING 212W",
    "course_title": "Structure of Human Language",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 9",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "What makes a word a word, as opposed to a phrase or sentence? What are the basic principles that determine how words, phrases and sentences are formed cross-linguistically? We will cover some well-known concepts in syntactic theory: including constituency, category, dependent clauses, argument structure, anaphora, wh-questions and other kinds of displacement, and see how they are analyzed in a generative grammar framework. We will periodically face the question `How are words different from sentences?' and in the second part of the course we will examine this question in-depth by looking at some problematic cases in English and other languages. Students will develop the vocabulary and problem-solving techniques that linguists use for morphosyntactic analysis: recognizing patterns in linguistic data, testing hypotheses, applying diagnostic tools, and advancing arguments and counterarguments.\nPrerequisite: Foundations of Linguistics (LING 201, LING_OX 201 or ANT 203), or equivalent course with permission of instructor.\nRequired Textbook(s): All assigned readings will be online.",
    "course_description": "This course investigates word formation (morphology) and sentence structure (syntax) in the world's languages.",
    "prerequisites": "LING 201 or LING_OX 201 or ANT 203 or equivalent transfer credit as prerequisite.",
    "instructors": "Marjorie Pak - Primary Instructor",
    "schedule_location": "TTh 8:30am-9:45am in Callaway Center C101",
    "course_resources": null,
    "sections": "Class Nbr: 1219, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 8:30-9:45a, Instructor: M. Pak, Status: Open",
    "date_accessed": "2024-03-30"
}