{
    "course_code": "LING 405W",
    "course_title": "Language and Discourse on the Web",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": "Continuing Writing Requirement",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Same as SPAN 405W 1)\nThis course incorporates a general theoretical frame in linguistics, with a specific focus in discourse analysis and pragmatics, and applies it to electronic communications. Students will examine different tools for Internet communication and explore the form and uses of Spanish language in them. Special attention is given to the recognition of the main features of specific Internet genres (e.g. web ads, electronic news articles, online conversations), and the analysis of their language functions and intercultural content. In addition to the theoretical frame, the course incorporates extensive practice that will allow students to apply discourse analysis techniques to electronic texts in their own professional interests (e.g. health, film, journalism, business, law). Background on Linguistics is recommended. Students must be familiar with the use of basic online communication tools (chat groups, forums, social networks and e-mail). TEXTS: - Hernando Cuadrado, Luis. Introducción a la teoría y estructura del lenguaje. Verbum, 1995. - Crystal, David. Internet Linguistics: A Student Guide. Routledge, 2011. - Selection of texts and readings available in Canvas. PARTICULARS: Evaluation will be based in class participation, daily assignments, two exams, one research project and online activities. PREREQUISITE: At least one foundational course for the Spanish Major and Minor",
    "course_description": "This course incorporates a general theoretical frame in linguistics, with a specific focus in discourse analysis and pragmatics, and applies it to electronic communications. Students will develop an intercultural research project by analyzing digital texts in a systematic way",
    "prerequisites": null,
    "instructors": "Jose Luis Boigues-Lopez - Primary Instructor",
    "schedule_location": "MW 5:30pm-6:45pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 4172, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 5:30-6:45p, Instructor: J. Boigues-Lopez, Status: Wait List",
    "date_accessed": "2024-03-30"
}