{
    "course_code": "LING 333",
    "course_title": "Language, Gender and Sexuality",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 21 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "Same as ANT 325 1 and WGS 333 1\nPopular media and discourse frequently make claims about the differences between the speech of men and women. Are these descriptions based on actual linguistic behavior or something else? How do we measure differences between the speech of men and women? What is the role of language in creating or subverting gendered identity? Do gay men, lesbians, trans and non-binary individuals have a language/language variety of their own? Are children socialized into gender-specific speech behaviors? In order to explore these questions, we will survey some of the theoretical approaches to the analysis of language and gender. We will learn both quantitative and qualitative technique. After an introduction to some of the approaches used to study language, we will use these skills to critically evaluate claims about the connection between language, gender, sexuality and identity. We will focus on primary academic research and natural language data.",
    "course_description": "Cross-cultural examination of how language reflects, maintains, and constructs gender identities. Topics include differences in male/female speech, the grammatical encoding of gender and childhood language socialization.",
    "prerequisites": null,
    "instructors": "Jason McLarty McLarty - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Candler Library 114",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 1212, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 10-11:15a, Instructor: J. McLarty, Status: Closed",
    "date_accessed": "2024-03-30"
}