{
    "course_code": "LING 340W",
    "course_title": "Topics in Sociolinguistics: Language Variation and Change",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "In this course we will explore the study of social variation in language and language use. The course will survey core areas and concepts of sociolinguistics and introduce the methods that sociolinguists use to study the relationships between society and language, language and identity, and language change. We will approach our topics primarily from one of the most central theoretical approaches to language variation and change, exploring what is known as variationist sociolinguistics. We will also consider the relationship between sociolinguistics and other areas of linguistic research. Finally, we will address the educational and social outcomes of developing better knowledge of (socio)linguistic variation. Sociolinguistics is an empirical discipline. We learn about the relationships between language and social structure and processes of language variation and change by investigating language as it is produced by normal talkers in real-life situations. In this course, we will be learning by doing - a major component of this course is your participation in an empirical group research project.\nTextbook: Readings will be posted on Canvas.",
    "course_description": "This course studies relations between language and society, relations between language and sociocultural context. Topics may include: language variation; multilingualism; verbal interaction; discourse analysis; ethnography of communication; sociolinguistics of Spanish.",
    "prerequisites": null,
    "instructors": "Jason McLarty McLarty - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Candler Library 121",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 5533, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 1-2:15p, Instructor: J. McLarty, Status: Closed",
    "date_accessed": "2024-03-30"
}