{
    "course_code": "OAM 634",
    "course_title": "Strategic Management",
    "credit_hours": "3",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "The delivery format listed for this class is based on current university guidelines. However, if there are further changes to the COVID19 guidelines for Fall 2021 or other acts beyond our control, the school reserves the right the modify the delivery method for this class\nPlease see the EMBA Program Office for meeting patterns and schedules related to this course",
    "course_description": "Topic: Business unit and corporate strategy \nThis is an introduction to business unit and corporate strategy. The course brings together a research-based set of concepts and analytical tools that students use to evaluate existing firm strategies and craft new ones. It is designed to prepare managers for positions that require integrative thinking across functional and product boundaries. The initial focus is on strategy at the level of the business unit, which is the foundation for competitive analysis. We examine the sources of competitive advantage in market position and resources. Students learn to identify whether a company has a competitive advantage and determine what courses of action it can take to maintain and expand its advantage. The latter part of the course focuses on how choices about corporate scope and strategy relate to threats to sustainability of competitive advantages.",
    "prerequisites": "Varies by section",
    "instructors": "Robert Kazanjian - Primary Instructor",
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 2730, Section #: 2201, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: R. Kazanjian, Status: Open\nClass Nbr: 5590, Section #: 2401, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: R. Kazanjian, Status: Open",
    "date_accessed": "2024-03-30"
}