{
    "course_code": "OAM 661",
    "course_title": "Applied  Entrepreneurship",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 22 / Seats Avail: 13Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "The delivery format listed for this class is based on current university guidelines.  However, if there are further changes to the COVID19 guidelines for Fall 2021 or other acts beyond our control, the school reserves the right the modify the delivery method for this class.",
    "course_description": "Class focuses on the following essential business and entrepreneurial concepts, and learn how to:\n- Determine if a business opportunity is worth pursuing;\n- Find the next big opportunity;\n- Understand how buyers really make decisions;\n- Design products the market \"\"really\"\" wants, quicker, less expensively and with lower risk;\n- Generate significant market interest for your products and services on a small budget;\n- Create tactics that are high impact, and easy to implement;\n- Develop strategies that have a significantly greater likelihood for success;\n- Improve your management skills to increase your odds of achieving your business objectives;\n- Leverage the effectiveness of working with partners and minimize the risks associated with partnering;\n- Negotiate more effectively with an investor (or as an investor);\n- Deal with the reality of business when it deviates from your business plan (as it inevitably will);\n- Create a business environment second to none;\n- Buy a business without over paying; and\n- Recognize if and when to sell your business and how much it's really worth.",
    "prerequisites": "Varies by section",
    "instructors": "Charles Goetz - Primary Instructor",
    "schedule_location": "M 6:30pm-9:30pm in Goizueta Business School 231",
    "course_resources": null,
    "sections": "Class Nbr: 2773, Section #: 2169, Type: LEC, Campus: ATL, Meets: M 6:30-9:30p, Instructor: C. Goetz, Status: Open\nClass Nbr: 2774, Section #: 3269, Type: LEC, Campus: ATL, Meets: M 6:30-9:30p, Instructor: C. Goetz, Status: Open",
    "date_accessed": "2024-03-30"
}