{
    "course_code": "ENGRD 201W",
    "course_title": "Multimedia Journalism",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 14 / Seats Avail: 14Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Continuing Communication(*)",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "This course studies the histories and practices of journalism through a focus on media addressed to and developed by non-normative communities of sexuality and gender. As a course that bridges theory and practice, we will think about how underground, mainstream, and DIY publication collectives use conventions of journalism and technologies of mass media to build communities explicitly for fostering safe, inclusive, even radical spaces of gender performance, queer intimacy, and social action.  Plan for hands-on sessions in the Rose Library (with their rich collections of LGBTQ+ publications) as well as exploration of Atlanta's contemporary publications. Across the semester, we will study the strategies, styles, and histories of mass media through an emphasis on queer-identifying publications, and practice the formats, genres, and conventions of media production specific to writing and digital communication.",
    "course_description": "Students write and report for newspapers, radio, magazines, online sites and social media and develop websites to publish multimedia writing and news reports. They learn the basics of news writing and reporting, interviewing, and audio and video production. No journalism background required.",
    "prerequisites": null,
    "instructors": "Sarah Salter - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in Callaway Center S103",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ENGRD_201W_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3443, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: S. Salter, Status: Open",
    "date_accessed": "2024-03-28"
}