{
    "course_code": "ENGRD 190",
    "course_title": "FSEM: Rhetoric and Discourse",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 0 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First Year Seminar",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "(Freshmen Only)\n\n\nRhetoric and Discourse in Ekphrasis - The arts are subjective, right? Paintings and sculptures and photographs and poems aim to move, not to convince. Yet are we not responsible to the data set via which we experience and sustain emotion, explore the human situation(s), and draw inspiration? Is it ever appropriate \"or even beautiful\" to make things up or to be imprecise with regard to works of art? And is any rhetorical move made in (or in response to) a painting or a poem its own justification? ENGRD 190 will hope try to turn a dark classroom into a space where we may engage such questions and illuminate the value, if any, of art that is demonstrably wrong (untrue, exaggerated, more like a door than a window) about other works of art.\nParticipants will observe, infer, juxtapose, compare, contrast, translate, and adduce counterfactuals with regard to a series of test cases physical objects (paintings, or photographs, or sculptures, or monuments) paired with a poem composed specifically to address it. They will write frequently and receive copious feedback. They will think hard about the relationships between truth and rhetorical form. And they will actively say what they see and grapple with what they say - especially if they have no prior special training in looking at art or in reading poems.",
    "course_description": "First-Years only. Variable topics course introducing students the study of rhetoric and public discourse through various topical approaches.",
    "prerequisites": null,
    "instructors": "Daniel Bosch - Primary Instructor",
    "schedule_location": "TTh 8:30am-9:45am in Callaway Center N203",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ENGRD_190_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: This section is full 3442, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 8:30-9:45a, Instructor: D. Bosch, Status: Closed",
    "date_accessed": "2024-03-28"
}