{
    "course_code": "ENGRD 223",
    "course_title": "Rhetorical Grammar",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 16Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "Focusing on the work that language can do in the real world, this course is less about mastering the \"rules\" of grammar and more about making the best choices to suit your purposes as a communicator. Through a study of grammar's impact on rhetorical effectiveness, students work with their own writing as they learn to make and adapt grammatical choices to fit their audience, purpose, constraints, exigencies, and timing. We will assume an understanding of grammar as the customary constraints and possibilities for a language in a given community. This means that there's not one \"right\" or standard grammar. You can, however, draw on multiple grammatical moves in different contexts to try to achieve our desired effects, and, as scholar April Baker-Bell reminds us, you do not have to abandon \"non-standard\" grammar in this process (for instance, grammar informed by African American Vernacular English, or grammar drawing on languages other than English). You will be encouraged to bring the knowledge of your own linguistic and social communities to this course, as you learn and innovate new techniques of rhetorical grammar.\nThis class is fully online and asynchronous.",
    "course_description": "Through a study and analysis of grammar's impact on rhetorical effectiveness, students work with their own writing as they learn to make and adapt grammatical choices to fit audience, purpose, constraints, exigencies, and timing.",
    "prerequisites": null,
    "instructors": "Robert Birdwell - Primary Instructor",
    "schedule_location": null,
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ENGRD_223_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3501, Section #: 1, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: R. Birdwell, Status: Open",
    "date_accessed": "2024-03-28"
}