{
    "course_code": "ENGRD 220W",
    "course_title": "Rhetorical Studies",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 14 / Seats Avail: 14Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Continuing Communication(*)",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "What is rhetoric? How should we define it? Is it an art, a practice, or a field of study? How does rhetoric relate to politics? How does it relate to justice? Can rhetoric be a force for good? How might it be abused? This course will consider answers to these and other questions about rhetoric that have been debated for more than two thousand years. We will first look at how the Ancient Greeks and Romans theorized and practiced rhetoric. We will then see how the terms, categories, and practices developed by these thinkers influenced subsequent generations of writers and orators. Finally, we will discover ways to apply what we have learned in our work as students, professionals, and citizens.\nStudents will hopefully come away from this class with a better understanding of how to make their own arguments and analyze the arguments of others, how to address particular audiences in particular situations and for particular purposes, and how to inform and persuade in an effective and ethical manner.",
    "course_description": "Introduction to rhetoric and rhetorical analysis. While learning rhetorical tactics of Ancient Greece and Rome, students will apply that learning to their academic and vocational goals. Practice in writing and speaking, grounded in ethics, are central to the course.",
    "prerequisites": null,
    "instructors": "Bernard Krumm - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in MODERN LANGUAGE_219",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ENGRD_220W_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3445, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: B. Krumm, Status: Open",
    "date_accessed": "2024-03-28"
}