{
    "course_code": "ENGRD 380W",
    "course_title": "Topic: Writing/ Rhetoric/Literacy",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 14 / Seats Avail: 14Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "[citation needed] - When citing sources in a paper, has your primary concern been to avoid academic dishonesty? Does formatting a works cited page ever feel like an aimless or arbitrary effort to ensure that everything is correct and in line with what your professor seems to want? People within and beyond the university seem to have strong opinions on what source use should look like, especially in the wake of some recent, high-profile plagiarism scandals. But are they citing their sources? In this course, we will read and draw from research in writing studies and related fields to theorize when, why, and how people cite sources. In doing so, we will identify and interpret the metaphors for citing \"like giving credit, building, networking, having conversations, and even courting readers\" that can reflect back to us what we think writers do by referencing others' work. We will consider authors' cited references as artifacts of these practices, objects to which we can apply a variety of analog and digital methods to survey the research \"landscape\" of a given topic, understanding key influences on how a \"field\" of knowledge forms and changes. Moreover, we will practice representing combinations of others' work in our own writing, weighing the balance between spending time with others' ideas and developing what we want to say.",
    "course_description": "Course topics will vary but always will be focused on writing, rhetorical composition and analysis, or literacy skills. Topics possible include a variety of options such as journalistic writing, non-fiction, debate, argumentation, persuasion, digital writing, among others.",
    "prerequisites": null,
    "instructors": "Greg Palermo - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Atwood Chemistry Bldg. 280",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ENGRD_380W_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3506, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 10-11:15a, Instructor: G. Palermo, Status: Open",
    "date_accessed": "2024-03-28"
}