{
    "course_code": "HIST 211",
    "course_title": "Latin America: A History",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 40 / Seats Avail: 4Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(This class will meet synchronously on Wed. 2:40 PM - 3:55 PM)\n(Latin America stretches across two continents and around the Caribbean Sea, encompassing vast geographical diversity. Divided into many nations and heterogeneous cultures, the region still has some common historical legacies. This class explores both the differences and the similarities. We pay particular attention to ethnic and racial difference within Latin American countries and to persistent patterns of inequality, as well as resistance to oppression. We will situate the region in a global context, primarily through reference to broad economic and political forces. Throughout we will weigh the balance between commonality and difference across the region, aiming at an understanding of how particular national histories fit within a shared region.)\nGrading Structure:\nParticipation: 10%\nShort paper: 15%\nMedium paper: 20%\nQuizzes: 10% X 3\nFinal Exam: 25%",
    "course_description": "This course explores the history of Latin America from European contact to present. Major themes include Latin America's position in a wider world; class, ethnic, and race relations; state-society relations; the making of regional and national identities.",
    "prerequisites": null,
    "instructors": "Thomas Rogers - Primary Instructor",
    "schedule_location": "W 2:40pm-3:55pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 3055, Section #: 1, Type: LEC, Campus: ATL, Meets: W 2:40-3:55p, Instructor: T. Rogers, Status: Open",
    "date_accessed": "2024-03-30"
}