{
    "course_code": "HIST 190",
    "course_title": "Freshman Seminar: A History of Hunger",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "You must have permission to enroll in-person.\n(Freshmen Seminar - Limited to First Year Students Only)\n(Seeing hunger as a problem is a modern idea. Before the nineteenth century, most people saw hunger as a simple fact; something much of the population had to face. This course examines the history of hunger as a conceptual category, tracking its changing meanings through the past two hundred years. It also examines the history of hunger as lived experience, both during acute episodes (famines) and chronic hunger. Finally, the course explores agricultural development and modernization from the fertilizer revolution of the 1830s, through the mid-twentieth century's Green Revolution, and up to the food price spikes of the 2000s. We will pay comparatively more attention to the history of the Americas, but the processes we study were and are global in scope and they merit study at a large geographical scale.)\nGrading Structure:\nParticipation: 20%\nDiscussion Coordination: 15%\nReading Reviews (2): 30%\nShort Paper: 15%\nMedium Paper: 20%",
    "course_description": "Introduces first-year students to the discipline of history, particularly historical sources and methods; aims to improve critical reading, analytical, and writing skills in small group discussion.",
    "prerequisites": null,
    "instructors": "Thomas Rogers - Primary Instructor",
    "schedule_location": "MW 11:20am-12:35pm in Atwood Chemistry Bldg. 215",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3878, Section #: 2, Type: SEM, Campus: ATL, Meets: MW 11:20a-12:35p, Instructor: T. Rogers, Status: Closed",
    "date_accessed": "2024-03-30"
}