{
    "course_code": "HIST 190",
    "course_title": "Freshman Seminar: Radicals/Revolution: Caribbean",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as LACS 190 1) - You must have permission to enroll in-person.\n(Freshmen Seminar - Limited to First Year Students Only)\n(In the popular imagination, the Caribbean has long been associated with economic polarization. Images of extreme poverty and drug-related violence are often punctuated by references to elite vacationing and tax havens for the rich. Both sets of representations suggest that the Caribbean is a provincial corner of the world, where the rules that we are accustomed to in North America and Europe do not apply. \nThe course will challenge these representations by showing continuities between European, US, African, and Caribbean histories. Through a range of primary sources, we will learn about three major revolutions that occurred within the Caribbean, turning this world region into a testing ground for modern ideologies and institutions undergirding globalization: the sugar revolution, the Haitian Revolution, and the Cuban Revolution. We will ask: why have the Caribbean's contributions to histories of global capitalism and political radicalism been largely forgotten or erased from the popular imagination? \nAll readings will be available online.)",
    "course_description": "Introduces first-year students to the discipline of history, particularly historical sources and methods; aims to improve critical reading, analytical, and writing skills in small group discussion.",
    "prerequisites": null,
    "instructors": "Adriana Chira - Primary Instructor",
    "schedule_location": "TTh 2:40pm-3:55pm in Math & Science Center - N306",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3877, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 2:40-3:55p, Instructor: A. Chira, Status: Closed",
    "date_accessed": "2024-03-30"
}