{
    "course_code": "HIST 246W",
    "course_title": "Renaissance Women Writers",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 3Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(This class will meet synchronously on Tues. 1:00 PM - 2:15 PM)\n(Renaissance women left an astonishing textual legacy ranging from letters, orations and memoirs to treatises, plays, and imaginative tales. This course uses select texts to investigate how European women used writing to shape, interpret and comment on the world around them between 1400 and 1650-a period that witnessed the advent of printing, the break-up of Christianity, and the first age of globalization. In exploring the ways that writing offered a vehicle for personal expression and agency, we will also probe the barriers that Renaissance women faced in becoming literate and in publishing their work. The course is divided into two sections. Part One examines women's relationships to religious practices and family life. Part Two considers women in the public eye, in their capacities as political rulers, courtesans, and published authors. The course aims to introduce students to women's historical experiences while improving critical reading and writing skills. Readings focus on primary sources, all of which will be available electronically on Canvas; we will make regular use of visual materials such as video clips to bring the period to life. Grading will be based on several short papers, class participation, and rotating turns as discussion leader. This is a discussion-based course; there are no scheduled examinations.)",
    "course_description": "Renaissance women left an astonishing textual legacy ranging from\nletters, speeches and memoirs to poems, plays, and imaginative tales. This course uses selected texts to investigate how Renaissance women used writing to shape, interpret and comment on the world around them.",
    "prerequisites": null,
    "instructors": "Sharon Strocchia - Primary Instructor",
    "schedule_location": "T 1pm-2:15pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 3105, Section #: 1, Type: LEC, Campus: ATL, Meets: T 1-2:15p, Instructor: S. Strocchia, Status: Open",
    "date_accessed": "2024-03-30"
}