{
    "course_code": "HIST 323",
    "course_title": "Reformation Europe",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 40 / Seats Avail: 19Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(This class meets synchronously on Thurs. 1:00 PM - 2:15 PM)\n(Why were sixteenth-century Europeans willing to kill and be killed in the name of religion? How did the religious upheavals occurring on the European continent shape the spread of Christianity to parts of Asia and the Americas in these years? This course examines the causes and consequences of the religious tumult known as the Reformation but tells the story from a more global perspective. Although we will survey major theological differences that emerged between 1500 and 1650, the course emphasizes the impact of new religious understandings on society, politics, and culture. One of our goals is to grasp how the patterns and structures first developed in the early modern period continue to influence our world today. Topics to be studied include the complex interplay between politics and religion; changes in family life and gender roles; new forms of social discipline that arose in tandem with religious reform; forced conversion and the making of religious refugees; Jewish-Christian relations, including the formation of ghettos; and European attitudes towards indigenous peoples. Readings include various primary sources in translation; we will incorporate discussions of primary source readings and make extensive use of audiovisual media. Grading is based on a mix of take-home essay exams, Canvas posts, and class participation)",
    "course_description": "Examines the breakup of Christianity in sixteenth-century Europe. Analyzes political, social, and economic causes and consequences of religious change, as well as different theological viewpoints.",
    "prerequisites": null,
    "instructors": "Sharon Strocchia - Primary Instructor",
    "schedule_location": "Th 1pm-2:15pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 3059, Section #: 1, Type: LEC, Campus: ATL, Meets: Th 1-2:15p, Instructor: S. Strocchia, Status: Open",
    "date_accessed": "2024-03-30"
}