{
    "course_code": "HIST 319W",
    "course_title": "Imperial Russia",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(This class will meet synchronously on Thurs. 9:40 AM - 10:55 AM) This course will study the development of Russian History from the Westernization drive of Peter the Great to the February Revolution of 1917.  This course fully meets Emory's post-freshman writing requirement and also serves as a GER (HSC).  Since it involves intensive historical research, it is also a four-credit hour course.  Although primarily concerned with political history, the development of Russia's social classes, the impact of its cultural Westernization, the effects of economic modernization and Russia's place in the world will also be examined.  Topics covered will include Westernization, the creation of a caste society, the emancipation of the serfs, economic modernization and the Revolutionary movement.  Key events will act as lens through which to interpret Russia: Peter's radical reforms, Catherine's creation of a noble ascendency, the titanic struggle of Napoleon's invasion in 1812, the life of a serf-peasant, the birth of revolutionary terrorism, the growing class divide and the collapse of the Empire in total war and revolution.  The course does not presume knowledge of Russian history, or even historical knowledge, therefore it has no prerequisites.",
    "course_description": "Russian history from Peter the Great to the Revolution, with emphasis distributed among political, socioeconomic, intellectual, and cultural aspects, as well as external relations.",
    "prerequisites": null,
    "instructors": "Matthew Payne - Primary Instructor",
    "schedule_location": "Th 9:40am-10:55am in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 3879, Section #: 1, Type: LEC, Campus: ATL, Meets: Th 9:40-10:55a, Instructor: M. Payne, Status: Open",
    "date_accessed": "2024-03-30"
}