{
    "course_code": "HIST 385",
    "course_title": "Spec Topics: History: The Latinx South",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 40 / Seats Avail: 30Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(This class will meet synchronously Tues. 9:40 AM - 10:55 AM)\n(In their introduction to Latino Immigrants and the Transformation of the U.S. South, historians Mary E. Odem and Elaine Lacy describe the late twentieth- through early twenty-first century as a \"new era in southern history.\" Following the rapid increase of Latinx migration and settlement in the region, scholars have documented the social, political, and cultural transformations of the southern U.S. This course explores the growing body of interdisciplinary studies focused on Latinxs residing in the U.S. South. Assigned readings and course discussions will cover topics such as Latinx labor, migration, cultural production, foodways, politics, activism, memory, and place-making within the regional and historical context of the U.S South. Together we will consider the ways in which scholars, academic institutions, and community organizations have documented and characterized the Latinx South. Throughout the semester we will engage in a Latinx and migrant-centered approach to the readings, in order to explore how everyday Latinxs understand and narrate their own lives and histories in the U.S South and beyond. To accomplish this, students will be introduced to oral history methodologies throughout the semester to accompany course readings)\nCourse concentrations/areas for undergraduate major\n-\tU.S History after 1860 \n-\tEmpires, Nations, and Citizenship, modern period",
    "course_description": "Selected topics in history for advanced students. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Iliana Rodriguez - Primary Instructor",
    "schedule_location": "T 9:40am-10:55am in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 3887, Section #: 4, Type: LEC, Campus: ATL, Meets: T 9:40-10:55a, Instructor: I. Rodriguez, Status: Open",
    "date_accessed": "2024-03-30"
}