{
    "course_code": "HIST 385",
    "course_title": "Spec Topics: History: The History of Skiing",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 35 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(This class will meet synchronously on Thurs. 6:00 PM - 7:15 PM)\nThis new course explores the history of snow sports, especially skiing, from the 18th century to today.  We have many topics and Zoom guests lined up.  This class is not only for history majors or skiers, but also for business students, and anyone interested in environmental history, sports history, and the history of gender and race.  The class will look at the military uses of skiing in World War II, the expansion of leisure sports after 1960, the development of ski schools, history of ski patrols, lift technology, emerging environmental issues, snow science, avalanche control, the history of the land and the indigenous peoples, race and inclusivity in winter sports, the transformation of ski equipment, snow fashions, and the business of ski resorts.  Students who have never taken a history course and first-year students are welcome. Each student will do a short final research project. Check out the promotional video on @emoryhistory Instagram during the enrollment period.  As American Historical Association Executive Director Jim Grossman says, \"Everything has a history.\"  Skiing and snow sports have a fascinating histories.  \nAssignments: Weekly readings and videos, regular asynchronous assignments, final research project and lead-in assignments for that project. \nReadings: All online. No book purchases required.\nLink to video about class: https://youtu.be/v7bfV1gGxd4",
    "course_description": "Selected topics in history for advanced students. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Judith Miller - Primary Instructor",
    "schedule_location": "Th 6pm-7:15pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3091, Section #: 3, Type: LEC, Campus: ATL, Meets: Th 6-7:15p, Instructor: J. Miller, Status: Wait List",
    "date_accessed": "2024-03-30"
}