{
    "course_code": "HIST 385",
    "course_title": "Spec Topics: History: US Empire in Latin America",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 35 / Seats Avail: 4Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as LACS 385 2)\n(This class will meet synchronously on Thurs. 11:20 AM - 12:35 PM)\nSince independence countries from Argentina to Cuba have developed in a close relationship of competition, contestation, cooperation, rivalry, occupation and sometimes all-out war with the United States. This course will provide a history of the intimate and sometimes violent relations between the United States and its southern neighbors since the collapse of European empires more than two centuries ago. The course takes a broadly global and political-economic approach. Rather than depicting US-Latin American relations in a void, we will study how continental relations emerged within the broad global transformations of the first and second eras of global revolution (approx. 1765-1824 and 1947-1975), the world wars and the rise of global capitalism in the nineteenth and twentieth centuries. We will pay close attention to developments both within the United States and in Latin American countries themselves. If the United States often related to, intervened in and shaped Latin American history, Latin Americans themselves sought relations with, challenged, critiqued and formed alliances with the United States. In doing so, they both helped build US power and at times proposed alternatives to empire, dependency and subjugation.",
    "course_description": "Selected topics in history for advanced students. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Teresa Davis - Primary Instructor",
    "schedule_location": "Th 11:20am-12:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 3090, Section #: 2, Type: LEC, Campus: ATL, Meets: Th 11:20a-12:35p, Instructor: T. Davis, Status: Open",
    "date_accessed": "2024-03-30"
}