{
    "course_code": "HIST 385W",
    "course_title": "Spec Topics: History: Human Trafficking/Global Hist.",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 11 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as AFS 389W 2, ANT 385W 1, and LACS 385W 1)\n(Complete topic: Human Trafficking: A Global History)\n(This class will meet synchronously on Tues. 11:20 AM - 12:35 PM)\n(Even though publicly and globally condemned as abhorrent for close to two hundred years, human trafficking is currently the fastest growing and most lucrative criminal activity conducted transnationally. The scale of this phenomenon leaves little untouched: from the foods that we eat, to the buildings we pass through daily, to the electronic devices that we rely on, to refugees' pursuit of safe havens, or to medical practices that we now take for granted. In practice, the distinction between freedom and unfreedom is not always clear-cut. Technologies initially developed to control the labor, reproductive ability, or even dead bodies of individuals subjected to unfree labor gradually seeped into fields and among individuals who are, according to the law, free from slavery.\nThis course will explore three questions: 1) Why has human bondage been so persistent in spite of, by now, its universal condemnation? 2) How do states and international organizations distinguish between victims of human trafficking and other kinds of migrants, and what are the political repercussions that such distinctions have? 3) How have technologies developed to control populations subjected to slavery and human trafficking been expanded into new realms of the economy and to whose advantage?)",
    "course_description": "Selected topics in history for advanced students. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Adriana Chira - Primary Instructor",
    "schedule_location": "T 11:20am-12:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3066, Section #: 1, Type: LEC, Campus: ATL, Meets: T 11:20a-12:35p, Instructor: Chira/Webster, Status: Wait List",
    "date_accessed": "2024-03-30"
}