{
    "course_code": "HIST 385",
    "course_title": "Spec Topics: History: Gender/Sexuality: Middle Ages",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 30 / Seats Avail: 24Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as WGS 385 6)\n(Complete topic: Gender and Sexuality in the Middle Ages)\n(This class meets synchronously on Thurs. 4:20 PM - 5:35 PM)\n(The medieval period played a critical role in the construction of modern Western views about gender roles and the morality of various types of sexual behavior.  Why, for example, does the Christian tradition consider sex to be sinful?  Why does Western society privilege marriage and outlaw bigamy, polygamy, and certain types \"lascivious\" sex acts?  Christian ideas about sex have greatly influenced Western notions of marriage, same-sex love, and the appropriate roles for men and women in society. Medieval society was far from homogenous: it was Christian, Muslim, and Jewish; it was elite, bourgeois, lower class, and enslaved, secular and religious, rural and urban, learned and non-literate. This course explores how medieval society constructed masculinity and femininity and will consider the diversity of medieval gender identities in relation to sexuality, social class, race, and ethnicity. Topics covered include family, work, religious life, women's agency, same-sex desires, prostitution, medical theories of the body, as well as the connections between gender and power, sex and violence, and the proscriptions of the Church compared to actual social practice)",
    "course_description": "Selected topics in history for advanced students. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Michelle Armstrong-Partida - Primary Instructor",
    "schedule_location": "Th 4:20pm-5:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 3088, Section #: 1, Type: LEC, Campus: ATL, Meets: Th 4:20-5:35p, Instructor: M. Armstrong-Partida, Status: Open",
    "date_accessed": "2024-03-30"
}