{
    "course_code": "HIST 414W",
    "course_title": "Facing the French Revolution: Germany and Great Britain",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 2Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": "Continuing Writing Requirement",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "Through close analysis of a range of British and German textual and visual sources, this discussion-driven seminar examines European politics and culture in the years immediately following the French Revolution, as the revolution in France became increasingly radical and spilled over the borders, and as observers elsewhere struggled to comprehend these events and their implications for their home countries.  The course explores such central comparative topics as British and German responses to the Revolution and the Terror, the birth of democratic, liberal, and conservative political ideologies and movements, and the relationship between classicism and Romanticism in both politics and culture. \n \nAssignments will include active participation in synchronous and asynchronous discussions, a short book review and presentation, a final research paper of 5,000-6,000 words (approximately 16-20 pages), plus two short assignments building up to the final paper.",
    "course_description": "Jr/Sr Colloquium. \nThis course examines European politics and culture in the years immediately following the French Revolution. To do so it explores a broad spectrum of British and German textual and visual sources from the multiple perspectives of political, intellectual, and cultural history.",
    "prerequisites": null,
    "instructors": "Brian Vick - Primary Instructor",
    "schedule_location": "MW 4:20pm-5:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 3890, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 4:20-5:35p, Instructor: B. Vick, Status: Open",
    "date_accessed": "2024-03-30"
}