{
    "course_code": "HIST 385W",
    "course_title": "Spec Topics: History: Plunderers: Rome & Empire",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 9Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Complete topic - Plunderers of the World: Rome & Empire)\n(This class will meet synchronously on Tues. 4:20 PM - 5:35 PM)\n\n\nHistory of Rome as an imperial power, from 2nd c. BCE to 2nd c. CE. Conquest of Mediterranean area and formation of provinces; Mediterranean slave trade; disintegration of the Roman Republic as a political system; rise of one-man rule; Antonine plague.\nThis class meets synchronously one day a week and has an asynchronous component. It takes an in-depth look at Rome as an imperial super-power, from the destruction of Carthage and Corinth in 146 BCE, to the assassination of the emperor Commodus in 192 CE. This was a time when Roman rule extended from Britain and the Danube frontier to North Africa and Syria. At the same time, the Roman political structure changed radically from a republic to a monarchy, and the Senate, which under the Republic had been the major policy-making body, became increasingly side-lined. \nMajor writing assignments include three papers (see below). The research paper will be on topic chosen in consultation with the instructor, requiring both primary sources and modern scholarship. Synchronous class days are structured around class discussion of readings and brief lectures by the instructor; asynchronous days will include brief recorded lectures and assignments using online sources or readings on Canvas.",
    "course_description": "Selected topics in history for advanced students. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Judith Evans-Grubbs - Primary Instructor",
    "schedule_location": "T 4:20pm-5:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 3069, Section #: 2, Type: LEC, Campus: ATL, Meets: T 4:20-5:35p, Instructor: J. Evans-Grubbs, Status: Open",
    "date_accessed": "2024-03-30"
}