{
    "course_code": "HIST 489RW",
    "course_title": "Jr/Sr Coll: LatAm&NonWest Wrld: Empire in the Americas",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 2Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Continuing Writing Requirement",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(This class will meet synchronously on Thurs. 4:20 PM - 5:35 PM). From the powerful Aztec and Inca polities of the fifteenth century to corporate neo-imperialism in the present, the history of the Americas is a history of many empires. This course focuses on both a place, the American continent, and a concept 'empire' seeking to unravel the various modalities of power, racialization, extraction and difference-making that have accompanied empires both past and present. While exploring the imperial stories of the Americas, we will also ask a deceptively simple question: what is an empire?  Are empires defined solely by the military and political subjugation of other peoples and territories or can we speak of cultural, economic, artistic or intellectual imperialism? What is the relationship between foreign occupation and the 'domestic' conquest and colonization of indigenous peoples? Between empires and expansionary/exclusionary nation-states? Drawing on materials from history, anthropology, literature and film, students in this course will hone their writing and argumentative skills while working to provide their own answers to the course's central questions.",
    "course_description": "All history majors except those who complete the Honors Program must take two colloquia (HIST 487, 488 or 489). Each colloquium treats a special theme by reading, discussion, and writing of papers. Enrollment in each is limited to twelve; non-majors are welcome within space limitations.",
    "prerequisites": null,
    "instructors": "Teresa Davis - Primary Instructor",
    "schedule_location": "Th 4:20pm-5:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 3075, Section #: 1, Type: SEM, Campus: ATL, Meets: Th 4:20-5:35p, Instructor: T. Davis, Status: Open",
    "date_accessed": "2024-03-30"
}