{
    "course_code": "HIST 495BW",
    "course_title": "Intro Historical Interpretation II",
    "credit_hours": "1-8",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Varies by section",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Continuing Writing Requirement",
    "permission": "Department Consent Required",
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Permission Required Prior to Enrollment)\n\n\nFor History Honors Students Only.",
    "course_description": "For honors students in history. Addresses historiographical and methodological issues, and offers practical guidance in thesis design and research, with details and emphases at discretion of instructor.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: This section is full 5293, Section #: 1, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: P. Allitt, Status: Closed\nClass Nbr: This section is full 5361, Section #: 2, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: D. LaChance, Status: Closed\nClass Nbr: 5362, Section #: 3, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: M. Payne, Status: Open\nClass Nbr: This section is full 5363, Section #: 4, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: T. Rogers, Status: Closed\nClass Nbr: 5364, Section #: 5, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: W. Rucker, Status: Open\nClass Nbr: This section is full 5365, Section #: 6, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: S. Strocchia, Status: Closed\nClass Nbr: This section is full 5366, Section #: 7, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: C. Suh, Status: Closed\nClass Nbr: This section is full 5367, Section #: 8, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: J. Ward, Status: Closed",
    "date_accessed": "2024-03-30"
}