{
    "course_code": "HIST 495A",
    "course_title": "Intro Historical Interpretation I",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 14 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Permission Required Prior to Enrollment)\n(This class will meet synchronously on Mon. 2:40 PM - 3:55 PM)\n(For History Honors Students only)\n(The goal of this course is to prepare advanced undergraduates interested in completing an honors thesis in history. The goal of the seminar is to ground students in the basic competencies of historical research, from evaluating existing scholarship to choosing and planning an original thesis project. The seminar also guides participants through the process of designing a research project, step by step. While the work completed in the course is highly individualized, a schedule of readings will introduce participants to the best practices and common challenges of historical research. The seminar will also be a collaborative space in which participants will share their research plans and provide constructive feedback on the work of others.\nOver the course of the semester, students will select a research topic, develop a set of research questions and research strategy, and identify relevant primary and secondary sources. The seminar requires demands full participation and steady progress, as evidenced by the incremental, structured set of assignments. Each weekly meeting of the course focuses on a component of the research planning process, and weekly engagement in written and spoken form--is mandatory for success in the course. By the end of the semester, seminar participants will complete a thesis proposal for submission to the History Department Honors Program.)",
    "course_description": "For honors students in history. Addresses historiographical and methodological issues, and offers practical guidance in thesis design and research, with details and emphases at discretion of instructor.",
    "prerequisites": null,
    "instructors": "Jason Ward - Primary Instructor",
    "schedule_location": "M 2:40pm-3:55pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3077, Section #: 1, Type: LEC, Campus: ATL, Meets: M 2:40-3:55p, Instructor: J. Ward, Status: Wait List",
    "date_accessed": "2024-03-30"
}