{
    "course_code": "HIST 453W",
    "course_title": "China and the World",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 8 / Seats Avail: 2",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": "Continuing Writing Requirement",
    "permission": "Department Consent Required",
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as EAS 453W 1)\n(Permission of Instructor Required Prior to Enrollment)\n(It is strongly recommended that students have taken at least one course in history or a related field prior to registering for this course)\n(China is known to its own people as Zhongguo, meaning \"The Middle Kingdom,\" an appellation that smacks of arrogance, and many have considered China to be ossified and closed to outside influences. But contemporary scholars are beginning to show that China was for much of its history an \"Open Empire,\" receptive to ideas from outside and in close contact with other areas of the world. This course attempts to resolve or at least clarify this paradox by approaching Chinese history from a global perspective. We will explore topics such as the Zheng He voyages, the so-called \"maritime prohibition,\" the tribute system, and China's relations with Western powers. We will also make explicit comparisons between China and the West, especially as regards science, military power, and commerce. \nWriting history is a key endeavor in this course, and each student will complete a fifteen- to twenty-page work of historical scholarship based on a topic to be decided in consultation with the instructor. We will focus on the elements of effective writing at the micro and macro levels: how to select a topic that engages with preexisting literature, how to locate and select sources, how to evaluate and read sources, how to outline, how to write rough drafts, etc. Each student will also deliver two or more oral presentations.)",
    "course_description": "Jr/Sr Colloquium. \nThis course examines China's relations with and connections to the rest of the world, with a focus on China's relations with Europeans, focusing on the period 1400 -1911. It is a writing-intensive course, and the writing of a history research paper is the primary goal.",
    "prerequisites": null,
    "instructors": "Tonio Andrade - Primary Instructor",
    "schedule_location": "M 6pm-8:30pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 3893, Section #: 1, Type: SEM, Campus: ATL, Meets: M 6-8:30p, Instructor: T. Andrade, Status: Open",
    "date_accessed": "2024-03-30"
}