{
    "course_code": "HIST 488RW",
    "course_title": "Jr./Sr. Colloquium: U.S.: Transpacific Lives",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 5Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Continuing Writing Requirement",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "This seminar will explore the history of US-Pacific relations through biographies, autobiographies, and historical monographs whose narratives are driven by an identifiable cast of central figures. The focus on \"lives\" is not primarily meant to unearth the details of personal lives. Rather, it is meant to inquire how tracing the lives of mobile historical actors challenges conventional periodization and geographical boundaries, and how it raises new questions in historical inquiry. Students will be introduced to various groups of mobile subjects-missionaries, students, immigrants, novelists, political activists, and politicians-whose transpacific journeys reveal historical connections that have been obscured by nation-bound narratives. For the final project, students will produce a 20-page original research paper. Previous course work in Asian American history and/or US-Asia relations is strongly recommended before taking this course.",
    "course_description": "All history majors except those who complete the Honors Program must take two colloquia (HIST 487, 488 or 489). Each colloquium treats a special theme by reading, discussion, and writing of papers. Enrollment in each is limited to twelve; non-majors are welcome within space limitations.",
    "prerequisites": null,
    "instructors": "Chris Suh - Primary Instructor",
    "schedule_location": "T 6pm-8:30pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 3883, Section #: 3, Type: SEM, Campus: ATL, Meets: T 6-8:30p, Instructor: C. Suh, Status: Open",
    "date_accessed": "2024-03-30"
}