{
    "course_code": "HIST 585",
    "course_title": "Special Topics in History: Colonial/Postcolonial History",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 3 / Seats Avail: 2",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "Same as WGS 730R 2, ANT 585 9, RLR 700 5)  This class will meet on Mondays 2:40-5:35 pm.\n\n\nComplete Topic:  Colonial & Postcolonial Histories: Explorations.\n\n\nThe course begins with a consideration of the philosophical differences between colonial and postcolonial histories. The former believe in the absolute, universal truth of their findings, presented from some Archimedean standpoint, above if not outside society. Postcolonial histories speak of multiple knowledge-positions, of histories that are necessarily partial and selective, that appear different from different locations, and are always implicated in the here and now of social and political interests. The seminar will investigate crosscurrents within and across cultures and regions, confluences and contradictions that go into the articulation of particular histories. We will also explore intersections across time, the conversation between a mutually constitutive past and present that occurs whenever history is written. \nThe seminar will be built around a close reading of texts recognized for their critical intervention in debates on the making of the modern world: texts emerging from deliberations in feminism, subaltern studies, borderland studies, critical race theory: in South Asia, North and South America, Europe and other areas that participants wish to explore.",
    "course_description": null,
    "prerequisites": null,
    "instructors": "Gyanendra Pandey - Primary Instructor",
    "schedule_location": "M 2:40pm-5:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 5308, Section #: 5, Type: SEM, Campus: ATL, Meets: M 2:40-5:35p, Instructor: G. Pandey, Status: Open",
    "date_accessed": "2024-03-30"
}