{
    "course_code": "HIST 585",
    "course_title": "Special Topics in History: Digital Schlrship/Media Stdies",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 6 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Closed",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as DSMS 700 1)\n(This seminar offers an interdisciplinary introduction to digital technologies and their use in research and publishing in the humanities and social sciences. The course will survey the historical emergence of network society, the changing modes of digital production and dissemination of knowledge, the scholarly use of new media, and critical perspectives on the digital humanities.  Along with assigned readings, an invited array of digital practitioners will demonstrate research tools, software applications, and publishing platforms. Students will work on a semester project and/or paper of their choosing and appropriate to their areas of interest. No technical expertise or prerequisites are needed.)\n(DSMS 700 is the core seminar for the Certificate in Digital Scholarship and Media Studies offered by the Laney Graduate School.  (The course is open to graduate students in any academic department, library staff, and to advanced undergraduates.)\nThis seminar relies on open educational resources, public websites, and scholarly articles freely available online. Assignments will address the history of the internet and worldwide web, social movements and networked society, digital privacy and security, corporate monopolies of digital resources, current debates in digital scholarship, approaches to textual analysis, digital mapping and visualizations, and new forms of open access scholarly publishing.)",
    "course_description": null,
    "prerequisites": null,
    "instructors": "Allen Tullos - Primary Instructor",
    "schedule_location": "T 6pm-9pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3083, Section #: 3, Type: SEM, Campus: ATL, Meets: T 6-9p, Instructor: A. Tullos, Status: Closed",
    "date_accessed": "2024-03-30"
}