{
    "course_code": "HIST 585",
    "course_title": "Special Topics in History: Anti-Black Racism & Violence",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 4",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Complete topic: Anti-Black Racism, Violence, and Mass Incarceration in the U.S.)\n(This course will focus, in part, on postbellum constructions of 'blackness' as deviant, dangerous, and criminal. These racialized notions were significant departures from antebellum racial stereotypes: namely, 'Sambo,' 'Coon,' 'Mammy,' and 'Jezebel' ;which imagined and projected enslaved peoples as compliant, harmless, and obedient to white patriarchal and paternalistic regimes. Ultimately, both antebellum and postbellum racialized notions were elaborate psycho-political mechanisms meant to sate ethical concerns about slavery and sexual violence, reconcile religious and ideological contradictions, and provide rationales for the twin paradoxes of slavery and Jim Crow in U.S. history. Notions of postbellum blackness, then, did both psychological and political work in the white imaginary and the histories and legacies of the criminalization of blackness, lynchings, race riots, mass incarceration, and the rise of the 'new' Jim Crow form a long continuum of thought, action, 'memory,' and race making in the modern U.S. Through the assigned readings and engaged discussions, this course will assess the various connections between race, gender, anti-black violence, and mass incarceration in the U.S. from Reconstruction to the present.)",
    "course_description": null,
    "prerequisites": null,
    "instructors": "Walter Rucker - Primary Instructor",
    "schedule_location": "Th 6pm-9pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 3081, Section #: 2, Type: SEM, Campus: ATL, Meets: Th 6-9p, Instructor: W. Rucker, Status: Open",
    "date_accessed": "2024-03-30"
}