{
    "course_code": "HIST 585",
    "course_title": "Special Topics in History: Research & Writing Workshop",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 4 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as HISP 520 1)\nThe challenges that scholars of Latin American, Caribbean, and Hispanic Studies face are remarkably similar across disciplines and topics as research transitions from an initial idea to an excellent research question to a well-argued final project. Because each participant in this seminar has a different project, we will use a workshop approach to produce, comment on, and be critiqued in a supportive and respectful manner.  We will analyze each other's work and push each other for greater clarity and insight as we contribute meaningfully on issues of conceptualization, source critique, methodology, and comparison. Instruction will focus on approaches to developing and writing research papers, with the final goal of submitting a publishable article to a peer-reviewed journal. Students may develop a paper written for a seminar in the previous semester or may initiate a new project. The course also addresses types of journals, journal audiences, the mechanics and ethics of manuscript submission, and the ethics and politics of choosing to publish in Spanish (Portuguese) or English.",
    "course_description": null,
    "prerequisites": null,
    "instructors": "Jeffrey Lesser - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Math & Science Center - N304",
    "course_resources": null,
    "sections": "Class Nbr: 5371, Section #: 7, Type: SEM, Campus: ATL, Meets: MW 1-2:15p, Instructor: Lesser/Stolley, Status: Open",
    "date_accessed": "2024-03-30"
}