{
    "course_code": "HIST 799R",
    "course_title": "Advanced Research",
    "credit_hours": "1-9",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": null,
    "course_description": null,
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: This section is full 5436, Section #: 1, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: T. Andrade, Status: Closed\nClass Nbr: This section is full 5445, Section #: 10, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Andrade/Ravina, Status: Closed\nClass Nbr: This section is full 5446, Section #: 11, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: C. Crais, Status: Closed\nClass Nbr: This section is full 5447, Section #: 12, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Crespino, Status: Closed\nClass Nbr: This section is full 5448, Section #: 13, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Evans-Grubbs, Status: Closed\nClass Nbr: This section is full 5772, Section #: 14, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Harris/Yannakakis, Status: Closed\nClass Nbr: This section is full 5437, Section #: 2, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Evans-Grubbs/Pastan, Status: Closed\nClass Nbr: This section is full 5438, Section #: 3, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Goldstein/Schainker, Status: Closed\nClass Nbr: This section is full 5439, Section #: 4, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. LaChance, Status: Closed\nClass Nbr: This section is full 5440, Section #: 5, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Lesser/Rogers, Status: Closed\nClass Nbr: This section is full 5441, Section #: 6, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Payne, Status: Closed\nClass Nbr: This section is full 5442, Section #: 7, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Tullos, Status: Closed\nClass Nbr: This section is full 5443, Section #: 8, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Villa-Flores, Status: Closed\nClass Nbr: This section is full 5444, Section #: 9, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Y. Yannakakis, Status: Closed",
    "date_accessed": "2024-03-30"
}