{
    "course_code": "ACT 399R",
    "course_title": "Special Topics in Accounting: Sustainability Measures",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Graded",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "What gets measured gets done, what gets measured and fed back gets done well, what gets rewarded gets repeated (John E. Jones III). Sustainability is a cause and concern for all of us, as it is about taking extraordinary care to preserve and protect our planet and our people. This course focuses on how companies can tell their ESG story with meaning, relevance, context, and success. We will discuss how a company can tell an effective sustainability story, whether sustainability reports add value to a stakeholder, what they should measure, and how meaningful they are, especially absent a common required framework. We will also discuss the standards the company should follow, especially given that many organizations have set standards (e.g., Global reporting Initiative in the EU, the SASB/VRF in the US) but there is no universal, uniform set of standards. We will discuss the fact that while external entities provide ESG ratings of companies, these ratings are limited absent a consistent methodology and common standards. We will focus on these areas in the context of the SEC's call for greater disclosure about climate change. We will study sustainability reports of Delta Airlines, UPS, and Exxon and examine best practices in sustainability reporting.",
    "course_description": "Special Topics in Accounting",
    "prerequisites": "This section is reserved for students in the BBA program.",
    "instructors": "Usha Rackliffe - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in Goizueta Business School 231",
    "course_resources": null,
    "sections": "Class Nbr: 4849, Section #: 1144, Type: LEC, Campus: ATL, Meets: MW 10-11:15a, Instructor: U. Rackliffe, Status: Wait List",
    "date_accessed": "2024-03-30"
}