{
    "course_code": "LING 340",
    "course_title": "Topics in Sociolinguistics: Discourse Analysis",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 18Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "This course examines written texts and spoken language in both informal and highly institutionalized settings.  Some questions that we ask include:  What makes conversation work and how do we know when a conversation has gone wrong?  What are the different features of institutional talk such as interviews and political speeches?  How are different \"voices\" used in spoken and written narratives?  How do we display aspects of our identity in spoken and written texts?  How do speakers exert institutional power over others in interactions?  How do speaker belief systems shape discourse and how dos discourse reinforce belief systems?  This course will introduce students to the ways that conversation, narrative, and language variation function in naturally occurring language data. Students will also learn the practical aspects of collecting and transcribing speech and we will review theoretical debates for how to relate the details of spoken and written \"texts\" to broader social categories such as power, identity, culture, and speaker roles.",
    "course_description": "This course studies relations between language and society, relations between language and sociocultural context. Topics may include: language variation; multilingualism; verbal interaction; discourse analysis; ethnography of communication; sociolinguistics of Spanish.",
    "prerequisites": null,
    "instructors": "Erica Britt - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in White Hall 200",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_LING_340_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3412, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: E. Britt, Status: Open",
    "date_accessed": "2024-03-29"
}