{
    "course_code": "PHYS 141",
    "course_title": "Intro Physics I W/Lab",
    "credit_hours": "4",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall",
    "requirement_designation": "Varies by section",
    "permission": null,
    "dates": "2021-05-17 through 2021-06-23",
    "class_notes": "Please make sure you're aware of the minimum Emory computer requirements for online courses.  Our physics labs will require you have a computer with either a Windows or Mac operating system.  Chromebooks will not be compatible with several key pieces of software our intro physics labs need.  Documentation of this requirement is at:  http://it.emory.edu/studentdigitallife/support/tech-recs.html\n\n\nThis is an online course. Emory College Online summer courses have required synchronous/live sessions every week. Students must be available to sign into and virtually attend the course online during those times (noted as the course meeting times- all times listed are local to Atlanta). Each course will also involve significant asynchronous material that you access on your own time in addition to standard amounts of readings and course assignments. Students should plan to spend 15-20 hours/week on this course. Please also be aware that faculty will begin corresponding with students during Week Zero of the course (one week before the official start date of the course), and that some interaction with the course may be required at that time. Students should begin checking the Canvas course site regularly one week prior to the official start of the term.",
    "course_description": "Introductory classical mechanics and thermodynamics. The student is expected to be competent in algebra, trigonometry, and plane geometry. Physics 141 and 142 are appropriate courses to satisfy a one-year physics requirement for professional schools.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": "Varies by section",
    "course_resources": null,
    "sections": "Class Nbr: 1455, Section #: 1, Type: LEC, Campus: ATL, Meets: MTWThF 11:30a-12:50p, Instructor: T. Bing, Status: Open\nClass Nbr: 1456, Section #: 2, Type: LAB, Campus: ATL, Meets: TTh 2:30-5:30p, Instructor: Donofrio/Bing, Status: Open\nClass Nbr: This section is full 1457, Section #: 3, Type: LAB, Campus: ATL, Meets: TTh 2:30-5:30p, Instructor: Team, Status: Closed\nClass Nbr: 1458, Section #: 4, Type: LAB, Campus: ATL, Meets: TTh 6:30-9:30p, Instructor: Donofrio/Bing, Status: Open\nClass Nbr: This section is full 1459, Section #: 5, Type: LAB, Campus: ATL, Meets: TTh 6:30-9:30p, Instructor: Team, Status: Closed",
    "date_accessed": "2024-03-30"
}