{
    "course_code": "PHYS 116",
    "course_title": "Intro Astronomy W/Lab",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 30 / Seats Avail: 17Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Varies by section",
    "permission": null,
    "dates": "2021-05-17 through 2021-06-23",
    "class_notes": "This is an online course. Emory College Online summer courses have required synchronous/live sessions every week. Students must be available to sign into and virtually attend the course online during those times (noted as the course meeting times- all times listed are local to Atlanta). Each course will also involve significant asynchronous material that you access on your own time in addition to standard amounts of readings and course assignments. Students should plan to spend 15-20 hours/week on this course. Please also be aware that faculty will begin corresponding with students during Week Zero of the course (one week before the official start date of the course), and that some interaction with the course may be required at that time. Students should begin checking the Canvas course site regularly one week prior to the official start of the term.",
    "course_description": "Students having taken Physics 115 for credit may not take this course. A descriptive astronomy course with laboratory. The celestial coordinate system, ancient astronomy, light and telescopes, the solar system, the sun, stellar evolution, galactic astronomy, and cosmology.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": "Varies by section",
    "course_resources": null,
    "sections": "Class Nbr: 1453, Section #: 1, Type: LEC, Campus: ATL, Meets: MWF 2:15-3:15p, Instructor: A. Bans, Status: Open\nClass Nbr: 1454, Section #: 2, Type: LAB, Campus: ATL, Meets: TTh 2:15-3:45p, Instructor: Batiste/Bans, Status: Open",
    "date_accessed": "2024-03-30"
}