{
    "course_code": "PORT 190",
    "course_title": "Freshman Seminar: Portuguese Around the Globe",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "First Year Seminar",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Freshman Seminar - Limited to First Year Students Only)\n(Complete Topic -  Portuguese Around the Globe: An Introduction to Lusophone Cultures)\nSpanning six centuries, this course offers students an introduction to the Portuguese-speaking world. Students will practice analytical skills and gain familiarity with the culture and history of Brazil, Angola, Portugal and Mozambique by engaging with literature, art, music and cinema. Historical moments that we will cover in this course include Portugal's colonialist expansion (1450-1700), the Kingdom of Kongo's response to it (1500-1700), the independence movements in Brazil, Angola and Mozambique (1820-1970), and the most recent cultural movements in music and cinema (1970-2000s). Students will examine different forms of colonialism, and how the legacy of colonialism has shaped today's Lusophone world. Moreover, students will contemplate topics of broader humanistic interest, such as national identities, colonialism, transcontinental cultural exchanges, and forms of resistance to colonial oppression.",
    "course_description": "Introduction to the study of Brazilian and Portuguese societies through different prisms (race and gender relations, national cinemas, sexuality, evolution of historical discourse, music, and more).",
    "prerequisites": null,
    "instructors": "Leonardo Velloso-Lyons - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in North Decatur Bldg 112",
    "course_resources": null,
    "sections": "Class Nbr: 2739, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 1-2:15p, Instructor: L. Velloso-Lyons, Status: Open",
    "date_accessed": "2024-03-30"
}