{
    "course_code": "PSYC 190",
    "course_title": "Fresh Sem: Psychology: States of Consciousness",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First Year Seminar",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Freshmen Only)\n\n\nWhat is like to be conscious as opposed to non-conscious? What qualifies various states of consciousness, and what are they? The seminar aims at reviewing and discussing scientific accounts dealing with these fundamental questions based on the reading of selected articles and chapters taken from the research literature in developmental and comparative psychology, psychopathology, neuroscience, as well as cultural anthropology. Students will be asked to keep a journal written in longhand, filled with their own reflections, reading notes, class notes, as well as mandatory 3-5 page long weekly essays. In addition to class participation and in-class presentation(s), this journal will be the basis of each student's final evaluation. This is a writing intensive course!",
    "course_description": "Small class experience on topics of current psychological interest that fosters a highly interactive and mutually collaborative learning environment involving freshmen and faculty members. Topics include clinical, neuroscience, animal behavior, social, development and cognition.",
    "prerequisites": null,
    "instructors": "Philippe Rochat - Primary Instructor",
    "schedule_location": "W 10am-12:30pm in New Psyc Bldg 493 (36 Eagle Ro",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 5633, Section #: 3, Type: SEM, Campus: ATL, Meets: W 10a-12:30p, Instructor: P. Rochat, Status: Closed",
    "date_accessed": "2024-03-30"
}