{
    "course_code": "PSYC 180",
    "course_title": "Research in College Drug Use",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Natural Sciences(*)",
    "permission": "Department Consent Required",
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Prior completion of PSYC 111 and  QTM 100.  PSYCH 180 is a research seminar that is also an elective (BA) and elective OR quantitative (BS) for psychology majors. The course focuses on providing instruction in theories and concepts associated with college drinking and substance use behaviors. Students will engage in weekly readings from an assigned text and research articles, generate and test hypotheses based on theoretical models using real world data, and generate a research report and poster for their final grade. The course is specifically designed for students early in their tenure at Emory and who have yet to have any research training opportunities. As such, seating is limited for seniors. Sophomore students who have declared their major as psychology and who meet the minimum requirements are strongly encouraged to apply.  Students interested in PSYCH 180 should send Professor Palmer (ROHAN.Palmer@emory.edu) a brief 250-word summary of your motivations for wanting to take the course and a description of your past research experience (if any).\n\n\n(This course focuses on the development of a better understanding of the epidemiology, biology, health practices, and research methods involved in college substance use. Students will obtain a strong foundation in epidemiological practices using hands-on analytical sessions using real-world data from publicly available datasets, including Emory's very own undergraduate student survey, MAPme.)",
    "course_description": "This course focuses on the development of a better understanding of the epidemiology, biology, health practices, and research methods involved in college substance use. Students will obtain a strong foundation in epidemiological practices using hands-on analytical sessions using real-world data.",
    "prerequisites": "QTM 100 or QTM_OX 100 or equivalent transfer credit as corequisite.",
    "instructors": "Prof. Rohan Palmer - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in New Psyc Bldg 361 (36 Eagle Ro",
    "course_resources": null,
    "sections": "Class Nbr: 2765, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: P. Palmer, Status: Open",
    "date_accessed": "2024-03-30"
}