{
    "course_code": "PSYC 385",
    "course_title": "Special Topics in Psychology: Inclusion in Groups",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 60 / Seats Avail: 20",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Prior completion of PSYC 212: Social Psychology AND PSYC 110, or 111, or AP/IB credit in psychology)(This course is designed to offer students a understanding of the theories and scientific research on group processes, with a specific focus on issues related to belonging and social inclusion/exclusion. In the course, students will be immersed in the scientific literature that studies the actions, processes, and changes that occur in and between groups and in and between individuals of these groups. For instance, we will discuss why people join groups, how people react to being excluded, how people recover from social exclusion, how to promote belonging using interventions, why do people voluntarily choose to exclude themselves from groups, what are the positive and negative aspects of solitude, and how social interactions and solitude enhance or undermine wellbeing. In addition to these content topics, we will also discuss the recent advances in methods and practices in this area of research.)",
    "course_description": "A series of special topics of concern to the discipline of psychology. Content will vary in successive offerings. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Dongning Ren - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in White Hall 208",
    "course_resources": null,
    "sections": "Class Nbr: 3011, Section #: 3, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: D. Ren, Status: Open",
    "date_accessed": "2024-03-30"
}