{
    "course_code": "PSYC 797R",
    "course_title": "Directed Research",
    "credit_hours": "1-12",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Varies by section",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Varies by section",
    "course_description": null,
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 2960, Section #: 1, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: P. Wolff, Status: Open\nClass Nbr: 2989, Section #: 10, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: S. Lourenco, Status: Open\nClass Nbr: 2990, Section #: 11, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: P. Brennan, Status: Open\nClass Nbr: 2991, Section #: 12, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: P. Palmer, Status: Open\nClass Nbr: 2993, Section #: 13, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: L. Craighead, Status: Open\nClass Nbr: 2994, Section #: 14, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Klin, Status: Open\nClass Nbr: 2996, Section #: 15, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: L. Nygaard, Status: Open\nClass Nbr: 2997, Section #: 16, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. Dilks, Status: Open\nClass Nbr: 5717, Section #: 17, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: S. Hamann, Status: Open\nClass Nbr: 5730, Section #: 18, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Kelly, Status: Open\nClass Nbr: 2964, Section #: 2, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: I. Waldman, Status: Open\nClass Nbr: 2968, Section #: 3, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: S. Goodman, Status: Open\nClass Nbr: 2972, Section #: 4, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Treadway, Status: Open\nClass Nbr: 2975, Section #: 5, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: P. Kragel, Status: Open\nClass Nbr: 2978, Section #: 6, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: S. Hamann, Status: Open\nClass Nbr: 2983, Section #: 7, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: B. Wilson, Status: Open\nClass Nbr: 2985, Section #: 8, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: R. Hampton, Status: Open\nClass Nbr: 2987, Section #: 9, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: P. Rochat, Status: Open",
    "date_accessed": "2024-03-30"
}