{
    "course_code": "CPLT 202W",
    "course_title": "Literatures, Genres, Media: 20thC Disease Narrative",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "\"The Twentieth-Century Disease Narrative: Sexual and Racial Contagions\" | This course explores the development of the disease narrative in twentieth-century French and English novels, short stories, essays, and memoirs from the U.S., France, and Martinique, as well as German-language psychoanalytic case studies. What are narrative conventions and how do they shape our understanding of disease, infectious and otherwise? How do unconscious mental processes like fantasy and projection affect our relationship to our own and others: illnesses? How do these psychic and narrative processes combine in European and American accounts of disease as contamination by the sexual and racial other? Students will write two essays and participate in discussions on Zoom and Canvas. Potential authors include Frantz Fanon, Édouard Glissant, Sigmund Freud, Henry James, André Gide, Susan Sontag, Audre Lorde, Eve Kosofsky Sedgwick, Toni Morrison, and Gillian Rose.\n\n\n*M ASYNC & W SYNC",
    "course_description": "This course introduces students to the way translation between different literatures, literary genres, and new media impacts our comparative reading of texts.",
    "prerequisites": null,
    "instructors": "Brendan Moore - Primary Instructor",
    "schedule_location": "W 9:40am-10:55am in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 1437, Section #: 1, Type: LEC, Campus: ATL, Meets: W 9:40-10:55a, Instructor: B. Moore, Status: Open",
    "date_accessed": "2024-03-30"
}