{
    "course_code": "CPLT 202W",
    "course_title": "Literatures, Genres, Media: Thinking w Fungi",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "You must have permission to enroll in-person\n\"Thinking with Fungi: Literature and Ecomedia in Conversation\" | As we enter the third decade of the 21st century, the twin crises of environmental devastation & human inequity have been further exacerbated by the onset of a global pandemic. The scope of these issues & their ramifications for the immediate future suggest a widespread failure of our social, economic, & political institutions at many levels. Confronted by increasing isolation & uncertainty, humans today face a profound existential dilemma, but answers may come in unexpected forms. According to mycologist Paul Stamets, \"The story of fungi is the story of our essential unity. The more we understand & respect this third kingdom, the more solutions we'll uncover for the many challenges that face us.\" A bold & curious assertion to the uninitiated, the idea that fungi play a significant role in sustaining life may seem surprising. But recent research suggests that these historically under-studied life forms may indeed provide remediation for some of our most pressing environmental issues, & perhaps more importantly, offer astonishing insights into the nature of all life on this planet.\n\n\nOnce we begin to understand the true vastness of fungal networks, the real extent to which life is connected to life becomes explicit. In this class, we will explore this idea in its biological & philosophical senses. How might studying organisms such as fungi help us understand the origins & nature of organic life? How does human life fit into this web of existence?  How might we harness the healing properties of fungi to establish healthier, cleaner, & more equitable communities? This class will explore the efforts of writers, artists, & thinkers from a wide range of disciplines to create work in the service of the natural world. Through a comparison of texts in a variety of genres and media, this class will explore the idea that a symbiotic view of life might inspire novel solutions to the environmental & social crises facing us today.\n\n\n*BOTH TTh IN-PERSON SYNC",
    "course_description": "This course introduces students to the way translation between different literatures, literary genres, and new media impacts our comparative reading of texts.",
    "prerequisites": null,
    "instructors": "Laura Hunt - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in Atwood Chemistry Bldg. 215",
    "course_resources": null,
    "sections": "Class Nbr: 1872, Section #: 2, Type: LEC, Campus: ATL, Meets: TTh 1-2:15p, Instructor: L. Hunt, Status: Open",
    "date_accessed": "2024-03-30"
}