{
    "course_code": "CPLT 201W",
    "course_title": "Reading Comparatively: Lyric, Ballad, & Modern Usages",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 9",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "You must have permission to enroll in-person\n\"Lyric, Ballad, and their Modern Usages\" | William Wordsworth in his \"Lyrical Ballads\" lamented the modern industrialization that had dramatically altered social relations but saw poetry as one way to counteract these modern processes. Meanwhile, Walter Benjamin posited that the \"shock experience\" of industrial society had historically altered the mass reception of lyric poetry. This course will explore lyric, ballads, and select criticism to discover some of the key readings in this debate, as well as to grapple with the range, diversity, and linguistic formulations of poetry works impeding an easy resolution of these issues. As a course in comparative literature, students will be engaged with literary and critical works across national traditions. Through readings, discussions, and paper assignments, students will inquire into comparative issues of literature, language, and culture, as they develop their thinking and writing aptitudes. \nReadings to be selected from the following authors: William Wordsworth, Henry Wadsworth Longfellow, Elizabeth Barrett Browning, Charles Baudelaire, Oscar Wilde, Federica García Lorca, Robert Frost, Nazim Hikmet, Muriel Rukeyser, Bertolt Brecht, Walter Benjamin, and Theodor Adorno. All required readings for this course are in English and will be available electronically on Course Reserves and/or Canvas.\nAssessment will be based around three paper assignments; attendance and participation in discussion posts; and a short presentation.\n\n\n*BOTH MW SYNC taught IN-PERSON",
    "course_description": "This course draws on classical, modern, and contemporary texts to introduce skills required for reading comparatively across national traditions and academic disciplines with an emphasis on close reading, critical interpretation, and the multiplicity of linguistic traditions around the world.",
    "prerequisites": null,
    "instructors": "Amir Hussain - Primary Instructor",
    "schedule_location": "MW 4:20pm-5:35pm in Atwood Chemistry Bldg. 215",
    "course_resources": null,
    "sections": "Class Nbr: 1435, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 4:20-5:35p, Instructor: A. Hussain, Status: Open",
    "date_accessed": "2024-03-30"
}