{
    "course_code": "CPLT 301W",
    "course_title": "Methods of Literary Interpretation",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 5",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "\"For Want of Language\" | Is there some hidden relation between desire and language? Each, it would seem, tries to recall something absent; each frequently gives way to fantasy; each seeks communion between self and other. The consequences of such a relation can already be glimpsed in the French verb \"vouloir dire\" (i.e., 'to mean'), which translates literally as \"wanting to say,\" thus suggesting that language is perhaps not so much a carrier of meaning as a desire for it. From this perspective, our course will analyze how literary figures of desire open onto fundamental questions about language, meaning, and identity in general. Focusing especially (though not exclusively) on figures of romantic and sexual desire, we will interpret several works of literature and art using approaches borrowed from psychoanalysis, feminist and queer theory, structuralism, and deconstruction. Texts may include literary works by Ovid, Balzac, Rachilde, Wilde, Butler, Baldwin, and Mishima; films by Marcel Camus and Park Chan-Wook; and essays by Freud, Barthes, Derrida, Cixous, and Edelman.\n\n\n*BOTH TTH SYNC",
    "course_description": "An introduction to a specific method of literary criticism or theoretical approach as applied through close textual interpretations.",
    "prerequisites": null,
    "instructors": "Andrew Kingston - Primary Instructor",
    "schedule_location": "TTh 11:20am-12:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 1450, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 11:20a-12:35p, Instructor: A. Kingston, Status: Open",
    "date_accessed": "2024-03-30"
}