{
    "course_code": "CPLT 489",
    "course_title": "Advanced Special Topics: Faith, White Abol,Black Church",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 3 / Seats Avail: 3Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as AAS 485 1, ENG 489 2, and REL 472 1)\n(Complete Topic: Faith, White Abolitionists, and the Black Church: The Literary Artist during Reconstruction)\n(Beginning after the Emancipation Proclamation was issued by Abraham Lincoln in 1863 and lasting until 1877, the period of Reconstruction stood as a moment when African Americans were legally entitled to enjoy the full rights of citizenship that had been granted to white citizens.  Writing during this period were Albion W. Tourgée and Charles Chesnutt.  Tourgée was a white civil rights pioneer and lawyer; Chesnutt, an African American author, essayists, and lawyer. Both men corresponded, discussing the social conditions and concerns that had arisen since the Civil War, especially the deep racial divisions that continued despite the end of legalized slavery. Both men saw the writing of fiction as one means of advocating for the equality of black citizens. Religion features prominently in their literary texts, with the nascent Black Church having an actual or implied presence in their works.  As artists with different racial backgrounds, they reveal through their literary art how personal views about racial equality and religion can refracted through one's racial identity.)",
    "course_description": "This course is designed to give advanced students the opportunity to investigate intensively an area of special interest. A reading knowledge of one foreign language is prerequisite. Topics may vary, but the goal of the course remains unchanged: the courses focuses on contemporary literary theory.",
    "prerequisites": null,
    "instructors": "Francine Allen - Primary Instructor",
    "schedule_location": "Th 9:40am-10:55am in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 4891, Section #: 2, Type: LEC, Campus: ATL, Meets: Th 9:40-10:55a, Instructor: F. Allen, Status: Open",
    "date_accessed": "2024-03-30"
}