{
    "course_code": "CPLT 389W",
    "course_title": "Special Topics: Literature: Practices of Reading",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 8 / Seats Avail: 4",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "You must have permission to enroll in-person\n(ENG 389W 5) \"Practices of Reading\" | Whether we read for pleasure or intellectual enrichment, to acquire knowledge or as a professional activity, at the heart of our engagement with literature is the practice of reading. Reading is also the method that most commonly defines the study of literature as a discipline.\n\n\nThis course puts reading as a practice into play with reading as a method to ask fundamental questions about our relationship with and to texts: What do we read? Why do we read? How do we read? What do our reading practices effect: what do they do for and to us, for and to others, for and to the world? How does the place from which we read, our sense of who we are and the cultures that shaped us, our public commitments, our beliefs and values: inform what, why, and how we read? Which conceptual frameworks do we find generative for our reading practices and how do we determine those frameworks? How do reading as a critical, professional practice relate to reading privately, 'just for fun'? We will explore these questions through a combination of literary and critical texts chosen, in part, by participants in the seminar. In so doing, we will engage some of the most urgent issues at the heart of the contemporary humanities: Does what and how we read matter, and what does literature have to offer a troubled world?\n\n\nEach student in the class will propose a text that at some point in their lives has been particularly important to them, and we will read these texts together. To get us started, we will begin with Toni Morrison, The Bluest Eye, but subsequent readings will be based on student proposals. Our discussion of these literary texts will be framed and informed by a broad selection of critical texts that offer different conceptual frameworks and analytical approaches to our reading practices. They will include selections by T.W. Adorno, Erich Auerbach, Homi Bhabha, Judith Butler, Hélène Cixous, Jacques Derrida, W.E.B. DuBois, Donna Haraway, Fredric Jameson, Trinh T. Minh-ha, Toni Morrison, Adrienne Rich, Gayatri Spivak.\n\n\n- Weekly: A Course Journal will serve as a record of responses to the literary and critical readings.\n- Early in the semester: A Personal Essay on a literary text that was important to or influenced you in a particular way. \n- End of the semester: A Critical Essay on that same literary text, revisiting your earlier response and reflecting on how (or if) our discussions and readings over the course of the semester have affected how you read this text and what it means to you.\n\n\n*BOTH TTh IN-PERSON SYNC | Depending on our collective comfort level, we might combine in-person (Tuesday) and synchronous remote (Thursday) class meetings each week. The best format will be decided collectively by all those enrolled, or interested, in this class.",
    "course_description": "Lively topical or theoretical approaches to a given set of literary texts or problems. May be repeated for credit when subject varies. Fulfills the post-freshman writing requirement.",
    "prerequisites": null,
    "instructors": "Angelika Bammer - Primary Instructor",
    "schedule_location": "TTh 9:40am-10:55am in New Psyc Bldg 220 (36 Eagle Ro",
    "course_resources": null,
    "sections": "Class Nbr: 1873, Section #: 2, Type: LEC, Campus: ATL, Meets: TTh 9:40-10:55a, Instructor: A. Bammer, Status: Open",
    "date_accessed": "2024-03-30"
}