{
    "course_code": "CPLT 751R",
    "course_title": "Spec Topics: Comparative Literature: Politics of Emotions",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 6 / Seats Avail: 4",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as PHIL 789 2)\n(Co-taught with Elizabeth Goodstein)\n(Reimagining the politics of emotion could not be more urgent. A communication revolution has given birth to new forms of political agency, but also new authoritarian practices; in the midst of a pandemic, the largest-ever global movement for social justice coincides with a resurgence of racism and nativism, and conspiracy theories thrive, feeding widespread distrust of the media and scientific expertise. \nLike political scientists, psychologists, sociologists, and historians, philosophers need to revise inherited models of human being and set aside overly rationalist models of explanation that have justified neglecting and demeaning the politics of passions and kept alive the fantasy of remaking politics itself in the name of reason. We will explore both how emotion matters in politics and how politics shape feeling and identity by reassessing the conceptual and representational foundations of political thought, drawing on music, art, literature and film to disclose new theoretical and practical possibilities. By exploring works and practices that explicitly or implicitly offer a more encompassing view of emotion's mobilizing force, this seminar aspires to create a space for rethinking the place of feelings, moods, and atmospheres in collective life.)",
    "course_description": "This course focuses on a specific body of literary texts, critical approach, or theoretical problem in the area of Comparative Literature.  Students may repeat this course for credit if the subject matter varies.",
    "prerequisites": null,
    "instructors": "Elizabeth Goodstein - Primary Instructor",
    "schedule_location": "W 4pm-7pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 5612, Section #: 9, Type: LEC, Campus: ATL, Meets: W 4-7p, Instructor: Willett/Goodstein, Status: Open",
    "date_accessed": "2024-03-30"
}