{
    "course_code": "CPLT 751R",
    "course_title": "Spec Topics: Comparative Literature: Mind,Brain&Image in Film&Fict.",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 2",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as ENG 789 5, PHIL 789 6, PSYC 770R 4) Title: \"Mind, Brain & Image in Film & Fiction\" | In this course we will explore some of the ways that neuroscience and the mind-brain split have figured in recent film, philosophy & prose fiction. We begin with a discussion of the cave drawings and paintings from the upper Paleolithic period (specifically in Chauvet Cave) & the claim that the human mind essentially begins with the creation of these images. (To spur discussion, we'll read a short selection from The Sapient Mind: Archaeology Meets Neuroscience.)  We'll then jump to Bergson's theory of the image & brain in his book Matter and Memory, followed by excerpts from Gilles Deleuze's two cinema books, The Movement-Image & The Time-Image, where he argues that \"the cinema: never stops tracing the circuits of the brain\".\n\n\nWe continue with excerpts from Patricia Pister's cinema book, The Neuro-image, which extends Deleuze's argument to contemporary films, at which point we will discuss two assigned films, Aronofsky's Pi & Bress & Gruber's The Butterfly Effect.  We then turn to readings about the brain & the mind-brain distinction, beginning with Catherine Malabou's short book, What Should We Do with Our Brain?, followed by a series of readings authored by actual neuroscientists, specifically: Stanislas Dehaene on consciousness & learning, Olaf Sporns on the brain's networks, & Cris Frith's fairly short Making up the Mind: How the Brain Creates our Mental World. Finally, before turning to the prose fiction, we will read a chapter or two from Jonah Lehrer's Proust Was a Neuroscientist. To conclude the course, we will read one or two novels (depending on how much time we have) which the class will choose from the novels that Marco Roth discusses in his essay 'The Rise of the Neuronovel'.\n\n\nRequirements:\n--Read all of the assigned material and fully engage in class discussion. \n--A 20-minute class presentation on a topic of your choice, but that I approve in advance. \n--A 15-18 page seminar paper due at the end of the semester\n\n\n*Counts as elective for NBB Majors\n\n\n*W 4-7PM SYNC ONLINE",
    "course_description": "This course focuses on a specific body of literary texts, critical approach, or theoretical problem in the area of Comparative Literature.  Students may repeat this course for credit if the subject matter varies.",
    "prerequisites": null,
    "instructors": "John H Johnston - Primary Instructor",
    "schedule_location": "W 4pm-7pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 1444, Section #: 3, Type: LEC, Campus: ATL, Meets: W 4-7p, Instructor: J. Johnston, Status: Open",
    "date_accessed": "2024-03-30"
}