{
    "course_code": "ITAL 375",
    "course_title": "Tops in Ital Lit in Trans",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 6Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Summer",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "ITAL 375 Merchants, Monks, and Courtesans: The Novella Traditions in Italy and China \n(Same as CHN 375 3)\nContent:  While the novel, understood as long prose narrative, has long occupied center stage as the quintessentially modern form of fiction, novellas or short stories in the vernacular language were preeminent, best-selling fictional genres during the early modern period. In this course we will explore the rich novella traditions as they developed in Italy and China, roughly from the 13th to the 17th centuries. We will focus on four broad categories (literature, society, ethics, and love) that will allow us to explore points of similarities and divergence between the two traditions, including shifting conceptions of literature, authorship, and readership, the interplay between classical and vernacular culture, the ways in which ethical norms, religious beliefs, gender ideals and conceptions of society shape and are shaped through these stories.",
    "course_description": "Topics to be announced each semester. Course taught in English. May be repeated for credit when syllabus changes. Focus on developing critical analysis and reasoning skills.",
    "prerequisites": null,
    "instructors": "Angela Porcarelli - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Candler Library 124",
    "course_resources": null,
    "sections": "Class Nbr: 1984, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: Porcarelli/Sibau, Status: Open",
    "date_accessed": "2024-03-30"
}