{
    "course_code": "ITAL 376",
    "course_title": "Topics in Italian Culture in Translation: Italian Cinema: Neorealism",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 9 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "(Same as FILM 395R 1)\nITAL 376-1   Italian Cinema. Neorealism to the present \n(Castaldo / MW 10:00-11:15AM in person + weekly asynchronous film screenings).\n \nITAL 376: History of Italian Cinema (Cross-listed with Film Studies)\nContent: A history of Italian cinema from mid 20th century to present day. This class will address both major and less known movements, directors, and genres, devoting particular attention to neorealist films and aesthetics in the light of their international resonance.  We will focus on historical topics, including fascism and antifascism, youth culture, class   struggle, terrorism, mafia, migration and film aesthetics (construction of pathos, landscape, memory, charisma).   Authors will include well known personalities such as Roberto Rossellini, Michelangelo Antonioni, Liliana Cavani, and contemporary filmmakers who are renewing Italian Film  Aesthetics, such as Alice Rohrwacher, Laura Bispuri, and Pietro Marcello. \nClass will be in English. Weekly online screening required (all films will be subtitled in English). All readings will be posted on canvas.",
    "course_description": "Topics to be announced each semester. Course is offered in English. Course content will vary, including topics of literature, history, culture, art history, political thought, current trends, and more. May be repeated for credit when syllabus changes.",
    "prerequisites": null,
    "instructors": "Achille Castaldo - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in MODERN LANGUAGE_128",
    "course_resources": null,
    "sections": "Class Nbr: 2347, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 10-11:15a, Instructor: A. Castaldo, Status: Open",
    "date_accessed": "2024-03-30"
}