{
    "course_code": "ITAL 470",
    "course_title": "Topics in Italian Literature",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 11Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Language [Foreign Language]",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "ITAL 470 La letteratura fantastica \nContent:  Fantasy, legend, and myths have been an integral part of literature through the ages and have always had a very strong influence on all forms of genre fiction. The habit of using real characters or situations and putting them in a world where things that are not expected to happen occur, has always had an appeal on readers. Writers have used fantasy in novels, poetry and short stories and directors have made many movies. \nThis course will provide an overview of the fantastical elements in Italian culture through the analysis of short stories and film. The texts and movies will illustrate cultural topics from the 20th century to the present. We will also see, through real experiences, how people from one country imagine or fantasize about life in a different country, specifically within the context of immigration.",
    "course_description": "In Italian. Intensive study of a single author, genre, literary movement, or period. Topic to be announced in advance. May be repeated for credit when topic varies. Prerequisite: Italian 302 or permission of program director.",
    "prerequisites": null,
    "instructors": "Simona Muratore - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in Carlos Hall 212",
    "course_resources": null,
    "sections": "Class Nbr: 1959, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: S. Muratore, Status: Open",
    "date_accessed": "2024-03-30"
}