{
    "course_code": "ENGRD 224R",
    "course_title": "English for ETSI Students",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 0 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Permission Required Prior to Enrollment)\n\n\nThis three-credit hour class is to be repeated over four semesters for the two-year duration that you attend Emory. The class is designed specifically to support you in developing your academic and informal/social English language proficiency through authentic materials. You will develop and practice your English language skills by reading, listening to, and interpreting diverse texts, engaging in discussions and performing various other activities both inside and outside of the classroom. In addition, it will introduce you to life in America and American culture, history, and traditions through expert guest speakers. Each of you will also be paired with a writing center tutor and conversation partner for extra practice outside of the classroom.\nThis is an English Language Learner (ELL) course. Contact Jane O'Connor (jcoconn@emory.edu) for permission to enroll.",
    "course_description": "3-credit class repeated over 4 semesters. Designed to develop English proficiency for scholars in the Emory-Tibet Science Initiative. Focus on reading, listening, interpreting, discussion. Intro to life in America and American culture, history, and traditions through guest speakers. Pairing with a Writing Center tutor is part of class.",
    "prerequisites": null,
    "instructors": "Jane O'Connor - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in Woodruff Library 215",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3918, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 1-2:15p, Instructor: J. O'Connor, Status: Closed",
    "date_accessed": "2024-03-30"
}