{
    "course_code": "ENGRD 221RW",
    "course_title": "Advanced Writing Workshop",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 0 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": "Department Consent Required",
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Permission Required Prior to Enrollment)\n\n\nRace, Language, and Culture - In this course, we will discuss how race, language, and culture affect our communication. Immigrant people often face preconceived notions about their language proficiency because of how they use language and how they racially and ethnically look. Ethnic accent bullying and linguistic stereotyping are two common dimensions of linguicism, which refers to beliefs or ideologies that discriminate against human beings based on language. In this course, we will read a variety of texts, stories, and articles written by writers from diverse cultures to discuss racial equalities, identities, forms of justice and injustice, bias and oppression, and human rights. Through a variety of tasks and assignments, students will have the opportunity to improve their writing and communication skills.\nThis is an English Language Learner (ELL) course. Contact Jane O'Connor (jcoconn@emory.edu) for permission to enroll.",
    "course_description": "Prerequisites: English 101 or 181 and written permission of instructor. Practical introductions to various kinds of media and professional writing. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Mahmuda Sharmin - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in Ignatius Few Building_131",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3910, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 10-11:15a, Instructor: M. Sharmin, Status: Closed",
    "date_accessed": "2024-03-30"
}