{
    "course_code": "ENGRD 302W",
    "course_title": "Technical Writing",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 3 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Continuing Writing Requirement",
    "permission": "Department Consent Required",
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Same as QTM 302W 1)\n(Permission Required Prior to Enrollment)\n\n\n(Same as XXXXXXXXXXXXXXXXXXXXXXXXX)\n\n\nIn this writing-intensive course, we will practice the effective and ethical communication of specialized technical knowledge and quantitative information. We will introduce rhetorical analysis as a method for understanding how quantitative information can be interpreted and conveyed for a variety of audiences that range from professional researchers to the lay public. Guided by this knowledge, you will exercise strategies for communicating via text, speech, and visuals that are integral to preparing genres like research reports, informative and persuasive infographics, technical instructions, translations, and user-selected or user-generated data sets. While adapting these genres and their conventions for our course goals, we will emphasize what methodological questions to ask, how, and where when analyzing and writing about data. As you gain comfort with thinking of writing and analysis as intertwined and exploratory pursuits, we will develop your facility with practices that center collaboration, transparency, and reproducibility. We will focus especially on how data are rhetorical and how these practices shape the impacts of our data-driven narratives.\nStudents should complete the following form for an enrollment permission number: https://tinyurl.com/ux3yj3ev",
    "course_description": "This writing-intensive course provides students with practice developing rhetorically effective and ethically sensitive communication in genres that characterize professional activity across and outside the university. No prior technical knowledge required.",
    "prerequisites": null,
    "instructors": "Greg Palermo - Primary Instructor",
    "schedule_location": "TTh 4pm-5:15pm in Callaway Center N118",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3923, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 4-5:15p, Instructor: G. Palermo, Status: Wait List",
    "date_accessed": "2024-03-30"
}