{
    "course_code": "ENGRD 223",
    "course_title": "Rhetorical Grammar",
    "credit_hours": "1",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Varies by section",
    "instruction_method": "Distance Learning",
    "typically_offered": "Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "Through a study and analysis of grammar's impact on rhetorical effectiveness, students work with their own writing as they learn to make and adapt grammatical choices to fit audience, purpose, constraints, exigencies, and timing. The notion of good grammar makes most of us think of getting it right or being correct. However, Grammar is all about choices, and these choices are made to forward your argument, help you find an audience, and make a difference with your writing. Grammatical choices are part of the writer's toolkit, helping the writer make meaning in collaboration with a reader. This class is fully online and asynchronous.",
    "course_description": "Through a study and analysis of grammar's impact on rhetorical effectiveness, students work with their own writing as they learn to make and adapt grammatical choices to fit audience, purpose, constraints, exigencies, and timing.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 3911, Section #: 1, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: M. Sharmin, Status: Open\nClass Nbr: This section is full 3913, Section #: 2, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: M. Sharmin, Status: Closed\nClass Nbr: This section is full 3914, Section #: 3, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: M. Sharmin, Status: Closed\nClass Nbr: 3916, Section #: 4, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: M. Sharmin, Status: Open\nClass Nbr: This section is full 5857, Section #: 5, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: R. Birdwell, Status: Closed",
    "date_accessed": "2024-03-30"
}