{
    "course_code": "REL 210RW",
    "course_title": "Classic Religious Texts: Taoism",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 2Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "This course satisfies the new Religion major requirement: -Tradition-Other.\nThis course explores the ideas of Taoism (Daoism), one of the major philosophical traditions of ancient China. We will be thinking through what the texts meant in their original context, and what they might mean for us today. We begin with a close reading of two different translations of the Tao Te Ching (Daodejing) by Lao Tzu (Laozi), the principal classic text. Themes include: ideas about language, political philosophy, relativism, the cultivation of the body, desire, gender, and cosmology. We will then read selections from the Taoist text Chuang Tzu (Zhuangzi), and a brief selection of later Taoist works, especially poetry. We will then focus on two themes: the martial tradition and the utopian tradition, that is, what these Taoist texts have to say about war and violence, and about the ideal peaceful society. We will discover that \"going with the flow\" is never a simple matter.",
    "course_description": "This course will explore classic religious texts in depth, developing skills to interpret sacred, philosophical and ethical works. Social, cultural, and/or philosophical contexts at work will provide interpretive frameworks.",
    "prerequisites": null,
    "instructors": "Eric Reinders - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in New Psyc Bldg 250 (36 Eagle Ro",
    "course_resources": null,
    "sections": "Class Nbr: 2301, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 10-11:15a, Instructor: E. Reinders, Status: Open",
    "date_accessed": "2024-03-30"
}