{
    "course_code": "REL 270",
    "course_title": "Special Topics in Religion: Religion & Social Movements",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 4 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "This course will be taught online. It meets for one synchronous 75-minute session per week on Tuesdays. The rest of the material will be delivered asynchronously.\nThis course satisfies the new Religion major requirement: - Theme, Tradition-Christianity.\nThe connection between religious radicalism and social-political dissent in colonial and modern Latin America remains to this day one of the most fascinating areas of historical inquiry. This course explores the persistent return of the millenarian and messianic impulse in Latin America from the colonial times to the national era. We will discuss the formation, diffusion, and \"defeat\" of these movements in the context of important social, economic and political changes in the history of Iberoamerica. Central to this course will be the analysis of the nature of millennial rhetoric, and more generally the nature of authority, persuasion, and the social construction of reality in each of these movements. Finally, we will address issues of race, class, and gender oppression in our discussion of millennial projects, cataclysmic expectations, and utopian visions of hope and redemption.\n\n\n(Same as SOC 289 1, ANT 285 4 &HIST 296 3)",
    "course_description": "Variety of subjects pertaining to religion. Content will vary in successive offerings. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Javier Villa-Flores - Primary Instructor",
    "schedule_location": "T 10am-11:15am in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2319, Section #: 4, Type: LEC, Campus: ATL, Meets: T 10-11:15a, Instructor: J. Villa-Flores, Status: Wait List",
    "date_accessed": "2024-03-30"
}