{
    "course_code": "REL 270",
    "course_title": "Special Topics in Religion: God, Sex, and Crime",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 6 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "This course will be taught online. It meets for one synchronous 75-minute session per week on Tuesdays. The rest of the material will be delivered asynchronously.\nThis course satisfies the new Religion major requirement: - Theme, Region\nThroughout history, crimes have tested and measured the social and cultural values that hold human beings  together.  In  a  society  such  as  New  Spain  (Mexico)  articulated  around  the  defense  and propagation of Catholic religion, religious crimes constituted a threatening subversion of the colonial discourse that justified the Spanish presence in Mexico, and a contradictory expression of the social tensions  lived  in  the  Spanish  colony.  This  course  will  look  at  colonial  society  through  the  lens  of crime by analyzing some of the main transgressions prosecuted by the Mexican Inquisition between 1520 and 1820, and the specific historical circumstances in which the trials took place. Our goal will be  not  only  to  analyze  the  reasons  for  inquisitorial  repression,  but  also  to  disentangle  the  tensions lived in the social fabric of the colony in light of the classic divides of race, class, and gender.\n\n\n(Same as HIST 296 4 &LACS 270 1)",
    "course_description": "Variety of subjects pertaining to religion. Content will vary in successive offerings. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Javier Villa-Flores - Primary Instructor",
    "schedule_location": "T 1pm-2:15pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2321, Section #: 5, Type: LEC, Campus: ATL, Meets: T 1-2:15p, Instructor: J. Villa-Flores, Status: Wait List",
    "date_accessed": "2024-03-30"
}