{
    "course_code": "REL 270",
    "course_title": "Special Topics in Religion: Jewish Women in the Modern Wor",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 13 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "Topic title: Jewish Women in the Modern World \nDescription: Gender as a category of analysis grew out of the women's movement and the turn to social history in the 1970s, and its dual roots in political activism and academic discourse have given it tremendous power to expand and transform our understandings of fundamental aspects of Jewish religious, historical, and cultural development.  In this course, we'll explore the experience of Jewish women as they accommodated to the social, economic, political, and ideological challenges of modernity in Europe and the United States, and how ideas about gender played a role in the construction of Jewish identities in the modern period.  Using a gendered lens, we'll ask how gender and sexuality fundamentally shaped modern Jewish historical experience, identity, ideology, and imagination from the 17th century forward.  To do so, we will not simply \"add women and stir,\" to borrow a phrase from feminist historians; rather, we will query how gender, the culturally and hierarchically constructed differences between the sexes based on perceived differences, has influenced women's lives and actions.\n\n\n(Same as JS 273 2 & WGS 285 2)",
    "course_description": "Variety of subjects pertaining to religion. Content will vary in successive offerings. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Katherine Rosenblatt - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in White Hall 207",
    "course_resources": null,
    "sections": "Class Nbr: 3883, Section #: 7, Type: LEC, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: K. Rosenblatt, Status: Open",
    "date_accessed": "2024-03-30"
}