{
    "course_code": "REL 370",
    "course_title": "Special Topics in Religion: Spain:Cinema,Fascism,Religios.",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 3 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "\"Spain: Film, Fascism, and Religiosity\" | A close analysis of the correspondences of cinema, fascism, and religiosity in Spain as national / transnational cultural productions. The course will focus on the ability of this artistic media to represent engagement and propaganda of fascism and Catholicism, and resistance to it; manipulation of historical memory, politics, and religion; Spanish religious and political exceptionalism and foreign relations; and the persistence of imperial religiosity and politics. Class discussion will revolve around the ways in which filmmakers deploy strategies to represent these thematic referential axes. Emphasis for students registered in CPLT 389W is on theoretical analysis; for those registered in Film 398W is on national / transnational film; and for those registered in REL 385 is on film and religion / religiosity. The resulting interdisciplinary seminar will unfold as a comparative, interactive engagement of these areas of inquiry\n\n\nWeekly blogposts based on assigned readings, weekly films, and class discussion (30%).\nAttendance and active participation in class discussion (30%).\nPresentation / discussion lead (10%).\nFinal research project (30%).\n\n\nNOTE: this course will meet in person twice a week for 75 minutes of class discussion.  Students will watch the films assigned each week on their own before the Wednesday class session.  All movies will be streamed, with the exception if two, that will be shown in person (dates TBD).\n\n\nSame as CPLT 389-2, FILM 385-1",
    "course_description": "Variety of subjects pertaining to religion. Content will vary in successive offerings. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "María Carrión - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Woodruff Library 214",
    "course_resources": null,
    "sections": "Class Nbr: 3117, Section #: 3, Type: LEC, Campus: ATL, Meets: TTh 10-11:15a, Instructor: Carrión/Ruiz Espigares, Status: Open",
    "date_accessed": "2024-03-30"
}