{
    "course_code": "ANT 280R",
    "course_title": "Anthro. Perspectives: Africa",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as AFS 280R 1) (This course meets synchronously one day/week and has additional asynchronous components.)\n\n\nThis course is an introduction to anthropological perspectives on the African continent.  Though often represented as a single and essentialized place, Africa is a large and diverse continent, characterized by a multiplicity of languages, cultures, geographies, histories, identities and experiences. This course will encourage an appreciation of the diversity and complexity of the continent, and a critical examination of popular representations and misconceptions about its peoples, societies, and politics. Through reading anthropological texts, as well as engaging fiction, film, and music from the continent, students will learn about Africa's diverse geographies, histories, and cultural forms. They will also trace historical trends in anthropology's engagement on the African continent and learn how African scholars have shaped the discipline of anthropology.",
    "course_description": "Anthropological perspectives on the people and cultures on different regions of the world.  May be repeated for credit when topic varies. HSC, may be repeated when topic changes.",
    "prerequisites": null,
    "instructors": "Kristin D Phillips - Primary Instructor",
    "schedule_location": "M 1pm-2:15pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 2875, Section #: 1, Type: LEC, Campus: ATL, Meets: M 1-2:15p, Instructor: K. Phillips, Status: Open",
    "date_accessed": "2024-03-30"
}