{
    "course_code": "ANT 307",
    "course_title": "Human Evolution",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 3Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Summer",
    "requirement_designation": "Science, Nature, Technology",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Strongly recommended prerequisite: ANT 201 or another biological anthropology course, or permission of instructor.) (This course meets synchronously one day/week and has additional asynchronous components.) This course deals with scientific questions of human origins and evolution and the available evidence for our own ancestry over the past 6 million years. We will begin with an overview of theories and techniques such as evolutionary theory, paleontology, paleoenvironmental reconstruction, phylogenetic analysis, genetics, and functional morphology. We will critically examine what key debates have taken place over the last century of exploration and discovery in human evolutionary research, learning how unconventional thinking and spectacular discoveries have shaped current knowledge of our origins. You will meet strange and fascinating historical characters, and then meet our fossil ancestors themselves via virtual databases and online content. Here, you will receive virtual learning about the morphology, life history patterns, locomotor repertoire, behavior, and dietary constraints of our nearest fossil relatives. You will learn what a surprising amount of information scientists can discern from fragmentary fossils and be brought up to date with the most current discoveries and debates in human evolution. Extremely exciting stuff!",
    "course_description": "This class aims to integrate data and theory from genetics, geology, and paleoanthropological evidence to trace the evolution of the human species. Opposing theories regarding the interpretation of data will be the focus of student evaluation.",
    "prerequisites": null,
    "instructors": "Elizabeth Veatch - Primary Instructor",
    "schedule_location": "T 1pm-2:15pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 2479, Section #: 1, Type: LEC, Campus: ATL, Meets: T 1-2:15p, Instructor: E. Veatch, Status: Open",
    "date_accessed": "2024-03-30"
}