{
    "course_code": "ANT 285",
    "course_title": "Anthropology; Special Topics: Concepts/Methods in Biol.Anth.",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 60 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "Equivalent to ANT 201 for Anthro major/minor requirements (does not meet GER lab requirement). Questions: contact Heather Carpenter (hcarpe5@emory.edu).\n\n\n(The overall goal of this course is to build an understanding of how we came to be the way we are. A second goal is to understand how we know what we know about our evolutionary past. We achieve these goals by covering the biological aspects of the human species from comparative and evolutionary perspectives. We will investigate the evolution of our species - and others - though the study of genetics, inheritance, population biology, and the basic principles of evolution. We will also rely on the comparative method; that is we will draw on evidence from other animals, particularly the nonhuman primates and review their ecology, anatomy, morphology, and behavior to gain insights into our own evolutionary past. Finally, we examine cultural evolution and the evolution of human adaptability. Through several case studies we will investigate the ways that populations are adapted to their local contexts and we will explore the demographic and environmental consequences of human's unique biocultural capacities. Through these multiple lines of evidence we hope to create a single picture of the emergence of our species.)",
    "course_description": "Seminar or lecture series on topics of anthropological interest at an intermediate level. Maybe repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Craig Hadley - Primary Instructor",
    "schedule_location": "M 9:40am-10:55am in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2493, Section #: 1, Type: LEC, Campus: ATL, Meets: M 9:40-10:55a, Instructor: Hadley/Liu, Status: Wait List",
    "date_accessed": "2024-03-30"
}