{
    "course_code": "ANT 340",
    "course_title": "Topics in Sociolinguistics: African American Language",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 3",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as LING 340 1, AAS 385 8)  Theoretical linguists are often concerned with how language is organized in the abstract. Psycholinguistics is a relatively young, but rapidly growing discipline that addresses how language might be realized as a component within the general cognitive system, and how language is comprehended, produced, and represented in memory. It is an interdisciplinary effort, drawing on research and techniques from linguistics, psychology, neuroscience, and computer science, and utilizes a variety of methods to investigate the underlying representations and mechanisms that are involved in linguistic computations. Moreover, psycholinguistics does more than simply describe the facts; it attempts to weave what is known about how humans produce and process language into a coherent cognitive system, with enough structure so that we can study its composition in a rigorous, hypothesis driven way. The core areas of psycholinguistics include language acquisition, language production, language comprehension, and language disorders and damage. The major themes of the course are as follows: Uncovering and characterizing the subsystems that account for linguistic performance; How such subsystems interact, and whether they interact within a fixed order; How the major linguistic subsystems relate to more general cognitive mechanisms.",
    "course_description": "This course studies relations between language and society, relations between language and sociocultural context. Topics may include: language variation; multilingualism; verbal interaction; discourse analysis; ethnography of communication; sociolinguistics of Spanish.",
    "prerequisites": null,
    "instructors": "Jason McLarty McLarty - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 4905, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 1-2:15p, Instructor: J. McLarty, Status: Open",
    "date_accessed": "2024-03-30"
}