{
    "course_code": "ANT 328W",
    "course_title": "Women, Religion & Ethnography",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 4 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as REL 328W 1, WGS 328W 1)  This course will be taught online. It meets for two synchronous 75-minute sessions per week on TTh.\nThis course satisfies the new Religion major requirement:- Theme. \nThis course will focus on the lives and voices of women in a range of religious traditions, listening for how they create and negotiate identities and space for themselves within (often) male-dominated traditions. Our primary sources will be ethnographic studies that have paid particular attention to women's multiple religious roles, positions, and status \"on the ground.\" This is an interdisciplinary class between religious studies, women, gender & sexuality studies, and anthropology. Each field of study begins with a different set of assumptions and questions and draws on different sources and methodologies, and thus contributes new perspectives to the other disciplines. One of our primary goals is to learn an ethnographic way of thinking, speaking, and viewing/listening to the world. A central question throughout the course will be: In what ways do ethnographic perspectives and sources expand the boundaries of who and what \"counts\" in the study of religion? This is also a writing intensive course, fulfilling the College writing requirement. We will look not only at the content of the ethnographies we read, but we will also examine the ethnographic research and writing processes represented in each reading. Students will have the opportunity to conduct fieldwork for their final projects.",
    "course_description": "Cross-cultural ethnographic study of women's religious lives, including ritual and leadership roles, forms and contexts of religious expression, and negotiations between dominant cultural representations and women's self-representations.",
    "prerequisites": null,
    "instructors": "Joyce Flueckiger - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 4802, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 1-2:15p, Instructor: Flueckiger/Patankar, Status: Wait List",
    "date_accessed": "2024-03-30"
}