{
    "course_code": "ANT 302",
    "course_title": "Primate Behavior & Ecology",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 50 / Seats Avail: 4Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall",
    "requirement_designation": "Science, Nature, Technology",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "Humans, chimpanzees, gibbons, mandrils, vervets, capuchins, aye-ayes, and more all share a common ancestor. What clusters us together on the evolutionary tree? What sets us apart?  This course investigates what it means to be a primate by examining the morphology, behavior, ecology, and cognition of our non-human primate relatives. In this course, we will draw from fundamental principles in anthropology, animal behavior, biology, ecology, and psychology, to delve into 1) the diversity of the primate taxa, 2) the principles of evolution and how they relate to primate behavior, 3) the ecological and social challenges primates face, and 4) the challenges we face in studying and conserving these species in their natural habitats. By drawing on scientific papers, stories from the field, wildlife documentaries, popular articles, podcasts, and interviews with primatologists, this course will challenge you to critically evaluate key theoretical and methodological issues in primate behavior focusing not just on what scientists know but how they know it.",
    "course_description": "This course surveys the social behavior, behavioral ecology, and adaptations of nonhuman primate species, the extant prosimians, monkeys, and apes.",
    "prerequisites": null,
    "instructors": "Marcela Benitez - Primary Instructor",
    "schedule_location": "TTh 9:40am-10:55am in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 2477, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 9:40-10:55a, Instructor: Benitez/Murphy, Status: Open",
    "date_accessed": "2024-03-30"
}