{
    "course_code": "ANT 285",
    "course_title": "Anthropology; Special Topics: Hormones/Human Social Behavior",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 30 / Seats Avail: 2Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Enrollment is tiered during pre-registration to prioritize space for first-year students. Other students wishing to enroll should contact Heather Carpenter at hcarpe5@emory.edu.)\n(Hormones and Human Social Behavior - Hormones have a bad reputation! They get blamed for making us erratic, emotional, and confrontational. But how do hormones really shape human social behavior? This course will take a distinctly anthropological approach to explore the many ways in which hormones are integral to regulating our unique human sociality, by not only examining their known social effects in humans, but also how these effects can be highly contextual and dependent on environment. Using knowledge from anthropology, psychology, neuroscience, and endocrinology, this course will address: 1. The basics of hormone structure and action, 2. important hormone systems for the regulation of emotion and action, 3. how these hormones shape daily human social life, especially in comparison to other animals, and 4. how these hormones work through development and the environment to create the great variability in human behavior we see today. This course will draw primarily from research articles in order to address not only the knowledge of these scientific fields, but also how such knowledge is produced and interpreted.)",
    "course_description": "Seminar or lecture series on topics of anthropological interest at an intermediate level. Maybe repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Daniel Coppeto - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in White Hall 208",
    "course_resources": null,
    "sections": "Class Nbr: 5633, Section #: 3, Type: LEC, Campus: ATL, Meets: TTh 1-2:15p, Instructor: D. Coppeto, Status: Open",
    "date_accessed": "2024-03-30"
}