{
    "course_code": "ANT 385",
    "course_title": "Special Topics: Anthropology: Culture and Economy",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 8Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as AFS 389 2) What do subsistence farmers in rural Africa, merchants in a Middle Eastern bazaar, and stock traders on the floor of New York's Wall Street have in common?  Answer: they all pursue activities strongly shaped by cultural and social relations regardless of whether they be in highly advanced capitalist or low-income economies.  Understanding the ways in which culture and economy interact has been the focus of anthropological studies for more than 100 years and it continues to define some of the discipline's most exciting and relevant work.        \n\tThe purpose of this course is to provide the student with a selected overview of the history, debates, and major topical issues in anthropological studies of economy. It will show how anthropologists study the economic bases of social and cultural life with an emphasis both on agrarian and urban economies.  The course is intended to give the student a critical awareness and understanding of the different theoretical and empirical issues that have defined the field of economic anthropology, as well as demonstrate the ways they have enriched understandings of important contemporary issues, including inequality, ethics and social justice, poverty, and globalization.  It does not require any prior knowledge of the disciplines of anthropology and economics.",
    "course_description": "Seminar or lecture series of topics of anthropological concern. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "William Boose - Primary Instructor",
    "schedule_location": "TTh 11:20am-12:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 2496, Section #: 4, Type: LEC, Campus: ATL, Meets: TTh 11:20a-12:35p, Instructor: Little/Boose, Status: Open",
    "date_accessed": "2024-03-30"
}