{
    "course_code": "ANT 385",
    "course_title": "Special Topics: Anthropology: Life on a Disrupted Planet",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "From wildfires in California to rising sea levels and disappearing honey bees, the planet on which we make our home is increasingly unstable. Now, more than ever, it is imperative to re-think how humans relate to the environment and to one another. Taking this challenge head on, this advanced cultural anthropology seminar will explore human futures and precarious presents by engaging contemporary scholarship, art, and media on climate change and the anthropocene: the new geologic age defined by human effects on global ecosystems. The course will use the anthropocene as a lens to explore key anthropological concepts such as politics, knowledge production, racial justice, and development. We will explore how communities from across the planet engage and conceptualize their changing environments and how people imagine their future in light of the social and environmental processes around them. Students will research how climate change and the anthropocene are engaged by anthropologists, policy makers, artists, and activists working across media and world areas. We will work together to envision the role that anthropology can play in helping communities face emerging ecological challenges and envision new forms of relation and understanding between humans and their environments. Grading in this class will be based on active participation in synchronous class sessions, the quality of engagement with asynchronous material, and successful completion of a mid-term and final project.",
    "course_description": "Seminar or lecture series of topics of anthropological concern. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Scott Schnur - Primary Instructor",
    "schedule_location": "Th 1pm-2:15pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 2876, Section #: 2, Type: LEC, Campus: ATL, Meets: Th 1-2:15p, Instructor: S. Schnur, Status: Open",
    "date_accessed": "2024-03-30"
}