{
    "course_code": "ANT 380",
    "course_title": "Muslim Cultures and Politics",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 17Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as MESAS 370 5 and WGS 385 4) \nFew symbols in today's world are as laden and fraught as sharia, an Arabic-origin term referring to the straight path, the path God revealed for humans, the norms and rules guiding Muslims on that path, and Islamic law and normativity. Yet the ways Muslim men and women experience the myriad dimensions of sharia often go unnoticed and unpublicized, as do the everyday lives of 'ordinary Muslims.' \nThis course aims to help ameliorate this situation by exploring the life experiences of an important cross-section of the world's ordinary Muslims in both Muslim-majority nations and the West (especially the U.S.). More specifically, the course examines how anthropologists have approached the study of Muslim cultures and politics and what we have learned from their scholarship about 'everyday Islam,' piety, race, music, popular culture, law, and social justice, with particular reference to the transnational Palestinian LGBTQ social movement and issues of gender variance and same-sex relations in the Middle East and Southeast Asia.",
    "course_description": "How have anthropologists approached the study of Muslim cultures and politics and what have we learned from their scholarship about ritual and religion, gender and subjectivity, law and social justice, and the politics and poetics of \"writing culture\"?",
    "prerequisites": null,
    "instructors": "Michael Peletz - Primary Instructor",
    "schedule_location": "TTh 2:40pm-3:55pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 2498, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 2:40-3:55p, Instructor: Peletz/Bingul, Status: Open",
    "date_accessed": "2024-03-30"
}