{
    "course_code": "ANT 385",
    "course_title": "Special Topics: Anthropology: Masculinity & Mortality",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 35 / Seats Avail: 9Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "This course concerns gender and health, with a specific focus on men. It uses a biocultural medical anthropological perspective. Most gender-focused scholarship focuses on women, but issues of male sex and masculine gender deserve further anthropological exploration.  Our readings and discussion will center on the questions - what does it mean to be a man? why is being a male harmful to one's health? Is this about biology or culture? Is it male biological inferiority or culturally coded ideals of masculinity that result risky behaviors, more violence, less interest in healthy behavior? In the future, will males become irrelevant?\nAcross the globe, health outcomes for men and boys are significantly worse than for women and girls. The \"Female Longevity Advantage\" will be explored.  We also examine questions of mortality and health care for the aged and dying.  The excess burden of morbidity and mortality -- \"men's health gap\" -- is particularly acute among men who are marginalized due to the intersectionality of their gender identities with racial, ethnic, sexual and socioeconomic positionalities. In general, men's comparatively higher status, which afford them greater access to power, privilege and opportunity, do not translate into more robust health outcomes.",
    "course_description": "Seminar or lecture series of topics of anthropological concern. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Peter J Brown - Primary Instructor",
    "schedule_location": "TTh 4:20pm-5:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 2494, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 4:20-5:35p, Instructor: P. Brown, Status: Open",
    "date_accessed": "2024-03-30"
}