{
    "course_code": "ANT 385",
    "course_title": "Special Topics: Anthropology: Women and Gender in Africa",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 4Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as AFS 389 1 and WGS 385 5) (This course meets synchronously one day/week and has additional asynchronous components.) This course explores how social, economic, and political transformations in colonial and postcolonial Africa have influenced women's experiences and gender relations on the continent. How did colonialism transform existing gender systems in Africa? How are African women today agitating for increased political spaces? Students will address such questions through engaging with African feminist theories, African women's writing, audiovisual material, historical texts, and anthropological scholarship. We will examine how the experiences of African women and conceptions about gender on the continent were influenced by forces such as colonialism, independence struggles, women's movements, political activism, human rights discourses, development aid, structural adjustment programs, among others. Throughout the course, we will see how African women have shaped their communities and cultivated spaces for agency, autonomy, and renewal amidst hegemonic cultural and political forces.",
    "course_description": "Seminar or lecture series of topics of anthropological concern. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Miriam Kilimo - Primary Instructor",
    "schedule_location": "W 9:40am-10:55am in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 2495, Section #: 3, Type: LEC, Campus: ATL, Meets: W 9:40-10:55a, Instructor: M. Kilimo, Status: Open",
    "date_accessed": "2024-03-30"
}