{
    "course_code": "ANT 585",
    "course_title": "Spec Tops: Anthropology: Research Methods Soc.Sciences",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 9",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "Permission of instructor required. Email permission to graduate coordinator to enroll: kay.norgard@emory.edu.\n\n\nIn this course students will 1) be introduced to a menu of anthropological methods in data collection and analysis, 2) be encouraged to think about integrating modes of data collection and analyses into a particular project, 3) discuss the advantages and disadvantages of mixed method research projects, 4) practice executing specific methods of collection and analysis, 5) gain familiarity with common qualitative and quantitative software programs, and 6) and practice how to give an effective research presentation. The course emphasizes practical applications and the integration of ethnographic, surveys, experimental and analytical tools. Data collection topics will include ethnographic interviewing, freelisting, semi-structured interviews, cognitive tasks, surveys, and time allocation. Analytical techniques will include some basic statistics, scale design, content analysis and identifying themes, and social network, cultural consensus, and text analysis. This course will be best for students who plan on conducting collecting primary data and who are interested in utilizing (and mixing) qualitative and quantitative data collection methods.",
    "course_description": null,
    "prerequisites": null,
    "instructors": "Craig Hadley - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 2874, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 1-2:15p, Instructor: C. Hadley, Status: Open",
    "date_accessed": "2024-03-30"
}