{
    "course_code": "ANT 501",
    "course_title": "History Anthropological Thought I",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 4",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "Permission of instructor required. Email permission to graduate coordinator to enroll: kay.norgard@emory.edu.\n\n\nThis course focuses on the history of theory in socio-cultural anthropology, beginning with the founding figures of the 19th century (such as Tylor and Morgan) and continuing through the present (Bourdieu, Foucault, Appadurai, Ortner, Mahmood, De Leon, Atshan, etc.). Along the way we will examine important traditions in early and mid-20th-century American anthropology, British Social Anthropology, and French Structuralism (represented by Zora Neale Hurston, Margaret Mead, E.E. Evans-Pritchard, and Claude Levi-Strauss), as well as intellectual developments that helped define the discipline in the second half of the 20th century, such as cultural materialism, interpretive/symbolic anthropology, political economy, practice theory, and feminist anthropology. In addition to critically examining the strengths and weaknesses of the dominant approaches and paradigms in the history of the discipline, we will explore the contributions that anthropology can make to our understanding of contemporary societies and cultures and processes of modernity and globalization.",
    "course_description": "This course traces some of the main trends in the history of theory in socio-cultural anthropology since the field's origins in the late nineteenth and early twentieth centuries.",
    "prerequisites": null,
    "instructors": "Michael Peletz - Primary Instructor",
    "schedule_location": "MW 4:20pm-5:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 2484, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 4:20-5:35p, Instructor: M. Peletz, Status: Open",
    "date_accessed": "2024-03-30"
}