{
    "course_code": "ANT 585",
    "course_title": "Spec Tops: Anthropology: Scholarly Wk as Creative Pract",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 2 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "\"Scholarly Work as Creative Practice\" | Established forms of scholarly inquiry often appear immutable. The peer-reviewed essay, the monograph, the conference presentation, have long served as professional markers in the academy, counted as evidence of productivity and used for scholarly legitimation. However, the rise of new fields of inquiry, coupled with growing dissatisfaction about the limitations (aesthetic, intellectual, and political) of normative forms, are both challenging these established norms and expanding the ways that scholarly work is practiced. This course explores the productive possibilities of such shifts. Even as the academic humanities continue to grapple with the myriad pressures of a contracting market, this course proposes that the emergence of new forms offers productive opportunities for innovation and creativity. And while our focus will be on a range of text-based forms, we will extend our inquiry to include visual forms, exhibition, and performance.\n________\nJohn Berger and Jean Mohr, A Seventh Man (1975)\nSaidiya Hartman, Wayward Lives, Beautiful Experiments: Intimate Histories of Riotous Black Girls, Troublesome Women, and Queer Radicals (2019)\nTerry Kapsalis and Gina Litherland, The Hysterical Alphabet (2008)\nJason de León, The Land of Open Graves: Living and Dying on the Migrant Trail (2015)\nNick Sousanis, Unflattening (2015)\nKathleen Stewart, Ordinary Affects (2007)\n__________\n1. Weekly exercises: Imitations of assigned class materials with critical commentary.\n2. Final Project: Presentation of a scholarly project in the form of a creative practice, accompanied by a paper offering critical commentary on the reasons for and yield of the chosen form.\n___________\nThe primary texts will be framed by a readings in critical theory readings from a range of fields.\n*Grad course meets once Thur 4-7PM for one 3-hr block sync",
    "course_description": null,
    "prerequisites": null,
    "instructors": "Angelika Bammer - Primary Instructor",
    "schedule_location": "Th 4pm-7pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 5131, Section #: 7, Type: SEM, Campus: ATL, Meets: Th 4-7p, Instructor: A. Bammer, Status: Open",
    "date_accessed": "2024-03-30"
}