{
    "course_code": "BIOL 223",
    "course_title": "Developmental Biology",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 65 / Seats Avail: 40Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "his course will introduce you to the broad field of Developmental Biology.  The fertilized egg, a single cell, gives rise to many cells that form complex multicellular organisms with many different cell types, tissues, and organs.  The overall goal of developmental biology is to elucidate the cellular and molecular processes that control this amazing achievement.  The study of development spans molecular biology, cell biology, genetics, embryology, and importantly, evolution.  These perspectives will be used to explore general principals and fundamental mechanisms that are shared between many diverse organisms, focusing on invertebrate and vertebrate animals.  This includes consideration of human development with examples of medically relevant disorders and social and ethical questions related to the field.  This course fulfills the Column A requirement (or elective credit) for the Biology major.  Prerequisites: Biology 142 + 142L.",
    "course_description": "How does a single cell embryo develop into a fully functional adult organism? We will examine the basic principles underlying development at the cellular, molecular, and organismal levels. Topics covered will include body plan development, examples of organogenesis and cell differentiation.",
    "prerequisites": "(BIOL 142 and BIOL 142L) or BIOL_OX 142 or equivalent transfer credit as a prerequisite.",
    "instructors": "Andreas Fritz - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in 1462 Clifton Rd 308",
    "course_resources": null,
    "sections": "Class Nbr: 2512, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: A. Fritz, Status: Open",
    "date_accessed": "2024-03-30"
}