{
    "course_code": "CL 325W",
    "course_title": "The Classical Tradition & American Founding",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 2",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "(Same as HIST 325W 1)\n\n\nPrerequisite: Freshman Writing Requirement\nCourse fulfills the Continuing Writing Requirement and the HSC Requirement\nCourse Description:\nHow did the American founders draw on the legacy of Greece and Rome?\nHow did the classical heritage shape American civic and political culture?\nThe course poses these and related questions in exploring the classical tradition in colonial America and the United States. We will examine texts both ancient and American as well as other evidence, including film and architecture. Throughout the course we will discuss the ways we continue to encounter classical receptions today.\nMost readings are available online. They include excerpts from Cicero, Virgil, The Federalist, the writings of Alexander Hamilton, Thomas Jefferson, Phillis Wheatley, and from the Columbian Orator.\nRequired Book:\nPlutarch's Lives. The Dryden Translation, ed. Arthur Hugh Clough, Vol. I and Vol. II (The Modern Library/Random House)\nGrading:\nClass participation and discussion emphasized; two midterm essays, final paper; quizzes.",
    "course_description": "A study of the role of the Greco-Roman legacy during formative decades of the American republic and in shaping civic values in the United States.",
    "prerequisites": null,
    "instructors": "Barbara Lawatsch-Melton - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in Candler Library 123",
    "course_resources": null,
    "sections": "Class Nbr: 3058, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 1-2:15p, Instructor: B. Lawatsch-Melton, Status: Open",
    "date_accessed": "2024-03-30"
}