{
    "course_code": "CL 329R",
    "course_title": "Spec Stud in Classical Culture",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 40 / Seats Avail: 32",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "Title:  Role Models from the Past: Leadership in the Roman Exemplary Tradition\nThis seminar will explore leadership through the lens of the ancient Romans' exemplary tradition, a collection of stories intended to enact, preserve, and model `good' leadership.  From Horatius Cocles, who single-handedly defended a bridge from an army of invaders, to Cornelia, the virtuous mother behind two revolutionary politicians, the Romans used exemplary stories to craft a model of leadership for future generations.  Through a variety of ancient prose and poetic texts and material evidence, we will examine the Roman definition of leadership and qualities of a good leader. We will first explore a selection of model exempla along with modern scholarly understandings for what exemplarity is.  In teams, we will then delve deeply into specific exempla in order to better understand the Roman conception of leadership and whether it is still relevant today.  Finally, students will have an opportunity to craft an individual exemplum for a leader (ancient or modern). Can we find exempla for our own world in the Romans' ancient stories or do we need new models for contemporary leadership?  How do we teach leadership today?",
    "course_description": "Topic changes to meet current interest of students and faculty. Course may be repeated for credit as topic varies.",
    "prerequisites": null,
    "instructors": "Emily Master - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Callaway Center C101",
    "course_resources": null,
    "sections": "Class Nbr: 1318, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 10-11:15a, Instructor: E. Master, Status: Open",
    "date_accessed": "2024-03-30"
}