{
    "course_code": "CL 190",
    "course_title": "Freshman Seminar",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 2",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "Texts, art/architecture, and concepts from ancient Greece and Rome persist because people have chosen to preserve them over time. Each choice of preservation/transmission, translation, reference, reinterpretation, appropriation, adaption, and (mis?) representation reflects a conscious choice that is both a product of the choice's own time and a reflection of all the choices that came before it. The cultural identities that people often ascribe to ancient Greece and Rome thus reflect multiple points of reinterpretation within the centuries of antiquity itself and between antiquity and the present. Indeed, these ,received, artifacts of antiquity may reveal as much as or even more about the points in between now and the past than the point at which they were created. \n \nWe will begin by examining what is meant by the term Classical Receptions, and how receptions can function in a variety of ways. The bulk of the semester will be spent examining and analyzing examples of these receptions in the larger categories of politics and propaganda; creations of cultural identity (including the constructs known as the \"Classical Ideal\" and \"Western Civilization\" and their use by ethnonationalists past and present); and both critical and non-critical receptions and references in the arts (especially film, advertising, and pop culture, from the silent film Cabiria to Spike Lee's Chi-Raq to the \"Rumors\" video of Lizzo and Cardi B. and beyond).",
    "course_description": "Limited to freshmen. Topic changes to reflect changing interests of faculty and students.",
    "prerequisites": null,
    "instructors": "Katrina Dickson - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in Candler Library 222A",
    "course_resources": null,
    "sections": "Class Nbr: 5749, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: K. Dickson, Status: Open",
    "date_accessed": "2024-03-30"
}