{
    "course_code": "BIOL 495BW",
    "course_title": "Honors Research",
    "credit_hours": "1-4",
    "seats": "Seats: Maximum Enrollment: 999 / Seats Avail: 958",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Continuing Writing Requirement",
    "permission": "Department Consent Required",
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "Second semester of the two-semester Biology Honors Program available to SENIORS in their last two semesters at Emory.  Students will continue with their research project from Biology 495A and write and defend a thesis in front of an Honors Committee.  Prerequisites:  Biology 142 + 142L, Biology 495A, a declared Biology major, and a 3.5 minimum GPA.  See the Biology Department website for additional information.  Contact Tonya Woolcock at tdavis6@emory.edu to request a permission number.  Successful completion of the Biology Honors Program will provide students with four (4) hours of elective credit and will fulfill the upper-level lab requirement for the Biology major, as well as a writing requirement for the GERs.",
    "course_description": "Prerequisite: consent of departmental honors coordinator. Final semester of independent research for students invited to participate in the biology department Honors Program. WR is satisfied by submission and acceptance of completed honors thesis based on this research.",
    "prerequisites": "This course requires BIOL 142 and BIOL 142L or BIOL_OX142  or BIOL 152 AND BIOL 495A or equivalent transfer credit as a prerequisite.",
    "instructors": "Alexander Escobar - Primary Instructor",
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 1824, Section #: 1, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Escobar, Status: Open",
    "date_accessed": "2024-03-30"
}