{
    "course_code": "BIOL 497R",
    "course_title": "Supervised Reading",
    "credit_hours": "1-4",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "Directed study with a Biology professor.  Permission of instructor is required.  Once permission is received, contact Tonya Woolcock at tdavis6@emory.edu to request a permission number.  This course does NOT count toward the Biology major.",
    "course_description": "Credit, one to four hours per semester. Prerequisite: permission of instructor.",
    "prerequisites": "(BIOL 142 and BIOL 142L) or BIOL_OX 142 or equivalent transfer credit as a prerequisite.",
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 2543, Section #: 1, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: E. Abreu, Status: Open\nClass Nbr: 2554, Section #: 10, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Cole, Status: Open\nClass Nbr: 2556, Section #: 11, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Corbett, Status: Open\nClass Nbr: 2557, Section #: 12, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. De Roode, Status: Open\nClass Nbr: 2558, Section #: 13, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: R. Deal, Status: Open\nClass Nbr: 2559, Section #: 14, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Eisen, Status: Open\nClass Nbr: 2560, Section #: 15, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Escobar, Status: Open\nClass Nbr: 2561, Section #: 16, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Fritz, Status: Open\nClass Nbr: 2563, Section #: 17, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: N. Gerardo, Status: Open\nClass Nbr: 2565, Section #: 18, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. Gorkin, Status: Open\nClass Nbr: 2567, Section #: 19, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. Jaeger, Status: Open\nClass Nbr: 2545, Section #: 2, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: R. Antia, Status: Open\nClass Nbr: 2569, Section #: 20, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: W. Kelly, Status: Open\nClass Nbr: 2570, Section #: 21, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: K. Koelle, Status: Open\nClass Nbr: 2571, Section #: 22, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: S. L'Hernault, Status: Open\nClass Nbr: 2572, Section #: 23, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: B. Levin, Status: Open\nClass Nbr: 2573, Section #: 24, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: R. Liu, Status: Open\nClass Nbr: 2574, Section #: 25, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: L. Morran, Status: Open\nClass Nbr: 2575, Section #: 26, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Murugan, Status: Open\nClass Nbr: 2576, Section #: 27, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: E. Nam, Status: Open\nClass Nbr: 2577, Section #: 28, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: I. Nemenman, Status: Open\nClass Nbr: 2578, Section #: 29, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: K. O'Toole, Status: Open\nClass Nbr: 2546, Section #: 3, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Arbilly, Status: Open\nClass Nbr: 2579, Section #: 30, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Prinz, Status: Open\nClass Nbr: 2580, Section #: 31, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Reyes, Status: Open\nClass Nbr: 2581, Section #: 32, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: L. Rieder, Status: Open\nClass Nbr: 2582, Section #: 33, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: I. Shepherd, Status: Open\nClass Nbr: 2583, Section #: 34, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: S. Sober, Status: Open\nClass Nbr: 2584, Section #: 35, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: R. Spell, Status: Open\nClass Nbr: 2585, Section #: 36, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Thakur, Status: Open\nClass Nbr: 2586, Section #: 37, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: N. Vega, Status: Open\nClass Nbr: 2587, Section #: 38, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: L. Wilson, Status: Open\nClass Nbr: 6029, Section #: 39, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: C. Schmidt, Status: Open\nClass Nbr: 2547, Section #: 4, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: C. Beck, Status: Open\nClass Nbr: 2548, Section #: 5, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: G. Berman, Status: Open\nClass Nbr: 2549, Section #: 6, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: P. Cafferty, Status: Open\nClass Nbr: 2550, Section #: 7, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: R. Calabrese, Status: Open\nClass Nbr: 2551, Section #: 8, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: K. Campbell, Status: Open\nClass Nbr: 2553, Section #: 9, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. Civitello, Status: Open",
    "date_accessed": "2024-03-30"
}