{
    "course_code": "CL 329R",
    "course_title": "Spec Stud in Classical Culture: Age of Nero",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 2",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as ARTHIST 329 1)\n\n\nCL 329R\tSpec Stud in Classical Culture:  Age of Nero       Slater & Varner\t1 MW\nContent\tPerpetuated in the popular imagination and Hollywood films as ancient Rome's most depraved and decadent emperor, Nero is notorious for fiddling while the city of Rome burned. As a poet, performer, and charioteer, Nero scandalized traditional Roman society.  But Nero was also a popular ruler, beloved by the common people.  His 14-year reign was one of the most productive artistic and literary periods in the Roman Empire, witnessing revolutionary developments in architecture, painting, sculpture, epic poetry, drama, philosophy and the novel.  Nero himself carefully controlled his own public image and has been dubbed by some scholars as western history's first popstar.  Was Nero a hero or an anti-hero?  In class discussions and lectures, this course will seek to reveal the man behind the outrageous myths by closely examining one of the most exciting epochs in Roman history through surviving masterpieces of art and literature.\nSelected Texts\t: \nA. Barrett, E. Fantham, and J. C. Yardley, eds, The Emperor Nero.  A Guide to the Ancient Sources \nS. Bartsch, K. Freudenburg and C. Littelwood, eds., The Cambridge Companion to the Age of Nero",
    "course_description": "Topic changes to meet current interest of students and faculty. Course may be repeated for credit as topic varies.",
    "prerequisites": null,
    "instructors": "Niall W Slater - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 3865, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 1-2:15p, Instructor: Slater/Varner, Status: Open",
    "date_accessed": "2024-03-30"
}