{
    "course_code": "CL 487",
    "course_title": "Special Topics in Classics: Power and Propaganda",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 6",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "Manipulation of the masses by those in power has been happening since humans first banded together into groups. Lower literacy rates in the ancient world led to a stronger emphasis on persuasion and communication through visual means vs. texts. In this course we will examine different types of propaganda in the ancient and modern worlds with a heavy emphasis on the visual. We will also explore how perceptions of Classical antiquity as a field have been transformed through the centuries, and how those new receptions have in turn shaped the uses of Classical antiquity as a transmissive medium for modern messaging. \n \nStudent interests will help shape course topics such as: How did Greeks and Romans manipulate perceptions of history? Why are there Roman fasces throughout the U.S. Capitol? How and why have perceptions of Classical antiquity been adapted by modern hate groups? How and why does visual propaganda work from colossal images such as the Statue of Liberty to the physical currency such as state quarters in our pockets and wallets? Why are symbols from Classical antiquity so prevalent in propaganda through the centuries? \n \nThis course is permission only. Preference will be given to Classics majors and minors, and students with a relevant, but all seriously interested students are welcome to apply even if the course appears to be full as I may be able to add a few additional students. \n \nApplication for course:  https://forms.gle/1ptWF2VPrEGBPFuL8",
    "course_description": "Variable course topic means that supplemental topic/structure will be variable as well (options include but are not limited to film/museum/travel/lecture series/independent research/experiential learning). Alternate course to CL 329 which is variable topic without extra component.",
    "prerequisites": null,
    "instructors": "Katrina Dickson - Primary Instructor",
    "schedule_location": "F 1pm-2:15pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 6025, Section #: 1, Type: LEC, Campus: ATL, Meets: F 1-2:15p, Instructor: K. Dickson, Status: Open",
    "date_accessed": "2024-03-30"
}