{
    "course_code": "ENG 210W",
    "course_title": "Major Authors",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 4Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "Course Topic: William Faulkner and Toni Morrison- William Faulkner and Toni Morrison are two of the greatest novelists in the history of the United States. Faulkner was born in 1897 and died in 1962 and spent most of his life in Mississippi. In his fiction, he wrestled with the legacies of the Civil War, largely from the perspective of white families in the American South. He was an extraordinary stylist who advanced literary modernism through his experimental techniques. Toni Morrison was born in 1931 and died in 2019. She earned a master's degree in English from Cornell University where she wrote her thesis on William Faulkner and Virginia Woolf. She writes back to Faulkner, often adopting and extending his literary techniques to illuminate the limits of his vision from her perspective as a black woman.  \n \nThis course introduces students to these two writers through some of their most esteemed novels. We will read Faulkner's As I Lay Dying, The Sound and the Fury, and Absalom, Absalom! and Toni Morrison's Sula, Beloved, and A Mercy. Students will learn the practice of close reading, which is, contrary to its name, a form of writing at the center of literary criticism.",
    "course_description": "An introduction to one or more major authors in English literature, with an emphasis on literary merit and its determination, canon formation, literary movements, and reading strategies.",
    "prerequisites": null,
    "instructors": "Dan Sinykin - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Callaway Center S105",
    "course_resources": null,
    "sections": "Class Nbr: 2359, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: D. Sinykin, Status: Open",
    "date_accessed": "2024-03-30"
}