{
    "course_code": "ENG 206W",
    "course_title": "Introduction to Narrative",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Course Topic: How to Build a World) What if literary worldbuilding is about more than backdrops for characters or settings in which plots unfold? We often take for granted that literature reflects reality and that it discloses truths about its historical moment. But literature also creates. It builds imaginative worlds that are not our own. How and to what ends? We will explore some key ways authors craft their storyworlds, asking: How do storyworlds relate to politics, ideology, and culture? How does worldbuilding fit into ideas of literary and cultural value? How do different genres, forms, and mediums train us to perceive and read in certain ways? What is the relationship between fictional storyworlds and reality of our own collective making? By becoming a better reader of fictional worlds, this class will help us to be better readers, and creators of our world. All readings in this course feature distinct worlds: some realistic, others science fictional, fantastic, alternate histories, and dystopias. Readings include N.K. Jemisin, The City We Became; Kim Stanley Robinson, Ministry for the Future; Colson Whitehead, The Underground Railroad; Cherie Dimaline, The Marrow Thieves; Virginia Woolf, To the Lighthouse; Nick Drnaso, Sabrina. In this class, we will practice the creative act of close reading to understand how diverse authors construct their storyspaces through the medium of language. We will also attempt to build our own \"better\" worlds through our assignments.",
    "course_description": "An introduction to the study of narrative, with an emphasis on narrative fiction and the critical vocabulary used to describe it. Readings will vary by semester, and may include examples from other disciplines.",
    "prerequisites": null,
    "instructors": "Mitch Murray - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in New Psyc Bldg 220 (36 Eagle Ro",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 6001, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: M. Murray, Status: Closed",
    "date_accessed": "2024-03-30"
}