{
    "course_code": "ENG 190",
    "course_title": "Freshman Seminar:English: Lives that Matter:Biography",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 6 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "Same as CPLT 190 1\nComplete Topic - Lives that Matter: Biography in a Social Media Age\nIn a celebrity-obsessed, media-driven, personality-marketing age, we might well wonder: Whose lives matter and why? How do we measure worth? What does it mean to live a good life; what constitutes goodness and on what grounds do we judge? This course takes up such questions by examining some of the ways that texts and images tell stories about people's lives. We will consider biographies in a variety of forms and media that represent people's lives as individuals and members of their respective communities. Biographies raise fundamental questions about the human condition, about love and loss, aspirations and disappointments, courage, pride, and shame. Yet, while they are stories of others, biographies also hold up a mirror to ourselves: What shaped us and who are we becoming? What are we proud of and what do we regret? How well do we know ourselves and can we ever really know another?",
    "course_description": "Every semester. Freshmen only. Through readings on variable topics, frequent writing assignments, and in-class discussions, the seminar emphasizes reasoned discourse and intellectual community. Does not satisfy first-year writing requirement.",
    "prerequisites": null,
    "instructors": "Angelika Bammer - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in New Psyc Bldg 235 (36 Eagle Ro",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 4339, Section #: 4, Type: SEM, Campus: ATL, Meets: TTh 10-11:15a, Instructor: A. Bammer, Status: Closed",
    "date_accessed": "2024-03-30"
}