{
    "course_code": "ENG 290W",
    "course_title": "Topics in Literary History",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "Course Topic: The Spirit of the Age: Revolution and Imagination in the Long Nineteenth Century\n\n\nThis course will explore the period in British literary history from 1789 to 1914. Bookended by political upheaval and war, the long nineteenth century represents a period of massive social, political, scientific, and philosophical change. It also features some of our most beloved writers: William Wordsworth, Jane Austen, Charles Dickens, the Brontë sisters, Oscar Wilde, and others. These poets, novelists, and creative thinkers imagined and reimagined the human experience in times of revolution and radical reform, experimenting with their art forms and developing new modes of expression. The course will examine a variety of genres: poetry, the novel, drama, essays, political documents, and autobiography, across a number of different themes: art and aesthetics, gender and sexuality, politics and imperialism, industrialization and science, etc. We will ask: What is the relationship between the literature and society? What kinds of knowledge does the literary imagination possess and create? Students will develop analytical skills and conduct effective research through different writing assignments, including short close reading essays and a discussion leadership opportunity, as well as a cluster of short research-oriented assignments based on a topic relevant to their interests. Writing projects will emphasize writing as a process with opportunities for feedback and revision.",
    "course_description": "Long historical surveys of national, regional, or ethnic traditions; or of genres or subgenres. Examples: History of African Literature, History of Latinx Literature, History of Science Fiction, History of the Sonnet, History of Southern U.S. Literature, History of Drama.",
    "prerequisites": null,
    "instructors": "Mary Taylor Mann - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in Callaway Center S105",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2390, Section #: 3, Type: LEC, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: M. Mann, Status: Closed",
    "date_accessed": "2024-03-30"
}