{
    "course_code": "ENG 290W",
    "course_title": "Topics in Literary History: Literatures, Genres, Media",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Same as CPLT 202W 3)\n\"Vegetable Love\" | \"In \"The Time is Ripe for Plant Rights,\" Michael Marder argues that it is high time for The Universal Declaration of Human Rights to be revised to include plants. \"There is no doubt that plants are some of the most vulnerable living beings on the planet,\" he argues, \"even according to fairly conservative estimates, one in every five plant species is currently on the brink of extinction.\" Plants, it turns out, index some of the most pressing political questions of our time: how do we manage potentially irreversible changes to the natural environment? How do we live with and through new technology? What type of relationship should people have to plants? Are plants part of the manmade world, or opposed to it? Will we think politics differently if we think plants differently?\nThese questions are not unique to the present moment. In this course, we will explore the plant thinking of various writers and theorists, beginning with Aristotle and then moving through a work from each century from the seventeenth up until the present. In these works, we will encounter narrators who find peaceful refuge in plant life, narrators who use plants to woo women, humans who try to turn themselves into plants, and a plant-alien who tries to pass itself off as a human. Reading these literary texts alongside contemporary essays and films about the Anthropocene era, we will consider how such texts help us define and contest the relationship between nature and the human.\"",
    "course_description": "Long historical surveys of national, regional, or ethnic traditions; or of genres or subgenres. Examples: History of African Literature, History of Latinx Literature, History of Science Fiction, History of the Sonnet, History of Southern U.S. Literature, History of Drama.",
    "prerequisites": null,
    "instructors": "Abby Scribner - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in Anthropology Building 105",
    "course_resources": null,
    "sections": "Class Nbr: 5504, Section #: 4, Type: LEC, Campus: ATL, Meets: TTh 1-2:15p, Instructor: A. Scribner, Status: Open",
    "date_accessed": "2024-03-30"
}