{
    "course_code": "ENG 290W",
    "course_title": "Topics in Literary History: Survey Latinx Lit.(1st to1898)",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 8",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "Course Topic Survey in Latinx Literature (First Contact to 1898) When Columbus arrived to Hispanola (now Haiti-Dominican Republic) on December 4, 1492, the moment of first contact between Indigenous peoples, the slaves he brought with him, and the multi-ethnic sailors paved the way for the new racial and cultural formations that made the Americas distinct from Europe. As borders and empires shifted territory between the Spanish, British, French, Dutch, and Portuguese in North America or what we now call the continental United States, so too did the nature of print culture. The effects of multiple colonizations and governments in North America were documented in the cultural production by an about these groups descending from the Spanish, Indigenous, Africans, and Asians in Latin America as they moved northward and/or were annexed into the United States via war or direct purchase As a result, studies of Latinx literature necessarily analyze texts dating back to the sixteenth century, include nineteenth century exile during the Latin American wars for independence, the Civil War, and trace the evolution of this literature through the present. This first half of the Latinx Literature survey starts with first contact, covers the Spanish period, the Mexican period in the southwest (1821- 1834) the annexation period (1835-1848), the intervention period and U.S. Civil war (1850-1880), and ends with the era of U.S. imperialism in the Caribbean and Pacific (1898).",
    "course_description": "Long historical surveys of national, regional, or ethnic traditions; or of genres or subgenres. Examples: History of African Literature, History of Latinx Literature, History of Science Fiction, History of the Sonnet, History of Southern U.S. Literature, History of Drama.",
    "prerequisites": null,
    "instructors": "Nicole Guidotti-Hernandez - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Callaway Center C203",
    "course_resources": null,
    "sections": "Class Nbr: 2386, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: N. Guidotti-Hernandez, Status: Open",
    "date_accessed": "2024-03-30"
}