{
    "course_code": "ENG 325W",
    "course_title": "The Early English Novel",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "This course will offer a survey of some of the most exciting, innovative, and intellectually provocative novels published in eighteenth-century Britain. A touchstone for our discussions will be the philosopher John Locke's reinvention of the human mind, in his 1690 Essay Concerning Human Understanding: \"Let us then suppose the mind to be, white paper, void of all characters, without any ideas; how comes it to be furnished?\" Locke's answer to this question, \"experience,\" had an enormous impact on the intellectual landscape of the century that followed. On the one hand, Locke's argument that our ideas are derived from the senses suggested that individuals are the products of their own experience, and thus have, in some measure, the power to shape their own lives. On the other hand, the shaping power that Locke attributed to experience conjured up the danger that our minds and our lives are always at the mercy of various external forces: including family and friends, enemies and competitors, as well as an array of social, cultural, and political settings, institutions, and ideologies. More than any other form of literary expression in the eighteenth century, the novel took up the challenge of imagining and embodying, even at times resisting, the power of experience. \n \nWe will study the novels of Daniel Defoe, Samuel Richardson, and Jane Austen, among others. Attendance and active class participation are required; written work will include a combination of exams and essays",
    "course_description": "The development of the English novel in the late seventeenth and eighteenth centuries with representative works by novelists such as Behn, Defoe, Richardson, Fielding, Burney, and Sterne.",
    "prerequisites": null,
    "instructors": "Paul Kelleher - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Callaway Center C203",
    "course_resources": null,
    "sections": "Class Nbr: 2363, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: P. Kelleher, Status: Open",
    "date_accessed": "2024-03-30"
}