{
    "course_code": "ENG 311RW",
    "course_title": "Shakespeare",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "Course Topic: Shakespearean Comedy in the time of #MeToo - What might Shakespearean comedy have to do with what philosopher Kate Manne has recently described as the \"logic of misogyny\"? Is it significant that the word \"misogynist\" itself dates from the early modern period? Why do Shakespearean comedies so often have disconcerting endings? We will explore such questions while contemplating six Shakespearean comedies: from 'light' romantic narratives to more obviously fraught \"problem plays.\" We'll discuss literary scholarship (with perspectives drawn from performance studies, gender and sexuality studies, and premodern critical race studies) and we'll engage conversations inspired by intersectional feminism and the #MeToo movement. Our goal will be to consider how these comedies may illuminate contemporary cultural matters such as the myth of the perfect victim, gaslighting, misogynoir, sexual consent, and sexual assault. Class work will include close reading and critical analysis in the form of discussion posts, essays, and multimodal assignments.",
    "course_description": "Selected major plays from the histories, comedies, tragedies, and romances. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Patricia Cahill - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Callaway Center S105",
    "course_resources": null,
    "sections": "Class Nbr: 2362, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 10-11:15a, Instructor: P. Cahill, Status: Open",
    "date_accessed": "2024-03-30"
}