{
    "course_code": "ENG 385W",
    "course_title": "Methods for Literary Research: Moby-Dick & Of One Blood",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "Course Topic: Moby-Dick and Of One Blood\nIn this course, students will learn about different approaches to literary criticism and scholarship through intensive investigation of two fascinating, globe-spanning American novels: Herman Melville's Moby-Dick (1851) and Pauline Hopkins' Of One Blood (1902). Melville's novel was a total flop at the time of its publication but went on to become celebrated as a visionary work of art in the twentieth and twenty-first century. It has inspired a dizzying array of critical responses grounded in critical race theory, ecocriticism, animal studies, queer theory, disability studies, postcolonial theory and more. Set against a backdrop of racial injustice, Of One Blood is a thrilling tale of adventure, intrigue, and fantasy, involving the discovery of an ancient Wakanda-like civilization in Ethiopia. One of four serialized novels published by the important African American journalist and editor Pauline Hopkins, it was long-neglected but has recently inspired archival research and wide-ranging critical scholarship, which connects the novel to debates about race, politics, spirituality, and psychology. Through short writing assignments and in-class presentations, students will explore how these works have been enlisted in a wider set of critical conversations; these will build toward final research projects in which students contribute to a scholarly conversation of their own curation.",
    "course_description": "This course introduces students to the methods and materials of academic literary research and criticism. Focusing on a small body of literature and scholarship within one area of study, the course will teach students to engage with secondary sources, including contextual and/or archival material.",
    "prerequisites": null,
    "instructors": "Benjamin Reiss - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Callaway Center S105",
    "course_resources": null,
    "sections": "Class Nbr: 3637, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: B. Reiss, Status: Open",
    "date_accessed": "2024-03-30"
}