{
    "course_code": "ENG 389W",
    "course_title": "Special Topics:Literature: Eating in the Archive",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "Course Topic: Eating in the Archive- Eating is among the most universal of human activities: it is both necessary for survival and immensely meaningful, encoding personal memories, cultural values, political ideologies, and more. And yet, to study the significance of eating in past eras often presents a methodological challenge, in that there is no eating, or at least no food, preserved in the archive. This course takes the archive of early America as its focus in order to explore the challenges and opportunities of studying the food cultures of past eras. We will investigate how ideas about food and eating were represented in a range of textual forms, including letters, narratives, poems, novels, and cookbooks. To contextualize these works, we will read theories of the archive as well as scholarship on the social and cultural significance of eating. We also attempt to cook some historical recipes of our own. Over the course of the semester, we will learn how early American accounts of eating, when enriched by their cultural, historical, and theoretical context, can be made to speak to some of the most significant debates of the time, including questions about race and slavery, democracy and nationhood, and about the human itself.",
    "course_description": "Literary topics vary. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Lauren Klein - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Tarbutton Hall 106",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2367, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: L. Klein, Status: Wait List",
    "date_accessed": "2024-03-30"
}