{
    "course_code": "ENG 389W",
    "course_title": "Special Topics:Literature: Fictions of our Climate",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 6",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Course Topic: Fictions of our Climate: Contemporary \"Cli-Fi\") This course explores environmental fiction of the last few years to understand how our natural world is changing, in fact and in imagination, and how some of our best novelists perceive the meaning of these changes. The works studied all deal with current environmental issues, and all are \"Anthropocene\" texts portraying human impacts on planetary systems. This new perspective is resulting in interesting experimentation in the aesthetic management of time and space, characterization, point of view, and assimilation of large scientific ideas. Subjects include climate instability, extinctions, involuntary migrations of both humans and animals, and global inequalities; all challenging topics. But the twin premises of this course are that cognitive courage is more beneficial than denial and that engaged literature is one of our moment's most vital alternatives to fatalism. Novels will include Paulo Bacigalupi, The Water Knife, 2015; Ashley Shelby, South Pole Station, 2017; Richard Powers, The Overstory, 2018; Kim Stanley Robinson, The Ministry of the Future, 2020 Jenny Offill, Weather, 2020, and Lydia Millet, A Children's Bible, 2020. Requirements include contribution to discussion, occasional short response papers, group reports, and midterm and final essays.",
    "course_description": "Literary topics vary. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "John Sitter - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Math & Science Center - N304",
    "course_resources": null,
    "sections": "Class Nbr: 5749, Section #: 5, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: J. Sitter, Status: Open",
    "date_accessed": "2024-03-30"
}