{
    "course_code": "ENG 389W",
    "course_title": "Special Topics:Literature: Margaret Atwood/William Gibson",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 16",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "This course will center on the fiction of Margaret Atwood and William Gibson, two of the most talented and innovative writers of contemporary fiction. Both started with science fiction narratives, though in both cases it was unlike most sci-fi at the time. We shall begin with Atwood's A Handmaid's Tale, which is a feminist narrative set in the future, followed by the \"MaddAddam trilogy\", which focuses on genetic modification of humans and corporate control. Then we shall read Gibson's first novel, Neuromancer, about a hacker's attempt to prevent two huge corporate A.I.s from fusing together. Whereas Atwood's novels have been strongly pro-feminist, pro-environment and pro-animal rights, Gibson's are subtly anti-corporate and anti-capitalist, and mostly concerned with new technologies and the new behaviors they elicit. Gibson's more recent fiction appears to be more directly concerned with the present; but, as he himself has stated: \"The Future is already here; it's just unevenly distributed\". Altogether, we shall try to read three or four of each writer's best.\nCourse requirements: regular participation in class discussion, a midterm exam, two essays (one on each writer), and a final third essay focused on some aspect of the work of both.",
    "course_description": "Literary topics vary. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "John H Johnston - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Callaway Center C101",
    "course_resources": null,
    "sections": "Class Nbr: 5241, Section #: 3, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: J. Johnston, Status: Open",
    "date_accessed": "2024-03-30"
}