{
    "course_code": "ENG 482RW",
    "course_title": "Seminar in Fiction:English: Virginia Woolf & Her Contemp.",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 7",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "In her essay \"How Should One Read a Book?\" Virginia Woolf suggests that the best way to experience fiction is to drop all preconceived notions of what a novel can be: \"do not dictate to your author; try to become him. Be his fellow-worker and his accomplice.\" In this course we will become the accomplices of one of the most inventive and distinctive writers of twentieth-century literature, as we investigate the range and depth of Woolf's impact on the form of the novel itself. Reading our way through much of Woolf's major fiction as well as a selection of her essays, stories, and autobiographical writing, we will think about Woolf as a critic, humorist, feminist, and literary innovator, with special consideration to the way Woolf reinvents traditional representations of character and human consciousness. We'll also examine the work of her Bloomsbury and modernist contemporaries, fictional, visual art, and criticism, as we consider how their need to refresh both life and literature compares to our own cultural position today.\nRequirements will include midterm and final papers, occasional shorter responses, and engaged participation in seminar discussions. Texts may include some of the following: Virginia Woolf, Night and Day, Mrs. Dalloway, Orlando, To the Lighthouse, Between the Acts, and A Room of One's Own; E. M. Forster, Maurice; Katherine Mansfield, selected stories; Winifred Watson, Miss Pettigrew Lives For a Day; Elizabeth Bowen, The Death of the Heart.",
    "course_description": "Studies in narrative fiction and narrative forms. Readings vary and may focus on one or more authors or on questions of literary art. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Erwin Rosinberg - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 2371, Section #: 2, Type: SEM, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: E. Rosinberg, Status: Open",
    "date_accessed": "2024-03-30"
}