{
    "course_code": "ENG 789",
    "course_title": "Special Topics In Literature: Theorizing the African Diaspor",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 17 / Seats Avail: 8",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "Taking as a truism that Blackness is not homogenous nor a monolith, this course will look at how the Black and African diasporas are constructed in a broad variety of geographies, cultures, histories, politics and social constructs. Beginning with theories of the diaspora that emerged in response to Paul Gilroy's The Black Atlantic, this class will look at how both scholarly work and fiction construct different forms of Blackness, and the implications these forms have on our theorizations of Blackness through gender, sexuality, and class. Upon completion of the course, students will be able to speak to key differences that distinguish different Black collectivities from one another, as well as identify leitmotifs that can connect seemingly different communities. Students will also be competent in understanding contemporary debates on Black identities and their idioms in discourses that feature gender, sexuality and/or class as their primary analytic.\nReadings may include but not be restricted to: Brent Edwards; Samantha Pinto; Jackie Kay; Zadie Smith; Peggy Piesche; Jean Rahier; Percy Hintzen; Kevin Quashie; Uri Dorchin; Edilza Sotero; Denise Ferreira da Silva; Dixa Ramirez; Helen Oyeyemi.\nCourse expectations: class attendance, weekly reader reactions, 1-2 class presentations on the reading, and one 20-25pp. due one week before final grades must be reported in.",
    "course_description": "Various topics, such as theoretical, generic, or cultural studies of literature.",
    "prerequisites": null,
    "instructors": "Michelle Wright - Primary Instructor",
    "schedule_location": "W 1pm-4pm in Callaway Center C201",
    "course_resources": null,
    "sections": "Class Nbr: 2171, Section #: 1, Type: SEM, Campus: ATL, Meets: W 1-4p, Instructor: M. Wright, Status: Open",
    "date_accessed": "2024-03-30"
}