{
    "course_code": "ENG 796R",
    "course_title": "Survey of English: Histories, Theories, Methods",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 9",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "This seminar is designed to introduce first-year graduate students to key theoretical and methodological issues that shape the discipline of English. It will expose students to the historical trajectory of debates central to literary studies today (the value of literature, the particular province of aesthetics, theories of taste, art and material culture) through thinkers such as Plato, Aristotle, Hume, Kant, Adorno, Derrida, etc. Through readings and discussions, students will be introduced to a disciplinary framework designed to help them frame their interests in light of recurrent and ongoing debates and new directions in literary studies. In general, we are preparing to answer the following questions: what is our object of study? How should we study it and why? Moreover, this course will serve as an introduction to the discipline of English studies through hands-on assignments designed to help you plan your course through the doctoral program (OR to figure out versatile pathways in the humanities if your terminal degree is a Masters (4+1).",
    "course_description": "An introduction to the discipline of English. Required for all first-year graduate students.",
    "prerequisites": null,
    "instructors": "Deepika Bahri - Primary Instructor",
    "schedule_location": "Th 10am-1pm in Callaway Center C201",
    "course_resources": null,
    "sections": "Class Nbr: 2178, Section #: 1, Type: LEC, Campus: ATL, Meets: Th 10a-1p, Instructor: Bahri/Knecht, Status: Open",
    "date_accessed": "2024-03-30"
}