{
    "course_code": "LING 410",
    "course_title": "Topics in Spanish Linguistics: The Politics of Spanish",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 2",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Same as SPAN 410 1)\n\n\nThe Politics of Spanish - Past and Present\n\n\nPREREQUISITES: One Foundational Course, preferably SPAN/LING 303 or SPAN/LING 304.\n\n\nDESCRIPTION: Taught in Spanish. In this course we will study the politics of language with a focus on Spanish, in the past and present. The course will begin with an introduction to the main topics, concepts, and theoretical frameworks for the study of the politics of language (including language standardization, correctness and monoglossia). We will then turn our attention to a range of local, national, and global contexts/topics that involve thinking and talking about Spanish as a political phenomenon, including: the invention of Spanish; the emergence and extension of Spanish as an imperial and national language; the creation, development, and activities of the Royal Spanish Academy, as well responses to them; the historical relations of Spanish with minoritized languages in Spain and Latin America, as well as revitalization of such languages; educational issues involving the teaching and learning of Spanish in Latin America, the US, and Spain; use of and attitudes to varieties of Spanish in mass and virtual media; and calls for and debates about gender-inclusive language across and beyond the Spanish-speaking world.\n\n\nTEXTS: All readings will be made available on Canvas.\n\n\nEVALUATION: Evaluation will be based on participation, daily preparation, take-home tests/essays, an oral presentation, and a final project (a research paper, or a creative and/or public-facing project aimed at helping a broader public understand political issues of Spanish).",
    "course_description": "Upper-level research seminar on topics of Hispanic linguistics and communication, such as history of the language, bilingualism, or translation. Students may take multiple SPAN 410 courses provided that they focus on different topics.",
    "prerequisites": null,
    "instructors": "Donald Tuten - Primary Instructor",
    "schedule_location": "TTh 4pm-5:15pm in MODERN LANGUAGE_330",
    "course_resources": null,
    "sections": "Class Nbr: 4729, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 4-5:15p, Instructor: Tuten/Velez, Status: Open",
    "date_accessed": "2024-03-30"
}