{
    "course_code": "LING 401W",
    "course_title": "Language, Mind & Society",
    "credit_hours": "4",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Varies by section",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": "Department Consent Required",
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Permission Required Prior to Enrollment)\n\n\nWhy is language structured the way it is? How and why is it limited in what it can express? Answers to questions such as these usually stem from two opposing views. One focuses on language and meaning as products of how the mind works. The other stresses language as a product of social interaction. In this course, we will consider a series of questions to better understand these two views. Topics will include what the sources of linguistic structure might be; whether (or how much of) language is innate in humans; how language reflects categories and helps us form categories; and to what extent language influences thought.\n\n\nThe course is only available to graduating seniors who have declared the following majors or minors: Linguistics, Psych/Ling, Span/Ling, or QSS major w/ concentration in Linguistics.",
    "course_description": "In this course, students think critically about fundamental questions in linguistics, including: Is language a product of how the mind works or a product of social interaction? What are the sources of linguistic structure? Is language innate in humans? Various perspectives are compared &amp; contrasted.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": "Varies by section",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3702, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 10-11:15a, Instructor: M. Pak, Status: Closed\nClass Nbr: 3703, Section #: 2, Type: SEM, Campus: ATL, Meets: TTh 4-5:15p, Instructor: J. Boigues-Lopez, Status: Open",
    "date_accessed": "2024-03-30"
}