{
    "course_code": "LING 316",
    "course_title": "Language Acquisition",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Same as PSYC 36 1)\nThe study of language development is central to our understanding of human behavior because it engages issues of brain organization and processes, symbolic capacity, knowledge representation, socialization, communication, and culture. Moreover, study of the origins and course of normal language development raises important theoretical issues in both linguistics and psychology (e.g., innateness of grammar, the nature of bilingualism, language and thought). Because language defines us as human and the study of language is connected to so many areas of linguistics and psychology, it is an important and very active area of scholarship. This course surveys the normal course of language development, variations in language development, and competing theoretical accounts of how development occurs.\nBecoming familiar with (learning how to read, understand, and synthesize) published research articles is a primary aim of the course that you'll work toward by closely analyzing a number of research papers and by writing a research paper. Writing is a powerful way to learn because it requires you to formulate a thesis and organize your thinking on a particular research topic. Also, this course will provide hands-on experience in using and analyzing corpus from CHILDES database.",
    "course_description": "Language acquisition in young children. Identifying speech sounds, determining meaning, and comprehending the rules of syntax.",
    "prerequisites": null,
    "instructors": "Yun Kim - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in Callaway Center S105",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3704, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 10-11:15a, Instructor: Y. Kim, Status: Closed",
    "date_accessed": "2024-03-30"
}