{
    "course_code": "ANCMED 190",
    "course_title": "Freshmen Seminar: Exploring Anc. Med. In the MCC",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "Complete Topic:Exploring the Ancient Mediterranean in the Carlos Museum\nThe course is an introduction to the interrelated cultures and societies of the ancient Mediterranean world (c. 3000 BCE to 500 CE) and to the way modern museums collect and display the artifacts of these societies.  The collections and exhibits of artifacts from the Ancient Near East, Egypt, the Greek diaspora and the Roman empire on display in Emory's Michael C. Carlos Museum are the focal point for our study.  In discussing and interpreting these artifacts as evidence for the institutions and values of the societies which produced or used them, we will also draw on ancient literary texts and modern historical analysis.\n As we study the objects on display in the Carlos' galleries, we will  engage questions about the history of museums and their collections.  How have museums acquired their collections and how should claims of cultural ownership be evaluated?  What are the ethical issues involved in collection and display of objects?  Who owns antiquity?  Whose interpretation of objects is authoritative?  What role do and should museums in public education?",
    "course_description": "Variable topics course introducing students to the interrelated cultures and histories of the ancient Mediterranean world. Emphasis is on the study and interpretation of primary texts and objects, including those in Emory's Carlos Museum.\n.",
    "prerequisites": null,
    "instructors": "Cynthia Patterson - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Callaway Center S102",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 4708, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: C. Patterson, Status: Closed",
    "date_accessed": "2024-03-30"
}