{
    "course_code": "CPLT 389",
    "course_title": "Special Topics: Literature: Practices of Reading",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Same as ENG 389 1) \nTopic: \"Practices of Reading\" | Whether we read for pleasure or intellectual enrichment, to acquire knowledge or as a professional activity, at the heart of our engagement with literature are practices of reading. Reading is also the method that most commonly defines the study of literature as a discipline.\n\n\nThis course puts reading as a practice into play with reading as a method to ask fundamental questions about our relationship with and to texts: What do we read? Why do we read? How do we read? What do our reading practices effect: what do they do for and to us, for and to others, for and to the world? How does the place from which we read our sense of who we are and the cultures that shaped us, our public commitments, our beliefs and values inform what, why, and how we read? Which conceptual frameworks do we find generative for our reading practices and how do we determine those frameworks? How does reading as a critical, professional practice relate to reading privately, just for fun? We will explore these questions through a combination of literary and critical texts chosen, in part, by participants in the seminar. In so doing, we will engage some of the most urgent issues at the heart of the contemporary humanities: Does what and how we read matter, and what does literature have to offer a troubled world?\n\n\n- Commonplace record: 30 % of total grade \n- Two Papers: 45 % of total grade\nEssay #1: 15 % of total grade\nEssay #2: 30 % of total grade \n- Final Presentation: 15 % of total grade\n- Class citizenship: 10 % of total grade",
    "course_description": "Lively topical or theoretical approaches to a given set of literary texts or problems. May be repeated for credit when subject varies..",
    "prerequisites": null,
    "instructors": "Angelika Bammer - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Woodruff Library 214",
    "course_resources": null,
    "sections": "Class Nbr: 3675, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 10-11:15a, Instructor: A. Bammer, Status: Open",
    "date_accessed": "2024-03-30"
}