{
    "course_code": "CPLT 302W",
    "course_title": "Literary Theory",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Topic: \"Literary Theory:\" - This course will focus on some of the most significant intellectual movements in literary theory and cultural criticism from the early twentieth century to the present: Formalism, the Bakhtin Circle, the Frankfurt School, Structuralism, Semiotics, Psychoanalysis, Poststructuralism, Feminism, Postcolonial Theory, Black Literary Theory, Queer Theory, Disability Studies, and Animal Studies. Although our class discussions and written assignments will be based on our assigned course readings, we may also draw from literature and other cultural forms beyond our readings in order to illustrate these different and sometimes conflicting theoretical approaches.\n\n\nIn this course, not only will students learn about these different approaches to literature and culture and their relationship with one another, but they will also learn how to read theoretical texts and write scholarly papers. This course fulfills one of the five core course requirements for both the Major and Minor Degrees in Comparative Literature as well as the General Education Requirement (GER) in Continuing Writing (WRT) for Emory College.\n\n\nFour response papers (2-3 pp. each, 40% total)\nLong essay (8-10 pp., 40%)\nAttendance and participation (20%)\n\n\nAll assigned readings will be made available in electronic format on Course Reserves.",
    "course_description": "Learning to read literature from a rheoretical viewpoint, its formal properties, distinctive features, origins, purposes, and capacities for representing the world; representative critics and schools from contemporary and earlier periods. *Note: This course is non-repeatable.",
    "prerequisites": null,
    "instructors": "Sean Meighoo - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in Candler Library 114",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3665, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: S. Meighoo, Status: Closed",
    "date_accessed": "2024-03-30"
}