{
    "course_code": "CPLT 389",
    "course_title": "Special Topics: Literature: Intersections",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 8 / Seats Avail: 5Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Same as FREN 341 1)\n(Intersections) \"Fictions of Photography\"E. Marder  MW 2:30-3:45pm (in person)\nContent:  Since its invention in 1839, photography has been a source of fascination, reflection, inspiration, and revulsion for many nineteenth and twentieth century thinkers and writers.  Because the medium of photography has the capacity to record images that are not available to the naked eye and to preserve and repeat them indefinitely, photography has given rise to many powerful written reflections about mourning, memory, time, history, fantasy, ghosts, death, and desire.  In this course, we will examine a selection of literary, philosophical, and theoretical texts to help us think about how photographic writing affects our understanding of images, events, and history.  Readings may include works by: Charles Baudelaire, Nadar, Edgar Allan Poe, Villiers de L'Isle Adam, Frederick Douglass, Roland Barthes, Walter Benjamin, Danielle Arasse, Malek Alloula, Susan Sontag, and Marguerite Duras.",
    "course_description": "Lively topical or theoretical approaches to a given set of literary texts or problems. May be repeated for credit when subject varies..",
    "prerequisites": null,
    "instructors": "Elissa Marder - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in MODERN LANGUAGE_128",
    "course_resources": null,
    "sections": "Class Nbr: 5436, Section #: 5, Type: LEC, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: E. Marder, Status: Open",
    "date_accessed": "2024-03-30"
}