{
    "course_code": "CPLT 301W",
    "course_title": "Methods of Literary Interpretation",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 8",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "\"The Ethics and Politics of Translation\" | Over the past decades, translation has been a buzzword in comparative and world literature studies. Both as a practice and concept, translation has moved from being an undesirable and derivative literary activity, sidelined in early disciplinary reports of comparative literature, to one that is not only considered immanent in the \"acts of literature, but also welcomed as the new theoretical/practical zone to challenge nationalist, Eurocentric, and/or homogenizing methods and tendencies in comparative studies. Historically, the rise of translation has as much to do with world politics (the cold war, anticolonial liberation movements, migration) as with intellectual trends (the influx of continental theory like poststructuralism and deconstruction, postcolonial theory, and the re-emergence of world literature).\n\n\nIn this course, we will focus on translation to inquire into the ethics and politics of literary expression, form, and aesthetics. As we read a range of texts (short story, novel, play, poetry, autobiography, essay, Nobel talk, dictionary, anthology, and documentary), some of which are translations and some take translation as a theme or use it a metaphor, we will not only examine different methods of translation, but also discuss various meanings of translation as rewriting, love, subversion, appropriation, worlding, vernacularization, and self-translation. As we consider the cultural and political significance of translation for interlingual subject formations, we will draw from critical essays by Gayatri Spivak, Walter Benjamin, Ngugi wa Thion",
    "course_description": "An introduction to different methods of literary criticism and textual interpretation, applying a variety of theoretical approaches to selected literary texts.  Readings include essays, fiction, poetry, and drama. *Note: This course is non-repeatable.",
    "prerequisites": null,
    "instructors": "Mehtap Ozdemir - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Callaway Center N118",
    "course_resources": null,
    "sections": "Class Nbr: 3661, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: M. Ozdemir, Status: Open",
    "date_accessed": "2024-03-30"
}