{
    "course_code": "CPLT 389W",
    "course_title": "Special Topics: Literature: Literature and Religion",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Same as REL 387W 1)\nThis course satisfies the Religion major requirement:- Theme.\nTopic: Religion and Fantasy\nThis course explores the intersections of religion and fantasy, as well as science, science fiction, magic, rationality, and the imagination. We begin by thinking about masks and identities-the nature of pretending and the suspension of disbelief, with special reference to \"lifestyle fantasy\" and cosplay. What does it mean to \"identify with\" a character in a story? Is there something inherently \"moral\" about reading fantasy or science fiction? Can fantasy be a spiritual practice? Miracles, invisible beings, super powers, magical objects, and life after death: what is the relation of our real lives to these miraculous possibilities? The theme of the boundary between different \"worlds\" (ways of being, ways of thinking) is picked up in fiction by Neil Gaiman, Paul Cornell, Lord Dunsany, Sylvia Townsend Warner, and others. \"This\" world and \"that\" world function as metaphors for many kinds of boundaries: foreign/native, language, race, gender, class.",
    "course_description": "Lively topical or theoretical approaches to a given set of literary texts or problems. May be repeated for credit when subject varies. Fulfills the post-freshman writing requirement.",
    "prerequisites": null,
    "instructors": "Eric Reinders - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Candler Library 114",
    "course_resources": null,
    "sections": "Class Nbr: 4662, Section #: 2, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: E. Reinders, Status: Wait List",
    "date_accessed": "2024-03-30"
}