{
    "course_code": "CPLT 489",
    "course_title": "Advanced Special Topics: Walter Benjamin & Arcades Proj",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 4 / Seats Avail: 4",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": "Department Consent Required",
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Same as GER 475 1)\nWalter Benjamin and the Arcades Project  | In recent years, Walter Benjamin (1892-1940) has come to be celebrated as a pioneering cultural theorist, and a minor industry of translations and secondary literature has grown up around this formerly obscure figure. This class will explore his principal achievement, an unfinished archaeology of the modern known as the Arcades Project, which consists of a series of fragments posthumously assembled by others. A palimpsest of theoretical reflection, historical narration, citations, excerpts, intertextual allusions, and metaphysical speculations, Benjamin's Passagen-werk is both highly resistant to the reader and extremely open to interpretation and appropriation. At once archive and unfinished magnum opus, this text embodies the material traces of a revolutionary method of cultural inquiry even as it attests to Benjamin's tragic failure to bring his dreams to reality.\n\n\nBy turning a work into a project, the English title begs the question of the relationship between that failure and Benjamin's distinctive achievement. Possibly, though, the Passagen-werk is not simply unfinished but unfinishable. In attempting to discern Benjamin's legacy in the fragmentary openness of this book that is not a book, we will ask what he can teach us as interdisciplinary scholars, as readers, and as critical participants in modern culture even as we develop a critical perspective on the reception history that represents his text as a coherent point of reference. In the spirit of carrying on Benjamin's legacy, students will be encouraged to pursue creative theoretical projects, including engaging with digital media.\n\n\nRequired texts: Benjamin: The Arcades Project\n \t         Eiland and Jennings: Walter Benjamin: A Critical Life\n\n\nThis course is the same as the graduate course CPLT 751R 4 (OPUS # 4616)",
    "course_description": "This course is designed to give advanced students the opportunity to investigate intensively an area of special interest. A reading knowledge of one foreign language is prerequisite. Topics may vary, but the goal of the course remains unchanged: the courses focuses on contemporary literary theory.",
    "prerequisites": null,
    "instructors": "Elizabeth Goodstein - Primary Instructor",
    "schedule_location": "W 4pm-7pm in Callaway Center C101",
    "course_resources": null,
    "sections": "Class Nbr: 4617, Section #: 1, Type: LEC, Campus: ATL, Meets: W 4-7p, Instructor: E. Goodstein, Status: Open",
    "date_accessed": "2024-03-30"
}