{
    "course_code": "CPLT 389W",
    "course_title": "Special Topics: Literature: A.I. in Fiction & Anime",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "A.I. in Fiction, Film & Anime | \"This course will focus on Artificial Intelligence in print fiction, films and anime. First, we will briefly consider how A.I. is defined and understood, its three basic types and their history. We will then turn to a series of novels, films and anime in which A.I. is variously represented, usually as a form of intelligent otherness whose purpose and intentions must be discovered or inferred. We will also explore how these representations are shaped or in part determined by the medium in which we experience them, and how the differences we encounter from one medium to another and how we process the relevant information might be relevant to our understanding of A.I.\n\n\nThroughout the course, but especially towards the end, we will consider how A.I. is no longer science fiction: Data gathering and processing is increasingly managed by A.I., and the automation A.I. makes possible will soon reduce the need for a large human workforce. Several decades ago, when Kevin Kelly, who writes about contemporary technology, asked Larry Page, one of the founders of Google, why they offered users the best web search engine, and for free, Page simply replied, \"Oh, what we're really doing is making an AI.\" Soon after, giant enterprises like Facebook, Amazon and Apple also began investing heavily in A.I., and now we are beginning to see the results.",
    "course_description": "Lively topical or theoretical approaches to a given set of literary texts or problems. May be repeated for credit when subject varies. Fulfills the post-freshman writing requirement.",
    "prerequisites": null,
    "instructors": "John H Johnston - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Woodruff Library 875",
    "course_resources": null,
    "sections": "Class Nbr: 6129, Section #: 5, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: J. Johnston, Status: Open",
    "date_accessed": "2024-03-30"
}