{
    "course_code": "CPLT 752R",
    "course_title": "Studies in History: Decolonizing Indigenous Hist",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 2 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Same as HIST 585 2, HISP 720 3)\nHow do we define Indigenous history? How has it been colonized, and why decolonize it? This course addresses communities in the Americas in a thematic way, emphasizing theories and methodologies from ethnohistory, collaborative and engaged scholarship, and Native American and Indigenous Studies. Rather than looking at Indigenous history in isolation, we begin with the assumption that Native people have encountered, negotiated and changed their societies in collaboration with other Native groups and peoples from other continents. Translation, diverse knowledges, and alternate forms of recording history will therefore be central themes, as we consider how Native peoples forged new economies, societies, forms of spirituality, and legal norms through diverse encounters.\nWe will explore current debates about the definitions and uses of terms such as decoloniality, indigeneity, empire, migration, and sovereignty. As we consider these concepts, we will bring a critical eye to them, taking stock of whose voices are louder than others and who offers paradigms that we can share as scholars working in different disciplines, time periods, and places.\nThe scope of the course is broad, and as such, does not pretend to cover the whole hemisphere. We will seek out hemispheric comparisons, putting Indigenous histories of South America, Mesoamerica, and North America into conversation.",
    "course_description": "This course focuses on a specific body of literary texts by taking a historical approach to the study of Comparative Literature.  Students may repeat this course for credit if the subject matter varies.",
    "prerequisites": null,
    "instructors": "Malinda Lowery - Primary Instructor",
    "schedule_location": "T 2:30pm-5:30pm in Ignatius Few Building_131",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 4171, Section #: 1, Type: SEM, Campus: ATL, Meets: T 2:30-5:30p, Instructor: Lowery/Yannakakis, Status: Open",
    "date_accessed": "2024-03-30"
}