{
    "course_code": "CPLT 751R",
    "course_title": "Spec Topics: Comparative Literature: Revolutionary Perversions",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 6 / Seats Avail: 4",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Same as FREN 775 1, PHIL 789 6, PSP 789 1)\nRevolutionary Perversions: Literature, Sexuality, Anachrony\nProfessor Elissa Marder / Tuesdays 1:00-4:00pm\nContent:  In this course, we shall examine how representations of \"non-normative\" sexuality in several major nineteenth-century works relate to the problem of representing history in the aftermath of the French revolution.  Many of the most famous canonical literary texts written in French prior to 1871 include references to impotence, lesbianism, hysteria, cross dressing, bestiality, masturbation and prostitution in the context of narratives that re-write or un-write the legacy of the French revolutions. By focusing on the literary treatment of these \"perverse\" forms of sexuality, we shall attempt to see how they encourage us to think differently about questions of historical transmission, language, gender, and sovereignty. Possible texts include: La Philosophie dans le boudoir (Sade), René (Chateaubriand), Ourika, Mme de Duras, Armance (Stendhal), Le Père Goriot and La Fille aux yeux d' or (Balzac), L'Education sentimentale (Flaubert), Le Secret de l'Echafaud (Villiers de L'Isle-Adam), and selections from Baudelaire's prose poems. Critical readings may include works by Freud, Marx, Benjamin, Blanchot, Michel-Rolph Trouillot, Daniel Arasse, Derrida and others.\n\n\nThe course will be taught in English although we will focus on the works in the original French texts.  Reading knowledge of French recommended but not required as (almost) all of the works are available in translation.",
    "course_description": "This course focuses on a specific body of literary texts, critical approach, or theoretical problem in the area of Comparative Literature.  Students may repeat this course for credit if the subject matter varies.",
    "prerequisites": null,
    "instructors": "Elissa Marder - Primary Instructor",
    "schedule_location": "T 1pm-4pm in Callaway Center C202",
    "course_resources": null,
    "sections": "Class Nbr: 5050, Section #: 6, Type: LEC, Campus: ATL, Meets: T 1-4p, Instructor: E. Marder, Status: Open",
    "date_accessed": "2024-03-30"
}