{
    "course_code": "FILM 385",
    "course_title": "Special Topics: Film and Media: Journalism in the Movies",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": "Department Consent Required",
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as ENGCW 389 1) (Permission Required)  Application required; complete course atlas information and application form available at http://creativewriting.emory.edu/home/academics/spring-2021-course-atlas.html. If Journalism has historically been considered a pure and ethically-driven form of non-fiction; if, pardon the cliché, it is the first rough draft of history; if its principle motivator in this nation's history has been the pursuit of truth, justice and the American way (you did know Superman/Clark Kent was a newspaper reporter, right?); and if it is the most zealous guardian of not just any amendment to the U.S. Constitution but the First Amendment, then why is the profession of journalism historically misrepresented as crude and corrupt when Hollywood tries to tell its story? Or is the profession's purity just an old former newspaperman's misguided fantasy that confuses vice and virtue in a vocation that consumed him and his conscience for more than 35 years? Newsrooms have long been filled with quiet creative geniuses and loudmouth miscreants, the brilliant and the boorish, the talented and the tawdry, and yet there are few if any professions as tethered to, and as cognizant of, a code of ethics. What does that get you? Good fodder for screenwriters and filmmakers of feature films and documentaries at home and abroad. We'll dive into this history and have some lively assignments and discussions.  Highest priority will be given to students in their final semester.",
    "course_description": "Rotating topics in film and media. May be repeated for credit when the topic varies.",
    "prerequisites": "FILM 102 and (FILM 201 or FILM 202 or FILM 203 or FILM 204) or equivalent transfer credit as prerequisite.",
    "instructors": "Hank Klibanoff - Primary Instructor",
    "schedule_location": "TTh 11:20am-12:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 5458, Section #: 4, Type: LEC, Campus: ATL, Meets: TTh 11:20a-12:35p, Instructor: H. Klibanoff, Status: Closed",
    "date_accessed": "2024-03-30"
}