{
    "course_code": "BSHES 760R",
    "course_title": "Professional Development Seminar: Approaches to Health Promotion: Reducing Drug-Related Harms",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 7",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "Course Title: Reducing Drug-Related Harms Using Internet-Based \"Big Data\": Machine Learning and AI Methods\n\n\nCourse Description:\nThis course will prepare students to conduct ethical, rigorous, and theoretically-informed analyses  of \"big data\" (machine learning/social media) in the context of research and interventions into intersecting crises of substance use disorders (SUDs) and drug-related harms.\nThis course is one of two courses on analyzing \"big data\" to study and intervene in drug-related harms (the other course is entitled \"Reducing Drug-Related Harms Using Big Data: Administrative, geospatial and network sources\"). We recommend, but do not require, taking this course second, or after taking the other course.\n\n\nPre-Requisites: It is recommended that students be comfortable working in a Unix/Linux environment, in addition to being familiar with database formatting using R or SQL via SAS. Prior completion of the following courses/equivalents is also needed to successfully complete this module:\nRegression (examples: BIOS 501, BSHES 700), and\nAt least one statistical programming course, such as SAS (examples: BIOS 501) or R (examples: BIOS 544)",
    "course_description": "This seminar will address a variety of topics of importance to the professional behavioral scientist in public health.",
    "prerequisites": null,
    "instructors": "Hannah Cooper - Primary Instructor",
    "schedule_location": "W 10:30am-1:20pm in Grace Crum Rollins L45",
    "course_resources": null,
    "sections": "Class Nbr: 5297, Section #: 1, Type: SEM, Campus: ATL, Meets: W 10:30a-1:20p, Instructor: Team, Status: Open",
    "date_accessed": "2024-03-30"
}