{
    "course_code": "AAS 355",
    "course_title": "Historical Arts of Africa",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Same as ARTHIST 355 1, AFS 355 1)\nCourse Title: The Uninitiated See Nothing: African Arts & Material Culture \nCourse Description: \nThis course introduces students to the diversity of the African continent's art, architecture, and material culture, spanning from ancient history to contemporary eras. Complementary themes such as the arts of birth and initiation, royalty and the common citizen, architecture and the natural world, and dance performance and masquerade serve as guiding frameworks. Examining various artistic mediums (e.g. metal, wood, clay, beads, textiles, and the body), students will investigate how the arts have been used to build African empires, cultivate relationships within community, resist colonialism and slavery, and forge connections with the divine world. Additionally, we will pose key questions that center matters of African art repatriation/restitution, cultural ownership, and museum ethics of care. Ultimately, this class will encourage students to redefine their definitions of \"art\" and cultivate greater appreciation for Africa's vibrant aesthetics and dynamic material cultures.",
    "course_description": "Traditional genres of African art with a focus on masks and figure sculpture in West and Central African city-states and chiefdoms from 1500 to European colonization. May be repeated for credit when topic changes, up to a maximum of twelve hours.",
    "prerequisites": null,
    "instructors": "Kyrah Malika Daniels - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Carlos Hall 212",
    "course_resources": null,
    "sections": "Class Nbr: 1882, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: K. Daniels, Status: Open",
    "date_accessed": "2024-03-30"
}