{
    "course_code": "AAS 385",
    "course_title": "Topics in Afr American Studies: Imagining Democracy",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": "Department Consent Required",
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Same as POLS 394 4)\nThe course is open to students with any major, but students must complete a short application before receiving permission to enroll. Students should contact Michelle Gordon, Ph.D. at michelle.yvonne.gordon@emory.edu for application information.\n\n\nThis class is the first part of a two-course sequence associated with the Imagining Democracy Lab, a grant-funded initiative to link imagination, knowledge, and action to advance civic and political engagement. In this class we will engage with academic perspectives from the humanities and social sciences on the concept of democracy, then examine how these perspectives have (or have not) manifested in the experience of communities in the Atlanta area specifically and American democracy more broadly. To this end, we will learn from leaders of nationally-renown civic and political engagement organizations in Georgia in addition to faculty from Emory and other institutions. We will explore course material through a mix of lectures, discussion sessions, group presentations, and an individual final research paper that entails deep study of themes from the course. The course is open to students with any major, but students must complete a short application before receiving permission to enroll. Students should contact Michelle Gordon, Ph.D. at michelle.yvonne.gordon@emory.edu for application information.",
    "course_description": "This course explores one of a wide range of topics pertaining to the African American experience in the fields of human and civil rights, social and literary texts, and the social sciences.",
    "prerequisites": null,
    "instructors": "Carol Anderson - Primary Instructor",
    "schedule_location": "T 1pm-3:45pm in Tarbutton Hall 120A",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 6153, Section #: 6, Type: LEC, Campus: ATL, Meets: T 1-3:45p, Instructor: Fraga/Anderson, Status: Open",
    "date_accessed": "2024-03-30"
}