{
    "course_code": "AAS 385",
    "course_title": "Topics in Afr American Studies: Critical Black Thought",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 9 / Seats Avail: 3Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "HAP w/Race & Ethnicity Req.",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Same as PHIL 385 2)\nCourse Description: \nWhat is black existence? Can we imagine black existence without reason, the transparent subject, formalized schemes of knowledge, and being? How has anti-blackness (de)structured our relationship to time, space, and thinking? Is it time to abandon the human as an organizing concept for liberation and freedom? Using black psychoanalysis, black feminist poethics, ecological studies, Afro-pessimism, semiotics, black humanism, and black theology, we will address these concerns. Ultimately, we will sketch the infrastructure of black thought and evaluate the efficacy of various methodologies and noetic practices. This course will celebrate (and critically evaluate) the beauty of black thinking, its innovation, and development. The reading is primarily philosophical and theoretical (with artistic and cinematic engagements).",
    "course_description": "This course explores one of a wide range of topics pertaining to the African American experience in the fields of human and civil rights, social and literary texts, and the social sciences.",
    "prerequisites": null,
    "instructors": "Calvin Warren - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Emerson Chemistry Bldg. E103",
    "course_resources": null,
    "sections": "Class Nbr: 1890, Section #: 3, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: C. Warren, Status: Open",
    "date_accessed": "2024-03-30"
}