{
    "course_code": "AAS 730",
    "course_title": "Topics in Expressive Arts and Cultures: Africana Religious Studies",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 8 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Same as RLR 700 9)\n(Complete Topic - Africana Religious Studies: Foundations of Black Thought in Africa and the Diaspora)\n\n\nThis course invites students to explore foundational principles, concepts, and practices in African and African diaspora religious cultures that have provided orientation for African-descended people's life, thought, and devotion.  By exploring epistemological, philosophical, and socio-cultural dimensions of African life and thought we will seek to gain clarity concerning the wellsprings and developments of African knowledge, personhood and religious practices in Africa and its diasporas, including the United States.  Our primary investigation will focus upon knowledge, personhood and practice in Africana religious cultures in order to access overlooked orientations, thought systems, and relational poetics that are conversant with critical debates and innovations in African American Studies today.  Thus, this course is designed to foster bold, courageous and creative critical thinking that disrupts legacies of colonial intrusion in Africa and its diasporas, with attention to the intellectual colonialism that has characterized much of the framing of and research on African/Black religious-cultures and societies.",
    "course_description": null,
    "prerequisites": null,
    "instructors": "Dianne Stewart - Primary Instructor",
    "schedule_location": "Th 10am-1pm in Candler Library 212",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 5858, Section #: 1, Type: SEM, Campus: ATL, Meets: Th 10a-1p, Instructor: Stewart/Lartey, Status: Closed",
    "date_accessed": "2024-03-30"
}