{
    "course_code": "AAS 710",
    "course_title": "Topics in Gender and Sexuality: Power,Ident.,Logics Legibility",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 0 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Same as WGS 730R, CPLT 751R 3, and PHIL 789 3)\n(Permission Required Prior to Enrollment)\n(Complete Topic: Spec Topics: Power, Identity, and the Logics of Legibility)\n(Why are some populations more legible than others? Why do certain political subjects have an easier time being protected than others? In this course, we will explore theories of power in relation to questions of violence and vulnerability to understand how vulnerable groups are created and cemented in relation to elite and powerful populations. How does violence manifest itself institutionally? How does vulnerability become imposed through various logics and techniques: of law, of class, of race? Power, violence, vulnerability can be inflicted and challenged through technologies, understood conceptually as instruments by which to accomplish certain ends. Readings will include writings in the traditions of decolonial, Latinx, and Black feminist theories, Foucauldian and Indigenous writings on power, land and sovereignty. Authors may include Frantz Fanon, Françoise Vergès, Joy James, Kimberlé Crenshaw, Maria Lugones, Michel Foucault, Christina Sharpe, Katherine McKittrick, and Elaine Scarry among others.)",
    "course_description": "This course introduces students to critical readings in African American gender and sexuality studies.",
    "prerequisites": null,
    "instructors": "Falguni Sheth - Primary Instructor",
    "schedule_location": "W 10am-1pm in Candler Library 125",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 4112, Section #: 1, Type: SEM, Campus: ATL, Meets: W 10a-1p, Instructor: F. Sheth, Status: Closed",
    "date_accessed": "2024-03-30"
}