{
    "course_code": "ENGCW 371RW",
    "course_title": "Creative Writing: Intermediate Poetry",
    "credit_hours": "4",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": "Department Consent Required",
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Permission Required Prior to Enrollment)\n\n\nApplication required. Complete course atlas information (including texts and grading) and application form will be available on the Creative Writing Program website: https://creativewriting.emory.edu/index.html\n\n\nThis intermediate course is a space for experienced poets to further sharpen and expand their poetry practices in an intensive workshop environment. Over the course of the semester, we will explore the poem as a kind of research endeavor, an investigation driven by language and syntax. How do poets draw subjects, language, and even formal considerations for their poems from external sources such as historical records, interview transcripts, and art objects? In each class session, we will work towards a shared set of terms and ideas with which we might complicate our understanding of poetry's possibilities. We will read five poetry collections and a number of other poems, craft essays, and hybrid works across a wide range of literary styles and traditions.",
    "course_description": "Every semester. Intermediate level workshop in writing poetry. ENG 270, 271, or 272 required as prerequisite. May be repeated for a maximum of eight hours credit.",
    "prerequisites": null,
    "instructors": "Steven Duong - Primary Instructor",
    "schedule_location": "Varies by section",
    "course_resources": null,
    "sections": "Class Nbr: 3655, Section #: 1, Type: SEM, Campus: ATL, Meets: M 2:30-5:30p, Instructor: S. Duong, Status: Open\nClass Nbr: 3939, Section #: 2, Type: SEM, Campus: ATL, Meets: T 2:30-5:30p, Instructor: S. Duong, Status: Open",
    "date_accessed": "2024-03-30"
}