{
    "course_code": "ENGCW 190",
    "course_title": "Freshman Seminar:Creative Writing: Writing Bodies in the World",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 3 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First Year Seminar",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Same as AAS 190 3, ENVS 190 3, LACS 190 1)\n(Freshmen Seminar - Limited to First Year Students Only)\n\n\nNOTE: There is no class on August 23, but there is an assignment. Please email nora.lewis@emory.edu as soon as possible if you did not receive a message with instructions from Professor Yanique.\n\n\nComplete course atlas information (including texts and grading) will be available on the Creative Writing Program website: https://creativewriting.emory.edu/index.html\n\n\nThis is a reading and writing class that will serve as introduction to the rigor of college level reading and the vulnerability of college level creative writing, as well as introducing you to your campus, Emory.  Our subject matter of the environment refers to both the outdoors and to human made enclosures. The `bodies' and `world' of the subtitle will explicitly refer to black bodies within a racist society and to student bodies on a college campus.  Our course will veer into disciplines such as Environmental Studies, African American Studies, Caribbean Studies, English, Creative Writing and Women, Gender & Sexuality Studies.  This class will occur in-person and out&about.  In-person will mean meeting in our assigned classroom or on the Emory college quad.  Out&About refers to times during class when you will meet at specific sites around campus in small groups or out on solo excursions. This, as will be true for all aspects of the course, will be subject to change as the course progresses.",
    "course_description": "Topics/genres vary. Emphasizes writing and reading as elements in intellectual exploration. Does not satisfy first-year writing requirement.",
    "prerequisites": null,
    "instructors": "Tiphanie Yanique - Primary Instructor",
    "schedule_location": "W 1pm-3:45pm in Ignatius Few Building_129",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3563, Section #: 1, Type: SEM, Campus: ATL, Meets: W 1-3:45p, Instructor: T. Yanique, Status: Closed",
    "date_accessed": "2024-03-30"
}