{
    "course_code": "SPAN 102",
    "course_title": "Elementary Spanish II",
    "credit_hours": "4",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Varies by section",
    "instruction_method": "Blended/Hybrid",
    "typically_offered": "Spring",
    "requirement_designation": "Humanities, Arts, Language [Foreign Language]",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "**This class will meet in person on MW and online on Fridays** \nSpanish 102 is the second course in a beginning-level language sequence and is an integrated skills course designed to promote communication with Hispanic communities and to heighten cultural awareness. Students participate in paired, small-group, and whole-class conversation/listening activities that focus on meaningful communication as well as reading and writing. As such, the goals of this course include the following: \n1. learning to use Spanish to communicate, primarily in speaking and listening, but also in reading and writing; \n2. learning of and about the tools of communication: basic linguistic units (words, idioms, verb forms, sounds) and grammar (rules which permit you to combine the units meaningfully);  \n3. and studying Hispanic cultures to begin to understand how culture affects language use.  \nPrerequisite: successful completion of Spanish 101 at Emory, at Emory at Oxford, transfer credit for Span 101 from another institution, or permission of the Director of Placement",
    "course_description": "The second half of a yearlong introductory course designed to train students to understand, speak, read, and write Spanish.",
    "prerequisites": "SPAN 101 or SPAN_OX 101 or equivalent transfer credit as prerequisite.",
    "instructors": null,
    "schedule_location": "Varies by section",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3293, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 8:30-9:45a; F 8:30-9:20a, Instructor: J. Feldman, Status: Wait List\nClass Nbr: 3295, Section #: 2, Type: LEC, Campus: ATL, Meets: MW 10-11:15a; F 10-10:50a, Instructor: J. Feldman, Status: Open\nClass Nbr: This section is full 3297, Section #: 3, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p; F 11:30a-12:20p, Instructor: W. Travers, Status: Wait List\nClass Nbr: This section is full 3304, Section #: 4, Type: LEC, Campus: ATL, Meets: TTh 1-2:15p; F 1-1:50p, Instructor: W. Travers, Status: Wait List",
    "date_accessed": "2024-03-30"
}