{
    "course_code": "SPAN 190",
    "course_title": "Freshman Seminar: Spanish: Latin American Film",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "This course explores the intersection of family, patriarchy, and violence in 21st-century Latin American film. The course will examine how various family formats are portrayed on film, and to what extent they construe, challenge, and/or reproduce influential categories (such as work, motherhood, decency, masculinity, promiscuity, or childhood) across gender, racial, and/or class-based lines. In examining these issues, we will look at how People of Color, women, children, and members of the LGBTQIA+ collective bear the brunt of abuse and generalized violence brought against them. We will also explore the concept of patriarchy paying attention to the many traits that turns masculinity in particular and cisheteronormativity in general (as well as subtle forms of white supremacy-ism) into vigilance vectors bent on building \"the normal\" by neutralizing and destroying any detectable \"deviance\" from an established (often State-sponsored) desideratum for docile and malleable citizens.  \nEvaluation will be based on participation in class, oral presentations, written responses submitted to discussion boards, and a final project.",
    "course_description": "Freshmen only. In-depth treatment of a topic in language, literature, or culture of the Luso-Hispanic world through readings, frequent writing assignments, and class discussions.",
    "prerequisites": null,
    "instructors": "Hernan Feldman - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Candler Library 124",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 5620, Section #: 2, Type: SEM, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: H. Feldman, Status: Closed",
    "date_accessed": "2024-03-30"
}