{
    "course_code": "SPAN 190",
    "course_title": "Freshman Seminar: Spanish: Mexico-US Border Spaces",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 12",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "Freshmen Seminar - Limited to First Year Students Only\nThis course explores the history and stories of the Mexico-U.S. border from colonial notions of boundaries through the Mexican-American War and the Mexican Revolution to the twentieth-century concept of \"borderlands\" and the present cultural and political tangle of migration, building of walls, globalization, and fluid borderland spaces, not all of them located at the official dividing line. Through close reading/viewing of different kinds of texts (chronicles, treaties/government documents, fiction, poetry, music, visual arts, oral histories, film), students will gain a critical understanding of the ideological, political and cultural constructions of la frontera as experienced in the U.S. borderlands and in \"border spaces\" in Atlanta. As circumstances allow, the class will explore specific places in Atlanta and engage with community partner guest speakers. We will also explore multiple ways of gathering evidence, including an experiential component in which we will engage texts through various art forms in order to more closely observe the texts and our own expressions of borders and border experiences. Some of these sessions will be created and led by students after working with the professor.",
    "course_description": "Freshmen only. In-depth treatment of a topic in language, literature, or culture of the Luso-Hispanic world through readings, frequent writing assignments, and class discussions.",
    "prerequisites": null,
    "instructors": "Vialla Hartfield-Mendez - Primary Instructor",
    "schedule_location": "T 1pm-3:45pm in COX 230A",
    "course_resources": null,
    "sections": "Class Nbr: 3738, Section #: 1, Type: SEM, Campus: ATL, Meets: T 1-3:45p, Instructor: V. Hartfield-Mendez, Status: Open",
    "date_accessed": "2024-03-30"
}