{
    "course_code": "SPAN 318",
    "course_title": "Critical Writing in Hispanic Topics: Lan&Cult for Heritage Speakers",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Language [Foreign Language]",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "Topic:  Language & Culture for Heritage Speakers\nDESCRIPTION: This course is designed specifically for heritage speakers: students who already speak Spanish but have never been schooled in Spanish or have received limited education in Spanish. The course introduces students to the study of the Spanish language and cultures in an academic context, and it is divided in three parts: 1) a sociohistorical background on the presence of the Spanish language in the United States, 2) a study on language variation and language ideologies, with a specific focus on the dialectal characteristics of US Spanish and how they differ and connect to other Spanish dialects, 3) a methodology for the critical analysis of cultural production in Spanish, such as films, literary works, music, etc. \nTEXTS:  \n- Potowski, Kim and Naomi Shin. 2019. Gramática española, Variación social. Routledge. \n- Selection of articles available on Canvas. \nEVALUATION: Evaluation will be based on class participation, daily assignments, exams, oral presentations and one final essay. \nPRE-REQUISITES: Heritage speakers of Spanish who have an official placement for foundational courses, or have completed Span 212, or with permission from instructor. This course is not open for heritage speakers who have already taken 400-level courses in Spanish or more than one 300-level course.",
    "course_description": "This course combines advanced writing instruction with the study of diverse Hispanic cultural topics.",
    "prerequisites": null,
    "instructors": "Jose Luis Boigues-Lopez - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Ignatius Few Building_129",
    "course_resources": null,
    "sections": "Class Nbr: 3685, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: J. Boigues-Lopez, Status: Open",
    "date_accessed": "2024-03-30"
}