{
    "course_code": "SPAN 485",
    "course_title": "Topics in Hispanic Culture: Latin American Short Stories",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 6",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "Description: It used to be a tenet of literary history that Latin Americans excelled in the short story form. Many of the most important writers of the narrative Boom of the 1960s and 70s,Garcia Marquez, Cortazar, Cabrera Infante, and others, used the short story as a way of developing skills that would later on allow them to produce their more important novels. But more than simply a laboratory for more ambitious literary pursuits, the genre stands on its own as a form of inquiry into questions of identity, social justice, and even metaphysics (i.e., Borges). In a cultural milieu where so many texts seem to compete for a share of our shorter attention span, it may be time to go back to the short story as flexible genre that allows for concise, direct interventions within the pressing social issues of our times. From its initial codification in the works of Horacio Quiroga to the more post-modern experiments of recent Cuban writers, this survey is meant to explore the achievements and the limitations of the genre and its continued relevance in today's world.\nAuthors include: Horacio Quiroga, Jorge Luis Borges, Juan Rulfo, Julio Cortazar, Clarice Lispector, Maria Luisa Bombal, Luis Negrón, Ena Lucia Portela, Mayra Santos, and others.",
    "course_description": "Upper-level research seminar on topics related to the language, discourse, literature, and/or culture of the Hispanic world. Students may take multiple SPAN 485 courses provided that they focus on different topics.",
    "prerequisites": null,
    "instructors": "Jose Quiroga - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in Callaway Center S104",
    "course_resources": null,
    "sections": "Class Nbr: 3699, Section #: 2, Type: LEC, Campus: ATL, Meets: TTh 1-2:15p, Instructor: J. Quiroga, Status: Open",
    "date_accessed": "2024-03-30"
}