{
    "course_code": "SPAN 485",
    "course_title": "Topics in Hispanic Culture: Feminisms in Argentina",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "Chiara Páez was a 14-year-old small-town girl from the Argentine hinterland who became pregnant and intended to give birth and raise her future child. Instead, her life was cut short when her boyfriend (who didn't want Chiara to carry this pregnancy to term) beat her unconscious and buried her while still alive. Months later, three men plied 16-year-old Lucía Pérez with drugs and raped her in the populous coastal city of Mar del Plata. Lucía was admitted to a hospital while unconscious, treated for drug abuse, and pronounced deceased after a painful agony. This course will explore how these events sparked an overarching Feminist Revolution of sorts that spans from the #Niunamenos Movement (2015) to the inclusion of \"femicidio/feminicidio\" as a hate crime in the Argentine Penal Code. The course will examine how massive street demonstrations led to the legalization of women's right to choose an abortion, to the Trans Collective's demands over safe labor conditions, and to the concomitant rise of a \"controversial\" gender-inclusive language (\"lenguaje inclusivo\"). We will read texts that became flagships within Argentine Feminist circles, such as Virginie Despentes's King Kong Theory, as well as Feminist literature, film, performance, and music created by Argentine authors.\nEvaluation will be based on participation in class, oral presentations, written responses submitted to discussion boards, and a final research paper.",
    "course_description": "Upper-level research seminar on topics related to the language, discourse, literature, and/or culture of the Hispanic world. Students may take multiple SPAN 485 courses provided that they focus on different topics.",
    "prerequisites": null,
    "instructors": "Hernan Feldman - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Candler Library 124",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3698, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 10-11:15a, Instructor: H. Feldman, Status: Closed",
    "date_accessed": "2024-03-30"
}