{
    "course_code": "SPAN 422",
    "course_title": "Matza and Tortillas",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Race and Ethnicity(*)",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Same as JS 422 1)\n\n\nThis course addresses the historical position and cultural production of Spanish, Latin American, and Latinx Jewry.  Looking first at early Iberia and modern Spain, then at contemporary Latin America and the US, we will examine how majority cultures construct an Other belonging to a minority culture within the complex interplay of religion, power, and politics. How have diasporic Jewish subjects in different parts of the Hispanic world been categorized racially and ethnically by their societies, and how have they historically framed their own identity while negotiating the pressures of exile, immigration, and antisemitism? Considering examples as diverse as Spain's marranos and the Jewish gauchos of Argentina, the course will explore what it means to live on the hyphen, negotiating tensions between assimilation and the preservation of differences. Readings will highlight the role of memory in constructing symbolic representations through which cultural, ethnic, and religious identity is expressed; we will compare these representations with the ways in which concepts of Otherness in our own society structure social relations at the everyday and the national levels. No prior knowledge of Jewish culture or religious traditions is required or assumed.\n\n\nTexts: Readings are interdisciplinary, drawing from a wide variety of discourses: narrative fiction, poetry, essays, drama, autobiographical memoirs, films, historical documents, legal codes, newspaper accounts, and musical recordings.\n\n\nEvaluation: The final grade will be based on active class participation; short written assignments; Web project; final research project.\n\n\nParticulars: Most primary readings will be in Spanish; supplementary background readings in English. Students will also receive a basic introduction to Ladino (the Judeo-Spanish language used in the Sephardic diaspora).\n\n\nRequirements: At least one 300-level foundational course in the Spanish major/minor; one additional course (300- or 400-level) is recommended. Students wishing to enroll without these prerequisites should consult with the instructor.",
    "course_description": "Addresses the historical position and cultural production of Spanish and Latin American Jewry, from medieval Spain to the present. We examine how diasporic Jewish subjects have framed their identity while negotiating the pressures of exile, immigration, antisemitism, and political violence.",
    "prerequisites": null,
    "instructors": "Hazel Gold - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Callaway Center N204",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3744, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 1-2:15p, Instructor: H. Gold, Status: Closed",
    "date_accessed": "2024-03-30"
}