{
    "course_code": "SPAN 485",
    "course_title": "Topics in Hispanic Culture: Gender and Femicide in C.A.",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 11 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Same as LACS 490R 1, WGS 475R 1)\n* This course is taught in Spanish*\nGender and Femicide in Central America\nThis cross listed seminar explores gendered violence as a theoretical, social, and human rights issue in the cultural production of Central American women from 1980 to the present. The course will focus on the specific social, historical, and political context of the Northern Triangle (Guatemala, Honduras, and El Salvador) in relation to the broader context of Central America and Latin America. Central questions are; how have wars, genocide, criminal and political violence been gendered? How do Central American women narrate domestic violence in relation to political violence? How do women remember and narrate gender violence in war during the \"post conflict\" era? How are the intersections of gender/sexuality, race/ethnicity, class, and other characteristics reflected in women's experiences of gender-based violence such as incest, sexual harassment and feminicide? This course will cover theories on gender violence from a multidisciplinary perspective in films, performances, fictional works, and testimonies of writers such as Rigoberta Menchú.\n\n\nIn addition, this course will allow students to engage in Collaborative Online International Learning (COIL) approaches by working on a project on virtual teams with other students, attending virtual talks, and interviewing feminist activists in Central America. The COIL approach will occur online, while regular class meetings will be held in person.\nPrerequisites: At least one SPAN Foundational Course (SPAN 300-318W)",
    "course_description": "Upper-level research seminar on topics related to the language, discourse, literature, and/or culture of the Hispanic world. Students may take multiple SPAN 485 courses provided that they focus on different topics.",
    "prerequisites": null,
    "instructors": "Leda Lozier - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Callaway Center N118",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 5701, Section #: 4, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: L. Lozier, Status: Wait List",
    "date_accessed": "2024-03-30"
}