{
    "course_code": "FILM 392R",
    "course_title": "Genre Studies: A Century of American Comedy",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 30 / Seats Avail: 25Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "An introduction to the extraordinary achievements of American film comedy from the silent era through the present day, through its various forms: silent slapstick (exemplified by Charlie Chaplin and Buster Keaton), classic romantic comedy (of the 1930s), the nervous romance (initiated by Annie Hall), animal comedy (Animal House) and grossout/grotesque comedy, through the relatively recent advent of more diverse films in terms of race, ethnicity and sexual orientation.   At the same time, we will be reading important works of criticism and analysis.  Requirements will include a staged-writing 8-10 pp. research term paper, in-class presentation, quizzes, etc.",
    "course_description": "History and theory of one or more major Hollywood genres, such as the Western, the gangster film, the musical, the horror film, film noir, and science fiction and their international analogues (e.g., the American Western and the Japanese chambara film). Weekly screenings required.",
    "prerequisites": "FILM 102 and (FILM 201 or FILM 202 or FILM 203 or FILM 204 or FILM_OX 204 or FILM 205) or equivalent transfer credit as prerequisites.",
    "instructors": "Matthew Bernstein - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in White Hall 111\nT 4pm-6pm in White Hall 206",
    "course_resources": null,
    "sections": "Class Nbr: 3944, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p; T 4-6p, Instructor: M. Bernstein, Status: Open",
    "date_accessed": "2024-03-30"
}