{
    "course_code": "MESAS 270",
    "course_title": "Special Topics MESAS-200 Level: Islam in Africa",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 13",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as REL 270 4, HIST 296 3)  This is a survey lecture course on the history of Islam in Africa, from its beginning in the seventh century to the present times. It provides a historical framework through which issues in contemporary Muslim societies in Africa can be analyzed and understood. It is designed to provide students with broad understanding of the history of Islam in Africa, including Northern, Western, and Eastern regions of the continent, stressing the role of the Sahara as a connective space. We will examine the dynamics of the rise and fall of different dynasties and empires, and the way African societies adopted Islam (Islamizing Africa), and adapted to it, maintaining their core traditions and beliefs (Africanizing Islam). We will learn about reform and Jihad movements before examining colonial powers; strategies to conquer and colonize Islamic institutions and societies. During the course we will discuss independence movements and the different ways Islam is being integrated in the fabrics of the independent states and societies, and examine issues of irredentism and terrorism, among others. Together we will analyze the ways opposing binaries, such as continuities/discontinuities, integration/separation, tradition/modernity, etc. apply or not to African Muslim societies and states.",
    "course_description": "Special topics in Middle Eastern and South Asian Studies, at the 200 level; may be repeated when content varies.",
    "prerequisites": null,
    "instructors": "Yacine Daddi Addoun - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 3192, Section #: 3, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: Y. Daddi Addoun, Status: Open",
    "date_accessed": "2024-03-30"
}