{
    "course_code": "MESAS 270",
    "course_title": "Special Topics MESAS-200 Level: Environment &Society in MENA",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 2",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as HIST 296 4) Full topic: Environment and Society in the MENA\n\n\nFrom industrial cities to irrigated fields, mountain ranges to hot deserts, and from islands to green oases, the Middle East and North Africa (MENA) encompasses a variety of environments well suited for examining the relationships between the environment and society. This course uses the MENA region as a case study for investigating complex issues surrounding environmental sustainability. In particular, this course will focus on 1) the relationship between religion and ecological stewardship or exploitation, 2) grassroots versus governmental environmentalism, and 3) practical economic, industrial, and natural resource management considerations in the context of environmental sustainability. This course will feature multiple guest speakers from the MENA region with their respective specializations to offer local insights on these topics. By the end of this course, students will produce public-facing final projects employing digital tools learned in the class. This course is funded by the Mellon Interventions Project Public Scholarship Teaching Fellowship.\n\n\nThis class with include an asynchronous component.",
    "course_description": "Special topics in Middle Eastern and South Asian Studies, at the 200 level; may be repeated when content varies.",
    "prerequisites": null,
    "instructors": "Norah Elmagraby - Primary Instructor",
    "schedule_location": "M 9:40am-10:55am in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 3193, Section #: 4, Type: LEC, Campus: ATL, Meets: M 9:40-10:55a, Instructor: N. Elmagraby, Status: Open",
    "date_accessed": "2024-03-30"
}