{
    "course_code": "CS 385",
    "course_title": "Topics in Computer Science: Soc.&Ethical Issues Computing",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 4Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "Prerequisite: CS 224. Permission required for enrollment, please contact Bríd Flood (bnflood@emory.edu). \nCourse Content: Computing innovations bring an era of exciting new technologies to society like social networks, microblogging, the internet of things, and autonomous vehicles. At the same time, society is growing increasingly concerned that these new capabilities bring a host of unwelcome side effects. Recent concerns include election interference, vaccine misinformation, surveillance capitalism, and killer robots. How can we critically assess whether a technology causes more harm than good? This course will cover topics on the social and ethical issues new computing technology confronts. The first part of the class will cover common philosophical approaches to ethical questions such as utilitarianism, deontology, and virtue ethics. The second part will consider the implications of ethical and political theories for thinking about the end user, the programmer, system design, and the development context. This will include examining differences between individual decision-making verses collective decision making and the role of political and social theories in characterizing how computing technologies are designed and created. The last part of the course will consider salient issues and case studies that pose pressing challenges for today's computing era.",
    "course_description": "Rotating topics in computer science. May be repeated for credit when the topic varies. Pre and co requisites depend on the topic offered.",
    "prerequisites": null,
    "instructors": "Kristin Williams - Primary Instructor",
    "schedule_location": "MW 4pm-5:15pm in Math & Science Center - W201",
    "course_resources": null,
    "sections": "Class Nbr: 6107, Section #: 2, Type: LEC, Campus: ATL, Meets: MW 4-5:15p, Instructor: K. Williams, Status: Open",
    "date_accessed": "2024-03-30"
}