{
    "course_code": "ITAL 376",
    "course_title": "Topics in Italian Culture in Translation: Italian Cinema",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 13 / Seats Avail: 11",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Same as FILM 395R 1)\n(ITAL 376 (4 credits)     T-TH 11:30-12:45   Italian Cinema\n(Castaldo TT 11:30-12:45 / Screenings Tuesdays 8:00-9:30PM / Cross-listed with FILM395R)\n \nCharisma on Screen. Italian cinema and the charismatic experience \nThis class analyzes the construction of charismatic presence and personae in Italian films from the post-war years onward. We will ask how charisma is created on screen, what formal features it requires to produce \"pathetic intensity\" to fuel the experience of charis (grace). We will focus in particular on the films of Liliana Cavani, whose works explore an obsession with illuminating personalities, as in the tetralogy comprised of The Cannibals, The Guest, Milarepa, and Francesco. In following Cavani's itinerary, we will consider her use of philosophical texts, biographical accounts, and theoretical essays to reconstruct charismatic figures like Nietzsche (Beyond Good and Evil) and Galilei (Galileo). Finally, we will expand our analysis to the work of classic Italian filmmakers such as Rossellini (The Flowers of St. Frances), Pasolini (The Gospel According to St. Matthew, Teorema), and Zurlini (Black Jesus). The class will be in English, and all films will be screened with English subtitles. Weekly Tuesday screenings required. Films longer than 90 minutes will be screened online. \n \nBooks \nAll readings will be accessible through Canvas",
    "course_description": "Topics to be announced each semester. Course is offered in English. Course content will vary, including topics of literature, history, culture, art history, political thought, current trends, and more. May be repeated for credit when syllabus changes.",
    "prerequisites": null,
    "instructors": "Achille Castaldo - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Rich Building 104\nT 8pm-9:30pm in White Hall 207",
    "course_resources": null,
    "sections": "Class Nbr: 2261, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p; T 8-9:30p, Instructor: A. Castaldo, Status: Open",
    "date_accessed": "2024-03-30"
}