{
    "course_code": "ECON 490R",
    "course_title": "Advanced Seminar: Economics: Mechanism Design",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 30 / Seats Avail: 15Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "Topic: Mechanism Design\nWhen markets fail (e.g., in the presence of public goods, externalities, and asymmetric information), or do not exist (e.g., in allocating kidneys to patients, or students to schools), can we design decentralized mechanisms to bring about desirable allocations? Mechanism design (aka market design) provides some answers. Some designed mechanisms are market-like, e.g., SO2 emissions markets or electric power exchanges; others involve auctions, such as spectrum auctions in mobile telephony; yet others involve matching such as the allocation of physicians to residency programs, or ventilators to patients. We will study the general theory of economic design, the manipulability of mechanisms, including auctions and matching mechanisms.",
    "course_description": "Scheduled as needed. Variable credit; maximum credit: eight hours. Prerequisite: Economics majors who have completed all specifically required courses for the major, or consent of the instructor. Preparation of exercises and reports based on current problems of economic policy; requires use of interpretation and analysis previously acquired in other economics and allied courses. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Shomu Banerjee - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Rich Building 211",
    "course_resources": null,
    "sections": "Class Nbr: 1135, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 1-2:15p, Instructor: S. Banerjee, Status: Open",
    "date_accessed": "2024-03-30"
}