{
    "course_code": "BUS 480",
    "course_title": "Senior Seminar: Innovative Mkt Approaches",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Mondays, 5:30-7:30 pm - GBS 304\nClass Dates:  9/11, 9/18, 9/25, 10/2, 10/16, alternate date: 10/23 (the alternate date is only used if the instructor or the school has an emergency that causes one of the scheduled dates to be canceled-it will not be held as a makeup date for a missed class).\n\n\nSeminar Description:  This seminar focuses on the tools and innovative marketing tactics that can be employed to build \"brand love\" amongst target consumers.  From mining consumer insights, to building a brand vision and positioning, to leveraging marketing assets and partnerships, students will get an understanding of the steps that can be taken to build loyal consumer adoption of a brand.  Topics will include a discussion of how consumer insights lead to compelling brand vision and positioning, how to develop and articulate a core creative idea and integrated marketing communication brief, and how to leverage external partnerships and other tactics to build consumer loyalty.  The course will examine several brands that are using traditional and non-traditional methods to build brand love and win in today's marketplace.  Over the course of the session, the class members will develop a plan to build brand love for a brand of choice, as well as participate in an exercise to develop a brand vision and positioning for their personal brand.\n\n\nInstructor:  Brad Taylor is a 23-year veteran of the Coca-Cola Company with extensive sales and marketing leadership experience. Most recently he served as Vice President of Sales & Marketing, National Accounts in the Foodservice and On-Premise Division where he led cross-functional teams to deliver over $500 million in revenue from existing national account customers, as well as secured new business in the foodservice, travel, healthcare, and specialty retail sectors. Earlier in his Coca-Cola career he served as Vice President of Customer Marketing where he led a team of marketers to consult top 100 customers in the areas of brand strategy and positioning, marketing strategies, and integrated marketing campaign development. Before Coca-Cola, Brad gained extensive brand management and marketing experience at Pizza Hut, Inc. as well as advertising agency account management experience at Bozell, and The Joey Reiman Agency. Brad has parlayed this vast experience into his own Branding, Marketing, and Sales Strategy freelance consultancy, TaylorBuiltBrands where he helps clients polish their brand and solve their marketing & sales challenges to build their business.",
    "course_description": "Senior seminar courses fall outside the scope of traditional academic coursework, and instead allow students to learn from and interact with experienced practitioners, and to develop industry-specific insights, fine-tune career skills, and increase professional exposure.",
    "prerequisites": "This section is reserved for students in the BBA program.",
    "instructors": "Andrea Hershatter - Primary Instructor",
    "schedule_location": "M 5:30pm-7:30pm in Goizueta Business School 304",
    "course_resources": null,
    "sections": "Class Nbr: 6649, Section #: 1103, Type: SEM, Campus: ATL, Meets: M 5:30-7:30p, Instructor: A. Hershatter, Status: Open",
    "date_accessed": "2024-03-30"
}