{
    "course_code": "BUS 480",
    "course_title": "Senior Seminar: Wall Street & Investing",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Mondays, 5:30-7:30 pm - GBS 331\nClass Dates: 9/11, 9/18, 9/25, 10/2, 10/16, alternate date: 10/23 (the alternate date is only used if the instructor or the school has an emergency that causes one of the scheduled dates to be canceled-it will not be held as a makeup date for a missed class).\n\n\nSeminar Description:  This seminar will focus on understanding personal and professional investment strategies, especially as they relate to the current economic and political environment.    Practical topics will include (but are not limited to) worldwide current events, investing, job direction in the financial services sector, and any other applicable events that may occur during the term.  Please note, there will be added emphasis on stock market psychology and how to make tough decisions regarding investments.\n\n\nInstructor: Michael Radetsky is a Senior Vice President at UBS.  He has taught this always-popular senior seminar since 1996.  Michael graduated from the University of Georgia with a Bachelor's Degree in Finance.",
    "course_description": "Senior seminar courses fall outside the scope of traditional academic coursework, and instead allow students to learn from and interact with experienced practitioners, and to develop industry-specific insights, fine-tune career skills, and increase professional exposure.",
    "prerequisites": "This section is reserved for students in the BBA program.",
    "instructors": "Andrea Hershatter - Primary Instructor",
    "schedule_location": "M 5:30pm-7:30pm in Goizueta Business School 331",
    "course_resources": null,
    "sections": "Class Nbr: 6650, Section #: 1104, Type: SEM, Campus: ATL, Meets: M 5:30-7:30p, Instructor: A. Hershatter, Status: Wait List",
    "date_accessed": "2024-03-30"
}