{
    "course_code": "BUS 480",
    "course_title": "Senior Seminar: Leadership-Health,Food&Fitness",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Tuesdays, 5:30-7:30 pm- GBS 338\nClass Dates: 9/5, 9/12, 9/19, 9/26, 10/3, alternate date: 10/17 (the alternate date is only used if the instructor or the school has an emergency that causes one of the scheduled dates to be canceled-it will not be held as a makeup date for a missed class).\n\n\nSeminar Description: Leaders are most effective when they are taking care of themselves. This seminar will provide knowledge and tools to maintain personal health (mental and physical) throughout one's career and stages of life. Topics will include the components of a healthy lifestyle, physical capabilities to train during exercise, time management, principles to guide nutrition, as well as strategies to model these behaviors for your team and colleagues.\n\n\nInstructor: Dr. Shveta Raju, MD, MBA is a Board-Certified Internal Medicine primary care physician at the multi-specialty group medical practice Gwinnett Clinic, northeast of Atlanta. After earning her MD and MBA at Emory, Dr. Raju completed her Internal Medicine residency at the Massachusetts General Hospital (Harvard Medical School). In addition to her clinical practice, she teaches medical students and is responsible for recruiting, hiring and training staff and physicians. Since December 2022 she has taught and mentored physicians as a Success Coach for the Chief Medical Officer training program at Goizueta Executive Education. After experiencing the benefits of CrossFit and healthy nutrition in her own life, Dr. Raju completed her CrossFit Level 2 Certification (2023) and Precision Level 1 Coach Certification (2022). She is passionate about improving the mental, physical and metabolic health of her patients and community.",
    "course_description": "Senior seminar courses fall outside the scope of traditional academic coursework, and instead allow students to learn from and interact with experienced practitioners, and to develop industry-specific insights, fine-tune career skills, and increase professional exposure.",
    "prerequisites": "This section is reserved for students in the BBA program.",
    "instructors": "Andrea Hershatter - Primary Instructor",
    "schedule_location": "T 5:30pm-7:30pm in Goizueta Business School 338",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 6658, Section #: 1112, Type: SEM, Campus: ATL, Meets: T 5:30-7:30p, Instructor: A. Hershatter, Status: Closed",
    "date_accessed": "2024-03-30"
}