{
    "course_code": "BUS 480",
    "course_title": "Senior Seminar: Private Equity-Due Diligence",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Tuesdays, 6:00-8:00 pm- GBS 301\nClass Dates: 10/24, 10/31, 11/7, 11/14, 11/28, alternate date: 12/5\n\n\nSeminar Description: Most private equity classes focus on financial and accounting due diligence.  While these are important topics, what often gets overlooked is the business due diligence, spanning commercial and operational topics.  Specifically, what is the outlook for the target's market growth, what might happen with their competitive position and future share gain, can management achieve their plans to improve profitability, etc.  These are critical questions that often inform the financial diligence and resulting valuation.  In a world where deals are hotly contested and both high interest rates and valuation, getting the business due diligence right matters more than ever.  This seminar would aim to bring this side of private equity to life, which would better enable future bankers, consultants, accountants, and private equity analysts in their first roles after graduation.\n\n\nInstructor: Sandeep Heda is a Partner in Bain & Company's Private Equity, Retail, and Advanced Manufacturing and Services practices.\n   Sandeep has more than 20 years of management consulting experience.  While at Bain, he has worked for extended periods in its San Francisco and Southeast Asia offices. He is currently a leader of Bain Atlanta office's associate consultant recruiting program and is also a member of the firm's Compensation and Promotion Committee. Sandeep has also been a guest lecturer at Duke University's Fuqua School of Business and cited or published in WSJ Pro Private Equity, HBR.org, and Supermarket News.\n   Sandeep graduated with bachelor's degrees in business administration and economics, summa cum laude, from Emory University. He received his MBA from the Wharton School of Business, where he graduated as a Palmer Scholar and Joseph Wharton Scholar. While at Wharton, Sandeep worked in the Investment Banking Division of Goldman Sachs in New York City.",
    "course_description": "Senior seminar courses fall outside the scope of traditional academic coursework, and instead allow students to learn from and interact with experienced practitioners, and to develop industry-specific insights, fine-tune career skills, and increase professional exposure.",
    "prerequisites": "This section is reserved for students in the BBA program.",
    "instructors": "Andrea Hershatter - Primary Instructor",
    "schedule_location": "T 6pm-8pm in Goizueta Business School 301",
    "course_resources": null,
    "sections": "Class Nbr: 6660, Section #: 1114, Type: SEM, Campus: ATL, Meets: T 6-8p, Instructor: A. Hershatter, Status: Open",
    "date_accessed": "2024-03-30"
}