{
    "course_code": "BUS 480",
    "course_title": "Senior Seminar: Applied Financial Planning",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Mondays, 6:00-8:00 pm - GBS 301\nClass Dates: 9/11, 9/18, 9/25, 10/2, 10/16, alternate date: 10/23 (the alternate date is only used if the instructor or the school has an emergency that causes one of the scheduled dates to be canceled-it will not be held as a makeup date for a missed class).\n\n\nSeminar Description:  Learning how to apply personal finance concepts to real world scenarios. The seminar will focus on how to analyze clients' financial pictures and goals to implement a financial plan. Each student will build a financial plan for their personal situation and have their plan evaluated by a financial planner.\n\n\nInstructor: John McColl graduated with a finance and accounting concentration from Goizueta in 2010. After graduation, he worked for 5 years as a financial statement auditor with EY where he helped multiple companies pursue IPOs. For the past 7 years, he has worked as a financial advisor with Edward Jones where he assists people with their retirement planning and investment goals.",
    "course_description": "Senior seminar courses fall outside the scope of traditional academic coursework, and instead allow students to learn from and interact with experienced practitioners, and to develop industry-specific insights, fine-tune career skills, and increase professional exposure.",
    "prerequisites": "This section is reserved for students in the BBA program.",
    "instructors": "Andrea Hershatter - Primary Instructor",
    "schedule_location": "M 6pm-8pm in Goizueta Business School 301",
    "course_resources": null,
    "sections": "Class Nbr: 6651, Section #: 1105, Type: SEM, Campus: ATL, Meets: M 6-8p, Instructor: A. Hershatter, Status: Wait List",
    "date_accessed": "2024-03-30"
}