{
    "course_code": "BUS 480",
    "course_title": "Senior Seminar: Decision-making: Authenticity",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Tuesdays, 5:30-7:30 pm- GBS 331\nClass Dates: 9/5, 9/12, 9/19, 9/26, 10/3, alternate date: 10/17 (the alternate date is only used if the instructor or the school has an emergency that causes one of the scheduled dates to be canceled-it will not be held as a makeup date for a missed class).\n\n\nSeminar Description: Students will engage in practical solutions concerning what their socialized biases may be entering the workforce. They will participate in discussions and reflections that challenge what it means to work autonomously and as a part of a team through authenticity. General decision-making styles will be examined in light of time pressure and goal determinants.\n\n\nInstructor: Steve Straughter is a highly accomplished and results-driven executive and corporate strategist with decades of experience, including top-tier consulting firm expertise across various industries. As an Advisory Board Member for eWAKA Mobility Limited, he provides strategic counsel and expert advice to the executive team, guiding the company's business growth and market expansion. Steve also holds the position of Chief Strategy Officer at LinkedToAsia, where he leads the organization's global strategic vision. Moreover, Steve has a strong background in academia, currently serving as an Adjunct Professor at Lone Star College, where he fosters an inclusive learning environment while delivering engaging lectures and facilitating dynamic discussions on various psychology topics. As the CEO of The Straughter Group, he spearheads the overall strategic direction and growth, collaborating with a team of consultants and securing strategic partnerships with Fortune 500 companies. Steve also dedicates himself to various service activities, such as coaching, mentoring, and radically awesome hobbies like mountain climbing and laughing out loud frequently!",
    "course_description": "Senior seminar courses fall outside the scope of traditional academic coursework, and instead allow students to learn from and interact with experienced practitioners, and to develop industry-specific insights, fine-tune career skills, and increase professional exposure.",
    "prerequisites": "This section is reserved for students in the BBA program.",
    "instructors": "Andrea Hershatter - Primary Instructor",
    "schedule_location": "T 5:30pm-7:30pm in Goizueta Business School 331",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 6659, Section #: 1113, Type: SEM, Campus: ATL, Meets: T 5:30-7:30p, Instructor: A. Hershatter, Status: Closed",
    "date_accessed": "2024-03-30"
}