{
    "course_code": "BUS 480",
    "course_title": "Senior Seminar: America's New Music City: Atl",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Wednesday, 5:30-7:30 pm - GBS 304\nClass Dates:  10/18, 10/25, 11/1, 11/8, 11/15, alternate date: 11/29\n\n\nSeminar Description:  We are currently experiencing one of the most fast-paced and innovative chapters in the history of the music business. After fifteen years of decline, global recording revenues have begun to rebound with eight consecutive years of growth. Atlanta deserves some credit for this resurgence as it is widely known as the hip hop capital of the world. In this seminar students will meet with leaders and experts who will help them develop an understanding of how the music industry functions, how Atlanta has become an internationally recognized music city, and where the Atlanta music scene is headed. We will explore a range of topics, from artist development, artist compensation in the digital age, music technology, and the future of the music industry.\n\n\nInstructor:  Ben Yonas is a Grammy nominated music producer/engineer and artist manager. His production/engineering credits include Mos Def, Estelle, TV On The Radio, Ledisi, Mickey Hart, Sammy Hagar, and Rubén Blades. He currently manages a roster of artists that include Grammy Winner Rizo, Grammy nominated violinist Jeremy Kittel, Grammy nominated hip hop duo Los Rakas, and Latin Grammy nominated Making Movies. Past management clients include Grateful Dead drummer Mickey Hart and Oakland Hip Hop duo Zion I. His MBA is from the University of Memphis where he directed the music business program for six years and led Memphis High Water Records and Music River Publishing Company.",
    "course_description": "Senior seminar courses fall outside the scope of traditional academic coursework, and instead allow students to learn from and interact with experienced practitioners, and to develop industry-specific insights, fine-tune career skills, and increase professional exposure.",
    "prerequisites": "This section is reserved for students in the BBA program.",
    "instructors": "Andrea Hershatter - Primary Instructor",
    "schedule_location": "W 5:30pm-7:30pm in Goizueta Business School 304",
    "course_resources": null,
    "sections": "Class Nbr: 6661, Section #: 1115, Type: SEM, Campus: ATL, Meets: W 5:30-7:30p, Instructor: A. Hershatter, Status: Wait List",
    "date_accessed": "2024-03-30"
}