{
    "course_code": "BUS 480",
    "course_title": "Senior Seminar: Leadership Development",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Please note that the first class for this seminar will run on Tuesday, September 5th from 5:30-7:30pm in GBS 500 on an exceptional basis.  All other classes will meet on Mondays from 5:30-7:30pm in GBS 500.  Monday dates are: 10/2, 10/16, 10/30 and 11/6.  Other rooms for this seminar may be utilized as speakers are scheduled.\n\n\nSeminar Description: Please join instructors GBS Dean Gareth James and Lieutenant General (Ret) Ken Keen, along with currently scheduled speakers Mayor Keisha Lance Bottoms (Leading in Government and Politics), Ann Lee (Leading a Non-Profit during Crisis), and Javier Goizueta (Leading in Business) for this unique seminar. Goizueta Business School develops principled leaders to make a positive impact in business and society. This seminar will focus on `What does that mean for you?, `What qualities do you need to have to be that kind of leader?. In this seminar students will learn from leaders with different experiences and perspectives from leading in academia, business, the military, politics, and the non-profit/humanitarian space. These speakers will share their leadership journey, lessons they have learned, and what advice can they offer to students as they reflect upon being a principled leader that strives to make a positive impact in business and society.\n\n\nInstructor: Gareth James was appointed Dean of Goizueta Business School in July 2022.  He joined Emory from the Marshall School of Business at the University of Southern California where he served in a number of key roles, including as the school's interim dean, as deputy dean and as a distinguished faculty member.   Gareth earned a BS in Statistics and a BComm in Finance, both from The University of Auckland in New Zealand. He then attended Stanford University as a Fulbright Scholar where he graduated with a PhD in Statistics.  A noted researcher and scholar, Dean James is the co-author of a highly successful textbook, An Introduction to Statistical Learning.\n   Dean James is also an award-winning teacher in the Information Systems and Operations area.  At USC he won many teaching awards, including being a three-time winner of the Golden Apple Award for best instructor in the full-time MBA program.\n\n\nInstructor: Lieutenant General (Ret) Ken Keen is a native of Hyden, Kentucky.  Following graduation from Eastern Kentucky University, as a distinguished military graduate, he was commissioned as a 2LT in the U.S Army Infantry in December 1974.  LTG (Ret) Keen retired from active duty on 1 March 2013.  LTG (Ret) Keen is a graduate of the Brazilian Command and General Staff College, the University of Florida's Master of Arts in Latin American Studies, and the Army War College.  \n   LTG (Ret) Keen is currently the Associate Dean of Leadership Development, Senior Lecturer in Organization and Management, and Program Lead for the Master in Business for Veterans Program at Emory University's Goizueta Business School in Atlanta, Georgia. In these roles, he manages a school-wide leadership development program, teaches leadership courses, and develops programming and teaches courses in the Master for Business for Veterans program.",
    "course_description": "Senior seminar courses fall outside the scope of traditional academic coursework, and instead allow students to learn from and interact with experienced practitioners, and to develop industry-specific insights, fine-tune career skills, and increase professional exposure.",
    "prerequisites": "This section is reserved for students in the BBA program.",
    "instructors": "Andrea Hershatter - Primary Instructor",
    "schedule_location": "T 5:30pm-7:30pm in Goizueta Business School 500\nM 5:30pm-7:30pm in Goizueta Business School 500",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 6654, Section #: 1108, Type: SEM, Campus: ATL, Meets: MT 5:30-7:30p, Instructor: Hershatter/Keen, Status: Closed",
    "date_accessed": "2024-03-30"
}