{
    "course_code": "BUS 480",
    "course_title": "Senior Seminar: Building a Billion $ Company",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Mondays, 5:30-7:30pm - GBS 301\nClass Dates:  10/30, 11/6, 11/13, 11/20, 11/27, alternate date: 12/4 (the alternate date is only used if the instructor or the school has an emergency that causes one of the scheduled dates to be canceled-it will not be held as a makeup date for a missed class).\n\n\nSeminar Description:  For any student aspiring to build, join or invest in a landmark company, learn from CEOs currently tackling the issues faced at each phase.\n  Session 1 - \"From Inception to $10M\"; Session 2 - \"$10M to $100M\"; Session 3 - \"$100M to $250M\"; Session 4 - \"$250M to $750M\"; Session 5 - \"Breaking $1B and accelerating through it\"  Format: The start of the class will be a speaker sharing learnings and issues at the specific stage, then as a class, we will tackle a case study covering a critical decision the CEO must make to succeed.\n  Be ready to envision building a billion-dollar company and expect to be better prepared post seminar. You will also meet some of the best entrepreneurs in the Atlanta region.\n\n\nInstructor:  Adam Marchick built three companies and received funding from nine Venture Capital firms. He serves as a Director at Emory' s Endowment, investing in Venture Capital funds on behalf of the University. Relevant experience includes scaling a company from $0 to $10M in revenue, securing lead funding from Sequoia Capital, and investing in over 40 start-ups.",
    "course_description": "Senior seminar courses fall outside the scope of traditional academic coursework, and instead allow students to learn from and interact with experienced practitioners, and to develop industry-specific insights, fine-tune career skills, and increase professional exposure.",
    "prerequisites": "This section is reserved for students in the BBA program.",
    "instructors": "Andrea Hershatter - Primary Instructor",
    "schedule_location": "M 5:30pm-7:30pm in Goizueta Business School 301",
    "course_resources": null,
    "sections": "Class Nbr: 6653, Section #: 1107, Type: SEM, Campus: ATL, Meets: M 5:30-7:30p, Instructor: A. Hershatter, Status: Wait List",
    "date_accessed": "2024-03-30"
}