{
    "course_code": "BUS 480",
    "course_title": "Senior Seminar: Global Sport: Economics &Geo.",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Thursdays 5:30-8:00pm and Fridays 9:30am-12:00pm (rooms vary), Class Dates: Thursday, 10/5 (GBS 338), Friday, 10/6 (GBS 331), Thursday, 11/2 (GBS 338), Friday, 11/3 (GBS 331)\n\n\nSeminar Description: Throughout the 20th and early 21st century, nation states have hosted global sports events like the Olympics and the FIFA World Cup for a variety of geopolitical and economic purposes. The Barcelona Olympic Games in 1992 are credited with helping the city and region progress on every level, while the 2022 FIFA World Cup in Qatar endured global criticism and outrage. This seminar is designed to analyze the reasons why nations bid on large global events, how they do so successfully via branding and marketing, and how these efforts are (or are not) measured appropriately.\n\n\nInstructor: Terrence Burns is one of the most accomplished and successful global sports marketing and branding experts in the world. Mr. Burns has a long history in Olympic marketing and international sports communications as a sponsor with Delta Air Lines, as a senior executive for the International Olympic Committee, and as an independent consultant. He served as lead brand and strategic consultant for 13 Olympic bids (five successful  Beijing 2008, Vancouver 2010, Sochi 2014, PyeongChang 2018, and Los Angeles 2028). He also served on the successful Russia 2018 FIFA World Cup, United 2026 FIFA World Cup, and Doha 2030 Asian Games bids. Mr. Burns the CEO and Owner of T. Burns Sports Group, LLC and Senior Advisor to Bruin Capital. Burns is a graduate of Emory University (BBA) and Georgia State University (MBA).",
    "course_description": "Senior seminar courses fall outside the scope of traditional academic coursework, and instead allow students to learn from and interact with experienced practitioners, and to develop industry-specific insights, fine-tune career skills, and increase professional exposure.",
    "prerequisites": "This section is reserved for students in the BBA program.",
    "instructors": "Andrea Hershatter - Primary Instructor",
    "schedule_location": "Th 5:30pm-8pm in Goizueta Business School 338\nF 9:30am-12pm in Goizueta Business School 331",
    "course_resources": null,
    "sections": "Class Nbr: 6669, Section #: 1123, Type: SEM, Campus: ATL, Meets: Th 5:30-8p; F 9:30a-12p, Instructor: A. Hershatter, Status: Wait List",
    "date_accessed": "2024-03-30"
}