{
    "course_code": "BUS 480",
    "course_title": "Senior Seminar: Do You Want Build Hedge Fund?",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 2Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Fridays, 9:00am-12:15pm (rooms vary), Class Dates: 9/8 (GBS 331), 10/13 (GBS 421), 10/27 (GBS 201)\n\n\nSeminar Description: This seminar is designed to provide a overview on the how \"funds\" (private equity, credit, real estate, etc.) are capitalized, structured and marketed. An emphasis will be placed detailing different titles, roles and departments within an organization (which will have similarities to banks and other financial institutions) and how they operate with each other. To conclude we will discuss the common ways founders start their funds, understanding and importance of the fund 'strategy' and experience a simulation as a fund founder.\n\n\nInstructor: Peter Kobliska has 20+ years of financial industry experience. He began his career working in middle market lending with Prudential Capital Group before moving on to Merrill Lynch. He spent 10 years with Fortress Investment Group working in several roles as part of the credit funds team. After relocating to Georgia in 2018, he spent time working for Credigy (a subsidiary of National Bank of Canada), SitusAMC and Rotunda Land & Development Group.  He has worked in different roles across a variety of different asset classes ranging from corporate debt & equity, real estate, asset-backed, litigation finance, intellectual property, energy and among others.",
    "course_description": "Senior seminar courses fall outside the scope of traditional academic coursework, and instead allow students to learn from and interact with experienced practitioners, and to develop industry-specific insights, fine-tune career skills, and increase professional exposure.",
    "prerequisites": "This section is reserved for students in the BBA program.",
    "instructors": "Andrea Hershatter - Primary Instructor",
    "schedule_location": "F 9am-12:15pm in Goizueta Business School 331\nF 9am-12:15pm in Goizueta Business School 421\nF 9am-12:15pm in Goizueta Business School 201",
    "course_resources": null,
    "sections": "Class Nbr: 6667, Section #: 1121, Type: SEM, Campus: ATL, Meets: F 9a-12:15p, Instructor: A. Hershatter, Status: Open",
    "date_accessed": "2024-03-30"
}