{
    "course_code": "BUS 480",
    "course_title": "Senior Seminar: Convergence-Sports, Media",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Wednesdays, 9:00-11:00am, GBS 421, Class Dates: 9/6, 9/13, 9/20, 9/27, 10/4, alternate date: 10/11 (the alternate date is only used if the instructor or the school has an emergency that causes one of the scheduled dates to be canceled-it will not be held as a makeup date for a missed class)\n\n\nSeminar Description: Significant disruption is evident in the television business as a result of internal and external factors.  This course will divulge and dissect the various elements impacting a once fruitful ecosystem.  Course format is a combination of case studies, guest speakers and interactive workshops designed to engage students directly to help them chart strategic paths to career fulfillment.\n\n\nInstructor: Scott Doyne (https://www.linkedin.com/in/scott-doyne) is a 25 year veteran of the sports media industry, now leveraging his experience as the founder of Doyne Services, LLC, a Professional Coaching and Career Services business.  Scott was most recently SVP for Turner Sports and Bleacher Report and previously led a Company-wide team of internal consultants advising the organization on Direct to Consumer Strategy.  Scott's versatile career spans leadership roles in production, product management, analytics, strategy, business development and general management, working with league partners at the NBA, NCAA, NHL, MLB, NASCAR and PGA Tour.  Scott's teams have won multiple awards for digital innovation including an Emmy for advanced technological achievement, a Global Media Award, as well as several Webby's and CableFax awards.  As a Professional Coach, Scott helps his clients define and achieve their dreams by providing a structured approach to career transition.  Scott has a consistent history of participating in mentoring programs and also through his alma maters, the University of Michigan and Emory University's Goizueta Business School where earned an MBA in 2003.  Scott has also completed coursework from Erickson Coaching International and is pursuing certification from the International Coaching Federation.  He lives in Dunwoody, Ga with his wife Aimee, 2 teenage children and a pet goldendoodle who has a thriving Instagram account.",
    "course_description": "Senior seminar courses fall outside the scope of traditional academic coursework, and instead allow students to learn from and interact with experienced practitioners, and to develop industry-specific insights, fine-tune career skills, and increase professional exposure.",
    "prerequisites": "This section is reserved for students in the BBA program.",
    "instructors": "Andrea Hershatter - Primary Instructor",
    "schedule_location": "W 9am-11am in Goizueta Business School 421",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 6666, Section #: 1120, Type: SEM, Campus: ATL, Meets: W 9-11a, Instructor: A. Hershatter, Status: Closed",
    "date_accessed": "2024-03-30"
}