{
    "course_code": "BUS 480",
    "course_title": "Senior Seminar: Weird and Wonky Topics",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Sunday, 3:00-6:15 pm, GBS 201, Class Dates:  10/1, 10/29, 12/3\n\n\nSeminar Description: This seminar will explore unique topics from contemporary financial news as a way to learn about market concepts and how they function. Students will learn about these interesting (and occasionally bizarre) stories to glean concepts and then extend those ideas to understand markets more broadly. Example topics may include: meteorologists employed by hedge funds, NFTs, high frequency trading, the music rights to Taylor Swift's master tapes, how the price of oil went negative, investments in sports teams and players, how a major investment bank accidentally wired $900 million, and why the largest electric car company on the planet might not be ESG friendly.\n\n\nInstructor: Josh Khalif is a Senior Institutional Trader at Flow Traders, one of the largest quantitative market making firms. Josh is involved in the trading of several asset classes across the firm, working with clients to trade ETFs, equities, bonds, ADRs, and cryptocurrencies. In addition to being an industry speaker and author, he also serves on the Digital Asset Advisory Committee for FTSE Russell. Josh graduated from Emory University in 2017 where he was in the Goizueta Business School and also majored in English in the College of Arts & Sciences. He is currently pursuing a Masters degree in Creative Writing and Literature through Harvard's Extension School.",
    "course_description": "Senior seminar courses fall outside the scope of traditional academic coursework, and instead allow students to learn from and interact with experienced practitioners, and to develop industry-specific insights, fine-tune career skills, and increase professional exposure.",
    "prerequisites": "This section is reserved for students in the BBA program.",
    "instructors": "Andrea Hershatter - Primary Instructor",
    "schedule_location": "Su 3pm-6:15pm in Goizueta Business School 201",
    "course_resources": null,
    "sections": "Class Nbr: 6672, Section #: 1126, Type: SEM, Campus: ATL, Meets: Su 3-6:15p, Instructor: A. Hershatter, Status: Wait List",
    "date_accessed": "2024-03-30"
}