{
    "course_code": "BUS 480",
    "course_title": "Senior Seminar: Adv Financial Modeling/Excel",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Wednesdays, 5:30-7:30pm, GBS 304.  Class Dates:  9/6, 9/13, 9/20, 9/27, 10/4, alternate date: 10/11 (the alternate date is only used if the instructor or the school has an emergency that causes one of the scheduled dates to be canceled-it will not be held as a makeup date for a missed class).\n\n\nSeminar Description:   Financial modeling and analysis are key skills for professionals seeking to advance in all areas besides just financial management. This advanced seminar is specifically for those seeking to be able to create practical models for forecasting, valuation, and analyses in investment banking, consulting, private equity, venture capital, equity research, or financial management. Participants must bring a laptop with Excel (any version) to simultaneously create a \"shadow-model\" along with the instructor and turn in at the end of each session for review.\n     Enrollment in this seminar will be limited to people who have already completed an internship requiring proficient financial modeling this past summer or the equivalent experience thereof, and who have strong Excel skills. Participants must be knowledgeable of: 1) Financial & managerial accounting; 2) Sales-based EFN (\"External Financing Needed\") forecasting including financial ratios; 3) Funding vehicle mechanics including debt amortization, revolving debt, excess cash accumulation, subordination, floating rate cost of capital, participatory dividends, cumulative dividends, and PIK (pay-in-kind) accretion.\n\n\nInstructor:  Steve Ahn is a partner of the consultancy AbacusTD and an adjunct faculty at Goizueta. He has worked in and taught finance and modeling for investment banks and other organizations for 25 years including JP Morgan, Citibank, Deutschebank, McKinsey & Co., Deloitte, Alix Partners, McGladrey Capital Markets, SEC licensees, and various FORTUNE 500 companies. He is the author of Global Cash Management (1996) and Financial Modeling (2016).",
    "course_description": "Senior seminar courses fall outside the scope of traditional academic coursework, and instead allow students to learn from and interact with experienced practitioners, and to develop industry-specific insights, fine-tune career skills, and increase professional exposure.",
    "prerequisites": "This section is reserved for students in the BBA program.",
    "instructors": "Steven Ahn - Primary Instructor",
    "schedule_location": "W 5:30pm-7:30pm in Goizueta Business School 304",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 6662, Section #: 1116, Type: SEM, Campus: ATL, Meets: W 5:30-7:30p, Instructor: S. Ahn, Status: Closed",
    "date_accessed": "2024-03-30"
}