{
    "course_code": "BUS 480",
    "course_title": "Senior Seminar: How to Write a Brand",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Fridays, 9:00am-12:15pm, GBS 234, Class Dates: 9/8, 9/15, 9/29\n\n\nSeminar Description: Part creative writing class, part branding workshop, this course explores how to create and communicate meaningful, memorable, and ownable concepts through language.\n   Using frameworks and best practices in brand naming and identity building, narrative, poetic, and rhetorical techniques, and publicly available language tools, we will independently craft and collectively polish compelling positioning and messaging targeted to its most valuable audiences.\n   By the final session, each student will have developed their own foundational set of strategically defined, creatively refined, and thoroughly vetted brand language assets: including a name/title, tagline/descriptor, and introductory messaging ready for presenting or pitching to future fans.\n\n\nInstructor: Molly Dickinson is the founder of the Banner Day® naming and branding company and co-founder of INVINCIBLE INC.®, a creative + legal services partnership. As an advisor, colleague, and collaborator, Molly has helped more than 125 clients put brand-building, business-enhancing, audience-enchanting ideas to work for their organizations. An award-winning writer and copywriter, Molly studied creative writing and literature and wrote her honors thesis in original poetry at Elon University. Since establishing her first freelance brand-writing business in 2009, she's continually partnered with fellow entrepreneurs to pursue the work she loves most: Helping self-starters, startups, and upstarts create brands worth celebrating.",
    "course_description": "Senior seminar courses fall outside the scope of traditional academic coursework, and instead allow students to learn from and interact with experienced practitioners, and to develop industry-specific insights, fine-tune career skills, and increase professional exposure.",
    "prerequisites": "This section is reserved for students in the BBA program.",
    "instructors": "Andrea Hershatter - Primary Instructor",
    "schedule_location": "F 9am-12:15pm in Goizueta Business School 234",
    "course_resources": null,
    "sections": "Class Nbr: 6668, Section #: 1122, Type: SEM, Campus: ATL, Meets: F 9a-12:15p, Instructor: A. Hershatter, Status: Open",
    "date_accessed": "2024-03-30"
}