{
    "course_code": "BUS 480",
    "course_title": "Senior Seminar: Bus. Systems & Design Thinking",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Wednesday, 6:00-8:00 pm - GBS 301, Class Dates:  10/18, 10/25, 11/1, 11/8, 11/15, alternate date: 11/29\n\n\nSeminar Description: As employees look for purpose-driven career paths and leaders wrestle with integrating disruptive innovations into organizational processes, this senior seminar offers students the opportunity to learn about leadership and innovation in impact driven organizations. Students will learn the frameworks and methodologies that empower change in the world through case studies that feature how nonprofits interact with corporations, and how the two work together to strengthen the community. In addition, guest speakers from across Atlanta's civic community and nonprofit boards will share stories and offer insights on career paths in both the nonprofit and corporate sectors.\n\n\nInstructor: Nir Levy is Assistant Director for Leadership Engagement at American Jewish Committee in Atlanta. Levy facilitates Leaders for Tomorrow (LFT) in Atlanta, is responsible for the Regional Board, manages leadership development programs, and supports overall development efforts. A graduate of Emory University's Goizueta Business School with a B.A. in Business Administration, Levy co-founded Campus Bubble, a technology company for higher education initially licensed and funded by Emory University. Levy was born in Jerusalem, Israel, and currently resides in the historic Westview neighborhood in Atlanta with his wife and cats.",
    "course_description": "Senior seminar courses fall outside the scope of traditional academic coursework, and instead allow students to learn from and interact with experienced practitioners, and to develop industry-specific insights, fine-tune career skills, and increase professional exposure.",
    "prerequisites": "This section is reserved for students in the BBA program.",
    "instructors": "Andrea Hershatter - Primary Instructor",
    "schedule_location": "W 6pm-8pm in Goizueta Business School 301",
    "course_resources": null,
    "sections": "Class Nbr: 6664, Section #: 1118, Type: SEM, Campus: ATL, Meets: W 6-8p, Instructor: A. Hershatter, Status: Wait List",
    "date_accessed": "2024-03-30"
}