{
    "course_code": "BUS 480",
    "course_title": "Senior Seminar: Excel for Intermediate Users",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Wednesday, 5:30-8:00 pm - GBS 338\n*This course will be taught on four dates for 2.5 hours - \nClass Dates:  9/6, 9/13, 9/20, 9/27, alternate date: 10/11 (the alternate date is only used if the instructor or the school has an emergency that causes one of the scheduled dates to be canceled-it will not be held as a makeup date for a missed class)\n\n\nSeminar Description:  The seminar offers an engaging, hands-on format in which 90% of the class consists of students working in small groups, with frequent breaks to review the solution methodology.    \nWhile useful for consulting/finance jobs, it is also very relevant other career paths:\n- Large data set calculations (autofilters, sumifs countifs, vlookup vs. xlookup)\n- Pivot tables\n- Basic subscription models\n- Emphasis on writing re-usable formulas (input cells, anchoring/dollar-tying, trace precedents)  \n- Introduction to core keyboard shortcuts and alt-key techniques \nSkill level:\n- It is an intermediate class, not advanced\n- Students with work experience at an investment bank should not enroll\n- Recommended for students who have basic Excel experience and want to improve their skills. \n- The instructor reserves the right to remove students with more advanced expertise or experience.\n\n\nInstructor:  Sahil Patel is an entrepreneur and current CEO of Spiralyze, a marketing technology company.  Previously, he was the CEO/founder of ER Express, a healthcare software company that he ran for 11 years before selling it in 2021.  He has 23+ years of experience in operations, sales, software development and finance.  He also worked as a consultant for Booz & Company/PWc.  Sahil holds a BBA from Goizueta and an MBA from Harvard Business School.",
    "course_description": "Senior seminar courses fall outside the scope of traditional academic coursework, and instead allow students to learn from and interact with experienced practitioners, and to develop industry-specific insights, fine-tune career skills, and increase professional exposure.",
    "prerequisites": "This section is reserved for students in the BBA program.",
    "instructors": "Andrea Hershatter - Primary Instructor",
    "schedule_location": "W 5:30pm-8pm in Goizueta Business School 338",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 6663, Section #: 1117, Type: SEM, Campus: ATL, Meets: W 5:30-8p, Instructor: A. Hershatter, Status: Closed",
    "date_accessed": "2024-03-30"
}