{
    "course_code": "BUS 480",
    "course_title": "Senior Seminar: Franchising-Intro Global Bus.",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 3Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Thursdays 5:30-8:00pm and Fridays 9:30am-12:00pm (rooms vary), Class Dates: Thursday, 9/28 (GBS 338), Friday, 9/29 (GBS 331), Thursday, 10/19 (GBS 338), Friday, 10/20 (GBS 331)\n\n\nSeminar Description: Every week, each of us are \"touched\" by the Franchise industry when we buy a \"service\" or \"product\" that is doing business with a Franchise model. Generally, franchising is a business model that has grown globally and has been instrumental in sharing the cultural values of the USA around the world \" the food we eat, the clothes we wear, the entertainment we view and the sports we watch. Each of the aforemenFoned \" food, clothes, entertainment, and sports -are engaged in franchising. In this Senior Seminar, we will review the origins of franchising, the process of franchising, the legal aspects of franchising and the expansion of franchising that impacts every aspect of business. Further, this Seminar will welcome a few guests to the classroom that are currently engaged in franchising.\n\n\nInstructor: Kenneth Cutshaw has held leadership positions in the C-Suite to Law Firm Partner to Academic Dean to the Boardroom to US Government sub-Cabinet. Cutshaw has been an adjunct professor teaching business and law, including Franchise, at seven universities over four decades. He has served as CEO/ President/ Chief Legal Officer of companies in several industries [restaurants, hospitality, and legal services]. He was the Honorary Consul for India in the USA, and a founder of a post-Soviet private university in the Country of Georgia where he served as its Law School Dean. He was appointed with Executive internatonal roles in the Administraions of Presidents Ronald Reagan and George H. W. Bush. He is currently a partner of a law firm and serves on several Boards in hospitality, and with an internatonal NGO.  Cutshaw has enjoyed his many years of working in the Franchise sector as a General Counsel, a President, and an owner of Food and Beverage brands. He enjoys sharing his experience and the experience of colleagues in the classroom at Emory.",
    "course_description": "Senior seminar courses fall outside the scope of traditional academic coursework, and instead allow students to learn from and interact with experienced practitioners, and to develop industry-specific insights, fine-tune career skills, and increase professional exposure.",
    "prerequisites": "This section is reserved for students in the BBA program.",
    "instructors": "Andrea Hershatter - Primary Instructor",
    "schedule_location": "Th 5:30pm-8pm in Goizueta Business School 338\nF 9:30am-12pm in Goizueta Business School 331",
    "course_resources": null,
    "sections": "Class Nbr: 6670, Section #: 1124, Type: SEM, Campus: ATL, Meets: Th 5:30-8p; F 9:30a-12p, Instructor: A. Hershatter, Status: Open",
    "date_accessed": "2024-03-30"
}