{
    "course_code": "BUS 480",
    "course_title": "Senior Seminar: Side Hustles &Starving Artists",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Sunday, 3:00-6:15 pm, GBS 204, Class Dates:  10/22, 10/29, 11/5\n\n\nSeminar Description: Side Hustles and Starving Artists' The Business Case for your Creative Pursuits. You can make money from your creative pursuits, but you must look at your passion with an eye for business. Lessons from a local writer who has made two careers for herself. One is a traditional professional career. The other is her passion, writing. Learn how to create a strategic plan, build your brand, find opportunities, hone your craft. Gain insights into different publishing opportunities. Find out how a creative passion can have a positive impact on your traditional career.\n\n\nInstructor: Nicki Salcedo is an Atlanta native with a degree in English and Creative Writing from Stanford University. She is the author of \"All Beautiful Things\" and three books of essays. Her writing career has led her to opportunities on stage, podcasts, and the radio. She teaches creative writing across the country and is also freelance writer, movie reviewer, and journalist. Nicki is also the Vice President of Strategic Partners at DarioHealth a global digital health company. She has worked for 20 years in health strategy, solutions, and technology. Nicki lives in Atlanta with her family. You can find her on LinkedIn https://www.linkedin.com/in/nickisalcedo/.",
    "course_description": "Senior seminar courses fall outside the scope of traditional academic coursework, and instead allow students to learn from and interact with experienced practitioners, and to develop industry-specific insights, fine-tune career skills, and increase professional exposure.",
    "prerequisites": "This section is reserved for students in the BBA program.",
    "instructors": "Andrea Hershatter - Primary Instructor",
    "schedule_location": "Su 3pm-6:15pm in Goizueta Business School 204",
    "course_resources": null,
    "sections": "Class Nbr: 6673, Section #: 1127, Type: SEM, Campus: ATL, Meets: Su 3-6:15p, Instructor: A. Hershatter, Status: Wait List",
    "date_accessed": "2024-03-30"
}