{
    "course_code": "BUS 480",
    "course_title": "Senior Seminar: Understanding Energy Trans.",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Sunday, 3:00-6:15 pm, GBS 231, Class Dates:  10/1, 10/15, 10/29\n\n\nSeminar Description: To achieve deep decarbonization, we need to rethink how we produce and consume energy and operate a radical switch to renewables and low carbon energy sources. This seminar provides a high-level understanding of the economic, financial, and political challenges of the energy transition. Topics covered include the history of the electricity grid, current commercially viable technologies (wind, solar, nuclear, natural gas), upcoming advancements (nuclear fusion, long duration energy storage, green hydrogen), and the economic implications, financing mechanisms, and policy frameworks necessary for promoting clean energy investments in the U.S. and globally.\n\n\nInstructor: Nicolette M. Salazar is an experienced professional with a strong focus on energy markets. She works at McKinsey & Company as an EPNG senior C&I analyst and on rotation with the Energy Storage Insights solutions team, focusing on the development of insights and assets related to electrification and decarbonization through the use of energy storage systems across the United States, Europe, and globally. Since joining McKinsey in 2021, she has supported clients across electric power and natural gas, renewables, energy storage, and sustainability topics. Prior to this, she served as a Graduate Intern at the U.S. Trade and Development Agency, conducting research on global market trends and infrastructure projects in emerging countries. Nicolette holds a Master of Arts degree with concentrations in Energy, Resources, and Environment and International Economics from Johns Hopkins SAIS. She also has a Bachelor of Business Administration from Emory University's Goizueta Business School.",
    "course_description": "Senior seminar courses fall outside the scope of traditional academic coursework, and instead allow students to learn from and interact with experienced practitioners, and to develop industry-specific insights, fine-tune career skills, and increase professional exposure.",
    "prerequisites": "This section is reserved for students in the BBA program.",
    "instructors": "Andrea Hershatter - Primary Instructor",
    "schedule_location": "Su 3pm-6:15pm in Goizueta Business School 231",
    "course_resources": null,
    "sections": "Class Nbr: 6674, Section #: 1128, Type: SEM, Campus: ATL, Meets: Su 3-6:15p, Instructor: A. Hershatter, Status: Wait List",
    "date_accessed": "2024-03-30"
}