{
    "course_code": "BUS 480",
    "course_title": "Senior Seminar: A Look at AI in Business",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Mondays, 5:30-7:30 pm, GBS 304\nClass Dates: 11/6, 11/13, 11/20, 11/27, 12/4\n\n\nSeminar Description:  Interested how businesses are using AI, specifically computer vision to transform their operations? Join this seminar for insight on how companies in retail, quick service restaurants (QSRs), grocery stores and distribution are leveraging computer vision to transform their operations, security and the customer experience. We'll start with the fundamentals: understanding what computer vision really means, exploring the different kinds of AI and how they differ from other technologies like BI, algorithms and analytics. From there, we'll describe the evolving landscape of computer vision use cases across multiple market segments and how AI is being used to uncover meaningful information that triggers automated action.\n\n\nInstructor: Beth Bergmann has applicable experience deploying AI- Computer vision for top Retailers and QSR's across North America. She also has strong connections to multiple Computer Vision Technology Providers to deep dive into use cases as well as the end client - bringing it together with the NVIDA, Lenovo and Dell ecosystem. She has also hosted multiple AI leaders on her company's podcast (https://www.telaid.com/podcast/).",
    "course_description": "Senior seminar courses fall outside the scope of traditional academic coursework, and instead allow students to learn from and interact with experienced practitioners, and to develop industry-specific insights, fine-tune career skills, and increase professional exposure.",
    "prerequisites": "This section is reserved for students in the BBA program.",
    "instructors": "Andrea Hershatter - Primary Instructor",
    "schedule_location": "M 5:30pm-7:30pm in Goizueta Business School 304",
    "course_resources": null,
    "sections": "Class Nbr: 6675, Section #: 1129, Type: SEM, Campus: ATL, Meets: M 5:30-7:30p, Instructor: A. Hershatter, Status: Wait List",
    "date_accessed": "2024-03-30"
}