{
    "course_code": "IDS 290R",
    "course_title": "Interdisciplinary Sidecar: Dreams:Theories Interpretation",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Title: Dreams: Theories of Interpretation and Reflection\n(Class begins Friday, September 8th)\nDo you often find yourself pondering the vivid stories and images that play\nout in your dreams? Are you fascinated by the mystery of the mind and\ncurious about possible ways to understand your dreams? In this course on\ndreams and theories of dream interpretation we will consider a range of\ninterdisciplinary perspectives. In addition, students will learn tools and\nstrategies for dream analysis and engage in dream discussions. The aim of\nthe course is to develop a more nuanced understanding of the nature of\ndreams and helpful ways to approach them. Requirements include light\nreading and weekly journaling. Prospective students should remember their\ndreams at least once a week and be willing to share and listen to dreams in\nclass.",
    "course_description": "A side-car course brings together a subset of students from two courses that overlap in methodologies, topics, etc., to create a short interdisciplinary course that runs simultaneously with its two sponsoring courses. One credit, S/U only. Schedule and format arranged by sponsoring professors.",
    "prerequisites": null,
    "instructors": "Cynthia Blakeley - Primary Instructor",
    "schedule_location": "F 1pm-2:30pm in Tarbutton Hall 105",
    "course_resources": null,
    "sections": "Class Nbr: 6095, Section #: 2, Type: SEM, Campus: ATL, Meets: F 1-2:30p, Instructor: Team, Status: Open",
    "date_accessed": "2024-03-30"
}