{
    "course_code": "IDS 200W",
    "course_title": "Interdisciplinary Foundations",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities and Arts with Cont.Communication(*)",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "IDS 200W examines the origins of distinct disciplines in contemporary universities through the lens of evidence in different fields of human knowledge. Recommended for students at any level interested in health sciences, law, business, or future studies at the graduate level. IDS 200W introduces students to the Liberal Arts and supports student's studies in a wide range of majors. Systematic focus on writing essential in any career. What counts as evidence in different fields of human knowledge? Do we have evidence of things unseen, e.g. gods, tradition, love, existence after death, meaning? In the ancient tragedy \"Antigone\", for example, a young woman defies the law for love of her brother. But could the young woman's love, her thinking, speech patterns, and motivations be due to genetic dispositions, neural mechanisms, religious extremism, or mental disorder? Such questions highlight the problematic nature of evidence and explanation that we will examine. Short writing assignments; posts to Discussion Board; attendance at four outside lectures of your choice; 1200-word midterm essay; final 5000-word research paper; participation in class discussion.",
    "course_description": "IDS 200 examines the origins and development of distinct disciplines in contemporary universities through the lens of what counts as evidence in different fields of human knowledge.",
    "prerequisites": null,
    "instructors": "Peter W Wakefield - Primary Instructor",
    "schedule_location": "MW 8:30am-9:45am in Callaway Center S420",
    "course_resources": null,
    "sections": "Class Nbr: 2800, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 8:30-9:45a, Instructor: P. Wakefield, Status: Wait List",
    "date_accessed": "2024-03-30"
}