{
    "course_code": "IDS 190",
    "course_title": "Fresh Sem: IDS: Reading Walls",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First Year Seminar",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Freshmen Seminar - Limited to First-Year Students Only) What moves people to write and paint on city walls? How does the presence of art in public space, from small graffiti tags to visceral political slogans and commissioned murals, transform the urban everyday? And what can we learn about a place by \"reading\" and analyzing its walls? These are the central questions that animate this interdisciplinary seminar on the cultural practice of street art and graffiti. Through scholarly readings and visual texts such as documentaries and photo archives we will examine historical lineages, social context, aesthetic techniques, and transformative potential of these art forms towards building broad skills in visual and cultural analysis. We will trace the significance of graffiti and street art as tools of expression and intervention for marginalized communities, the interplay between criminalization and institutionalization, movements for preservation and archiving, and their role in urban and social change. Our immediate context of Atlanta will serve as a central case study for these explorations. The city's rich history and contemporary presence of street art and graffiti will be brought into the curriculum through guest lectures by local artists and researchers and field trips to sites like the Krog Street Tunnel.",
    "course_description": "Variable topics using interdisciplinary approaches from the humanities and social sciences. Topics represent current interests of the instructor.",
    "prerequisites": null,
    "instructors": "Julia Tulke - Primary Instructor",
    "schedule_location": "MW 4pm-5:15pm in Callaway Center S420",
    "course_resources": null,
    "sections": "Class Nbr: 6582, Section #: 2, Type: SEM, Campus: ATL, Meets: MW 4-5:15p, Instructor: J. Tulke, Status: Wait List",
    "date_accessed": "2024-03-30"
}