{
    "course_code": "IDS 385",
    "course_title": "Special Topics: Reflections on Neurodiversity",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 3Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Through this course, we will seek to define the concept of \"neurodiversity\". What characteristics must one possess in order to be within this group? Who gets to call themselves \"neurodivergent\"? Is there a \"group\"? What does it mean to be within this group or to be a neurodivergent individual? What are the bounds of being \"neurodivergent\" and what are some key personal, social, and societal implications? We will explore this concept primarily through the lens of psychology with perspectives on individual and social development and societal functioning. In addition, perspectives on neurodiversity reflected in disability studies, the arts, career development, culture, biology, ethics (and other disciplines) will be included. We will examine how autism and other diagnosed and undiagnosed conditions can exemplify this concept. Mission of the Course: To engage students in readings, thought exercises, discussions, and experiences as an overview of neurodiversity as a meaningful socio-cultural and scholarly concept, and with insight into specific aspects of the lived experience of individuals who experience obstacles or exclusion because of their perceived mental, psychological, and behavioral differences.",
    "course_description": "Highly focused courses, drawing on multiple disciplines of the humanities and social sciences; may be repeated for credit when topics vary.",
    "prerequisites": null,
    "instructors": "Kelsey Bohlke - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in Rich Building 211",
    "course_resources": null,
    "sections": "Class Nbr: 5332, Section #: 3, Type: LEC, Campus: ATL, Meets: TTh 1-2:15p, Instructor: Segall/Bohlke, Status: Open",
    "date_accessed": "2024-03-30"
}