{
    "course_code": "IDS 290R",
    "course_title": "Interdisciplinary Sidecar: American Women and Zionism",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 4",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Title: American Women and Zionism\nThis course is an intersection point between Kate Rosenblatt's course on Jewish Women in the Modern World (Religion) and Geoff Levin's course on US-Israel Relations (MESAS). Our sidecar course will use the lens of gender to explore how American women of all\nbackgrounds engaged with the long history of Zionist organizing in\nsupport of a Jewish homeland. Some of the topics we'd like to include are:\nthe role of Hadassah: The Women's Zionist Organization of America, Arab\nAmerican women's activism, intra-Jewish debates around anti- and non-\nZionism, evangelical Christian women's support for Israel, and Zionist\ndiscourses of antisemitism. Given the high-pitched tenor of conversation\naround Zionism on American college campuses, we hope that our sidecar\ncourse will provide space for productive and intellectually engaging\nconversations. It will also fit into the Tam Institute for Jewish Studies\nthematic framing for the academic year on Gender and Reproduction.\"",
    "course_description": "A side-car course brings together a subset of students from two courses that overlap in methodologies, topics, etc., to create a short interdisciplinary course that runs simultaneously with its two sponsoring courses. One credit, S/U only. Schedule and format arranged by sponsoring professors.",
    "prerequisites": null,
    "instructors": "Geoffrey Levin - Primary Instructor",
    "schedule_location": "W 4pm-4:50pm in Woodruff Library 214",
    "course_resources": null,
    "sections": "Class Nbr: 6092, Section #: 4, Type: SEM, Campus: ATL, Meets: W 4-4:50p, Instructor: Team, Status: Open",
    "date_accessed": "2024-03-30"
}