{
    "course_code": "ENGRD 190",
    "course_title": "FSEM: Rhetoric and Discourse",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 6",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First Year Seminar",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Freshmen Only)\n\n\nSeeing Art: Visual and Verbal Rhetoric in Ekphrasis - The arts are subjective, right? Paintings and sculptures and photographs and poems aim to move, not to convince. But what is the responsibility of an artist, or any human, to the data set from which they draw their inspiration? Given that art is artifice, is any rhetorical move made by an artist its own justification? In Seeing Art we will hope to turn a dark classroom into a space where we may illuminate the value, if any, of art that is demonstrably wrong (untrue, exaggerated, more like a door than a window) about other works of art.  \nParticipants in Seeing Art will observe, infer, juxtapose, compare, contrast, translate, and adduce counterfactuals with regard to a series of test cases, each on a painting, or a photograph, or a sculpture, paired with a poem composed specifically to address it. They will write frequently and receive copious feedback. They will think hard about the relationships between truth and rhetorical form. And they will actively say what they see, especially if they have no prior special training in looking at art or in reading poems.",
    "course_description": "First-Years only. Variable topics course introducing students the study of rhetoric and public discourse through various topical approaches.",
    "prerequisites": null,
    "instructors": "Daniel Bosch - Primary Instructor",
    "schedule_location": "MW 8:30am-9:45am in Callaway Center S104",
    "course_resources": null,
    "sections": "Class Nbr: 3518, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 8:30-9:45a, Instructor: D. Bosch, Status: Open",
    "date_accessed": "2024-03-30"
}