{
    "course_code": "ENGRD 316W",
    "course_title": "Rhetorics of Resistance",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Continuing Communication(*)",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "History is rife with warnings, prohibitions, and laws that have prevented various groups of people from full access to the practices of reading and writing. Consider this, why were African slaves forbidden to learn to read and write in the United States? Why did Victorian doctors link women's independent reading to physical maladies like insanity and infertility? This class investigates literacy practices as rhetorical endeavors of resistance to power structures that attempted to control and deprive certain populations from the pleasure and agency of meaning-making. Through informal, formal, and multimodal assignments, students will develop a strong foundational knowledge of rhetorical theory through a thematic study of the literacy practices of figures like Frederick Douglass, Malcolm X, Paulo Freire, Malala Yousafzai, Mary Daly, and others.",
    "course_description": "History is rife with warnings, prohibitions, and laws that have prevented various groups of people from full access to the practices of reading and writing. This class investigates literacy practices as rhetorical endeavors of resistance to power structures.",
    "prerequisites": null,
    "instructors": "Kathleen Leuschen - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in New Psyc Bldg 493 (36 Eagle Ro",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3766, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 10-11:15a, Instructor: K. Leuschen, Status: Closed",
    "date_accessed": "2024-03-30"
}