{
    "course_code": "BUS 480",
    "course_title": "Senior Seminar: Wall Street & Investing",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 50 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "This class meets on Mondays from 5:30-7:30pm on the following dates: 9/13, 9/27, 10/18, 11/1, 11/8, alternate dates: 11/15, 11/29.  Please note that alternate dates are only used if the instructor or the school has an emergency that causes one of the scheduled dates to be canceled (they will not be held as makeup dates for a missed class).  When signing up for a course, please remember to keep alternate dates free also.\n\n\nThe delivery format listed for this class is based on current university guidelines. However, if there are further changes to the COVID19 guidelines for Fall 2021 or other acts beyond our control, the school reserves the right the modify the delivery method for this class.\n\n\nThis seminar will focus on understanding personal and professional investment strategies, especially as they relate to the current economic and political environment.    Practical topics will include (but are not limited to) worldwide current events, investing, job direction in the financial services sector, and any other applicable events that may occur during the term.  Please note, there will be added emphasis on stock market psychology and how to make tough decisions regarding investments.",
    "course_description": "Senior seminar courses fall outside the scope of traditional academic coursework, and instead allow students to learn from and interact with experienced practitioners, and to develop industry-specific insights, fine-tune career skills, and increase professional exposure.",
    "prerequisites": "This section is reserved for students in the BBA program.",
    "instructors": "Andrea Hershatter - Primary Instructor",
    "schedule_location": "M 5:30pm-7:30pm in Goizueta Business School 304",
    "course_resources": null,
    "sections": "Class Nbr: 2669, Section #: 1101, Type: SEM, Campus: ATL, Meets: M 5:30-7:30p, Instructor: A. Hershatter, Status: Open",
    "date_accessed": "2024-03-30"
}