{
    "course_code": "BUS 480",
    "course_title": "Senior Seminar: Adv Financial Modeling/Excel",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 50 / Seats Avail: 29Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "Class meets on Tuesdays from 5:30-7:30pm on the following dates: 9/14, 9/21, 9/28, 10/5, 10/19, alternate dates: 10/26, 11/2. Alternate dates are only used if the instructor or the school has an emergency that causes one of the scheduled dates to be canceled (they will not be held as makeup dates for a missed class).  When signing up for a course, please remember to keep alternate dates free also.\n\n\nThe delivery format listed for this class is based on current university guidelines. However, if there are further changes to the COVID19 guidelines for Fall 2021 or other acts beyond our control, the school reserves the right the modify the delivery method for this class.\n\n\nFinancial modeling and analysis are key skills for professionals seeking to advance in all areas besides just financial management. This advanced seminar is specifically for those seeking to be able to create practical models for forecasting, valuation, and analyses in investment banking, consulting, private equity, venture capital, equity research, or financial management. Participants must bring a laptop with Excel (any version) to simultaneously create a \"shadow-model\" along with the instructor and turn in at the end of each session for review.",
    "course_description": "Senior seminar courses fall outside the scope of traditional academic coursework, and instead allow students to learn from and interact with experienced practitioners, and to develop industry-specific insights, fine-tune career skills, and increase professional exposure.",
    "prerequisites": "This section is reserved for students in the BBA program.",
    "instructors": "Steven Ahn - Primary Instructor",
    "schedule_location": "T 5:30pm-7:30pm in Goizueta Business School 301",
    "course_resources": null,
    "sections": "Class Nbr: 2671, Section #: 1103, Type: SEM, Campus: ATL, Meets: T 5:30-7:30p, Instructor: S. Ahn, Status: Open",
    "date_accessed": "2024-03-30"
}