{
    "course_code": "BUS 480",
    "course_title": "Senior Seminar: For The Culture",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 40 / Seats Avail: 19",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "This class meets on Tuesdays from 5:30-7:30pm on the following dates: 9/14, 9/21, 9/28, 10/5, 10/19, alternate dates: 10/26, 11/2. Alternate dates are only used if the instructor or the school has an emergency that causes one of the scheduled dates to be canceled (they will not be held as makeup dates for a missed class).  When signing up for a course, please remember to keep alternate dates free also.\n\n\nThe delivery format listed for this class is based on current university guidelines. However, if there are further changes to the COVID19 guidelines for Fall 2021 or other acts beyond our control, the school reserves the right the modify the delivery method for this class.\n\n\n\"Do it for the Culture\" is usually a statement requesting that an individual carry out a specific action for benefit of their shared culture. This seminar will encourage a deep dive into the ways that business, social justice, and culture intersect to spur progress and influence change. 'For the Culture: The Business of Social Justice' will encourage students to explore ways to uplift and build on our collective culture to galvanize social impact using the principles of business, critical consciousness development, and organizational psychology.",
    "course_description": "Senior seminar courses fall outside the scope of traditional academic coursework, and instead allow students to learn from and interact with experienced practitioners, and to develop industry-specific insights, fine-tune career skills, and increase professional exposure.",
    "prerequisites": "This section is reserved for students in the BBA program.",
    "instructors": "Andrea Hershatter - Primary Instructor",
    "schedule_location": "T 5:30pm-7:30pm in Goizueta Business School 304",
    "course_resources": null,
    "sections": "Class Nbr: 2672, Section #: 1104, Type: SEM, Campus: ATL, Meets: T 5:30-7:30p, Instructor: A. Hershatter, Status: Open",
    "date_accessed": "2024-03-30"
}