{
    "course_code": "BUS 480",
    "course_title": "Senior Seminar: Going Global/Practical Guide",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 75 / Seats Avail: 45",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "This class meets virtually through Canvas.\n\n\nThe delivery format listed for this class is based on current university guidelines. However, if there are further changes to the COVID19 guidelines for Fall 2021 or other acts beyond our control, the school reserves the right the modify the delivery method for this class.\n\n\nGoing Global is for study abroad students, F-1 international students, students who one day hope to live or work abroad, and exchange students spending a semester here at Goizueta. This class will help you to translate your international experiences into concrete skills that you can talk about during your job or internship search. It will also teach you about how other cultures do business. As a bonus, you earn senior seminar credit without having to physically attend class. Going Global is an online, reflection-based class. Thought- provoking, personalized assignments will be posted online. You will be an official author on the class discussion board on Canvas (don't worry, we'll teach you how). You will post assignments online as well as read and comment on other class members' work.",
    "course_description": "Senior seminar courses fall outside the scope of traditional academic coursework, and instead allow students to learn from and interact with experienced practitioners, and to develop industry-specific insights, fine-tune career skills, and increase professional exposure.",
    "prerequisites": "This section is reserved for students in the BBA program.",
    "instructors": "Jeremy Billetdeaux - Primary Instructor",
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 2677, Section #: 1110, Type: SEM, Campus: ATL, Meets: Meets Online, Instructor: J. Billetdeaux, Status: Open",
    "date_accessed": "2024-03-30"
}