{
    "course_code": "BUS 480",
    "course_title": "Senior Seminar: Excel for Beginners",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 36 / Seats Avail: 4Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-09-22 through 2021-10-19",
    "class_notes": "Class meets Wednesdays from 5:30-8:00pm on the following dates: 9/22, 9/29, 10/6, 10/13, alternate date: 10/20.  Alternate dates are only used if the instructor or the school has an emergency that causes one of the scheduled dates to be canceled (they will not be held as makeup dates for a missed class).  When signing up for a course, please remember to keep alternate dates free also.\n\n\nThis seminar will teach you the fundamentals of using Excel to solve problems in business settings.  It is intended for novices only and is not for students with previous finance modeling experience.  The seminar offers an engaging, hands-on format in which 90% of the class consists of students working in small groups, with frequent breaks to review the solution methodology.    The course will cover basic data manipulation and formulas, simple keyboard shortcuts to make you faster, introduction to pivot tables, vlookup, and index(match), and simple forecasting techniques.  \n     This course is recommended for students who want a basic grounding and do not yet have Excel experience.  Students may take this seminar either as a standalone or as a precursor to the Intermediate seminar that the same instructor will offer subsequently in the semester.  The instructor reserves the right to remove students with banking or other modeling experience or expertise.\n\n\nThe delivery format listed for this class is based on current university guidelines. However, if there are further changes to the COVID19 guidelines for Fall 2021 or other acts beyond our control, the school reserves the right the modify the delivery method for this class.",
    "course_description": "Senior seminar courses fall outside the scope of traditional academic coursework, and instead allow students to learn from and interact with experienced practitioners, and to develop industry-specific insights, fine-tune career skills, and increase professional exposure.",
    "prerequisites": null,
    "instructors": "Tina Giannakopoulos - Primary Instructor",
    "schedule_location": "W 5:30pm-8pm in Goizueta Business School 338",
    "course_resources": null,
    "sections": "Class Nbr: 6322, Section #: 1117, Type: SEM, Campus: ATL, Meets: W 5:30-8p, Instructor: Hershatter/Giannakopoulos, Status: Open",
    "date_accessed": "2024-03-30"
}