{
    "course_code": "BUS 480",
    "course_title": "Senior Seminar: Current Events & Business Impact",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 50 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "Class meets Tuesdays, from 5:30-7:30 pm on the following dates: 9/14, 9/28, 10/19, 10/26, 11/2, alternate date: 11/16. Alternate dates are only used if the instructor or the school has an emergency that causes one of the scheduled dates to be canceled (they will not be held as makeup dates for a missed class).  When signing up for a course, please remember to keep alternate dates free also.\n\n\nKeeping up with current events and putting them in a business, social and historical context is crucial in understanding changes in the business world.  By openly discussing current events, we can better understand how these events affect today's business environment and us.  Students who take this class will be able to apply their knowledge, not only in a classroom setting, but also in interviews and other interactions with professionals.  The class will be run as an applied book club, centering on discussions from articles in a variety of publications, including The New York Times, The Wall Street Journal, The Financial Times, The Economist and many others.  Each week's readings will cover a wide range of topics, covering politics, business, technology and even pop culture.  Students will be encouraged to make suggestions regarding topics or specific articles they wish to discuss.",
    "course_description": "Senior seminar courses fall outside the scope of traditional academic coursework, and instead allow students to learn from and interact with experienced practitioners, and to develop industry-specific insights, fine-tune career skills, and increase professional exposure.",
    "prerequisites": "This section is reserved for students in the BBA program.",
    "instructors": "Andrea Hershatter - Primary Instructor",
    "schedule_location": "T 5:30pm-7:30pm in Goizueta Business School 331",
    "course_resources": null,
    "sections": "Class Nbr: 6086, Section #: 1112, Type: SEM, Campus: ATL, Meets: T 5:30-7:30p, Instructor: A. Hershatter, Status: Open",
    "date_accessed": "2024-03-30"
}