{
    "course_code": "BUS 480",
    "course_title": "Senior Seminar: Excel for Intermediate Users",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 36 / Seats Avail: 9Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-09-22 through 2021-10-19",
    "class_notes": "Class meets on Wednesdays from 5:30-8:00pm on the following dates: 10/27, 11/3, 11/10, 11/17, alternate date: 12/1.  Alternate dates are only used if the instructor or the school has an emergency that causes one of the scheduled dates to be canceled (they will not be held as makeup dates for a missed class).  When signing up for a course, please remember to keep alternate dates free also.\n\n\nThis seminar covers what is typically learned in the first three months on the job about mastering the building blocks of using Excel to solve business problems. It is an intermediate class, not an advanced one, and students with work experience at an investment bank should not enroll.  The seminar offers an engaging, hands-on format in which 90% of the class consists of students working in small groups, with frequent breaks to review the solution methodology.    The course will cover nuanced data manipulation, pivot table creation, keyboard shortcuts and alt-key techniques for formatting cells, calculation checking techniques such as formula auditing, more advanced formulas for conditional calculations, index(match), vlookup and error checking and developing basic models from scratch. \n     This seminar is recommended for students who have basic Excel experience, and want to improve their comfort.  It is particularly useful for those who will be pursuing a consulting, data analytics, or finance internship.  Students may take this seminar either as a standalone or as a follow-on to the Beginner seminar that the same instructor will offer earlier in the semester.  The instructor reserves the right to remove students with more advanced expertise or experience.\n\n\nThe delivery format listed for this class is based on current university guidelines. However, if there are further changes to the COVID19 guidelines for Fall 2021 or other acts beyond our control, the school reserves the right the modify the delivery method for this class",
    "course_description": "Senior seminar courses fall outside the scope of traditional academic coursework, and instead allow students to learn from and interact with experienced practitioners, and to develop industry-specific insights, fine-tune career skills, and increase professional exposure.",
    "prerequisites": null,
    "instructors": "Tina Giannakopoulos - Primary Instructor",
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 6324, Section #: 1118, Type: SEM, Campus: ATL, Meets: Does Not Meet, Instructor: Hershatter/Giannakopoulos, Status: Open",
    "date_accessed": "2024-03-30"
}