{
    "course_code": "BUS 480",
    "course_title": "Senior Seminar: Business Etiquette",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 45 / Seats Avail: 23Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-09-22 through 2021-10-19",
    "class_notes": "Class meets Wednesdays from 5:30-7:30pm on the following dates: 9/22, 9/29, 10/6, 10/20, 11/10, alternate date: 11/17. Alternate dates are only used if the instructor or the school has an emergency that causes one of the scheduled dates to be canceled (they will not be held as makeup dates for a missed class).  When signing up for a course, please remember to keep alternate dates free also.\n\n\nThis seminar is designed to prepare students to enter the business world attuned to the nuances of appropriate behavior and attire in business and social settings, across a variety of global cultural norms.  Particular attention is paid to acquiring knowledge of social protocol during the networking, job search, and interviewing stages.  The class is practical in scope, utilizing examples of real-world problems that BBA graduates are likely to face.  A DEI expert will also share the importance of allyship in supporting a diverse and inclusive workplace.  And, the seminar will include instruction on wedding etiquette.",
    "course_description": "Senior seminar courses fall outside the scope of traditional academic coursework, and instead allow students to learn from and interact with experienced practitioners, and to develop industry-specific insights, fine-tune career skills, and increase professional exposure.",
    "prerequisites": null,
    "instructors": "Andrea Hershatter - Primary Instructor",
    "schedule_location": "W 5:30pm-7:30pm in Goizueta Business School 301",
    "course_resources": null,
    "sections": "Class Nbr: 6320, Section #: 1115, Type: SEM, Campus: ATL, Meets: W 5:30-7:30p, Instructor: A. Hershatter, Status: Open",
    "date_accessed": "2024-03-30"
}