{
    "course_code": "MKT 548",
    "course_title": "Sales & Business Development",
    "credit_hours": "3",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "The delivery format listed for this class is based on current university guidelines.  However, if there are further changes to the COVID19 guidelines for Fall 2021 or other acts beyond our control, the school reserves the right the modify the delivery method for this class.",
    "course_description": "This course is designed for both specialists and generalists; namely, those who are pursuing a career in sales and business development, as well as those who will use sales skills in their careers. The course exposes students to the contemporary challenges faced in the selling process. The settings of the cases and exercises used in the course are quite diverse in terms of the sizes of the organizations involved and the types of markets that they serve. Therefore, the course is relevant to students whose interests are in general management, consulting, finance, and entrepreneurship as well as those who expect to work directly in sales and business development. The course centers on three themes:\n Personal selling\n Sales management\n Selling into the channel of distribution \nThe objective of this course is to develop and enhance the skill set that students will need to pursue careers that involve selling and business development. By the end of this course, you will have acquired the skills that will allow you to enhance your firms' revenue, either personally or through a sales force.",
    "prerequisites": "Varies by section",
    "instructors": "Robert Kelly - Primary Instructor",
    "schedule_location": "Th 6:30pm-9:30pm in Goizueta Business School 231",
    "course_resources": null,
    "sections": "Class Nbr: 2744, Section #: 2166, Type: LEC, Campus: ATL, Meets: Th 6:30-9:30p, Instructor: R. Kelly, Status: Open\nClass Nbr: 2745, Section #: 3266, Type: LEC, Campus: ATL, Meets: Th 6:30-9:30p, Instructor: R. Kelly, Status: Open",
    "date_accessed": "2024-03-30"
}