{
    "course_code": "QTM_OX 100",
    "course_title": "Introduction to Statistical Inference with Laboratory",
    "credit_hours": "4",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Varies by section",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Mathematics and Quantitative Reasoning",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "Varies by section",
    "course_description": "QTM100 provides an introduction to descriptive and inferential statistics. It is designed as a gateway course, with emphasis on practice and implementation. The course introduces probability, sampling distributions, interval estimation, hypothesis testing, ANOVA, regression, and nonparametric tests. The class consists of lectures and a weekly lab session. The lectures introduce statistical concepts and theory, and the lab session applies those lessons using the statistical software R.The following departments require QTM100 as a part of their major coursework: neuroscience and behavioral biology, psychology, anthropology, educational studies, human health, and sociology.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": "Varies by section",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 4662, Section #: 10, Type: LAB, Campus: OXF, Meets: Does Not Meet, Instructor: J. Hardy, Status: Wait List\nClass Nbr: 4577, Section #: 11, Type: LAB, Campus: OXF, Meets: Does Not Meet, Instructor: J. Hardy, Status: Open\nClass Nbr: This section is full 4580, Section #: 12, Type: LAB, Campus: OXF, Meets: Does Not Meet, Instructor: S. Riner, Status: Wait List\nClass Nbr: 4364, Section #: 14, Type: LAB, Campus: OXF, Meets: Does Not Meet, Instructor: S. Riner, Status: Open\nClass Nbr: This section is full 4366, Section #: 15, Type: LAB, Campus: OXF, Meets: Does Not Meet, Instructor: S. Riner, Status: Wait List\nClass Nbr: This section is full 6088, Section #: 16, Type: LEC, Campus: OXF, Meets: TTh 8:30-9:45a, Instructor: T. Chih, Status: Wait List\nClass Nbr: This section is full 6089, Section #: 17, Type: LAB, Campus: OXF, Meets: Does Not Meet, Instructor: T. Chih, Status: Wait List\nClass Nbr: This section is full 6090, Section #: 18, Type: LEC, Campus: OXF, Meets: TTh 10-11:15a, Instructor: T. Chih, Status: Wait List\nClass Nbr: This section is full 6091, Section #: 19, Type: LAB, Campus: OXF, Meets: Does Not Meet, Instructor: T. Chih, Status: Wait List\nClass Nbr: 4368, Section #: 2, Type: LEC, Campus: OXF, Meets: TTh 8:30-9:45a, Instructor: T. Dixon, Status: Open\nClass Nbr: This section is full 4371, Section #: 3, Type: LEC, Campus: OXF, Meets: TTh 1-2:15p, Instructor: J. Hardy, Status: Wait List\nClass Nbr: 4374, Section #: 4, Type: LEC, Campus: OXF, Meets: TTh 10-11:15a, Instructor: J. Hardy, Status: Open\nClass Nbr: This section is full 4378, Section #: 5, Type: LEC, Campus: OXF, Meets: MW 4-5:15p, Instructor: S. Riner, Status: Wait List\nClass Nbr: 4381, Section #: 6, Type: LEC, Campus: OXF, Meets: MW 2:30-3:45p, Instructor: S. Riner, Status: Open\nClass Nbr: This section is full 4583, Section #: 7, Type: LEC, Campus: OXF, Meets: MW 11:30a-12:45p, Instructor: S. Riner, Status: Wait List\nClass Nbr: 4586, Section #: 9, Type: LAB, Campus: OXF, Meets: Does Not Meet, Instructor: T. Dixon, Status: Open",
    "date_accessed": "2024-03-30"
}