{
    "course_code": "ELSP 521",
    "course_title": "Laboratory in Graduate and Professional Writing",
    "credit_hours": "2",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 2",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "Blended/Hybrid",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2023-05-12 through 2023-08-02",
    "class_notes": "-Focus: Making progress on a particular text\n-Target audience: Multilinguals/users of English as an additional language\n-Day/time, twice per week; mix of online and in-person; details to be determined by course participants\n***ELSP 521 is designed to support participants who need to make significant progress on a particular graduate or professional, such as a research article for publication, a second- or third-year paper, a research proposal, or any other text focused on research broadly defined.  Participants will design a writing plan, work on crafting strong arguments/claims, practice writing clearly and cohesively, and revise and edit their texts accordingly. As needed, they will also collect and analyze exemplars of their text type with respect to common rhetorical moves and language. Participants will be asked to submit a short description of the target text prior to enrollment to ensure its appropriateness.",
    "course_description": "ELSP 521 an intensive analysis of the principles and revision practices of research article writing. Tools such as rhetorical, genre, and corpus analysis may be used to analyze published literature in their own field and then apply conclusions to an original piece of writing. Course content focuses on the central role of rhetorical organization, development of identifying an argument, a research gap, construction of logical arguments, data interpretation, as well other important concepts including reader-oriented writing, style, and tone.",
    "prerequisites": null,
    "instructors": "Grace Song - Primary Instructor",
    "schedule_location": "WF 11am-12:40pm in North Decatur Bldg 101E",
    "course_resources": null,
    "sections": "Class Nbr: 2511, Section #: 1, Type: LEC, Campus: ATL, Meets: WF 11a-12:40p, Instructor: G. Song, Status: Open",
    "date_accessed": "2024-03-30"
}