{
    "course_code": "ELSP 516",
    "course_title": "Communication Skills for Intermediate Speakers III",
    "credit_hours": "2",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 5",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "Blended/Hybrid",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2023-05-12 through 2023-08-02",
    "class_notes": "-Focus: presenting your research\n-Target audience: multilingual students/students who use English as an additional language\n-Proficiency level: multi-level\n-Time/day: twice a week, mix of in-person and online; details to be determined by course participants\n***Whether in seminars, journal clubs, group meetings, or conferences, you know that presenting your research is critical to your academic and professional success. In this course, you will learn strategies to explain your ideas clearly and confidently in a variety of formats including poster presentations, conference presentations, and a newly emerged format called the video abstract.",
    "course_description": "Designed to improve the communication skills of intermediate (OPI level 2) students. Intermediate speakers can handle many of the speaking exchanges of routine life and work; however, they typically require a sympathetic listener accustomed to ESL speakers. Intermediate speakers may have difficulty sequencing and/or linking ideas into paragraph-length discourse, maintaining appropriate past, present, and future time frames, sustaining fluency, and/or being readily comprehensible. Students will focus on:",
    "prerequisites": null,
    "instructors": "Peggy Wagner - Primary Instructor",
    "schedule_location": "WF 10am-11:40am in North Decatur Bldg 101D",
    "course_resources": null,
    "sections": "Class Nbr: 2510, Section #: 2, Type: LEC, Campus: ATL, Meets: WF 10-11:40a, Instructor: P. Wagner, Status: Open",
    "date_accessed": "2024-03-30"
}