{
    "course_code": "JS 230",
    "course_title": "Yiddish Culture",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "Title: The Changing Jewish Family in Yiddish Culture. Course meets synchronously on Tues. 1-2:15 p.m. Every time he marries off one of his girls, the iconic Jewish patriarch Tevye the Dairyman manages to lose a daughter rather than to gain a son. The unusual thing about this set of stories by Sholem Aleichem (the prototype for Fiddler on the Roof) is that it is told from the parent's point of view. Just as battles are usually recounted by the victors, so too is the battle between generations usually recounted by the children. This seminar will explore the process of rapid and radical generational change that marked the passage of Yiddish-speaking Jewry from the nineteenth century to the long twentieth. We will analyze family dynamics as represented in Jewish cultural production: the fraught and illuminating relations between mothers and sons, fathers and daughters, siblings, grandparents and grandchildren, and families 'blended' in complex new ways. We will reflect on increasingly unstable categories including class and gender that affect the family's shifting self-understanding. Encompassing fiction, film, television and memoir, the course will consider continuity and rupture in Jewish culture in both the Old World and the New. No prerequisites.",
    "course_description": "A broad introduction to the history, literature, and film of Ashkenazi Jewish culture in Europe and America. All texts in English translation.",
    "prerequisites": null,
    "instructors": "Miriam Udel - Primary Instructor",
    "schedule_location": "T 1pm-2:15pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3802, Section #: 1, Type: SEM, Campus: ATL, Meets: T 1-2:15p, Instructor: M. Udel, Status: Closed",
    "date_accessed": "2024-03-30"
}