{
    "course_code": "JS 273",
    "course_title": "Topics in Jewish Rel & Culture: Jewish Imm & American Pop Cult",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 3",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as REL 270 5)\n(This course will meet synchronously on Thursdays from 11:20 a.m.-12:35 p.m., with the rest of the coursework asynchronous materials)\n(Topic Title: Jewish Immigrants & American Popular Culture: Song, Stage, and Screen)\n(Course description: This course examines the relationship between American popular culture and Jewish immigrants from Eastern Europe (1880-1940s). It covers the rise of mass culture in the United States in the late nineteenth century through the post-immigrant era. Students will read novels, plays, and comics, listen to songs, and watch films, receiving a well-rounded grasp of how America shaped Jewish immigrants and how Jewish immigrants shaped America. The course will touch on themes of urbanization, migration, religious change, antisemitism, economic mobility, modern romance, print culture, and much more. The asynchronous elements of the course include short lectures, readings, and engagement with primary sources. The synchronous elements of the course include discussion and live analysis of primary sources)",
    "course_description": "Special Topics in Jewish Religion and Culture: Variety of subjects emphasizing Jewish Religion and Culture. Content will vary. May be repeated when the topic changes.",
    "prerequisites": null,
    "instructors": "Matthew Brittingham - Primary Instructor",
    "schedule_location": "Th 11:20am-12:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 3804, Section #: 1, Type: SEM, Campus: ATL, Meets: Th 11:20a-12:35p, Instructor: M. Brittingham, Status: Open",
    "date_accessed": "2024-03-30"
}