{
    "course_code": "JS 370",
    "course_title": "Topics in Jewish Religion & Culture: Yiddish Political Theater",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 4 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as GER 375 2, THEA 385)  In 1935, the leftist Yiddish writer Khaver Paver published a book of stories about Labzik, A Clever Pup to be distributed through the school system of the communist-aligned International Workers Order. The twelve stories--which tackle themes including the intertwined pursuit of racial and economic justice, police brutality, allyship and solidarity, and even the effects of a respiratory illness on the working poor--are strikingly relevant to urgent contemporary conversations. Inspired by these connections, Theatre Emory plans to mount a virtual production this Spring, adapting some of the Labzik material as a puppet theater show. This course will serve as the academic hub for the collaboration-in-process: contextualizing the project in terms of the avant garde political puppet theatricals of the interwar period (especially in Central and Eastern Europe), as well as providing a staging ground for the dramaturgical and technical aspects of producing the planned show to the extent possible under fluid circumstances. Enrollment in the course is not required for involvement in the show; however, it is recommended, and students will have the chance to continue their involvement in the Spring production with Theatre Emory. Instructor Miriam Udel is the translator of the Labzik stories; she will be assisted by Jake Krakovsky, 14, an accomplished professional actor, puppeteer, and theater-maker.",
    "course_description": "This course will focus on particular aspects of or themes in Judaism or Jewish culture and how it is practiced. Topics will vary.",
    "prerequisites": null,
    "instructors": "Miriam Udel - Primary Instructor",
    "schedule_location": "M 11:20am-12:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 5253, Section #: 2, Type: SEM, Campus: ATL, Meets: M 11:20a-12:35p, Instructor: M. Udel, Status: Closed",
    "date_accessed": "2024-03-30"
}