{
    "course_code": "JS 371",
    "course_title": "Topics in Jewish History: Jews & Capitalism",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 10Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as HIST 385 5)\n(This class will meet synchronously Wed. 2:40 PM - 3:55 PM) The course will explore representations and perceptions of Jews in commerce - from Shylock to Bernie Madoff to Osama bin Laden's screeds against Judeo-capitalism.  We will then focus on the Jewish role in the development of capitalism, critiquing \"essentialist\" approaches to this question.  We will explore the Jewish revolt against capitalism in the form of socialism, communism, and labor Zionism in the late nineteenth and early twentieth centuries in Eastern Europe, America, and Palestine.   We will use economic history as a lens to better understand modern anti-Semitism, mass migration, the project of Zionism, and the rise of international Jewish philanthropy.  At the end of the course, we will look at how capitalism has reshaped Jewish religious culture - from food consumption to liturgical music.  Overall, the course will challenge students to explore a subject long riddled with stereotypes, antisemitism, and triumphalist narratives of a minority success story in the modern world.",
    "course_description": "This course will focus on a specific period or dimension of Jewish history with an emphasis on the use of documents and other primary sources. Topics will vary.",
    "prerequisites": null,
    "instructors": "Ellie Schainker - Primary Instructor",
    "schedule_location": "W 2:40pm-3:55pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 4781, Section #: 1, Type: LEC, Campus: ATL, Meets: W 2:40-3:55p, Instructor: E. Schainker, Status: Open",
    "date_accessed": "2024-03-30"
}