{
    "course_code": "JS 490RW",
    "course_title": "Senior Seminar In Jewish Studies: Politics of Immigration in US",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 2 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Continuing Writing Requirement",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as HIST 488RW 1)\n(Class will meet synchronously on Wed 1:00 PM - 2:15 PM) \nThis course examines debates and changing policies regarding immigration, citizenship, and borders in the United States from the 18th century to the present, viewing them as an arena in which different and often conflicting visions of American security and economic interests, civic virtues, national identity, and belonging have been articulated. Topics include: the relationship between slavery and immigration; the rise of nativism as a political movement in the 19th and 20th centuries; the impact of racism and racial categorization on immigration policy; the emergence and development of federal immigration law and immigration restriction; the role of immigration in American political economy and labor relations; changing refugee and asylum policies; the intersection of immigration and public health concerns; and the politics of illegal immigration and undocumented immigrants in the U.S.\nCourse requirements include regular preparation and participation, facilitating one discussion, one short review essay, and a final original research paper. In addition to the books listed for purchase, several articles will be available electronically.",
    "course_description": "Selected topics in Jewish studies. Required for majors.",
    "prerequisites": null,
    "instructors": "Eric L Goldstein - Primary Instructor",
    "schedule_location": "W 1pm-2:15pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 4789, Section #: 1, Type: SEM, Campus: ATL, Meets: W 1-2:15p, Instructor: E. Goldstein, Status: Wait List",
    "date_accessed": "2024-03-30"
}