{
    "course_code": "HLTH 385",
    "course_title": "Special Topics: Human Health: The Self in Performance",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 5Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-06-28 through 2021-08-04",
    "class_notes": "(Same as THEA 385 2)\nThis course will introduce self-revelatory performance, a technique in which participants create an original performance piece that depicts the \"working through\" of a recent life challenge using drama therapy techniques. The course will include the history of the method's practice, foundational theories and principles, various approaches used, and an exploration of the technique's effect on human health and wellness. In addition to traditional lecture, classes will involve learning through participation in drama therapy warm-ups, techniques, and processing. As the course is primarily experiential, it is crucial that students attend regularly and participate in activities and group discussions. No previous training in theatre or drama therapy is necessary.\n\n\nThis is an online course. Emory College Online summer courses have required synchronous/live sessions every week. Students must be available to sign into and virtually attend the course online during those times (noted as the course meeting times- all times listed are local to Atlanta). Each course will also involve significant asynchronous material that you access on your own time in addition to standard amounts of readings and course assignments. Students should plan to spend 15-20 hours/week on this course. Please also be aware that faculty will begin corresponding with students during Week Zero of the course (one week before the official start date of the course), and that some interaction with the course may be required at that time. Students should begin checking the Canvas course site regularly one week prior to the official start of the term.",
    "course_description": "Seminar of lecture series of topics in human health. May be repeated for credit when topic varies. Credit varies from one to four hours.",
    "prerequisites": null,
    "instructors": "Erica Craig - Primary Instructor",
    "schedule_location": "TTh 6:30pm-8pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 1569, Section #: 3, Type: LEC, Campus: ATL, Meets: TTh 6:30-8p, Instructor: E. Craig, Status: Open",
    "date_accessed": "2024-03-30"
}