{
    "course_code": "ENGCW 376RW",
    "course_title": "Creative Writing: Intermediate Non-Fiction",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 2",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": "Department Consent Required",
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Permission Required Prior to Enrollment)\nApplication required; complete course atlas information (including texts and grading) and application form available at http://creativewriting.emory.edu/home/academics/fall%202021%20course%20atlas.html. ***If you have not taken ENGCW 272W Introduction to Fiction Writing, you must attach a 10-15 page writing sample to your application.*** \nThis workshop will introduce the fundamentals of writing personal nonfiction narratives. We will explore the basic elements of storytelling -- character, plot, setting, structure, dialogue, etc. -- and how each is used in creating a story out of the events of one's own life. Students will learn how to turn a true story into a written narrative. Editing skills will be sharpened in discussion and evaluation of one another's works-in-progress. The course will concentrate on the creation of three short nonfiction pieces as well as considerations of technique, creation of real characters, and dramatic structure. Classes will be conducted as workshops in which the main emphasis is on the students' own work, and short lectures, with some in-class writing and improvisation.",
    "course_description": "Every semester. Intermediate level workshop in nonfiction genres that often use fictional techniques. ENGCW 270, 271, or 272 required as prerequisite. May be repeated for a maximum of eight hours credit.",
    "prerequisites": null,
    "instructors": "Joseph Skibell - Primary Instructor",
    "schedule_location": "Th 2:30pm-5:30pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 2590, Section #: 1, Type: SEM, Campus: ATL, Meets: Th 2:30-5:30p, Instructor: J. Skibell, Status: Open",
    "date_accessed": "2024-03-30"
}