{
    "course_code": "ENGCW 190",
    "course_title": "Freshman Seminar:Creative Writing: What is Translation?",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 3 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Same as SPAN 190 1, ENG 190 3)\nThis course, taught in English and requiring no second language, introduces students to the field of translation, in multiple contexts and settings. Translation is embedded into our everyday lives: newsfeeds, trade and commerce, knowledge production, religion all rely upon it, yet the process is often unremarked, rendered invisible. The course is aimed at making visible the people, processes and products involved in translation; that is, translators and interpreters, theories and strategies, and the texts they produce. Some of the topics we will broach include: how to read a translation; translation and gender; translation and race; translational identities; translators as social and political agents. Course readings will include fiction, theory, history, memoir and journalism, and classes will be both discussion- and workshop-based. Students will also engage in activities including identifying and 'translating' genre and register; intralingual translation; comparing multiple translations of the same text; and Oulipo activities.\nPREREQUISITES: None",
    "course_description": "Topics/genres vary. Emphasizes writing and reading as elements in intellectual exploration. Does not satisfy first-year writing requirement.",
    "prerequisites": null,
    "instructors": "Lisa Dillman - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Candler Library 121",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 4163, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: L. Dillman, Status: Closed",
    "date_accessed": "2024-03-30"
}