{
    "course_code": "CBSC 370A",
    "course_title": "Community Building and Social Change I - Principles and Perspectives",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 8 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures",
    "permission": "Department Consent Required",
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Same as SOC 370A 1, ENVS 370A 1, CBSC 370A 1)\n\n\nThis course examines how communities of all sizes and types (e.g., neighborhoods, cities, metropolitan regions) solve important public problems. Our focus will be on understanding how, why, and to what effects, collaborative, community-based, cross-sector (public-private-nonprofit) initiatives are crafted. The course addresses several tensions and issues that affect the practice of community building, and the processes through which community builders attempt to overcome these obstacles to foster social change comprehensively (e.g., reduce poverty and promote economic mobility) as well as within specific policy domains such as education, economic development, workforce development, health, and the environment, among others. We will explore the course material through lectures, individual and group exercises, and the examination of a variety of case studies of comprehensive community initiatives launched over the past 30 years. This course is a requirement for participation in Emory's Community Building and Social Change Fellows Program, though students do not need to commit to participating in the CBSC program to enroll. For more information on the CBSC program see https://www.emorycbsc.com/ or contact the CBSC program director, Kate Grace, at kdgrace@emory.edu.",
    "course_description": "Open only to undergraduate students by permission of the instructor. Additionally, this course is required for all students seeking to apply for the fellowship in Community Building and Social Change.",
    "prerequisites": null,
    "instructors": "Michael Rich - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in Tarbutton Hall 218",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2660, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: M. Rich, Status: Open",
    "date_accessed": "2024-03-30"
}