{
    "course_code": "ANT 185",
    "course_title": "Anthropology: Special Topics: Greek Archaeology",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 40 / Seats Avail: 16",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Blended/Hybrid",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Same as CL 103 1)\nArchaeology: Ancient Aliens, Lost Cities, and Making Up the Past: PSEUDO-ARCHAEOLOGY\nWhy does archaeology inspire endless theories about aliens, lost civilizations, apocalyptic predictions, and mysterious technologies? While archaeological investigation is in many ways about solving ancient mysteries, archaeology is grounded in rigorous methodologies, careful accumulation and analysis of data, and scientific method. This course explores where pseudoarcheology comes from and the cultural work it does, and introduces the foundations of archaeological methods and scientific inquiry. Students will develop critical thinking skills and analytical tools to evaluate evidence, and will engage with larger questions about uses of history and the evolution of political and religious ideologies that are built on historical and archaeological ideas. Along the way, we learn about who really did build the pyramids, what happened to Atlantis, and what the Fascists found in the Roman forum.",
    "course_description": "Seminar or Lecture series on topics of anthropological interest at an introductory level. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Sandra Blakely - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in White Hall 206\nF 2:30pm-3:45pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 4369, Section #: 1, Type: LEC, Campus: ATL, Meets: MWF 2:30-3:45p, Instructor: S. Blakely, Status: Open",
    "date_accessed": "2024-03-30"
}