{
    "course_code": "ANT 101",
    "course_title": "Introduction To Anthropology",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 180 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "\"How did Homo sapiens evolve? What is culture? How have human societies changed and developed over time? Why do gender norms and forms of gender expression vary from society to society? How did poverty emerge as an enduring social phenomenon? What is race, and why is racism so persistent in our world?\" \nThis course introduces students to the four subfields of American Anthropology (Archaeology, Biological Anthropology, Cultural Anthropology, and Linguistic Anthropology) in order to answer these and other important questions about who we (humans) are and why we do what we do. Anthropology can be defined as the holistic study of what it means to be human. This class will show students how anthropology's commitment to holistic inquiry makes it a powerful tool for understanding human biology, culture, language, and social organization. Our essential goals in this course will be to understand how humans emerged as a species, came to understand themselves, and how we got to where we are today.",
    "course_description": "Survey of the study of the human species: its evolution, prehistory, language, and comparative social and cultural systems.",
    "prerequisites": null,
    "instructors": "Justin Hosbey - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Anthropology Building 303",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 1671, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: Team, Status: Wait List",
    "date_accessed": "2024-03-30"
}