{
    "course_code": "ANT 200",
    "course_title": "Foundations of Behavior",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 63 / Seats Avail: 3Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Science, Nature, Technology",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Same as NBB 201 1)\nThis course presents an introduction to evolutionary processes and biological bases of behavior. Lectures and readings will emphasize the interaction of social life, behavior, and cognition. Examples drawn especially from humans and nonhuman primates will be used to place human behavior in the context of that of other species. Topics covered will include: human and primate evolution, evolutionary theory and mechanisms, animal behavior, basic functional neuroanatomy, and neural and neuroendocrine mechanisms of behavior, with an emphasis on social behavior. A main learning goal of the course is to understand how to think in an integrative way about all the causes of behavior, from the ultimate causes in evolution to the proximate causes in the brain, hormones, and the environment, mediated by genetic and developmental causes in between.",
    "course_description": "This course presents an introduction to evolutionary processes and biological bases of behavior. Lectures and readings will be organized around a developmental and life history perspective and will emphasize the importance of context in biological mechanisms and the interaction of social life, behavior, and cognition. Examples drawn especially from humans and nonhuman primates will be used to place human behavior in the Context of other species and to illustrate the dual inheritance of biology and culture in our species. Topics covered will include evolutionary mechanisms, adaptation, phylogenetic constraints, neural and neuroendocrine mechanisms of behavior, life history theory, developmental programs, principles of allometry, sexual selection and alternative reproductive strategies, social bonds and socialization, and the cognitive bases of social interaction in humans and nonhumans.",
    "prerequisites": null,
    "instructors": "Marcela Benitez - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in White Hall 208",
    "course_resources": null,
    "sections": "Class Nbr: 1683, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: Team, Status: Open",
    "date_accessed": "2024-03-30"
}