{
    "course_code": "ANT 328",
    "course_title": "Women, Religion & Ethnography",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Same as REL 328 1, WGS 328 1)\nThis course satisfies the new Religion major requirement:- Theme.\nIn this course, we will be interested in the voices of women themselves, listening for how they create and negotiate identities and space for themselves: how they express agency- within an (often) male-dominated tradition. We will look at women's ritual, performance, and leadership roles within a range of religious traditions. Our sources include ethnographic studies that have paid particular attention to women's lives and voices. One of our primary goals is to learn an ethnographic way of thinking, speaking, and viewing/ listening to the world. Underlying questions throughout the course are: How does the study of women and religion from an ethnographic perspective contribute to methodologies for the study of religion? In what ways do ethnographic perspectives expand the boundaries of who and what \"counts\" in the study of religion? We will look at women's practices and experience, but these questions are applicable to other non-dominant voices in a particular religious tradition. What do ethnographic readings tell us about the gendered practice of fieldwork and ethnographic writing; what models do they provide for our own fieldwork and study of religion?",
    "course_description": "Cross-cultural ethnographic study of women's religious lives, including ritual and leadership roles, forms and contexts of religious expression, and negotiations between dominant cultural representations and women's self-representations.",
    "prerequisites": null,
    "instructors": "Aalekhya Malladi - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in Candler Library 101",
    "course_resources": null,
    "sections": "Class Nbr: 5535, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: A. Malladi, Status: Open",
    "date_accessed": "2024-03-30"
}