{
    "course_code": "ANT 210",
    "course_title": "Human Biology:Life Cycle Approach",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 50 / Seats Avail: 28",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "Science, Nature, Technology",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Prerequisites: Bio 141 or permission of instructor.) This is a course in human biology. It integrates content from evolutionary, biological, and social sciences to provide a foundation for understanding the processes that shape human beings across the life course. Specific topics include: principles of evolution and genetics relevant to the human life cycle, development and growth (in-utero through adulthood), reproductive processes (pregnancy, lactation, menopause), health and disease, plasticity and tradeoffs, aging and death. This course uses an evolutionary and comparative perspective, drawing on cross-cultural and cross-species examples throughout. We will focus on the biological systems (neurological, hormonal, and immune) that underlie behavior, reproduction, and health/disease, and discuss the influences of sociocultural and ecological dynamics on these systems. This course is a good option for students interested in health-related disciplines.",
    "course_description": "Human biology from conception to senescence, in an evolutionary and cross-cultural context, emphasizing neural and neuroendocrine processes underlying behavior and reproduction. Conception, fetal development, birth, infant growth, puberty, pregnancy, adult sexuality, and aging.",
    "prerequisites": null,
    "instructors": "James K Rilling - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in White Hall 206",
    "course_resources": null,
    "sections": "Class Nbr: 5512, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 10-11:15a, Instructor: Rilling/Factor, Status: Open",
    "date_accessed": "2024-03-30"
}