{
    "course_code": "ANT 280R",
    "course_title": "Anthro. Perspectives: Sex&Violence: New Guinea & US",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 3Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "This course considers radical cultural diversity among the peoples and cultures of New Guinea and compares this diversity to practices and beliefs in the US. Across previous decades, New Guinean practices often seemed extreme, outlandish, or flamboyant to Westerners, including alternative expressions of sexuality, violence, death and treatment of corpses, gender relations, bodily trauma, power and domination, and love and friendship. Some of these poignant practices have declined in recent decades while others have morphed or persist in new guises. Of special interest is how diverse or extreme practices in New Guinea throw into relief diverse or extreme practices now evident or emerging in the US. The present course organizes this diversity into six themes and compares the trends in each case with changing trends in American culture: Sex, Violence, Death, Power/Domination, Gender, and Friendship. Each section begins with selected consideration of New Guinea and then compares and contrasts this with present or emerging practices in America and other Western countries. The larger goal is to understand the diversity and magnitude of cultural and sub-cultural diversity as it proliferates and modernizes over time.",
    "course_description": "Anthropological perspectives on the people and cultures on different regions of the world.  May be repeated for credit when topic varies. HSC, may be repeated when topic changes.",
    "prerequisites": null,
    "instructors": "Bruce M Knauft - Primary Instructor",
    "schedule_location": "MW 4pm-5:15pm in Anthropology Building 107",
    "course_resources": null,
    "sections": "Class Nbr: 1689, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 4-5:15p, Instructor: B. Knauft, Status: Open",
    "date_accessed": "2024-03-30"
}