{
    "course_code": "ANT 450W",
    "course_title": "The Evolution of Childhood",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Continuing Writing Requirement",
    "permission": "Department Consent Required",
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "Prerequisites: Junior or Senior status; at least two of the following: Anth 201, 202, NBB 201 (Anth 200), Bio 142, Psych 110, 205, 207, 353 (NBB 302); and permission of the instructor (antmk@emory.edu). Please tell me why you are interested and what relevant courses you have had both within and beyond the prerequisites.\n\n\nEvolutionary and anatomical foundations of psychological, especially social and emotional, development, as well as comparative socialization and enculturation. We read the instructor's book, with four main sections (evolution, maturation, socialization, enculturation). Topics include: life history theory, evolution of ontogeny, evolutionary developmental psychology, neural and neuroendocrine development from fetal life through puberty and parenthood, comparative socialization with an emphasis on primates and other mammals, early experience effects, stress in animal models and children, hunter-gatherer childhood, cross-cultural studies childrearing, theories of culture and personality, cultural evolution, human universals, and a proposed \"culture acquisition device\" common to all human brains and minds. Some questions: How did parent-offspring conflict and cooperative breeding? It takes a village to rise a child, affect human evolution? What in social and emotional development depends as much on 'postnatal neuroembryology' as on experience? How do socialization and enculturation differ? What are our legacies from mammalian, primate, and earlier hominin development? Is 'maternal sentiment' a human universal? Is culture unique to humans? How do genetic and cultural evolution interact? Are there commonalities of process at varied levels of analysis such as evolution, brain development, learning, socialization, and enculturation? What are the unique features of human childhood?",
    "course_description": "Covers the evolutionary and anatomical foundations of psychological, especially social and emotional, development, as well as comparative socialization and cross-cultural varieties of enculturation. Among the topics covered will be relevant parts of: life history theory and cultural evolution.",
    "prerequisites": null,
    "instructors": "Melvin J Konner - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in New Psyc Bldg 225 (36 Eagle Ro",
    "course_resources": null,
    "sections": "Class Nbr: 4580, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: M. Konner, Status: Open",
    "date_accessed": "2024-03-30"
}