{
    "course_code": "ANT 402",
    "course_title": "Advanced Seminar in Cultural Anthropology: Issues in Contemporary Anth.",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 12",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "PLEASE NOTE THAT THIS CLASS WILL MEET ONLINE THROUGH LABOR DAY, with the first in-person meeting scheduled for Sept 7.  Contact the instructor for meeting links.\n\n\nJuniors and Seniors only.  The Advanced Seminar will be a twice weekly discussion-based class that explores issues within contemporary anthropology.   Its primary purpose is for us to collectively explore some of the different ways anthropology is pursued and to think about its significance as an approach in today's world.\nOne of the emphases of the seminar will be the creation of a community of students. Through open, lively discussion, students will be encouraged to think creatively about how they might synthesize their knowledge of anthropology gained through their study at Emory and consider its value as they prepare to navigate different career paths.\nClass discussion will be anchored in our reading of selected texts (written and visual). These materials have been carefully chosen to catalyze debate about the choices anthropologists make in carrying out their work. Using particular examples of practice, we will examine the significance of different approaches, research techniques and modes of presentation.\n \nIn addition to our review of the assigned materials, we will also welcome a number of visitors to the course to share their current research and facilitate dialogue about anthropology's contemporary significance.\n\n\nThrough class discussion, presentation and project work, students will be encouraged to develop an expansive perspective with respect to anthropology and the understandings it offers. Emphasis will be placed on students gaining critical skills and confidence in working with visual and textual anthropologies.\nStudents will take turns in preparing and leading discussion, and they will gain experience in introducing and participating in conversation with guest speakers.\nAssessment will be based around written assignments and a final project.\nRequired texts:  Edward Said:  Representations of the Intellectual (1994, Vintage); Tim Ingold Anthropology: why it matters (2018, Polity Press); Jason DeLeon: The Land of Open Graves (2015, University of California Press);  Miyarrka Media:  Phone and Spear  (2019, Goldsmiths Press);  Don Kulick:  A Death in the Rainforest (2019, Algonquin).",
    "course_description": "Topical seminar for advanced students in cultural anthropology..",
    "prerequisites": null,
    "instructors": "Anna Grimshaw - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Woodruff Library 215",
    "course_resources": null,
    "sections": "Class Nbr: 1682, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 10-11:15a, Instructor: A. Grimshaw, Status: Open",
    "date_accessed": "2024-03-30"
}