{
    "course_code": "AAS 359",
    "course_title": "Studies in African American Literature: 1900 to Present: Reconstruction, Civil Rights",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 5Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "HAP w/Race & Ethnicity Req.",
    "permission": "Department Consent Required",
    "dates": "2023-05-09 through 2023-05-26",
    "class_notes": "(Same as ENG 359 2)\n(Complete Topic: Reconstruction, Civil Rights, and Sea Island Culture)\n(This course will introduce students to the \"on-the-ground\" history of Reconstruction and Civil Rights movement strategy through classwork, research in the Rose Library archives, and a study away collaboration with the Penn Center National Historic Landmark. We begin the course on Emory's campus spending some sessions in the Rose Library. For the last four class sessions we will join students from other area universities: Morehouse, Spelman, UGA, University of North Carolina, among others' on St. Helena Island, South Carolina at the Penn Center. Here we will learn about Gullah Geechee history and culture as well as explore Penn Center archives relating to the strategizing meetings held by the Southern Christian Leadership Conference (SCLC) and Student Nonviolent Coordinating Committee. Students will participate in workshops, cultural events, and field trips while on St. Helena. Room and board and transportation costs for students will be covered.)",
    "course_description": "A topics course dealing with major traditions and issues in African American literature from 1900 to the present. Possible topics include passing and miscegenation, black novels since 1950, Afrofuturism, and black theater.",
    "prerequisites": null,
    "instructors": "Valerie Babb - Primary Instructor",
    "schedule_location": "MTWThF 9am-12:30pm in Callaway Center S102",
    "course_resources": null,
    "sections": "Class Nbr: 1648, Section #: 1, Type: LEC, Campus: ATL, Meets: MTWThF 9a-12:30p, Instructor: V. Babb, Status: Open",
    "date_accessed": "2024-03-30"
}