{
    "course_code": "CL 329R",
    "course_title": "Spec Stud in Classical Culture",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 16Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2022-05-10 through 2022-05-27",
    "class_notes": "Have you ever stopped to think about how many references there are to ancient history in modern media? Whether through films like 300, video games like Age of Empires or Assassin's Creed, or even comics, antiquity continues to influence and be re-imagined by modern digital entertainment. In 'Ancient Worlds, Modern Media' you'll explore how mythology and the ancient world are depicted in videogames, webcomics, anime, film, music videos, and other new media. You'll tackle questions of authenticity vs. creative license and learn to recognize how works use history and myth in order to express cultural and political viewpoints through live gameplay, film screenings, guest speakers, and more. This course will be online to best facilitate the above experiences and does not require advance knowledge of ancient history or mythology.\n\n\nThis is an online course. Emory College Online summer courses have required synchronous/live sessions every week. Students must be available to sign into and virtually attend the course online during those times (noted as the course meeting times- all times listed are local to Atlanta). Each course will also involve significant asynchronous material that you access on your own time in addition to standard amounts of readings and course assignments. Students should plan to spend 15-20 hours/week on this course. Please also be aware that faculty will begin corresponding with students during Week Zero of the course (one week before the official start date of the course), and that some interaction with the course may be required at that time. Students should begin checking the Canvas course site regularly one week prior to the official start of the term.",
    "course_description": "Topic changes to meet current interest of students and faculty. Course may be repeated for credit as topic varies.",
    "prerequisites": null,
    "instructors": "Kira Jones - Primary Instructor",
    "schedule_location": "MTWThF 1pm-2:30pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 1188, Section #: 1, Type: SEM, Campus: ATL, Meets: MTWThF 1-2:30p, Instructor: K. Jones, Status: Open",
    "date_accessed": "2024-03-30"
}