{
    "course_code": "CPLT 301W",
    "course_title": "Methods of Literary Interpretation",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 6",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "\"Novel Worlds: History & Politics in Fiction\" | This course has two broad aims: first, it will introduce students to a selection of compelling narratives from around the world; and second, it will encourage a meditation on the link between history and fiction or politics and aesthetics in novelistic writing. In this course, as we consider several elements in narrative form and fictionality (tale, fantasy, crime fiction, metafictional historiography, postcolonial rewriting), we will also look at each novel's mediation and revision of their respective political and cultural histories and ask in what ways narrative and aesthetics offer alternative past and future visions. Questions for discussion will include \"colonialism/postcolonial writing/decoloniality,\" \"translation,\" \"globalization and cosmopolitanism,\" \"state, secularism, and religion,\" \"migration and engagement with 'others',\" \"violence, trauma, and memory,\" \"gender and sexual identity.\" Through readings, discussions, and writing assignments, we will explore how a comparative and international perspective enables us to read and interpret novels (even the most seemingly \"local\" or \"national\" productions) as irresistibly \"global.\" We will also analyze how certain novelistic forms, themes and issues \"travel.\"\n\n\nRequired texts or materials to be purchased:\n-\tNaguib Mahfouz, Arabian Nights and Days (240 p)\n-\tOrhan Pamuk, My Name is Red (417 p)\n-\tAssia Djebar, Fantasia: An Algerian Cavalcade, Trans. Dorothy S. Blair (Heinemann, 1993, 227 p)\n-\tAbdulrazak Gurnah, Paradise (Bloomsbury, 2022, 256 p)\n-\tTahar Ben Jelloun, The Sand Child (176)\n-\tAdania Shibli, Minor Detail (140 p)\n\n\nAssessment and grading (exams, quizzes, assignments, essays, papers, attendance):\n-\tWeekly blogs\n-\tIn-Class Presentation\n-\tClose-reading paper (3-4 pages)\n-\tComparative paper (5-6 pages)",
    "course_description": "An introduction to different methods of literary criticism and textual interpretation, applying a variety of theoretical approaches to selected literary texts.  Readings include essays, fiction, poetry, and drama. *Note: This course is non-repeatable.",
    "prerequisites": null,
    "instructors": "Mehtap Ozdemir - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in Callaway Center S108",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_CPLT_301W_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3723, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: M. Ozdemir, Status: Open",
    "date_accessed": "2024-03-30"
}