{
    "course_code": "CPLT 190",
    "course_title": "Fresh Sem: Literature: Writers and Cities",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 0 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "First Year Seminar",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "\"Writers and Cities\" | The course addresses how writers and artists in general in the Twentieth and Twenty-first centuries have understood the experience of living in the modern city, and how metropolitan life had a decisive effect not only on the content but also the form of art.\nBy carefully selecting its examples from a broad range of American, Latin American and European major works from the period between 1910 to 2020 the course aims to combine urban life to art. The city may not explain a given text, or a work of art, but there is some formal relation between both.\n\n\nWe will be examining different kinds of texts: musical compositions, paintings, short stories, letters, diaries and films. Every two weeks the students will write a one-page paragraph linking these texts to the ones preceding them. This requirement can also be fulfilled orally at three different points in the semester.\n\n\nRequired books for the course:\n- Clarice Lispector, The Hour of the Star\n- Julio Cortazar, Blow Up and Other Stories\n- Frank O'Hara, Lunch Poems\n \nIn addition to these texts, there will be a Canvas required readings for different class sessions, as well as short videos, movies ,and musical compositions.\n\n\nIn addition to a comprehensive account on how cities produce, inspire and frame art and aesthetics during the last century, the course also maps out more conflicted forms of dehumanization and injustice. You will also learn how to articulate your thoughts faced with a work of art , as well as the different ways in which art questions our sense of reality.",
    "course_description": "Freshman-only seminar designed to engage students in various aspects of inquiry and research with the close guidance of a faculty member.",
    "prerequisites": null,
    "instructors": "Jose Quiroga - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Callaway Center S101",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_CPLT_190_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: This section is full 3686, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: J. Quiroga, Status: Closed",
    "date_accessed": "2023-10-31"
}