{
    "course_code": "CPLT 101",
    "course_title": "Rhetorical Composition/Critical Reading",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 16",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Writing(*)",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "\"Philosophy, Poetry, Critique\" | This writing-intensive course aims to read across these three \"genres\" to discover their interplay in creative discovery and expression. We will challenge the traditional separation between creative and critical approaches to writing and show how these methods have been connected and often treated as one and the same. As such, readings will cover a wide variety of periods and places, from Parmenides, philosophical poem to Kafka's diaries and letters. These texts demonstrate writing as process, one that is often unfinished or undone. They also present mixed genres and modes of writing, and we will think rhetorically about how this presentation adds to our thinking. Students will engage course readings through discussion as well as written responses. Major assignments include a reading reflection, researched bibliography, and a topic paper; these assignments will form a final writing portfolio reflecting course topics and learning objectives.\n\n\nTexts may include selections from Walter Benjamin, Simon Weil, Georges Bataille, Paul Celan and Ingeborg Bachmann.",
    "course_description": "Instruction in rhetorical composition, critical reading, reflection, and writing as recursive process. Across themed sections, students engage with diverse genres. Courses share some common assignments including research writing and final student-curated portfolio with reflection project.",
    "prerequisites": null,
    "instructors": "Samuel Smith - Primary Instructor",
    "schedule_location": "MWF 10am-10:50am in Carlos Hall 212",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_CPLT_101_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3689, Section #: 1, Type: LEC, Campus: ATL, Meets: MWF 10-10:50a, Instructor: S. Smith, Status: Open",
    "date_accessed": "2023-10-31"
}