{
    "course_code": "CPLT 751R",
    "course_title": "Spec Topics: Comparative Literature: The Work of Memory",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 6 / Seats Avail: 4",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(Same as ANT 585 7, HIST 585 4, ENG 789 7)\n\"The Work of Memory\" | This course will review some of the key texts and concepts in the emerging field of Memory Studies, with particular emphasis on the connections (and tensions) between history (what happened) and memory (what is remembered and how). In this context, we will explore some of the terms in which memory is talked about, including the distinctions between public, collective, social or cultural, memory, on the one hand, and private, personal, or autobiographical, memory, on the other hand. We will consider the political, ethical, social, aesthetic, and psychological dimensions of remembering \"and its counterpart, forgetting\" and consider some of the ways in which perspectives and approaches from the field of Memory Studies might offer useful analytical and hermeneutic tools for our work.\n\n\nWeekly responses to the readings and a semester project.",
    "course_description": "This course focuses on a specific body of literary texts, critical approach, or theoretical problem in the area of Comparative Literature.  Students may repeat this course for credit if the subject matter varies.",
    "prerequisites": null,
    "instructors": "Angelika Bammer - Primary Instructor",
    "schedule_location": "W 4pm-7pm in Callaway Center S108",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_CPLT_751R_2_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3923, Section #: 2, Type: LEC, Campus: ATL, Meets: W 4-7p, Instructor: A. Bammer, Status: Open",
    "date_accessed": "2024-03-30"
}