{
    "course_code": "CPLT 751R",
    "course_title": "Spec Topics: Comparative Literature: Queer Theory",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 2 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(Same as WGS 752R 1, PHIL 789 2, AAS 710 4)\nThe point of departure of this seminar is the question of sexuality and desire posed in queer theory and in respect to psychoanalysis, gender, and critical theories of race. An underlying question is what queerness does to theory, but also what, in turn, may remain unthought or an impossibility for theory in relation to queerness. The seminar is divided in three parts. The seminar will begin with a study of Freud's works on sexuality, namely his reflections on the foundational myth of the castration complex. In this first section, we will also study how Freud's theories have influenced contemporary psychoanalytic theories (Lacan, Winnicott, Bersani, Edelman) and psychoanalytic feminisms (Irigaray, Kristeva, Rose, Sedgwick, Butler) on the question of sexuality. The second section explores how critical theorists and philosophers of race have taken up and departed from such lines of inquiry (Tinsley, Warren, Jackson, Bradley, Puar, Munoz, Snorton). The third section places our interrogations against the words that comprise the sub-heading of the course title: the universal, worlding, and difference. We will ruminate on them as concepts, figures, and effects of rhetoric to ask how they come into being and into relation with language, representation, and politics. In this final sense, we will explore the contributions of queer theory to a range of other fields (including anthropology, film and media studies, political theory).",
    "course_description": "This course focuses on a specific body of literary texts, critical approach, or theoretical problem in the area of Comparative Literature.  Students may repeat this course for credit if the subject matter varies.",
    "prerequisites": null,
    "instructors": "Linette Park - Primary Instructor",
    "schedule_location": "M 4pm-6:45pm in Candler Library 125",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_CPLT_751R_4_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: This section is full 4557, Section #: 4, Type: LEC, Campus: ATL, Meets: M 4-6:45p, Instructor: L. Park, Status: Closed",
    "date_accessed": "2024-03-30"
}