{
    "course_code": "LING 328",
    "course_title": "Historical Ling & Lang Change",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 5",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Prerequisite: Linguistics 201 (or equivalent) or instructor consent is required for this course.\n\n\nChange is constant in all (living) languages, in all times and places. This course explores this important phenomenon from the perspectives of historical linguistics and sociolinguistics. We will begin by surveying diverse types of change that affect sounds, grammar, and lexical meaning. We will then explore how we can know about languages and changes of the past (for instance, the Comparative Method). We will conclude by examining a range of responses to a key question of sociolinguistics: how and why do changes occur when and where they do?\n\n\nParticulars: Grades will be based on a combination of participation, homework/preparation, and four take-home exams. Students interested in carrying out a research project in historical linguistics or historical sociolinguistics should speak with the instructor about enrolling concurrently or subsequently in Ling 497R.",
    "course_description": "Linguists agree that languages change; they do not agree about how such change occurs. This course views that linguistic systems cannot be completely understood from a purely synchronic perspective. The course surveys types of change, which can affect the linguistic systems, using data from various languages.",
    "prerequisites": null,
    "instructors": "Donald Tuten - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in MODERN LANGUAGE_330",
    "course_resources": null,
    "sections": "Class Nbr: 3442, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: D. Tuten, Status: Open",
    "date_accessed": "2024-03-30"
}