{
    "course_code": "SPAN 385",
    "course_title": "Topics in Language and Culture: Race & Nation in Latin/x Amer.",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 11 / Seats Avail: 2Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Humanities, Arts, Language [Foreign Language]",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Same as LACS 385 1)\nRace & Nation in Latin/x America\nIn this 300-level course students will explore how since the post-independence period in the early 1800s, cultural production has participated in and commented on the formation of national identity in Latin/x America and the place of race in those identities. Through a hemispheric perspective, students will study a variety of textual and visual mediums including novels, essays, poetry, painting, and film in order to establish parallels and contrasts among various national and racial formations throughout the Americas. Students will hone the capacity to speak and write analytically about various forms of cultural production using each medium's corresponding terminology in Spanish. Students will also acquire knowledge of major artistic and intellectual figures of the modern period in Latin/x America and a familiarity with critical approaches to the study of race and nationalism. Students will be expected to prepare thoroughly, participate actively in class discussion, and deliver oral presentations on a work of their choice. Students will also produce written essays in Spanish including 2 short technical analyses, an essay-based midterm exam, and a final research paper. PREREQUISITES: Prior to enrolling in this class students must have taken Spanish 301, 302, or an equivalent course. Students interested in this course should attend class from the first day of the semester.",
    "course_description": "Advanced study of a topic related to the language, discourse, literature, and/or culture of the Hispanic world. Students may take multiple SPAN 385 courses provided that they focus on different topics.",
    "prerequisites": null,
    "instructors": "Mónica García Blizzard - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in Modern Language 201",
    "course_resources": null,
    "sections": "Class Nbr: 2497, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 1-2:15p, Instructor: M. García Blizzard, Status: Open",
    "date_accessed": "2024-03-30"
}