{
    "course_code": "SPAN 410",
    "course_title": "Topics in Spanish Linguistics: Hybridity, Contact & Change",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Same as LING 410 1)\n(DESCRIPTION: This course, taught in Spanish, will explore the place of hybridity and hybridization in the development of the Spanish language, with particular attention to manifestations of hybridity that have arisen through contact between/among different varieties of Spanish and between Spanish and other languages. The first half of the course will focus on fundamental concepts and approaches to the study of hybridity in language: purity vs. hybridity in language; diverse models for the study of hybridity (e.g., borrowing, interlanguage, code-switching/mixing/blending, heteroglossia, translanguaging) and specific contemporary manifestations of hybridity (e.g., Spanglish as a local and global phenomenon). The second part of the course will focus on historical (often unrecognized) processes of hybridization in Spanish language communities that have led to the formation of modern varieties of Spanish, such as dialect contact/mixing in medieval Castile and colonial Latin America; dialect and language contact in the formation of Judeo-Spanish; bilingualism and language shift in/beyond Latin American indigenous communities; language shift and creolization in/beyond Afro-Hispanic communities.)\nTEXT: Readings provided by instructor.\nPARTICULARS: Evaluation will be based on participation and preparation, two take-home tests, two practice explorations, and a final project.\nPREREQUISITE: Span 303 OR Span 304 OR Ling 201 OR permission of the instructor.",
    "course_description": "Upper-level research seminar on topics of Hispanic linguistics and communication, such as history of the language, bilingualism, or translation. Students may take multiple SPAN 410 courses provided that they focus on different topics.",
    "prerequisites": null,
    "instructors": "Donald Tuten - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in Callaway Center S109",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2498, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: D. Tuten, Status: Closed",
    "date_accessed": "2024-03-30"
}