{
    "course_code": "SPAN 485",
    "course_title": "Topics in Hispanic Culture: Latin American Cinema",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 7",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "This course offers an advanced introduction to Latin American cinema by exploring its various stages and their styles. We will cover the silent period, studio cinema, the local reception of neorealism, the political and experimental impulses of the New Latin American cinema, as well as contemporary film from the region. We will focus primarily on films from Mexico, Argentina and Brazil, where the region's largest film industries emerged. The course examines the historical and sociopolitical contexts within which films were produced and upon which they reflect, as well as the ways in which local filmmakers adopt and/or reject aspects of Hollywood and European cinemas. Some of the themes and questions we will explore include the relationship between cinema and modernity in Latin America, how film serves a space to imagine and disseminate discourses about national identity, and the medium's capacity and limitations as social critique. In order to explore these questions through class discussions and written assignments, students will acquire or refine their abilities to discuss cinema in both narrative and technical terms. In this discussion-based seminar students are expected to lead class discussions and deliver oral presentations. Students will also produce written essays in Spanish including 2 short technical analyses and 2 research papers. Students who intend to take this course must be present from the 1st day of class. PREREQ: At least 1 foundational course (300-318W)",
    "course_description": "Upper-level research seminar on topics related to the language, discourse, literature, and/or culture of the Hispanic world. Students may take multiple SPAN 485 courses provided that they focus on different topics.",
    "prerequisites": null,
    "instructors": "Mónica García Blizzard - Primary Instructor",
    "schedule_location": "TTh 4pm-5:15pm in Callaway Center C203",
    "course_resources": null,
    "sections": "Class Nbr: 2013, Section #: 2, Type: LEC, Campus: ATL, Meets: TTh 4-5:15p, Instructor: M. García Blizzard, Status: Open",
    "date_accessed": "2024-03-30"
}