{
    "course_code": "SPAN 485",
    "course_title": "Topics in Hispanic Culture: Latin American Popular Music",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "This course deals with the surge of popular music in Latin America, at a time when \"the youth\" had become a main consumer market for such music and, later, an emergent category of political import across the world. The methodology guiding our course will explore how music as a marketable product interacted with events such as the Vietnam War, the Tlatelolco Massacre in Mexico, the Prague Spring, the Civil Rights Movement in the US, the May 68 in Paris, the Liberation Theology Movement across Latin America, or the Cultural Revolution in China. Guided by these milestones, we will study the \"Nueva Trova Cubana\" artists, Brazilian bossa nova and the Tropicalismo movement, the 'folklore' music of Joni Mitchell (USA), Violeta Parra (Chile) and Mercedes Sosa (Argentina), the British 'invasion' of the Beatles and the Rolling Stones in the US (but also in Latin America). We will also explore some of the most salient aspects of the vernacular rock and pop scenes in the Hispanic World up to Soda Stereo, Shakira and Rosalía, as well as more world-ish 'protest' music, such as Rage Against the Machine, Mano Negra, Manu Chao, Calle 13, and Pussy Riot. The method of evaluation will consist of participation in class, a short presentation, a mid-term Exam, and a final assignment. PREREQUISITE: At least one foundational course (SPAN 300-318W) or permission from the instructor.",
    "course_description": "Upper-level research seminar on topics related to the language, discourse, literature, and/or culture of the Hispanic world. Students may take multiple SPAN 485 courses provided that they focus on different topics.",
    "prerequisites": null,
    "instructors": "Hernan Feldman - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in Callaway Center S102",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2011, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 10-11:15a, Instructor: H. Feldman, Status: Closed",
    "date_accessed": "2024-03-30"
}