{
    "course_code": "SPAN 485",
    "course_title": "Topics in Hispanic Culture: The Caribbean at the End",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 2",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "How did the Hispanic Caribbean present come about? What social and political events brought it into being? What kinds of future do these events portend? Part of our work in this class will be an attempt to read our contemporaneity in terms of these conflicts and/or reconciliations happening within a geographic locale defined by a common culture nevertheless inhabiting different temporal and political frameworks. What does it mean to think about the present? Where does it start?  When did it start? I want these questions to guide this course, even if I don't really need (or want) to answer them--not even in a site as historically 'heavy' as the Caribbean, since 1492 the scenario where empires collude and collide.\nReadings by: Rita Indiana, Pedro Cabiya, Antonio Jose Ponte, Achy Obejas, Mayra Santos, Luis Negron, Reina Maria Rodriguez\nRequirements: Four short papers (approximately 5 pages each) (60% total, 15% each);\nMidterm (15%); Oral presentations (10%); Attendance, Participation, Pop Quizzes, etc.\n(15%))\nPrerequisites: At least one Foundational Course (SPAN 300-318W)",
    "course_description": "Upper-level research seminar on topics related to the language, discourse, literature, and/or culture of the Hispanic world. Students may take multiple SPAN 485 courses provided that they focus on different topics.",
    "prerequisites": null,
    "instructors": "Jose Quiroga - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in Candler Library 123",
    "course_resources": null,
    "sections": "Class Nbr: 2015, Section #: 3, Type: LEC, Campus: ATL, Meets: TTh 1-2:15p, Instructor: J. Quiroga, Status: Open",
    "date_accessed": "2024-03-30"
}