{
    "course_code": "GRK 201",
    "course_title": "Intermediate Greek: Prose",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 14 / Seats Avail: 11",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "Humanities, Arts, Language [Foreign Language]",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "This course is designed to develop the reading skills of students who have completed a year of college-level Greek or its equivalent and to acquaint them with one of the literary masterpieces of classical Greece and its cultural context. In the first half of the course, we will review the basic forms and syntax of Attic Greek acquired in first year through reading adapted and abridged selections from Plato's Symposium. In the second half of the course, we will read at least two unabridged selections from the Symposium. Though the greatest emphasis of the course will be on increasing students, competence in reading ancient Greek, the wide-ranging content of the dialogue should permit students to explore individual interests in the area of classics, whether literary, historical, philosophical, art historical or broadly cultural. \nRequired Texts: \t\n\t*Pratt, Eros at the Banquet: Reviewing Greek with Plato's Symposium\n\t*Pratt, The Essentials of Greek Grammar: A Reference for Intermediate Readers of \tAttic Greek\n\tA translation of the Symposium (I recommend Allen or Woodruff.)\n*These texts will be provided without charge to students registered for the course. They can be picked up from the instructor on or before the first day of class. \nRequirements: 3 50-minute exams, final, quizzes & class participation. A short presentation.\nPrerequisite: Greek 101-102, Greek 110, or equivalent.",
    "course_description": "A review of grammar and introduction to Greek prose through selections from one or more authors such as Plato, Herodotus, Lysias, and Xenophon.",
    "prerequisites": null,
    "instructors": "Jonathan Master - Primary Instructor",
    "schedule_location": "MWF 11:30am-12:20pm in Candler Library 222A",
    "course_resources": null,
    "sections": "Class Nbr: 1013, Section #: 1, Type: LEC, Campus: ATL, Meets: MWF 11:30a-12:20p, Instructor: J. Master, Status: Open",
    "date_accessed": "2024-03-30"
}