{
    "course_code": "ENGCW 376RW",
    "course_title": "Creative Writing: Intermediate Non-Fiction",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 4",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": "Department Consent Required",
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Permission Required Prior to Enrollment)\n\n\nApplication required; complete course atlas information and application form available at http://creativewriting.emory.edu/home/academics/spring-2021-course-atlas.html. NOTES: 1) Students must have taken ENGCW 272W Introduction to Fiction Writing or they must provide some evidence they have done journalistic writing and attach a writing sample of 10-15 pages of prose or journalistic writing to their application and submit AS ONE WORD DOCUMENT; 2) This course is not open to first-year students. This workshop is focused on long form, nonfiction magazine and feature writing -- reading it, reporting it, writing it, and doing so in ways and by means that separate the exceptional from the pedestrian. This is nonfiction. Be prepared to be a reporter, to meet people face-to-face, to ask questions, to see and hear things with your own eyes and ears. We'll have visiting experts on hand as we discuss where great ideas come from, how to be strategic in your reporting, the art of the interview, and crafting stories, then stories within stories.",
    "course_description": "Every semester. Intermediate level workshop in nonfiction genres that often use fictional techniques. ENGCW 270, 271, or 272 required as prerequisite. May be repeated for a maximum of eight hours credit.",
    "prerequisites": null,
    "instructors": "Hank Klibanoff - Primary Instructor",
    "schedule_location": "T 2:40pm-5:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 2975, Section #: 1, Type: SEM, Campus: ATL, Meets: T 2:40-5:35p, Instructor: H. Klibanoff, Status: Open",
    "date_accessed": "2024-03-30"
}