{
    "course_code": "ENGCW 272",
    "course_title": "Introduction to Fiction Writing",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 4",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": "Department Consent Required",
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Permission Required Prior to Enrollment)\n\n\nApplication required; complete course atlas information and application form available at http://creativewriting.emory.edu/home/academics/spring-2021-course-atlas.html. THIS CLASS DOES NOT FULFILL THE POST-FRESHMAN WRITING REQUIREMENT. This is an introduction to the art of fiction writing for beginning students. The roots of storytelling will be explored, and elements of the fiction writer's craft will be introduced and practiced. We will also closely read and examine selected works of published short fiction, though the occasional interdisciplinary model of music, film, and other mediums will be considered. Students will complete writing exercises and shorter pieces of fiction, as well as one longer story that will be workshopped. Students will also be expected to analyze and discuss in-depth both the work of fellow students and published stories; thusly, class participation is not optional. (Note: we will center character-based literary fiction, meaning this course is not one in which genres like fantasy, sci-fi, mystery, horror, romance, etc. will be read or written.) Students should expect asynchronous work in addition to our synchronous meetings.",
    "course_description": "Every semester. Introductory workshop in fiction writing. Counts as a prerequisite for 300-level intermediate workshops but not for Advanced Fiction, Advanced Poetry, or Advanced Playwriting. May not be repeated for credit.",
    "prerequisites": null,
    "instructors": "T Cooper - Primary Instructor",
    "schedule_location": "F 6pm-9pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 2978, Section #: 1, Type: SEM, Campus: ATL, Meets: F 6-9p, Instructor: T. Cooper, Status: Open",
    "date_accessed": "2024-03-30"
}