{
    "course_code": "ENGCW 389W",
    "course_title": "Creative Writing: Spec. Topics: Intro. to Dramatic Writing",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": "Department Consent Required",
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as FILM 385W 1 and THEA 385W 1)\n(Permission Required Prior to Enrollment)\n\n\n(Same as XXXXXXXXXXXXXXXXXXXXXXXXX)\n\n\nApplication required; complete course atlas information and application form available at http://creativewriting.emory.edu/home/academics/spring-2021-course-atlas.html.  An expedition into storytelling: A good story has drama. From a movie to a play to even your favorite Tik Tok video, something about the structure makes you want to keep watching. You find yourself wondering, \"What will happen next?\" This course will teach students what dramatic structure is and how it works. We will practice crafting stories for each other using tools like realistic dialogue, fully realized characters, and strong endings. These tools are useful beyond creative writing. We all love a good story whether we're on stage or not. By the end of this course, students will have experienced writing across disciplines like poetry, theater, and film.",
    "course_description": "Credit, variable; maybe be repeated for a maximum of eight hours credit when topic varies. Specific topics to be announced. Typical subjects include the novel, first person narrative, formalist poetry, and nonrealistic forms. ENGCW 270, 271, or 272 required as prerequisite.",
    "prerequisites": null,
    "instructors": "Jireh Holder - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2976, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 1-2:15p, Instructor: J. Holder, Status: Closed",
    "date_accessed": "2024-03-30"
}