{
    "course_code": "PHYS 599R",
    "course_title": "Research (Pre-Candidacy)",
    "credit_hours": "2-9",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": null,
    "course_description": "Research credits for students who have yet to reach candidacy in the Ph.D. program.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 2014, Section #: 1, Type: THE, Campus: ATL, Meets: Does Not Meet, Instructor: J. Burton, Status: Open\nClass Nbr: 2015, Section #: 10, Type: THE, Campus: ATL, Meets: Does Not Meet, Instructor: L. Santos, Status: Open\nClass Nbr: 2017, Section #: 11, Type: THE, Campus: ATL, Meets: Does Not Meet, Instructor: S. Boettcher, Status: Open\nClass Nbr: 2018, Section #: 12, Type: THE, Campus: ATL, Meets: Does Not Meet, Instructor: I. Nemenman, Status: Open\nClass Nbr: 2019, Section #: 13, Type: THE, Campus: ATL, Meets: Does Not Meet, Instructor: H. Harutyunyan, Status: Open\nClass Nbr: 2020, Section #: 14, Type: THE, Campus: ATL, Meets: Does Not Meet, Instructor: K. Davis, Status: Open\nClass Nbr: 2021, Section #: 15, Type: THE, Campus: ATL, Meets: Does Not Meet, Instructor: T. Lian, Status: Open\nClass Nbr: 2022, Section #: 16, Type: THE, Campus: ATL, Meets: Does Not Meet, Instructor: R. Ribeiro, Status: Open\nClass Nbr: 2023, Section #: 17, Type: THE, Campus: ATL, Meets: Does Not Meet, Instructor: A. Srivastava, Status: Open\nClass Nbr: 2024, Section #: 18, Type: THE, Campus: ATL, Meets: Does Not Meet, Instructor: L. Finzi, Status: Open\nClass Nbr: 2026, Section #: 19, Type: THE, Campus: ATL, Meets: Does Not Meet, Instructor: M. Kim, Status: Open\nClass Nbr: 2027, Section #: 2, Type: THE, Campus: ATL, Meets: Does Not Meet, Instructor: E. Weeks, Status: Open\nClass Nbr: 2028, Section #: 20, Type: THE, Campus: ATL, Meets: Does Not Meet, Instructor: N. Vega, Status: Open\nClass Nbr: 2029, Section #: 21, Type: THE, Campus: ATL, Meets: Does Not Meet, Instructor: D. Sussman, Status: Open\nClass Nbr: 2030, Section #: 22, Type: THE, Campus: ATL, Meets: Does Not Meet, Instructor: S. Shekhar, Status: Open\nClass Nbr: 2032, Section #: 23, Type: THE, Campus: ATL, Meets: Does Not Meet, Instructor: J. Rieser, Status: Open\nClass Nbr: 2033, Section #: 24, Type: THE, Campus: ATL, Meets: Does Not Meet, Instructor: W. Benalcazar, Status: Open\nClass Nbr: 5855, Section #: 25, Type: THE, Campus: ATL, Meets: Does Not Meet, Instructor: K. Salaita, Status: Open\nClass Nbr: 6035, Section #: 26, Type: THE, Campus: ATL, Meets: Does Not Meet, Instructor: R. Ribeiro, Status: Open\nClass Nbr: 2034, Section #: 3, Type: THE, Campus: ATL, Meets: Does Not Meet, Instructor: D. Weissman, Status: Open\nClass Nbr: 2036, Section #: 4, Type: THE, Campus: ATL, Meets: Does Not Meet, Instructor: C. Roth, Status: Open\nClass Nbr: 2037, Section #: 5, Type: THE, Campus: ATL, Meets: Does Not Meet, Instructor: G. Berman, Status: Open\nClass Nbr: 2038, Section #: 6, Type: THE, Campus: ATL, Meets: Does Not Meet, Instructor: K. Salaita, Status: Open\nClass Nbr: 2040, Section #: 8, Type: THE, Campus: ATL, Meets: Does Not Meet, Instructor: S. Urazhdin, Status: Open\nClass Nbr: 2041, Section #: 9, Type: THE, Campus: ATL, Meets: Does Not Meet, Instructor: K. Warncke, Status: Open",
    "date_accessed": "2024-03-30"
}