{
    "course_code": "FREN 101",
    "course_title": "Elementary French I",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 3Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Humanities, Arts, Language [Foreign Language]",
    "permission": null,
    "dates": "2022-05-13 through 2022-06-22",
    "class_notes": "FREN 101 (Sherman / online)\nThis beginning-level course introduces students to reading, writing, speaking, and understanding the French language via exploration of various aspects of the French-speaking world. The course is conducted entirely in French. Instruction proceeds from guided to more creative and independent work with emphasis on speaking, writing, communication, and active participation. Students will complete at-home practice with the required online textbook and platform: Atelier-MindTap. FREN 101 is open to beginners and students with up to one year of high school French. Please note: Students with prior experience in French must provide language placement results to the instructor.\n\n\nThis is an online course. Full participation in synchronous sessions is required (meeting times listed are local to Atlanta), and students should plan to spend at least 15-20 hours/week on the course. Students should begin checking the Canvas course site regularly one week prior to the official start of the term.",
    "course_description": "Every semester. This beginning-level French language course provides students with new perspectives on French and francophone cultures while building writing, reading, speaking and listening skills.",
    "prerequisites": null,
    "instructors": "Elara Sherman - Primary Instructor",
    "schedule_location": "MTWTh 10:30am-11:30am in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 1276, Section #: 1, Type: LEC, Campus: ATL, Meets: MTWTh 10:30-11:30a, Instructor: E. Sherman, Status: Open",
    "date_accessed": "2024-03-30"
}