{
    "course_code": "PSYC 111",
    "course_title": "Intro To Psyc II",
    "credit_hours": "3",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Varies by section",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "OPUS waitlist available at the beginning of add/drop/swap. (There will be small group discussions. This second semester of introductory psychology will cover in broad brushstrokes the major areas of research design, social psychology, social and emotional development, personality measurement and theory, psychopathology, and therapeutic interventions. Emphasis will be on the empirical foundations of psychological knowledge, and on fostering students' scientific thinking about behavior. Particulars: There will be one primary textbook and supplemental readings. Participation in research projects or equivalent is required.)\n\n\nThis course is a LINC (Learning Through Inclusive Collaboration) course with LAT 315. Funded by the Howard Hughes Medical Institute, LINC'd courses are designed to help faculty and students who are engaged in thematically related courses across different disciplines to create points of intersection, or links, between the two courses. Each course will remain independently taught, but will engage in several LINC activities that will draw connections across key themes and concepts and help students integrate across ways of knowing.",
    "course_description": "Introduction to social behavior, development, and individual differences.",
    "prerequisites": "Students completing PSYC_OX 100 or equivalent cannot enroll in PSYC 111. For concerns, please contact the Psychology department.",
    "instructors": null,
    "schedule_location": "Varies by section",
    "course_resources": null,
    "sections": "Class Nbr: 1711, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: Tasimi/Ikeda, Status: Open\nClass Nbr: This section is full 1712, Section #: 2, Type: LEC, Campus: ATL, Meets: MW 10-11:15a, Instructor: Team, Status: Wait List",
    "date_accessed": "2024-03-30"
}