{
    "course_code": "PSYC 352",
    "course_title": "The Genetics of Human Behavior",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 70 / Seats Avail: 35Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Spring",
    "requirement_designation": "Science, Nature, Technology",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "(This class meets synchronously on Tuesday 11:30-12:45 only with asynchronous materials delivered throughout the week.) ( In this course we will examine the underlying causes of human behavior and traits, focusing particularly on the use of quantitative genetic methods (ie, twin and adoption studies) to disentangle genetic and environmental influences. We also will review molecular genetic methods for finding specific genes that underlie behavior. We will begin by reviewing the historical backdrop to behavior genetics, including a focus on Charles Darwin, Francis Galton, and Gregor Mendel. We will proceed to examine the use of twin and adoption studies to disentangle genetic and environmental influences, and the advantages of these methods over family studies. We will then review various molecular genetic methods for finding specific genes. We will end by exploring the results of quantitative and molecular genetic studies of various forms of psychopathology, personality, and behavior.  Prerequisite: QTM 100 or QTM_OX 100 or an equivalent basic statistics course. Textbook: Behavioral Genetics / Edition 7; Publication Date:10/02/2016; Publisher: Worth by Valerie S.Knopik, Jenae M. Neiderhiser, John C.DeFries, Robert Plomin, Charles Darwin. On the Origin of Species; either hard copy or pdf posted to Canvas.)",
    "course_description": "In this course we will examine the underlying causes of human behavior and traits, focusing particularly on the use of quantitative and molecular genetic methods (i.e., twin and adoption studies, genome-wide studies) to disentangle genetic and environmental influences.",
    "prerequisites": "QTM 100 or QTM_OX 100 or equivalent transfer credit as prerequisite.",
    "instructors": "Irwin Waldman - Primary Instructor",
    "schedule_location": "T 11:30am-12:45pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 4627, Section #: 1, Type: LEC, Campus: ATL, Meets: T 11:30a-12:45p, Instructor: Waldman/Jodeiry, Status: Open",
    "date_accessed": "2024-03-30"
}