{
    "course_code": "PSYC 385",
    "course_title": "Special Topics in Psychology: Identities in Films of 1970s",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 14 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "(Important psychological characteristics of individuals, and of the time and place that they live, are often reflected in and inspired by media such as literature, art, and film. In this course we will examine the tension between Individualist versus Collectivist identities in American films of the 1970s. This was a particularly fruitful period for such exploration given the vast societal changes and social upheaval that took place in American society at the time and the ways in which it motivated individuals to rethink the possibilities for the various aspects of their identities. Together we will view a selection of films that illustrate the tension between these aspects of individuals;  identities, with a particular focus on Individualist versus Collectivist identities. In addition to looking back on the 1970s we will discuss the applicability of this tension to present-day American society and current events.) (Textbook: Readings to be assigned by the instructor.)",
    "course_description": "A series of special topics of concern to the discipline of psychology. Content will vary in successive offerings. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Irwin Waldman - Primary Instructor",
    "schedule_location": "T 1pm-3:45pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 1746, Section #: 3, Type: LEC, Campus: ATL, Meets: T 1-3:45p, Instructor: I. Waldman, Status: Open",
    "date_accessed": "2024-03-30"
}