{
    "course_code": "PSYC 473",
    "course_title": "Adv Topics In Abn Psychology: Autism Spectrum Disorders",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "This seminar will provide a comprehensive overview of autism spectrum disorders (ASD), including the clinical and epidemiological features of ASD, how to detect, diagnose, and treat the disorder, and etiological factors associated with ASD. The course will follow a translational approach to bridging scientific research and clinical practice. Guest lectures by clinical and research faculty from Emory University and the Marcus Autism Center will range from social neuroscience and genetics to experimental paradigms for screening and detection, to the neurodevelopment of the disorder throughout the lifespan. Readings will include a collection of articles and chapters on ASD that elucidate the features of autism from both historic and current perspectives. In addition to reading assignments, course assignments will include active classroom discussion, a term paper that involves literature review and critical thinking, and reflection papers on practicum experiences. Students will receive direct experience with individuals with ASD through supervised clinical practicum placements at the Marcus Autism Center for 3 hours/week (observation only). Marcus Autism Center is one of the country's leading centers for clinical care and scientific research of ASD. Students interested in enrolling in this course should have taken at least one of the following prerequisite courses: Child Psychopathology, Abnormal Psychology, Child Development, Cognitive Neuroscience, or related course.\n\n\n(Permission Required Prior to Enrollment)",
    "course_description": "Selected issues in psychopathology theory and research.",
    "prerequisites": null,
    "instructors": "Michael Siller - Primary Instructor",
    "schedule_location": "M 3pm-4:30pm in New Psyc Bldg 493 (36 Eagle Ro",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 4704, Section #: 1, Type: LEC, Campus: ATL, Meets: M 3-4:30p, Instructor: Siller/Saulnier, Status: Closed",
    "date_accessed": "2024-03-30"
}