{
    "course_code": "PSYC 476R",
    "course_title": "Biological Foundations of Behavior: Gender Development",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 3",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "(Enrollment in this class is limited to seniors and juniors only. Sophomores and freshmen are not allowed to enroll in this class).This seminar investigates the factors that affect the development of gender in humans. It will use the book As Nature Made Him, by John Colapinto, the description of a clinical case in which a genetic male identical twin lost his penis as a result of a botched circumcision and was reared as a girl along with his identical twin brother who was reared as a boy. For decades this case was referred to as evidence that gender identity is completely a matter of rearing and socialization. Each seminar participant will be responsible for leading one week of the seminar based on a chapter in As Nature Made Him and in additional primary sources relevant to that chapter. Grades for the seminar will be based on the class presentation, participation in other student's sessions, and on a short position paper (no more than 5 pages) on the development of human gender. The goal of this seminar is to look carefully at the development of gender and to possibly reconcile different approaches to understanding gender.)",
    "course_description": "Selected issues in physiological and comparative psychology.",
    "prerequisites": null,
    "instructors": "Kim Wallen - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in New Psyc Bldg 493 (36 Eagle Ro",
    "course_resources": null,
    "sections": "Class Nbr: 1752, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 1-2:15p, Instructor: K. Wallen, Status: Open",
    "date_accessed": "2024-03-30"
}