{
    "course_code": "POLS 317",
    "course_title": "Global Human Rights",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 10",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "POLS 110 required.\n\n\nHow are human rights realized and limited under the intertwining of international and domestic politics? The course surveys the incentive structure of perpetrators, victims, defenders, and observers of repression/oppression, and how these actors interact with each other and the political and informational environment to produce the human rights practices, policies, and institutions as we see them. The course then releases the assumption that human rights norms and law are constant. The course will discuss the historical expansion of human rights norms, contestations, and its future, given what the preceding weeks inform us about how international and domestic politics of human rights work. Rather than focusing on the United States or any specific society, you will learn theories that generalize globally.",
    "course_description": "Suggested prerequisite: Political Science 110. This course delves into the philosophical and contextual underpinnings of human rights in order to create a framework for understanding the increasing importance of human rights in the international system.",
    "prerequisites": null,
    "instructors": "Jiwon Kim - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Tarbutton Hall 218",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_POLS_317_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 1987, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: J. Kim, Status: Open",
    "date_accessed": "2023-10-31"
}