{
    "course_code": "POLS 490R",
    "course_title": "Advanced Seminar: Pol.of Int'l Aid Effectiveness",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 15",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "POLS 490R \nCourse Title: THE POLITICS OF INTERNATIONAL AID EFFECTIVENESS OR WHOSE RESULTS MATTER AND WHY?\n\n\nPeople that study and/or work in international aid tend to have strong opinions about its definition, the way it is funded, the way it should be delivered, even the way it is studied and evaluated.  This course will give students a shared foundation to engage in lively debate and develop their own perspectives about how this system works.\nThe course will expose students to both academic and practical perspectives on four major topics concerning international aid: 1) The structure of the modern international aid system, 2) The reality and critique of aid programs in practice, 3) The quest for global goals and their influence on notions of effectiveness, and 4) From aid effectiveness to social science research.\n\n\nAbout the instructor: Dr. Jodi Nelson received her Ph.D. in political science from Columbia University. She has extensive experience in the international aid system, having served as a consultant on global health and development issues and as director of research and evaluation at the International Rescue Committee and the Bill and Melinda Gates Foundation. She is currently the managing director of effective philanthropy at the Arthur M. Blank Family Foundation in Atlanta.",
    "course_description": "Open only to senior and junior majors and others by permission of instructor. Selected topics in political science.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": "TTh 8:30am-9:45am in Callaway Center C203",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_POLS_490R_3_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 5699, Section #: 3, Type: SEM, Campus: ATL, Meets: TTh 8:30-9:45a, Instructor: Staff, Status: Open",
    "date_accessed": "2023-10-31"
}