{
    "course_code": "CS 385",
    "course_title": "Topics in Computer Science: Practicum in AI Entrepreneursh",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 23 / Seats Avail: 5Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Pre-requisite (CS/QTM Students): CS 325 or CS 334\n\n\nBBA students should enroll in BUS/MKT399: Building AI Solutions\n\n\nDepartment permission required, please email bnflood@emory.edu\n\n\nThis course equips students with the skills and knowledge to excel in AI business solutions as young entrepreneurs. The course is jointly taught by Goizueta Business School and Computer Science faculty for a rich interdisciplinary experience. It is open to students from diverse academic backgrounds, including those in the BBA, CS, and QTM. Teams will be constructed to leverage complementary skill sets, fostering a creative and productive environment.\n\n\nOver the course, students collaborate in teams to develop AI-powered digital products and services and engage in the entire product development lifecycle. The course structure delves into various aspects of AI entrepreneurship from three critical angles:\n1. Venture Strategy: Explore foundational subjects, such as AI business solutions, the AI ecosystem, entrepreneurial potential, and feasibility assessment.\n2. Artificial Intelligence: Dive into technical topics, such as data management, AI models and algorithms, application development, and system evaluation.\n3. Entrepreneurship: Focus on business aspects, such as monetization strategy, customer acquisition, user data analysis, and digital marketing.\n\n\nThe course also includes discussions on project management and ethics in AI. The ultimate goal of the course is for each student team to deliver a robust AI business solution. These solutions will undergo evaluation by faculty members and a panel of external judges, providing students with invaluable real-world feedback and experience.",
    "course_description": "Rotating topics in computer science. May be repeated for credit when the topic varies. Pre and co requisites depend on the topic offered.",
    "prerequisites": null,
    "instructors": "Jinho Choi - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in White Hall 111",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_CS_385_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3835, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: Choi/Schweidel, Status: Open",
    "date_accessed": "2023-10-31"
}