{
    "course_code": "CS 799R",
    "course_title": "Dissertation Research",
    "credit_hours": "1-9",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Varies by section",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Varies by section",
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Varies by section",
    "course_description": null,
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 5931, Section #: 1, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: V. Sunderam, Status: Open\nClass Nbr: 6278, Section #: 10, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: L. Xiong, Status: Open\nClass Nbr: This section is full 6282, Section #: 11, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Choi, Status: Closed\nClass Nbr: 6286, Section #: 12, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Sarker, Status: Open\nClass Nbr: 6292, Section #: 13, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. Arnold, Status: Open\nClass Nbr: This section is full 6299, Section #: 14, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Y. Vigfusson, Status: Closed\nClass Nbr: This section is full 6301, Section #: 15, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Wildani, Status: Closed\nClass Nbr: 6376, Section #: 16, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Bhasin, Status: Open\nClass Nbr: This section is full 6026, Section #: 2, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: L. Ruthotto, Status: Closed\nClass Nbr: 6247, Section #: 3, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: E. Wall, Status: Open\nClass Nbr: 6249, Section #: 4, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Zufle, Status: Open\nClass Nbr: 6253, Section #: 5, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: C. Yang, Status: Open\nClass Nbr: This section is full 6258, Section #: 6, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Z. Qin, Status: Closed\nClass Nbr: 6260, Section #: 7, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: B. Mahmoudi, Status: Open\nClass Nbr: 6272, Section #: 8, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Reyna, Status: Open\nClass Nbr: This section is full 6275, Section #: 9, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: E. Agichtein, Status: Closed",
    "date_accessed": "2024-03-30"
}