{
    "course_code": "CS 597R",
    "course_title": "Directed Study",
    "credit_hours": "1-9",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Varies by section",
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Varies by section",
    "course_description": "The purpose of this course is to provide CS Masters students with the necessary career management skills to effectively identify, compete, and secure relevant career-launching internships and full-time professional career opportunities",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 5928, Section #: 1, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: V. Sunderam, Status: Open\nClass Nbr: 6284, Section #: 10, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Sarker, Status: Open\nClass Nbr: 6289, Section #: 11, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: T. Pan, Status: Open\nClass Nbr: 6386, Section #: 12, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Ho, Status: Open\nClass Nbr: 6478, Section #: 13, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Choi, Status: Open\nClass Nbr: 6502, Section #: 14, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: N. Katebijahromi, Status: Open\nClass Nbr: 6571, Section #: 15, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: W. Jin, Status: Open\nClass Nbr: 6025, Section #: 2, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Madabhushi, Status: Open\nClass Nbr: 6028, Section #: 3, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: L. Zhao, Status: Open\nClass Nbr: 6040, Section #: 4, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: H. Kwon, Status: Open\nClass Nbr: 6264, Section #: 5, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Ismail, Status: Open\nClass Nbr: 6266, Section #: 6, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: S. Bozkurt, Status: Open\nClass Nbr: 6267, Section #: 7, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: K. Williams, Status: Open\nClass Nbr: 6269, Section #: 8, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: G. Clifford, Status: Open\nClass Nbr: 6276, Section #: 9, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: L. Xiong, Status: Open",
    "date_accessed": "2024-03-30"
}