{
    "course_code": "SOC 389",
    "course_title": "Spec. Tops in Sociology: Crime and the Media",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 40 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "Crime and the Media.\nCourse Description:\nThis course will provide an introduction to critical issues and approaches in the study of criminology with a specific focus on the role of mass media in influencing public perceptions of crime, justice, and safety. While there are many ways to approach the study of crime and the media, this course will focus on helping students understand how audiences of crime drama, film, and various news media are impacted.  We will also explore the ways in which gangs and those in the criminal justice system use media.  In considering the social construction of crime through media, we will ask why it's important to consider the media depictions of crime and criminals.  What do they tell us about our perception of society?  What do they tell us about how we conceive of social justice and punishment? What implications might the social construction of crime have on policy?  What impact might it have on the electorate? \n \nThis course will take an evidence-based approach to studying crime and the media.  This means that students will be expected to engage in assignments and a research project that emphasizes the nature of evidence in the sociological study of crime and media.  Students are not expected to have methods training or research experience prior to taking this course.",
    "course_description": "A seminar or lecture series on topics of special sociological concern.",
    "prerequisites": null,
    "instructors": "Sonal Nalkur - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in New Psyc Bldg 290 (36 Eagle Ro",
    "course_resources": null,
    "sections": "Class Nbr: 2819, Section #: 2, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: S. Nalkur, Status: Open",
    "date_accessed": "2024-03-30"
}