{
    "course_code": "SOC 389",
    "course_title": "Spec. Tops in Sociology: Social Responses to Mental Ill",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 30 / Seats Avail: 3Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "Social Responses to Mental Illness\nThis course is about the social construction of, and responses to, mental illness. By drawing upon cultural sociology, social psychology, and history, we will address the following questions: Is mental illness a scientific category used to diagnose and treat people, or is it a social category used for population control? In the last 200 years America has responded to mental illness in a variety of ways which were the most effective, harmful, and who gets to decide? Just as importantly, how have people with a mental illness responded to their group stigma and society's efforts to `cure,' `manage', and punish them? How is mental illness represented in popular culture and the media, and how can this influence  norms and social responses to people with a mental illness?\nWe will critically examine the origin and use of 'mental illness' on the micro, meso, and macro levels of analysis in American society. While the course is primarily focused on the United States there will be a short survey of how mental illness is determined and engaged with around the world. Main concepts include socialization, power, social control, stigma, as well as the medicalization and criminalization of targeted populations through organizational and institutional forms.\nNote: This course is not going to delve into the biology or physiology of mental illness.",
    "course_description": "A seminar or lecture series on topics of special sociological concern.",
    "prerequisites": null,
    "instructors": "Jamica Zion - Primary Instructor",
    "schedule_location": "TTh 5:30pm-6:45pm in Callaway Center C101",
    "course_resources": null,
    "sections": "Class Nbr: 2828, Section #: 3, Type: LEC, Campus: ATL, Meets: TTh 5:30-6:45p, Instructor: J. Zion, Status: Open",
    "date_accessed": "2024-03-30"
}