{
    "course_code": "SOC 389",
    "course_title": "Spec. Tops in Sociology: Race, Culture, and Health",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 40 / Seats Avail: 32Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "Race, Culture, and Health.\nCourse Description:\nThis course uses a sociological perspective to develop an intersectional and cross-cultural understanding of health, illness, treatments, and therapies. The intent is to deepen your understanding of the scientific and sociocultural foundations of conventional and unconventional healing systems. We'll also understand the various approaches to preventing illness, healing, and maintenance of well-being. We'll study how the alternative approaches to health care complement the biomedical model resulting in the cross-cultural avenues of diagnosis, treatment, and acceptance of health care. You will become familiar with:\n* the evolution of medical practices in various racial and ethnic populations; \n* the underlying concepts, ideas, principles, and therapeutic practices surrounding these cultural healing systems; and \n* the impact that ethnic beliefs and culture have on health promotion, the prevention of health problems, and the treatment of disease. \nWe'll explore how the cultural values of various racial and ethnic populations impact the extant understanding of health & illness and the utilization of health care services. \nAssignments: In-class participation exercises; weekly writings (around 2 pages on most weeks); and seminar leadership on one week.",
    "course_description": "A seminar or lecture series on topics of special sociological concern.",
    "prerequisites": null,
    "instructors": "Apoorva Ghosh - Primary Instructor",
    "schedule_location": "TTh 4pm-5:15pm in Callaway Center C101",
    "course_resources": null,
    "sections": "Class Nbr: 2876, Section #: 10, Type: LEC, Campus: ATL, Meets: TTh 4-5:15p, Instructor: A. Ghosh, Status: Open",
    "date_accessed": "2024-03-30"
}