{
    "course_code": "SOC 489",
    "course_title": "Special Topics in Sociology: Moon Bound: A Sociology of the",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "Moon Bound: A Sociology of the Apollo Era. Department permission only.\nCourse Description:\nOnly 12 humans have walked on the Moon; only 24 have orbited the Moon. No human has been beyond Earth's orbit since the last Apollo lunar mission in 1972. The Apollo missions were extraordinary scientific achievements; they were also historical events located in particular social contexts. This seminar course takes a sociological approach to explore different aspects of the Apollo Era (1962-1972), including political (the astronauts' role in U.S. diplomacy in the Cold War); organizational (early culture of NASA); technological (spaceflight before the digital age); family (the community culture of the early astronaut families); and media (e.g., constructing the 'Astronaut' as hero).  \nStudents will work with primary source material from the Emory Center for Digital Scholarship's Apollo 15 Learning Hub and the Stuart A. Rose Library, as well as other online archives (as needed) to create their own projects on one of the main topic areas. \nRequirements: Three short research assignments that will build into a final project. The final project may take any number of forms, e.g., a written paper, a video, a presentation. Decisions will be determined based on the interests of the students. Class attendance and discussion are integral to this course. \nPrerequisite: one Sociology course. Permission of the instructor.",
    "course_description": "A seminar or lecture series on topics of special sociological concern.",
    "prerequisites": null,
    "instructors": "Tracy L Scott - Primary Instructor",
    "schedule_location": "W 4pm-6:45pm in Tarbutton Hall 206",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2809, Section #: 1, Type: LEC, Campus: ATL, Meets: W 4-6:45p, Instructor: T. Scott, Status: Wait List",
    "date_accessed": "2024-03-30"
}