{
    "course_code": "SOC 506",
    "course_title": "Applied Regression",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 6",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-01-10 through 2022-04-25",
    "class_notes": "This course builds upon the statistical toolkit from SOC 500 Linear Regressions and provides a foundation for conducting and evaluating regression-based works in the social sciences. The first part of the course will cover the topics in conducting transparent and reproducible research. Students will be expected to adopt these research practices throughout the semester. The second part of the course will cover generalized linear models (GLM) that examine non-linear outcome variables. The readings, lectures, and in-class discussion will address each method's mathematical justification, execution, and interpretation using statistical software and application in published articles. The third component of the course will focus on students' in-class presentation and discussion of their research projects. The primary goal of this course is for students to gain fluency in the foundational statistical methods in the social sciences. Fluency denotes the ability to 1) to assess the methods' appropriateness to address sociological questions, 2) to provide thoughtful reviews to works using these methods, and 3) to actively engage in collaborations that use statistical methods. This course aims to provide a broad survey of the most commonly used generalized linear models.",
    "course_description": "This course covers the topic of regression analysis in sociology. This includes the basics of diagnostics, errors, and dealing with collinearity. After covering ordinary least squares, the class moves into nonlinear dependent variables, including regression models for categorical dependent variables like logistic regression and Poisson regression. The course focuses on the interpretation of results, with particular emphasis on visualization to aid understanding of complex statistical models and nonlinear relationships.",
    "prerequisites": null,
    "instructors": "Heeju Sohn - Primary Instructor",
    "schedule_location": "T 2:30pm-5:30pm in Callaway S107",
    "course_resources": null,
    "sections": "Class Nbr: 2848, Section #: 1, Type: SEM, Campus: ATL, Meets: T 2:30-5:30p, Instructor: H. Sohn, Status: Open",
    "date_accessed": "2024-03-30"
}