{
    "course_code": "WGS 285",
    "course_title": "Variable Topics in Women, Gender & Sexuality Studies: Gender/Sexuality/Holocaust",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Same as REL 270 4, JS 273 3, HIST 296 5)\nThis course satisfies the Religion major requirement: - Theme. During the Holocaust, men and women found themselves in the same hell, yet they suffered different horrors. Fiercely contested only thirty years ago, today gender and sexuality are considered key categories to understand the Nazi crimes. This course will explore how social understandings of gender norms and human sexuality affected the lives of perpetrators, bystanders, and victims. Using primary sources such as Nazi laws and propaganda, diaries, memoirs, and video testimonies, we will examine where men's and women's experiences mirrored one another and where they differed, as well as the ways in which the Nazi system redefined-and in some cases shattered-traditional gender roles. We will begin with an examination of gender and sexuality in Nazi ideology and everyday life in the Third Reich, then move on to the study of gendered experiences during the genocide, in ghettos and camps, and conclude with looking at how gender lens impacts memory and representations of the Holocaust. The themes covered will include the role of gender and sexuality in Nazi ideology, gay and transgender lives under Nazism, sexual violence, forced sterilization and reproductive rights, female perpetrators, and the link between homosocial male bonding, performative masculinity, and genocide.",
    "course_description": "Offerings vary each semester.",
    "prerequisites": null,
    "instructors": "Alicja Podbielska - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Rich Building 211",
    "course_resources": null,
    "sections": "Class Nbr: 4621, Section #: 2, Type: SEM, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: A. Podbielska, Status: Wait List",
    "date_accessed": "2024-03-30"
}