{
    "course_code": "WGS 190",
    "course_title": "Fresh Sem: Women, Gender, & Sexuality Studies: India's Women",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 4Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First Year Seminar",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Same as MESAS 190 1 and HIST 190 1)\n(Freshmen Seminar - Limited to First Year Students Only)\n(Complete Topic - India's Women: History, Politics, Leadership)\n(What do you imagine if asked about women and girls of India? Shy, beautiful, bejeweled, Hollywood scenes, food and dance? Or suppressed and victimized? Our seminar will look at India and its women and what makes them powerful. Our examples are:  the first female leader of India in the seventeenth century who killed ferocious tigers, to brilliant women journalist today who are risking their lives to tell important stories, to prize-winning environment activists, to ex-untouchable writer/activist. We will study primary sources, essays, films, fiction and art to think about India's women in different historical times and places. Our investigation will trace changeability - of peoples and of spaces - and with these of the rich and dynamic character of love, sexuality, filial relationships, and everyday life in the careers of India's women.)",
    "course_description": "For first-year students only. Entry level seminar focusing on a specific topic.",
    "prerequisites": null,
    "instructors": "Ruby Lal - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in New Psyc Bldg 393 (36 Eagle Ro",
    "course_resources": null,
    "sections": "Class Nbr: 3341, Section #: 2, Type: SEM, Campus: ATL, Meets: MW 10-11:15a, Instructor: R. Lal, Status: Open",
    "date_accessed": "2024-03-30"
}