{
    "course_code": "WGS 333",
    "course_title": "Language, Gender and Sexuality",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Same as LING 333 1, ANT 325 1)\nCourse Description: Although we are surrounded by messages about gender and sexuality from an early age, what agency do we have in creating and displaying gender and sexuality and what role does language play in this process?  What do terms like transgender, cisgender, non-binary, and genderqueer mean and why does gender-inclusive and gender-affirming language matter?  How do other elements of our social identities (i.e. race, class, nationality, etc.) intersect with language, gender, and sexuality?  As we search for answers to these questions, we will explore sociolinguistic, anthropological, and feminist approaches to the study of language, gender, and sexuality.  We will examine our assumptions and beliefs about gender and sexuality and the ways that our beliefs are encoded in the language that we use.  We will also explore how and why people display different ways of speaking based on their gender and sexual identities.\n\n\nReadings will be posted on Canvas or placed on Course Reserves.",
    "course_description": "Cross-cultural examination of how language reflects, maintains, and constructs gender identities. Topics include differences in male/female speech, the grammatical encoding of gender and childhood language socialization.",
    "prerequisites": null,
    "instructors": "Erica Britt - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in Tarbutton Hall 218",
    "course_resources": null,
    "sections": "Class Nbr: 4647, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 1-2:15p, Instructor: E. Britt, Status: Open",
    "date_accessed": "2024-03-30"
}