{
    "course_code": "WGS 385",
    "course_title": "Spec Topics: Women, Gender, & Sexuality Studies: Feminist Media Studies",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Feminist Media Studies is designed to provide students with the analytic skillset, language, and theoretical frameworks to explore various forms of media from a feminist perspective. The first half of the course is dedicated to unpacking and analyzing the following questions/debates: What is feminist media studies and why is it important? What sets a feminist approach to media apart from standard criticism? What feminist theories can we use to evaluate and analyze media? What makes a piece of media \"feminist\"? How does identity factor into a feminist media studies analysis? How has the internet, and specifically social media, disrupted and/or facilitated feminism's ends? Once the groundwork is established, the second half of the course is dedicated to applying feminist media studies' theories and methods to a variety of films, television shows, visual art, podcasts, records, memes, zines, and other forms of media. The course will culminate in a final project in which students will either analyze or produce a piece of media of their choosing, with appropriate guidance and sign-off from the instructor.",
    "course_description": "Offerings vary each semester.",
    "prerequisites": null,
    "instructors": "Samantha Wrisley - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in Tarbutton Hall 105",
    "course_resources": null,
    "sections": "Class Nbr: 6485, Section #: 5, Type: SEM, Campus: ATL, Meets: TTh 1-2:15p, Instructor: S. Wrisley, Status: Open",
    "date_accessed": "2024-03-30"
}