{
    "course_code": "WGS 385",
    "course_title": "Spec Topics: Women, Gender, & Sexuality Studies: Queer Asia(s)",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 7Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Complete Topic - Queer Asia(s): Identity, Method, and Critique)\n(From gay and lesbi subjectivities in Indonesia to the rebellious \"cool child\" (Ku'er) in the Sinophone world, queer communities in Asia seem to have adopted numerous queer terms and identities originated in the West. But must queerness cohere globally in the name of solidarity, or could it take on different meanings in Asian societies and cultures? Focused on \"queer Asia(s)\" , this course critically examines what it means to be queer and Asian in the world today. We will seek to retrace how terms such as \"queer\" and \"LGBT\" have traversed the vast geological regions collectively referred to as \"Asia\" or \"Asian diasporas\". We will diverge from certain western-centric assumptions in gender and queer studies in order to better study modes of queerness in Asian cultures, religions, and diasporic communities. Course materials and readings are drawn from historical accounts of homosexuality in China, Japan, and India, as well as more contemporary permutations of queerness as seen in queer visual cultures and transnational activism. Active participation in discussions is mandatory, but no prior knowledge or coursework in Asia/queer studies is expected. By the end of the course, you will be well-equipped with critical tools for understanding different forms of queerness integral to many aspects of Asian histories and cultures.)",
    "course_description": "Offerings vary each semester.",
    "prerequisites": null,
    "instructors": "Aobo Dong - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in Tarbutton Hall 111",
    "course_resources": null,
    "sections": "Class Nbr: 2748, Section #: 2, Type: SEM, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: A. Dong, Status: Open",
    "date_accessed": "2024-03-30"
}