{
    "course_code": "WGS 700",
    "course_title": "Women, Gender, & Sexuality Studies  Pro-Seminar",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 7",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Permission Required Prior to Enrollment)\n(This course offers WGSS doctoral students the opportunity to examine critical texts, debates, fissures, and disruptions that have constituted the field of Women's, Gender, and Sexuality Studies. We will read a range of different texts that have shaped the field, paying close attention to how a field becomes unsettled and remade. As the course progresses, students will develop a working vocabulary around key analytical concepts, rubrics, and questions that have defined the study of gender and sexuality. We will give particular attention to the ways in which fields of radical critique become institutionalized, and how WGSS scholars have approached a range of ideas, from intersectionality to the politics of attachment. Among other questions we will consider are: how do we approach the study of gender and sexuality as co-constituted by race, class, citizenship, nationhood, histories of violence, and transnational movement? What place do structures of racial capitalism, empire, secularism, liberalism, and neoliberalism as well as profound critiques of those structures  have in shaping our understandings of WGSS? What is the relationship between theory and activism, between critique and social justice? How do we approach the field with an ethics of care and relationality? We will read a range of texts that address these and other questions, inviting students to continually examine their own relationship to the field.)",
    "course_description": null,
    "prerequisites": null,
    "instructors": "Aisha Finch - Primary Instructor",
    "schedule_location": "Th 1pm-3:45pm in Candler Library 125",
    "course_resources": null,
    "sections": "Class Nbr: 2780, Section #: 1, Type: LEC, Campus: ATL, Meets: Th 1-3:45p, Instructor: A. Finch, Status: Open",
    "date_accessed": "2024-03-30"
}