{
    "course_code": "WGS 385W",
    "course_title": "Spec Topics: Women, Gender, & Sexuality Studies: The Sexual Politics of Hate",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 7Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "In recent years, the deep and intractable nature of hatred has charged into the forefront of our cultural consciousness through racist and misogynistic acts of mass violence, the passage of sexist and anti-LGBTQ laws, the popularization and intensification of white supremacist/misogynist protests and online spaces, and intense forms of anti-woman, anti-LGBTQ, and anti-Black backlash in politics and culture. Taking sexuality and politics as its starting point, this continuing communication course engages with and in various forms of communication to both understand and importantly, respond to various forms of identity-based hatred, such as misogyny, sexism, racism, homophobia, transphobia, and classism.\n\n\nThe course begins by introducing the critical theoretical frameworks necessary to ground a public scholarship approach by reading canonical feminist and anti-racist texts, as well as material that closely examine the social/emotional workings of identity-based hatred. Course materials include but are not limited academic texts, public speeches, opinion pieces, films, documentaries, and investigative journalism. Throughout, students will engage in both individual and collectivized forms of communication through a variety of written assignments, culminating in a collaborative group project in which they will chose to make a zine, a podcast, a press release + recorded speech, or a YouTube video. Together we will think critically about the nature of hate and how public scholarship can be used to effectively respond to and neutralize hate in the public sphere.",
    "course_description": "Offerings vary each semester.",
    "prerequisites": null,
    "instructors": "Samantha Wrisley - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Emerson Chemistry Bldg. E102",
    "course_resources": null,
    "sections": "Class Nbr: 6487, Section #: 2, Type: SEM, Campus: ATL, Meets: MW 1-2:15p, Instructor: S. Wrisley, Status: Open",
    "date_accessed": "2024-03-30"
}