{
    "course_code": "WGS 730R",
    "course_title": "Special Topics: Women, Gender, & Sexuality Studies: Brown Queer Theory",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 6 / Seats Avail: 4",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Same as 751R 1)\nTopic: Brown Queer Theory - Before the 1990s, there were two movie houses in my neighborhood in San Juan. The first was owned by an older Puerto Rican actress whose last movie was filmed in the 1950s, the final years of the Golden Age of Mexican Cinema. There we watched Pasolini double features on certain weekends, Montgomery Clift classics, Swedish films with gratuitous frontal nudity, anything by Buñuel, Goddard, or Charlton Heston. The second movie house was the Lorraine and it was a regular porno theater. The projectionist arrived at 2 or 3 PM and finished work around midnight. The movies seemed to have no beginning or end and would play continuously.\n\n\nBut during timed intermissions every two hours or so, the lights came on and all the men who had been helping hands, or making out, or showing off, moved to the front seats to cheer on the female strippers who had probably just arrived from the airport. The strippers danced with a chair as prop, or with a broom as prop, or simply danced--sometimes with enthusiasm. And it was a point of honor for no man to stay seated in the back rows when there was a woman getting naked up front. You could say it was just a performance of heterosexuality but it was more an issue of courtesy and respect. And yes, it was a performance of heterosexuality.\n\n\nLet's call these movie houses \"Queer Theory\"--or better still \"Brown Queer Theory\" at the risk of invoking an impossibility: partly autobiographical sites that are escape routes for each other, temporary homes where we can suspend all belief but also all finality, devious cultural translations that cover up fake difference. As long as we dont see them as metaphor, we can even engage in their manufactured pleasure, or their brave appeal to a heroic nostalgia, within a time that feels out of joint. The choice of texts may even propose new beginnings or at best reiterate how those figures are simply engaging in a rite past the age when those rites are supposed to take place.\n\n\nTexts may include Nestor Perlongher, Severo Sarduy. Roland Barthes, Sylvia Molloy, Jack Halberstam, Lisa Duggan, Judith Butler, Paisley Currah, Juana Maria Rodriguez, Gayatri Gopinath, and others. \nWith special appearances by Manuel Puig and Jose Esteban Muñoz.",
    "course_description": null,
    "prerequisites": null,
    "instructors": "Jose Quiroga - Primary Instructor",
    "schedule_location": "Th 1pm-4pm in Callaway Center S108",
    "course_resources": null,
    "sections": "Class Nbr: 5642, Section #: 3, Type: LEC, Campus: ATL, Meets: Th 1-4p, Instructor: J. Quiroga, Status: Open",
    "date_accessed": "2024-03-30"
}