{
    "course_code": "SOC 230",
    "course_title": "Sociologic. Aspects Health/Illness",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 100 / Seats Avail: 40Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "In this course we will examine health, illness, and health care institutions as social phenomena, in four parts that move from the macro-social to the micro-social, and across cultures.  In Part I we will learn about population trends in health and the aging of our global society, as well as the social forces that play a determining role.  In Part II we will examine and compare health care institutions in the US and several industrialized countries, with special attention to the Affordable Care Act, which went fully into effect in January 2014.  In Part III we will study the social relationships and roles of health care providers and patients.  Finally, in Part IV we take up issues of the experience of illness and the role that health plays in individual identity.\n\n\nThe following books are available at the Emory College Bookstore.  Substantial portions of these wonderful books are required reading, and they are enthusiastically recommended for purchase.  They are not available on Canvas.  \nFadiman, Anne. 1997. The Spirit Catches You and You Fall Down: A Hmong Child, Her American Doctors, and the Collision of Two Cultures. Farrar, Straus, and Giroux.\nKleinman, Arthur. 1988. The Illness Narratives: Suffering, Healing and the Human Condition. Basic Books.\nReid, T. R. 2010. The Healing of America: A Global Quest for Better, Cheaper, and Fairer Health Care. Penguin.\nWilkinson, Richard. 2005. The Impact of Inequality: How to Make Sick Societies Healthier.  Bloomsbury Press.\n\n\nThis class is meant primarily for non-seniors. The waitlist is opened only after these students are enrolled",
    "course_description": "Social etiology and ecology of disease, sociological factors affecting treatment and rehabilitation, and the organization of medical care and medicine as a social institution.",
    "prerequisites": null,
    "instructors": "Ellen Idler - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Anthropology Building 303",
    "course_resources": null,
    "sections": "Class Nbr: 2639, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: E. Idler, Status: Open",
    "date_accessed": "2024-03-30"
}