{
    "course_code": "SOC 389",
    "course_title": "Spec. Tops in Sociology: Digital Inequality",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 14Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "Course Description: Welcome to Digital Inequality, Spring 2023. In this course we will investigate the question, 'What is the relationship between technological change and social inequality.' We do so in three ways. First, we explore debates among sociologists, economists, and communication scholars about the extent to which technological change has contributed to various forms of inequality (economic, health, civic participation) and how this intersects with inequalities by race, class, and gender. Second, we explore theoretical tools and vocabulary, including what scholars call the first-, second-, and third-level digital divides. First-level divides concern issues of access to technological resources. Second-level divides focus on differences in technological skills and literacies. Third level divides emphasize the relationship between skills and literacies and broader social inequalities. We also look at scholarship on each of these divides, what it shows about the relationship between technological change and inequality, and issues beyond the framework of the digital divide. Finally, throughout the course students will be asked to apply conceptual tools and empirical studies to make sense of their own experiences and local and global issues and use these ideas in a semester-long group research project culminating in a group-produced podcast & script, designed for broadcast and submission to National Public Radio's Student Podcast Challenge: College Edition.",
    "course_description": "A seminar or lecture series on topics of special sociological concern.",
    "prerequisites": null,
    "instructors": "Cassidy Puckett - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in Callaway Center N204",
    "course_resources": null,
    "sections": "Class Nbr: 3059, Section #: 4, Type: LEC, Campus: ATL, Meets: TTh 1-2:15p, Instructor: C. Puckett, Status: Open",
    "date_accessed": "2024-03-30"
}