{
    "course_code": "SOC 457W",
    "course_title": "Development Of Sociological Theory",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 80 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Continuing Writing Requirement",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "1. Sociological theory sometimes has the unfortunate reputation of being (a) removed from empirical matters and (b) done by people who are now long-dead. That reputation cannot be further from the truth. In fact, sociological theory remains vibrant in the present and, in both its classical and contemporary formulations, it has remained tied to understanding the world in which we live.  \n \nOne thread that runs through sociological theory is the concern with inequality, both in terms of understanding why it occurs and what needs to be done to eliminate it. To that end, sociologists have put forward theories that address inequality by emphasizing race, gender, class, status and the like (as well as the interplay and intersections found between them).  \n \nWe take that thread as the organizing principle of this theory class. Indeed, we focus on sociological theory dealing with the mechanisms by which inequality is produced and reproduced, as well as sociological theory that offers solutions about those mechanisms. In the process, we will show, on the one hand, how sociological theory is firmly linked to empirical research and, on the other hand, how sociological theories are formulated and refined by people addressing the present world, both in understanding and improving it.",
    "course_description": "Prerequisite: one sociology course or consent of instructor. Analysis of development of sociological theory as tradition of inquiry into organization and change of groups and societies. Covers classical and major contemporary contributions.",
    "prerequisites": "Any SOC or SOC_OX  or equivalent transfer credit as prerequisite.",
    "instructors": "Timothy J Dowd - Primary Instructor",
    "schedule_location": "TTh 4pm-5:15pm in White Hall 101",
    "course_resources": null,
    "sections": "Class Nbr: 3140, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 4-5:15p, Instructor: T. Dowd, Status: Open",
    "date_accessed": "2024-03-30"
}