{
    "course_code": "SOC 585",
    "course_title": "Advanced Topics in Sociological Research: Digital Inequalities",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 6",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "In this course we investigate the question, \"What is the relationship between technology and inequality?\" We do so in three ways. First, we explore debates among sociologists, economists, and communication scholars about the extent to which technological change has contributed to various forms of inequality (e.g., education, wealth, health) and how this intersects with inequalities by race, class, and gender.\n\n\nSecond, we explore theoretical tools and vocabulary, including what scholars call the first-, second-, and third-level digital divides. First-level divides concern issues of access to technological resources. Second-level divides focus on differences in technological skills and literacies. Third level divides emphasize the relationship between skills and literacies and broader social inequalities.\n\n\nWe examine scholarship on each of these divides, what it shows about the relationship between technological change and inequality, and also investigate critical issues beyond the framework of the digital divide, like algorithmic bias. As we investigate these topics, we will attend to the theoretical, substantive, methodological, and political considerations that concern the study of digital inequality.\n\n\nFinally, students will engage in research in digital inequality: manuscript review and a course project (e.g., an individual or collaborative research paper on an ongoing project, a proposal for future research, or a public sociology project, depending on what would best support students' future work).\n\n\nBooks\nISBN: 978-0226732695 Puckett, Cassidy. Redefining Geek. University of Chicago Press\nFirst edition",
    "course_description": "Various topics in Sociology.",
    "prerequisites": null,
    "instructors": "Cassidy Puckett - Primary Instructor",
    "schedule_location": "T 4pm-6:45pm in Tarbutton Hall 206",
    "course_resources": null,
    "sections": "Class Nbr: 3635, Section #: 3, Type: SEM, Campus: ATL, Meets: T 4-6:45p, Instructor: C. Puckett, Status: Open",
    "date_accessed": "2024-03-30"
}