{
    "course_code": "SOC 742",
    "course_title": "Recent Theoretical Orientations",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 2",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2023-01-11 through 2023-04-24",
    "class_notes": "This course discusses \"theorizing\"--how to think theoretically and how to come up with good theoretical ideas. It includes a review of major epistemologies in social science and a step-by-step practice of theorizing. \nBooks: \nISBN: 978-0333774991 Benton, Ted, and Ian Craib. 2011. Philosophy of Social Science. Basingstoke: Palgrave Macmillan. \nISBN: 978-0335208845 Gerard Delanty, Piet Strydom. Philosophies of Social Science: The Classic and Contemporary Readings. Open University Press.  \nISBN: 978-0691155227 Swedberg, Richard. 2014. The Art of Social Theory. Princeton: Princeton University Press. \nISBN: 978-0393978148 Abbott, Andrew Delano. 2004. Methods of discovery: heuristics for the social sciences, Contemporary societies. New York: W.W. Norton & Co.",
    "course_description": "Sociological theory sometimes has the unfortunate reputation of being (a) removed from empirical matters and (b) done by people who are now long dead. That reputation cannot be further from the truth. In fact, sociological theory remains vibrant in the present and, in both its classical and contemporary formulations, it has remained tied to understanding empirically the world in which we live. In this seminar, we will focus on recent streams of thought within sociological theory -- starting with such 20th century sociologists as W.E.B. Du Bois and working our way to such living sociologists as Viviana Zelizer. In the process, we will see how sociological theory connects to such fundamental concerns as race and racism, identity, commercialization and the expanding digital world.",
    "prerequisites": null,
    "instructors": "Bin Xu - Primary Instructor",
    "schedule_location": "M 6pm-8:45pm in Tarbutton Hall 206",
    "course_resources": null,
    "sections": "Class Nbr: 3652, Section #: 1, Type: LEC, Campus: ATL, Meets: M 6-8:45p, Instructor: B. Xu, Status: Open",
    "date_accessed": "2024-03-30"
}