{
    "course_code": "QTM 190",
    "course_title": "First-Year Seminar in QTM: Explore YourWorld Through Data",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 0 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First Year Seminar",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "(Freshmen Seminar - Limited to First Year Students Only)\n(Complete Topic:Exploring Your World Through Data)\n(We live in a world overflowing with data. In this first year seminar, we build an understanding of how to use data to make insights about our world. We do this through a series of case studies, each focusing on a different social science topic and a different data science skill set. Our case studies include exercises from anthropology, human biology, sociology, economics, global health and demography and more. Through these cases, we will learn (and practice) a tool kit of computational skills and analytical thinking that includes data visualization, inferential thinking, basic statistical analyses, and text mining, and web scraping. By the end of the seminar, you will have made studied many interesting aspects of your world and learned some valuable computational skills. No programming experience is required!)",
    "course_description": "Variable first-year seminar topics within QTM which may aim to provide an introduction to quantitative theory, practical applications of quantitative methods, introductory coding or statistics, or introduce other topics pertinent to quantitative fields.",
    "prerequisites": null,
    "instructors": "Craig Hadley - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in New Psyc Bldg 235 (36 Eagle Ro",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_QTM_190_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: This section is full 2122, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 10-11:15a, Instructor: C. Hadley, Status: Closed",
    "date_accessed": "2024-03-29"
}