{
    "course_code": "QTM 302W",
    "course_title": "Technical Writing",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 15Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Continuing Communication(*)",
    "permission": "Department Consent Required",
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "(Same as ENGRD 302W 1)\nIn this writing-intensive course, we will practice the effective and ethical communication of specialized technical knowledge and quantitative data. Because data are information given order, we will consider their arrangement and re-arrangement as rhetoric. We will introduce rhetorical analysis as a model for understanding how quantitative data can be interpreted and conveyed for multiple audiences that range from professional researchers to the lay public. Guided by this knowledge, you will exercise strategies for communicating via the text, speech, and visual conventions that are integral to preparing ?technical? genres such as research reports, research translations, informative and persuasive infographics, instructions, and data repositories. We will adapt these genres and their conventions for our course goals that center collaboration, transparency, and reproducibility, while emphasizing the methodological questions to ask when bringing new purposes to data prepared by others, as well as whom to ask, and how. As you gain comfort with thinking of writing and analysis as intertwined practices of exploratory inquiry, we will focus especially on how these practices shape the social impacts of our data-driven narratives.\nEmail permission number requests to Sadie Hannans (shanna9@emory.edu). Do not contact the instructor or other staff directly to request placement in this class.",
    "course_description": "This writing-intensive course provides students with practice developing rhetorically effective and ethically sensitive communication in genres that characterize professional activity across and outside the university. No prior technical knowledge required.",
    "prerequisites": null,
    "instructors": "Greg Palermo - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Callaway Center S102",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_QTM_302W_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3669, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: G. Palermo, Status: Open",
    "date_accessed": "2024-03-29"
}