{
    "course_code": "MESAS 190",
    "course_title": "Freshmen Seminar in MESAS: The Indian Ocean",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "First class meeting is Monday, August 30th.\n\n\nDescription \nThe Indian Ocean has been described as the 'most ancient' of oceans and a 'cradle of globalization.' This is because it witnessed some of the earliest human interactions with the marine environment, and because subsequently diverse peoples were mobilized to exploit its many resources for food and other products, to cross oceanic spaces, and to inhabit new parts of the globe.  Interconnected economies and cross-cultural encounters are part of the story of peoples and communities living around the ocean.  This seminar explores the intersection of geography and environment, history, society, economy and culture around the Ocean's shores, across its waters, and on its numerous islands.\nTextbook\nEdward Alpers, The Indian Ocean in World History.  Oxford University Press, 2014.  ISBN 978-0-19-533787-7.\nElectronic access to this text is available through Woodruff Library.",
    "course_description": "Exclusively for first-year students. Seminar provides introduction to various historical, religious, cultural, and linguistic aspects of the Middle East and South Asia. Topics vary.",
    "prerequisites": null,
    "instructors": "Roxani Margariti - Primary Instructor",
    "schedule_location": "MW 4pm-5:15pm in Candler Library 114",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 6161, Section #: 6, Type: SEM, Campus: ATL, Meets: MW 4-5:15p, Instructor: R. Margariti, Status: Closed",
    "date_accessed": "2024-03-30"
}