{
    "course_code": "AFS 270",
    "course_title": "Topic Seminar: History of Human Rights",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 5Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "(Same as HIST 285 7, AAS 285 3, ANT 285 2)\nWhat are human rights and when did they originate? Through what kinds of institutions and frameworks have they been advocated and defended? Are human rights exclusively a Western project? Or do they have postcolonial origins too? Who retains human rights and when are we obliged to protect them? This course will recover the multiple histories of human rights from their deep origins in the 1750s to their more recent incarnations in the 1990s. We will focus on the history of Europe and its engagement with the wider world: looking at how Europe has shaped and was shaped by Africa, South Asia, and the United States over the nineteenth and twentieth centuries. We will examine the relationships between human rights and other crucial events of this period, including revolution, imperialism, and genocide. We will also pay close attention to the work of gender and women in this history. Our goal will be to understand how the evolution of human rights became part of our contemporary framework of politics, law, and culture.",
    "course_description": "An introductory course on African Studies. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Tehila Sasson - Primary Instructor",
    "schedule_location": "MW 8:30am-9:45am in Rich Building 104",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_AFS_270_4_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3740, Section #: 4, Type: SEM, Campus: ATL, Meets: MW 8:30-9:45a, Instructor: T. Sasson, Status: Open",
    "date_accessed": "2024-03-28"
}