{
    "course_code": "LING 190",
    "course_title": "Fresh Sem: Linguistics: Language&Linguistics in Sci-Fi",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "What is the role of language in the human experience? What makes human language different from other languages, both real and imagined? What happens when cross-species communication fails (and succeeds)? We will explore these questions by reading works of science fiction and speculative fiction by Octavia Butler, Ted Chiang, Mary Shelley, China Mieville, Marcel Theroux, and others, intermixed with philosophical essays and empirical studies on related topics. We'll also discuss the film Arrival, an adaptation of Ted Chiang's novella Story of your life. Ultimately I hope you gain a deeper and more nuanced understanding of what language is, as well as a fuller appreciation for how language could be different. Grading will be based on active participation in synchronous and asynchronous discussions, frequent reading-comprehension quizzes, and several short papers.\n\n\nRequired Textbook(s):\n1.) Embassytown, by China Mieville\n2.) Strange Bodies, by Marcel Theroux\n3.) Other required readings will be available online.",
    "course_description": "The freshman seminar in linguistics introduces students to basic aspects in linguistics by focusing on specific themes and topics which vary according to the instructor.",
    "prerequisites": null,
    "instructors": "Marjorie Pak - Primary Instructor",
    "schedule_location": "TTh 4:20pm-5:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3135, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 4:20-5:35p, Instructor: M. Pak, Status: Closed",
    "date_accessed": "2024-03-30"
}