{
    "course_code": "LING 410",
    "course_title": "Topics in Spanish Linguistics: Spanish in the US",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 7 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as SPAN 410 1)\n(This course provides a descriptive and critical overview of the linguistic practices of different Spanish-speaking communities in the United States, as well as several methodologies for the study of these practices. Students will learn about the linguistics characteristics of the different Spanish varieties spoken by these communities, including phonetic, morphological, syntactic and lexical aspects. Special attention is given to the relationship between language and society, particularly on topics such as identity, immigration, language policy and languages in contact. The course also presents an overview of three different research methodologies: discourse analysis, ethnography and linguistic landscape. Students will read and analyze studies carried out by different scholars and will design their own research project on the topic of their preference.) (Some background on general Linguistics is recommended, such as the one provided in Span/Ling 303, Span/Ling 304 or Ling 201.)\n(Particulars: Evaluation will be based in class participation, daily assignments, two exams, one research project proposal and oral presentations.) \n(Prerequisite: At least one foundational course for the Spanish Major and Minor (preferably Span/Ling 303 or Span/Ling 304).",
    "course_description": "Upper-level research seminar on topics of Hispanic linguistics and communication, such as history of the language, bilingualism, or translation. Students may take multiple SPAN 410 courses provided that they focus on different topics.",
    "prerequisites": null,
    "instructors": "Jose Luis Boigues-Lopez - Primary Instructor",
    "schedule_location": "MW 11:20am-12:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 4841, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 11:20a-12:35p, Instructor: J. Boigues-Lopez, Status: Open",
    "date_accessed": "2024-03-30"
}