{
    "course_code": "LING 385",
    "course_title": "Special Topics in Linguistics: Forensic Linguistics",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "This course offers an introduction into Forensic Linguistics. We will look at the history of the field and trace the origins of linguistic expertise and the legal system, as well as discuss the general importance of Language and Language expertise and the law. We will look at how the practical application of linguistics lends itself to various aspects of the legal profession, from law enforcement and the criminal justice system to civil law and litigation. We will spend time examining the underlying linguistic theory and methodologies that are central to the field by looking at cases where forensic linguistic expertise was consulted to assist in identifying potential documentary evidence and to evaluate a range of language-based evidence. Finally, students will learn how to apply forensic linguistic techniques in both investigative and probative contexts while working in a legal/law enforcement framework.\n\n\nRequired Textbook(s):\nNo textbook required. Weekly reading assignments will be article/scholarship based.",
    "course_description": "Investigation of a particular issue or topic in the study of language, linguistics, and communication. May be repeated when topic varies. Topics may include: the Romance languages; intercultural communication; words and the world; language and human nature.",
    "prerequisites": null,
    "instructors": "Betsy Barry - Primary Instructor",
    "schedule_location": "MW 4:20pm-5:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3146, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 4:20-5:35p, Instructor: B. Barry, Status: Closed",
    "date_accessed": "2024-03-30"
}