{
    "course_code": "LING 350",
    "course_title": "Health Communication",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 11 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "In this course, we will be discussing Health Communication, broadly defined: the study of language and discourse about health and health care as used a) between health care providers and patients, b) among health care professionals, and c) among members of the larger society and the media. The study of health communication also includes using linguistic data as a diagnostic tool, development and implementation of healthcare materials, and the recording, retrieval, and interpretation of personal health information. We will examine health communication as a kind of intercultural discourse, in which participants often communicate across various kinds of social, cultural and linguistic barriers, even though these are not always evident to participants themselves.\n\n\nRequired Textbook(s):\n1.) Harvey & Koteyko. 2013. Exploring Health Communication: Language in Action. IBSN: 9780415597227\n2.) Additional Articles on electronic reserve.",
    "course_description": "We examine the language around health and health care as a type of intercultural discourse, including communication between doctors and patients, between health care providers, and discussions of health in the media. We also examine language as a diagnostic tool.",
    "prerequisites": null,
    "instructors": "Susan Tamasi - Primary Instructor",
    "schedule_location": "TTh 2:40pm-3:55pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3145, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 2:40-3:55p, Instructor: S. Tamasi, Status: Closed",
    "date_accessed": "2024-03-30"
}