{
    "course_code": "POLS 335",
    "course_title": "Nations And Nationalism",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 40 / Seats Avail: 30Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-05-17 through 2021-06-23",
    "class_notes": "This course explores the interaction between the nation, nationalism, and conflict. Intrastate conflict, particularly nationalist or ethnic conflict, is now one of the dominant forms of large-scale violence in the international system. By contrast, conflict between states has become relatively less common. The class is divided into three main learning goals: (1) Understanding identity, the nation, and nationalism: the course will begin with a focus on historical and contemporary theories of the nation, formation of the nation, ethnicity, ethnic mobilization, and nationalism; (2) Understanding sources of conflict: the second third of the course focuses on sources of intrastate and identity conflict; and (3) Understanding how conflict ends and sustainable solutions to prevent recurrent conflict: the final third of the course turns to sustainable solutions to intrastate conflicts, post-conflict justice and reconciliation processes, and how to prevent recurrent conflict. Using the body of theoretical work in this area and several prominent conflict cases, students will analyze these core questions and build a working knowledge of a contemporary conflict. Only a basic level of knowledge about international relations and comparative politics is assumed. It is recommended but not required that students have taken POLS 111, POLS 110 or POLS 120.\n\n\nThis is an online course. Emory College Online summer courses have required synchronous/live sessions every week. Students must be available to sign into and virtually attend the course online during those times (noted as the course meeting times- all times listed are local to Atlanta). Each course will also involve significant asynchronous material that you access on your own time in addition to standard amounts of readings and course assignments. Students should plan to spend 15-20 hours/week on this course. Please also be aware that faculty will begin corresponding with students during Week Zero of the course (one week before the official start date of the course), and that some interaction with the course may be required at that time. Students should begin checking the Canvas course site regularly one week prior to the official start of the term.",
    "course_description": "Suggested prerequisite: Political Science 120. Surveys the main contemporary theories of ethnic mobilization and nation building. Discusses the relationship between ethnicity and nationalism, and examines ethnic conflict and ways of resolving and preventing it.",
    "prerequisites": null,
    "instructors": "Danielle Jung - Primary Instructor",
    "schedule_location": "TTh 11:30am-1pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 1442, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 11:30a-1p, Instructor: D. Jung, Status: Open",
    "date_accessed": "2024-03-30"
}