{
    "course_code": "EPI 552",
    "course_title": "Human Genome Epidemiology",
    "credit_hours": "2",
    "seats": "Seats: Maximum Enrollment: 32 / Seats Avail: 13",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-16 through 2024-04-29",
    "class_notes": "\"Course Notes Changes: \nPrerequisite of EPI 530 or EPI 504. GME Certificate students only through November 7.  All others may register on November 8.\"",
    "course_description": "Prerequisite/Concurrent: EPI 504 or EPI 530.  This course will introduce students to applications of epidemiologic methods and approaches to evaluating the use of human genetic discoveries in the practice of medicine and public health in the 21st century. With the completion of the human genome project, the epidemiologic approach is now urgently needed to assess the prevalence of genetic variation in the population, to characterize the burden of disease associated with genetic variation and with gene- environment interaction, and to evaluate the impact of genetic tests in reducing morbidity and mortality. At the end of the course, participants should be able to identify types of information needed to translate genetic discoveries into medicine and public health and be able to review and evaluate such information in the scientific literature. The course is designed for public health students interested in the intersection of epidemiology, genetics, preventive medicine, and health policy.",
    "prerequisites": null,
    "instructors": "Marta Gwinn - Primary Instructor",
    "schedule_location": "M 5pm-6:50pm",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_EPI_552_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 1132, Section #: 1, Type: LEC, Campus: ATL, Meets: M 5-6:50p, Instructor: Sun/Gwinn, Status: Open",
    "date_accessed": "2023-10-31"
}