{
    "course_code": "EPI 590R",
    "course_title": "EPI Seminar: Disease Surveillance",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 18",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-08 through 2024-01-13",
    "class_notes": "Students need to understand the definition of disease surveillance. Disease surveillance is defined as the systematic and ongoing data collection, analysis, and interpretation of outcome-specific data for use in the planning, implementation, and the timely dissemination of these data for prevention and control activities of diseases. This course is focused on surveillance of selected occupational diseases (occupational cancer, asthma, silicosis, malignant mesothelioma, tuberculosis) and COVID-19.\nStudents can expect to learn this course as follows.\n¿\tLearn about historical development of the concept of disease surveillance, purposes and uses of disease surveillance in public health practice. \n¿\tLearn about surveillance of selected occupational diseases including occupational cancer, occupational asthma, silicosis, malignant mesothelioma, tuberculosis, and COVID-19 that affect morbidity and mortality in the United States.\n¿\tLearn about CDC occupational disease surveillance system available in the United States and prevention strategies using surveillance information on occupational diseases.\n¿\tLearn how to interpret disease surveillance data (morbidity and mortality) to track trends over time using existing CDC occupational disease surveillance data.\n¿\tLearn how to review and critique published articles relevant occupational diseases surveillance and write a report that summarizes the findings of a particular article and then present your review in class.",
    "course_description": "Various topics by Epi faculty. Check OPUS/Atlas for current topics and descriptions.",
    "prerequisites": null,
    "instructors": "Ki Moon Bang - Primary Instructor",
    "schedule_location": "MTWThF 10am-12pm in Grace Crum Rollins TBA\nMTWThF 1pm-3pm in Grace Crum Rollins TBA",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_EPI_590R_5_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2164, Section #: 5, Type: SEM, Campus: ATL, Meets: MTWThF 10a-12p; MTWThF 1-3p, Instructor: K. Bang, Status: Open",
    "date_accessed": "2023-10-31"
}