{
    "course_code": "EPI 738R",
    "course_title": "Advanced EPI Methods I",
    "credit_hours": "2",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 20",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Prerequisites: This course is an elective for Epidemiology PhD students and is open to PhD students from other departments only with instructor permission.  Prior or concurrent enrollment in EPI 760/BIOS 76 is required. Course Description: This course covers a wide variety of selected topics in study design, analysis and causal inference. Fundamental concepts to be covered include: relationships between observational and observable probabilities and links between nonparametric structural equation models and directed acyclic graphs;  equivalence of exchangeability and identification of certain causal effects;  maximum likelihood estimation and a conceptual approach to use of estimating equations; application of instrumental variables and negative controls and identification of causal effects using them; study designs, including difference in difference studies, regression discontinuity and interrupted time series studies; and a conceptual approach to graphical representation of the pattern of a causal effects and the G-formula.",
    "course_description": "Covers a wide variety of topics in epidemiologic methodology. Topics will include basic epidemiologic measures, confounding, misclassification, selection bias, types of case-control studies, Berkson of epidemiologic parameters. Prerequisite: EPI 530, EPI 534, BIOS 500, BIOS 501 (EPI 534 and BIOS 501 may be taken concurrently). Doctoral student section.",
    "prerequisites": null,
    "instructors": "W Dana Flanders - Primary Instructor",
    "schedule_location": "W 8am-9:50am",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_EPI_738R_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2161, Section #: 1, Type: LEC, Campus: ATL, Meets: W 8-9:50a, Instructor: W. Flanders, Status: Open",
    "date_accessed": "2023-10-31"
}