{
    "course_code": "FREN 488W",
    "course_title": "Topics in French",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 10Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Humanities, Arts, Language with Writing",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "FREN 488W  \"Dreams, Daydreams and Fantasies: Literature and Psychoanalysis\"(C. Nouvet / MW 10:00-11:15AM in person sessions)\nContent:  Dreams, Freud claims, are not meaningless phenomena, but the 'royal road' to the unconscious. We will explore how dreams open a path to the unconscious through Freud's account of how dreams 'work' i.e. the processes that they put into play. We will also explore the relation between dreams and art. For instance, some surrealist artists (writers as well as painters) avail themselves of the inventive resources of the dream and play with fantasy while insisting on the specific work that art performs. While being open to the world of fantasies, art is not a simple and passive automatic transcription of the unconscious. It requires a vigilance that has led writers to compare repeatedly their activity to a 'daydream' which takes place between waking and dreaming. The relation between literature and painting will also be addressed.\nAll texts/resources are web based unless preceded by * \n-\t*  Freud: Sur le re've [Folio Essais] \nLa cre'ation litte, raire et le re've e'veille' \n-\t*  Breton: Manifestes du surre'alisme [Folio Essais] \n-\tRay et Eluard: Les mains libres \n-\tErnst: Ecritures [selections] \n-\tMichaux: selections from: En re'vant a' partir de peintures e'nigmatiques; La nuit remue \n-\tGracq: Le roi Cophetua \n-\tPontalis: \"Revenir sur les pas de qui?\" \n-\tGiacometti: L'objet invisible",
    "course_description": "Courses will include the study of a variety of subjects in French and/or francophone literature and culture. May be repeated for credit.",
    "prerequisites": "FREN 310, FREN 314 and two 300 level FREN courses, or equivalent transfer credit as prerequisite.",
    "instructors": "Claire Nouvet - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in Ignatius Few Building_129",
    "course_resources": null,
    "sections": "Class Nbr: 3004, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 10-11:15a, Instructor: C. Nouvet, Status: Open",
    "date_accessed": "2024-03-30"
}