{
    "course_code": "FREN 785",
    "course_title": "Postcolonial Studies",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 12",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-01-10 through 2022-04-25",
    "class_notes": "FREN 785   \"Écritures de la terre\"(V. Loichot / T 1:00-4:00pm in person)\nRésumé du séminaire:\nS'il est un paradoxe, c'est d'aimer sa terre quand on y a été déporté. Ce séminaire envisagera, à travers les exemples de la Martinique et d'Haïti, l'écriture de la terre en littérature et philosophie. Nous y étudierons les stratégies de réappropriation de la terre après l'économie de la Plantation, l'ambivalence de la terre nourricière et cannibale, sa valeur mémorielle et poétique, son caractère profane et sacré, ses personnifications et sexualisations. Nous nous demanderons également, dans le sillage de la pensée du désastre de Blanchot, ce qu'il advient du texte quand la terre écrit elle-même par son tremblement. En effet, comment et quoi écrire après Goudougoudou ? Qu'advient-il de l'histoire quand la Révolution haïtienne est assimilée à une catastrophe naturelle ? Comment répondre à l'empoisonnement de la terre et des corps par le chlordécone? Qu'est-ce que la production littéraire apporte à la pensée et aux pratiques écologiques ? Comment l'écriture de la terre des « petits pays » nourrit-elle la pensée de la planète Terre ?\n\n\nParticulars\nOne 12-page research paper, one oral presentation, active class participation, three 400-word response papers. The seminar will be conducted in French. Students from other graduate programs who have a good reading knowledge and communication skills in French are encouraged to enroll and will be able to deliver their presentation and write their paper in English. \nTexts to be purchased: \n-\tAimé Césaire. Cahier d'un retour au pays natal. ISBN 978-2708704206\n-\tLaurent Dubois. Haiti: The Aftershocks of History. ISBN 978-0805093353\n-\tMalcolm Ferdinand. Une Écologie décoloniale. ISBN 978-2021388497\n-\tÉdouard Glissant. Poétique de la Relation. ISBN 978-2070720255\n-\t---. Philosophie de la Relation. ISBN 2070125424 (Optional)\n-\tSuzanne Roussi Césaire. Le Grand camouflage. ISBN 978-2021289275\n-\tYannick Lahens. Failles. ISBN 978-2848050904\nFilm:\n-\tRaoul Peck. Assistance mortelle, 2013.",
    "course_description": null,
    "prerequisites": null,
    "instructors": "Valérie Loichot - Primary Instructor",
    "schedule_location": "T 1pm-4pm in Callaway Center C202",
    "course_resources": null,
    "sections": "Class Nbr: 2303, Section #: 1, Type: LEC, Campus: ATL, Meets: T 1-4p, Instructor: V. Loichot, Status: Open",
    "date_accessed": "2024-03-30"
}