{
    "course_code": "LAW 901",
    "course_title": "Supervised Research",
    "credit_hours": "1-3",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Varies by section",
    "instruction_method": "Varies by section",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-08-15 through 2022-11-21",
    "class_notes": null,
    "course_description": "Students will work one-on-one with an individual faculty member on projects related to the faculty member's scholarly research. Students will receive general research training at the start of the semester. The course will general draw on and develop students' legal research, analysis, writing, communication, and overall professionalism skills. Students will submit periodic reports to the professor, in writing or orally, as appropriate, on their research and analysis and receive specific feedback and guidance from the professor as relevant and appropriate to the particular research project.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 2479, Section #: 001, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: K. Levine, Status: Open\nClass Nbr: 5286, Section #: 002, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Romig, Status: Open\nClass Nbr: 5655, Section #: 003, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Witte Jr., Status: Open\nClass Nbr: This section is full 5772, Section #: 004, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: M. Sybblis, Status: Closed\nClass Nbr: 6114, Section #: 005, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: M. Broyde, Status: Open\nClass Nbr: 6145, Section #: 006, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Shepherd, Status: Open\nClass Nbr: 6160, Section #: 007, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: S. Pill, Status: Open\nClass Nbr: 6219, Section #: 008, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: G. Georgiev, Status: Open\nClass Nbr: 6266, Section #: 009, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: S. Payne, Status: Open\nClass Nbr: 6318, Section #: 010, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: M. Lawrence, Status: Open\nClass Nbr: This section is full 6517, Section #: 011, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: A. Cloud, Status: Closed",
    "date_accessed": "2024-03-30"
}