{
    "course_code": "ITAL 320W",
    "course_title": "Business Italian",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 9Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Language with Writing",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "ITAL 320W:  Business Italian\nMuratore (MW 11:20-12:35 online synchronous)\nContent: This advanced-level course, taught entirely in Italian, will prioritize the acquisition of the practical workforce skills and the global competencies that students need to initiate a conversation with Italian-speaking businesses and prospective employers. The course will begin with an introduction of Italian business culture, practices and etiquette. To develop these skills and acquire meaningful experience, students will be given the opportunity to engage with Italian business representatives and Italian students through electronic communication, speaker panels and guest-speaker presentations. This course will prioritize the acquisition of business-related vocabulary, an understanding of best practices for electronic communication and business etiquette, as well as the development of collaborative, presentational, oral and written communication skills among the students.)",
    "course_description": "Development of linguistic and communication skills needed to initiate a conversation with Italian speaking businesses and prospective employers, combined with an  introduction of Italian business culture, practices and etiquette.",
    "prerequisites": "ITAL 202 or ITAL_OX 202 or equivalent transfer credit as prerequisite.",
    "instructors": "Simona Muratore - Primary Instructor",
    "schedule_location": "MW 11:20am-12:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 3037, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 11:20a-12:35p, Instructor: S. Muratore, Status: Open",
    "date_accessed": "2024-03-30"
}