{
    "course_code": "ITAL 470W",
    "course_title": "Topics in Italian Literature: Il folle volo",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 12Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Language with Writing",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Complete Topic - Il folle volo:  A Transnational/Translational approach to the journey motif in Italian literature and cinema)\nPorcarelli  TT 11:20-12:35 online synchronous\nContent: From its beginning literature has found a central theme in the journey metaphor; be it physical or symbolic.  In this course, by using a transnational/translational approach, we will explore the ways travel narratives dwell on notions of chances and choice, discovery and change, and search and struggle. By portraying Italy as an in-between space, geographically and historically characterized by internal and external transits, we will look at the journey motive as a privileged tool to shape, negotiate and challenge identity. During the semester we will read a variety of texts organized in chronological order, beginning with the rendering of Ulysses' travel in Dante Alighieri's Divine Comedy, all the way to contemporary postcolonial and migration travel narratives.",
    "course_description": "In Italian. Intensive study of a single author, genre, literary movement, or period. Topic to be announced in advance. May be repeated for credit when topic varies. Prerequisite: Italian 302 or permission of program director.",
    "prerequisites": null,
    "instructors": "Angela Porcarelli - Primary Instructor",
    "schedule_location": "TTh 11:20am-12:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 3028, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 11:20a-12:35p, Instructor: A. Porcarelli, Status: Open",
    "date_accessed": "2024-03-30"
}