{
    "course_code": "ITAL 190",
    "course_title": "Freshmen Seminar: Italian: Land of Borders",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "You must have permission to enroll in-person.\n(Freshmen Seminar - Limited to First Year Students Only)\n(Compltete Topic - Land of Borders: Material and Imaginary Crossings in Italian Literature and Cinema)\n(Internal and external borders, material and imaginary lines of division have always been a foundational part of the multicultural construction called Italian identity. This freshman seminar will examine the crossing of cultural and social barriers between the north and the south of the country, as represented in classics of Italian cinema about internal migration, like Visconti's Rocco and his brothers, and in mafia movies and tv series, which often intertwine with the long history of Italian transoceanic migration. Finally, we will explore a wide range of narratives investigating the migratory patterns across the Mediterranean, of which Italy is a crossroad where a multitude of stories and voices resonate.)",
    "course_description": "Seminar designed to engage freshmen in aspects of inquiry and research into areas of Italian culture through mutual exploration of subject matter. Primary mode of classroom discourse is dialogue and group projects.",
    "prerequisites": null,
    "instructors": "Achille Castaldo - Primary Instructor",
    "schedule_location": "MW 11:20am-12:35pm in New Psyc Bldg 290 (36 Eagle Ro",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3023, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 11:20a-12:35p, Instructor: A. Castaldo, Status: Wait List",
    "date_accessed": "2024-03-30"
}