{
    "course_code": "CPLT 333",
    "course_title": "Literature & Other Disciplines",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 8 / Seats Avail: 8",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "(SAME AS AAS 385 4, PHIL 385 2, REL 370 1, ENG 389 2)\n\"Literatures of the Unthought\" | This course attends to the position of the unthought across a variety of disciplinary sites. In some cases, that which is unthought is due to neglect, repression, or obfuscation. In other cases, the unthought is a structural feature of thought itself. Oftentimes, one cannot tell whether the unthought is a result of the former or the latter. This course attends to each of these permutations of what remains unthought in the literatures of creative writing, speculative philosophy, negative theology, psychoanalysis, black study, queer theory, settler decoloniality, and geology. In 2003, the cultural historian Saidiya Hartman coined the phrase \"the position of the unthought\" to describe how the logics of chattel slavery continue to haunt a post-emancipation world. In 1987, the literary critic Hortense Spillers theorized this position--exemplified in the \"ungendered female flesh\" --as the \"zero degree\" of modern social conceptualization. In 1952, the philosopher and psychiatrist Frantz Fanon theorized how colonial social conceptualizations rendered black people into that which \"is not\" (n'est pas).\n\n\nThis course attends to the position of the unthought across a variety of disciplinary sites. In some cases, that which is unthought is due to neglect, repression, or obfuscation. In other cases, the unthought is a structural feature of thought itself. Oftentimes, one cannot tell whether the unthought is a result of the former or the latter. This course attends to each of these permutations of what remains unthought in the literatures of creative writing, speculative philosophy, negative theology, psychoanalysis, black study, and queer theory.\n\n\nIn 2003, the cultural historian Saidiya Hartman formulated the position of the unthought to describe how the logics of chattel slavery continue to haunt a post-emancipation world. In 1987, the literary critic Hortense Spillers theorized this position as the zero degree of modern social conceptualization. In 1952, the philosopher and psychiatrist Frantz Fanon theorized how colonial social conceptualizations rendered black people into that which is not.\n\n\nFanon's formulation resembles the Christian tradition of apophatic theology beginning in the 5th Century, which contended that the divine can only be said or known in terms of what it is not. In a similar vein, at the turn of the 20th Century, Sigmund Freud invented psychoanalysis as a therapeutic method of attending to the unconscious as that constitutive feature of the psyche whose effects can only be spoken or known indirectly.\n\n\nThis course will ask how literature, broadly conceived, offers a unique vehicle for orienting ourselves to these various iterations of the position of the unthought.\n\n\nTEXTS: Authors may include (in addition to the above): Plato, Pseudo-Dionysius, Marguerite Porete, Juan de la Cruz, W. E. B. Du Bois, Franz Kafka, Nella Larsen, Simone Weil, Richard Wright, Ralph Ellison, Samuel Beckett, Édouard Glissant, Maurice Blanchot, Toni Morrison, Anne Carson, Giorgio Agamben, Dionne Brand, M. NourbeSe Philip, Frank Wilderson, Alexis Pauline Gumbs, and Ashon Crawley.\n\n\nPARTICULARS: Weekly participation (25%); bi-weekly close reading posts [six total] (25%); midterm revision and expansion of one close reading post (25%); final portfolio of three revised and expanded close reading posts (25%).",
    "course_description": "A study of literary texts and their complex interplay with other disciplines (e.g., literature and psychoanalysis, literature and philosophy, literature and law, and literature and religion.)",
    "prerequisites": null,
    "instructors": "Andrew Kaplan - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Callaway Center N118",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_CPLT_333_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3463, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: A. Kaplan, Status: Open",
    "date_accessed": "2024-03-28"
}