{
    "course_code": "CPLT 389W",
    "course_title": "Special Topics: Literature: Marxism, Literature, Culture",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 16",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "\"Marxism, Literature, Culture\" | \"This course will focus on the problem of literature and culture in Marxist theory.  We will read selected texts by Karl Marx, Friedrich Engels, Antonio Gramsci, V.N. Vološinov, Mikhail Bakhtin, Walter Benjamin, Max Horkheimer, Theodor W. Adorno, Raymond Williams, E.P. Thompson, Louis Althusser, Pierre Bourdieu, Henri Lefebvre, Michel de Certeau, Ernesto Laclau, Chantal Mouffe, Stuart Hall, Gayatri Chakravorty Spivak, and Donna Haraway.  Although our class discussions and written assignments will be based on our assigned course readings, we may also draw from literature and other cultural forms beyond our assigned readings in order to illustrate their different and sometimes conflicting theoretical approaches.\"\n\n\nStudents will not only learn about these different approaches to literature and culture and their relationship with one another, but they will also learn how to read theoretical texts and write scholarly papers.  This course fulfills one of the three elective requirements for the Major Degree in Comparative Literature as well as the General Education Requirement (GER) in Continuing Writing (WRT) for Emory College.\"\n\n\n\"The following texts are required for purchase:\n-\tKarl Marx and Friedrich Engels, The Marx-Engels Reader, ed. Robert C. Tucker, 2nd ed. (New York: W.W. Norton and Company, 1978), ISBN: 978-0393090406\n-\tAntonio Gramsci, The Antonio Gramsci Reader: Selected Writings, 1916-1935, ed. David Forgacs (New York: New York University Press, 2000), ISBN: 978-0814727010\n-\tErnesto Laclau and Chantal Mouffe, Hegemony and Socialist Strategy: Towards a Radical Democratic Politics, 2nd ed. (New York: Verso, 2014), ISBN: 978-1781681541\nAll other readings will be made available in electronic format on Course Reserves.\n\n\nStudents will be assessed on the following basis:\n-\tFour (4) response papers (10% each, 40% total)\n-\tLong essay (40%)\n-\tAttendance and participation (20%)\"",
    "course_description": "Lively topical or theoretical approaches to a given set of literary texts or problems. May be repeated for credit when subject varies. Fulfills the post-freshman writing requirement.",
    "prerequisites": null,
    "instructors": "Sean Meighoo - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in Callaway Center S104",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_CPLT_389W_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3464, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: S. Meighoo, Status: Open",
    "date_accessed": "2024-03-28"
}