{
    "course_code": "CPLT 490",
    "course_title": "Comparative Literature Major Seminar",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 10",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "(Same as ENG 483R 1)\n\"TEXTS AND/IN WORLDS: PERSPECTIVES FROM COMPARATIVE LITERATURE\" | \nThe Senior Seminar in Comparative Literature is a discussion- and practice-based class. Its primary purpose is to provide a space in which to collectively explore our chosen field of study: what it is about, how it works, and what it is able to do. By considering the underlying assumptions, methods, insights, and potential impact of our field, we will be better able to understand what the work we do means to us, personally and professionally, and what it might mean to the communities and worlds we live in. Along the way, we will work to create the kind of community among ourselves that can sustain, support, and inspire us, intellectually and in many other ways.\n\n\nThrough engaging with a wide and varied range of texts \"literary, critical, and theoretical\" we will practice and hone skills that are at once discipline-specific and transferable to many other academic fields and professional endeavors. We will weigh the yield of different theoretical frameworks; explore how different genres require different readings; and experiment with different modes of presentation (oral, written, visual; individual as well as collaborative).\nGuest presentations from colleagues in, or adjacent to, our primary field of Comparative Literature will offer additional perspectives for our consideration.\n\n\nCourse materials:\nTwo short texts will be required for purchase: Adania Shibli's prose narrative A Minor Detail (2016) and March: Book One, (2013), volume one of the three-volume comic-book rendering of the American Civil Rights Movement by John Lewis, Andrew Aydin, and Nate Powell. Both texts are available through the Emory University bookstore as well as through online vendors. \nAll other readings will be available through electronically either through Course Reserves or \"Files\" on our Canvas site or through web links accessible through any browser.\nA note on materials:\nIn order to best facilitate class discussion, computers and electronic devices are not usually allowed in the class. Please bring hard copies of the assigned readings to class. Exceptions to this rule will be made explicit.\n\n\nAssessment will be based on a combination of written and oral presentations over the course of the semester. Particular emphasis will be placed on an independent research project that you will design and develop over the course of the semester and present in the final week of class. In order to practice effective communication in different media and modes, presentations will be in both oral and written form.",
    "course_description": "Intensive reading of literary and theoretical texts that raise critical issues in the field of Comparative Literature and related disciplines. Note: This course is non-repeatable.",
    "prerequisites": null,
    "instructors": "Angelika Bammer - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Callaway Center S108",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_CPLT_490_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3465, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 10-11:15a, Instructor: A. Bammer, Status: Open",
    "date_accessed": "2024-03-28"
}