{
    "course_code": "SOC 101",
    "course_title": "Intro to General Sociology",
    "credit_hours": "3",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Varies by section",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Social Sciences(*)",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "This class is meant for freshmen and sophomore students only. The waitlist is opened only after these students are enrolled and only rarely will a junior, but not a senior, find a seat off the waitlist.\n\n\nThe purpose of this course is to provide students with a general survey of the field of sociology and an overview of the sociological approach. More importantly, the course is intended to have students think about the social world and our place in it. Major theoretical concepts and methodologies will be examined and illustrated with a wide variety of classic and recent empirical studies. Some of the topics we'll explore include: the influence of society on love and death; the causes and consequences of social inequality (race and ethnic relations; gender relations); and the social definitions of deviant behavior.",
    "course_description": "Study of human social behavior. Social and cultural aspects of the emergence, maintenance, modification, and adjustment of human groups.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": "Varies by section",
    "course_resources": null,
    "sections": "Class Nbr: 3821, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 10-11:15a, Instructor: S. Nalkur, Status: Open\nClass Nbr: 3822, Section #: 2, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: S. Nalkur, Status: Open\nClass Nbr: 3824, Section #: 3, Type: LEC, Campus: ATL, Meets: MW 4-5:15p, Instructor: A. Barra, Status: Wait List\nClass Nbr: 3825, Section #: 4, Type: LEC, Campus: ATL, Meets: MW 10-11:15a, Instructor: A. Churchwell, Status: Wait List",
    "date_accessed": "2024-03-30"
}