{
    "course_code": "SOC 190",
    "course_title": "Fresh Sem: Sociology: Master Trends of Modern Society",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 19 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First Year Seminar",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "The transition from premodern to modern society has been analyzed by virtually every major social theorist from the Enlightenment onward.  In this first-year seminar, we will examine several key dimensions of this change, focusing on five master trends: \n(1) Rationalization.  This refers to a highly general historical process that has permeated all aspects of modern life and which broadly speaking involves the gradual displacement of Tradition by Reason;   \n(2) Individualization.  Another very general and pervasive trend, individualization involves the relative decline of familial influence and the corresponding rise of the individual as the primary unit in modern society;  \n(3) Secularization.  This is a complex set of changes in which religion loses some of its cultural authority to define meaning and purpose;  \n(4) Medicalization.   This is the process by which everyday experiences and conditions come to be defined as medical problems requiring treatment;\n(5) Globalization.   This is an ancient process that has rapidly accelerated in the past century as various kinds of international connections -- economic, political, cultural -- develop and multiply.\n\n\nWe will examine a wide range of specific topics related to these trends, including McDonalds as a model of bureaucratic organization; due process and democracy as basic human rights; fashion as both self-expression and group conformity; deviant behaviors as medical diseases; your morning cup of coffee as a global supply chain; and terrorism as backlash against globalization and secularization.",
    "course_description": "A small class on topics of sociological concern that fosters a highly interactive and mutually collaborative learning environment among students and between students and teachers.",
    "prerequisites": null,
    "instructors": "Jeff Mullis - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Rich Building 103",
    "course_resources": null,
    "sections": "Class Nbr: 3826, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: J. Mullis, Status: Wait List",
    "date_accessed": "2024-03-30"
}