{
    "course_code": "SOC 331",
    "course_title": "The Meaning of Work",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 40 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Irregularly",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "This course will use a sociology of culture approach to explore how the notion of \"work\" is a social construction. The course proceeds in three sections:\n1) Societal Narratives of Work Meaning: The American Dream (Money)\nWe explore the meaning of work through the societal narrative of \"The American Dream.\" We consider how this narrative contains major theoretical and philosophical views on the definition and meaning of \"work\", particularly around notions of money. We also look at counter-narratives.\n2) Social Realities of Work Meaning: Gender, Race, and Class (Power)\nWe study how work is socially constructed around different groups, particularly gender, race, and social class. We look at sociological research that shows how these cultural meanings are embedded in power structures in the U.S. \n3) Creating Work Meaning: Culture and Agency (Purpose)\nWe explore issues of organizational culture and how workers create meaning at work. We also look at how individuals create meaning in their own work and through work identities.\n\n\nAssignments: In-class Small Group Work (graded individually, not as a group), Two Critical Thinking Papers (5-6 pages each) and one Final Paper (8-12 pages). NOTE: No group projects. No exams.",
    "course_description": "This course uses a sociology of culture approach to explore \"work\" as a social construction, in three ways: 1) societal narratives of work meaning: The American Dream (Money); 2) social realities of work meaning: Gender, Race, and Class (Power); 3) agency in creating work meaning (Purpose).",
    "prerequisites": null,
    "instructors": "Tracy L Scott - Primary Instructor",
    "schedule_location": "Varies by section",
    "course_resources": null,
    "sections": "Class Nbr: 3938, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: T. Scott, Status: Wait List\nClass Nbr: 3940, Section #: 2, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: T. Scott, Status: Wait List",
    "date_accessed": "2024-03-30"
}