{
    "course_code": "SOC 343",
    "course_title": "Mass Media And Social Influences",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 90 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "In this course, we examine the nature and impact of mass media in three broad sections with each section devoted, respectively, to media producers, to the content that these producers provide, and to the audiences who interact with that content (and sometimes make their own content in the process). In the first section, we begin by considering the social implications of new forms of media, heeding the roles that competition, technology and regulation played in the historical spread of such forms. This historical perspective, in turn, allows us to make sense of such contemporary media as Netflix and Spotify. We then examine how current media industries are organized, and the implications that this holds for the careers of media workers. In the second section, we focus on the content of media products and investigate factors that promote or inhibit the range of content and representations, as well as the role that media content plays in terms of celebration and commemoration of the past. In the third and final section, we consider the audience that actively engages mass media products. We particularly pay attention to how they use this content to build identity and community, as well as use it to deal with broader social divides.",
    "course_description": "Processes and conditions of opinion formation and change, and the function of opinion in group life.",
    "prerequisites": null,
    "instructors": "Timothy J Dowd - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in White Hall 112",
    "course_resources": null,
    "sections": "Class Nbr: 3941, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: T. Dowd, Status: Open",
    "date_accessed": "2024-03-30"
}