{
    "course_code": "SOC 489W",
    "course_title": "Special Topics in Sociology: Natural Language Processing",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 9 / Seats Avail: 8Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Continuing Communication(*)",
    "permission": "Department Consent Required",
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Same as LING 485W-1 and QTM 490RW-1\n\n\n(Permission Required Prior to Enrollment) Prerequisite 446 Goal. The seminar is a sequel to Soc/Ling/QTM 446 and Soc 585 (Big/Small Data & Visualization). It aims to bring to a co-authored journal submission the work carried out by students in 446/585 on different text corpora. Using a range of NLP tools, students will strive to provide a coherent picture of NLP analytics as these apply to their specific corpus. The course is a 4-credit course. Co-authorship. Co-authors for journal submissions include professor, undergraduate team members, and computer-science students who have helped develop the NLP tools. Graduate students are free to work alone on their corpus with no obligation of shared co-authorship. Teamwork and workload. Students will work in teams, one team per corpus. Teams will be expected to present their work, as a team, every two weeks throughout the semester and present four co-authored drafts of their ongoing work at regular intervals.\nFinal paper and literature review. Since the final paper is expected to be submitted to a journal, the literature review part of the paper will engage both appropriate NLP literature and specific topic literature as appropriate for the corpus (thus, a corpus of country folktales will need to address the literature on folktales). Grading. Final grade will be based on presentations, paper drafts, and final paper.",
    "course_description": "A seminar or lecture series on topics of special sociological concern.",
    "prerequisites": null,
    "instructors": "Roberto Franzosi - Primary Instructor",
    "schedule_location": "W 6pm-9pm in Tarbutton Hall 111",
    "course_resources": null,
    "sections": "Class Nbr: 5893, Section #: 1, Type: LEC, Campus: ATL, Meets: W 6-9p, Instructor: R. Franzosi, Status: Open",
    "date_accessed": "2024-03-30"
}