{
    "course_code": "SOC 489",
    "course_title": "Special Topics in Sociology: Ethnoracial Inequities/Policie",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 19 / Seats Avail: 15Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Course description: This course troubles with the concept of 'ethnoracial justice' by evaluating the philosophies and technologies of policies that shape ethnoracial inequities in the United States. Adopting a \"womb to tomb\" approach, we consider how the sociobiological etiologies of ethnoracial constructs (race, ethnicity, nationality, religion) governs the transitions of the life course (age and cohort) within the context of transformative periods of American history (pre-Civil War, Reconstruction, Jim Crow, Colorblind Racism, post-Racialism). This course grounds radical visions of ethnoracial futures in the racist systemic roots by breaking down how four sedimentations of racism: biological racism, medical racism, cultural racism, and structural racism. Anti-black ethnoracism is centered to understand the pyramidal logics with anti-indigenous and anti-immigrant ethnoracisms. Students will develop a critique of a single public policy, identifying the macrocosms that contextualize the microsystems governing processes of ethnoracialization, the scaffolds of ethnoracial life, and the faces of ethnoracial inequities.",
    "course_description": "A seminar or lecture series on topics of special sociological concern.",
    "prerequisites": null,
    "instructors": "Abigail Sewell - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in Tarbutton Hall 111",
    "course_resources": null,
    "sections": "Class Nbr: 4664, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 1-2:15p, Instructor: A. Sewell, Status: Open",
    "date_accessed": "2024-03-30"
}