{
    "course_code": "SOC 500",
    "course_title": "Research Methods/Models:Statistics",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Description:\nThis course will provide a graduate-level introduction to statistics and their use in the sociology. Students will learn how to  \n(1) identify the appropriate uses of specific statistics (what the statistic is and when to use it) \n(2) demonstrate an understanding of the fundamentals of hypothesis testing \n(3) describe the shape of probability distributions \n(4) use statistical software (Stata) to analyze social science data and meaningfully interpret the results in answer to a research question \n(5) interpret statistics from course examples, Stata output, and published studies  \nBy the end of this course students will have the skills and confidence to conduct and interpret statistical analyses and will be prepared for the Spring regression course.",
    "course_description": "This course is an introduction to descriptive and inferential statistics for bivariate and multivariate analyses. The course will help you understand statistics reported in social science publications and in the news media, as well as help you conduct original research. The overall goal is to increase your statistical literacy - your ability to create, interpret, and critically evaluate statistical evidence. This is a set of skills that you will find highly useful in your current academic life and in your future career. It is also a valuable set of skills for virtually everyone in modern society, as statistical knowledge (and numerical literacy more broadly) is key for making sense of the growing amounts of information that we encounter in a digital world.",
    "prerequisites": null,
    "instructors": "Irene Browne - Primary Instructor",
    "schedule_location": "TTh 8:30am-9:45am in Tarbutton Hall 206",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3949, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 8:30-9:45a, Instructor: I. Browne, Status: Closed",
    "date_accessed": "2024-03-30"
}