{
    "course_code": "TATT 605PSYC",
    "course_title": "Teaching Assistantship",
    "credit_hours": "2",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Varies by section",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Permission Required Prior to Enrollment)",
    "course_description": "The nature of a teaching assistantship varies from department to department. The defining characteristic of this position across all departments and programs is a controlled, carefully monitored initial teaching opportunity. A teaching assistant may be responsible for 10 to 12 hours per week of discussion or laboratory supervision.",
    "prerequisites": "TATT 600 or equivalent transfer credit as prerequisite.",
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 4975, Section #: 1, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: A. Kazama, Status: Open\nClass Nbr: 4985, Section #: 10, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Barber, Status: Open\nClass Nbr: This section is full 4986, Section #: 11, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: D. Dilks, Status: Closed\nClass Nbr: 4987, Section #: 12, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Dugan, Status: Open\nClass Nbr: 4989, Section #: 13, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: S. Goodman, Status: Open\nClass Nbr: This section is full 4990, Section #: 14, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: H. Rodman, Status: Closed\nClass Nbr: 4991, Section #: 15, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: B. Wilson, Status: Open\nClass Nbr: This section is full 4992, Section #: 16, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: I. Waldman, Status: Closed\nClass Nbr: 4998, Section #: 17, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: D. Ren, Status: Open\nClass Nbr: 6225, Section #: 18, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: P. Wolff, Status: Open\nClass Nbr: 4976, Section #: 2, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Dugan, Status: Open\nClass Nbr: 4977, Section #: 3, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: A. Kelly, Status: Open\nClass Nbr: 4978, Section #: 4, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: P. Moon, Status: Open\nClass Nbr: 4979, Section #: 5, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: P. Rochat, Status: Open\nClass Nbr: 4980, Section #: 6, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: E. Respress, Status: Open\nClass Nbr: 4981, Section #: 7, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: H. Miller-Goldwater, Status: Open\nClass Nbr: 4982, Section #: 8, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: D. Edwards, Status: Open\nClass Nbr: 4984, Section #: 9, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: M. Treadway, Status: Open",
    "date_accessed": "2024-03-30"
}