{
    "course_code": "QTM 185",
    "course_title": "Applied Topics in QTM: Data & Decision Making Sports",
    "credit_hours": "2",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 6Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Irregularly",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "The sports industry generates an enormous amount of data today and is constantly growing. Across most organizations, data is massive, in disparate places, and it is unstructured \"which makes it hard to drive meaningful insights.\" This has created a need for data analysts, decision / data scientists, etc. with knowledge of the latest analytical tools and skills to help drive real-time insights from large amounts of raw data. This course centers on understanding the challenges in the sports industry and the role that data, analytics, and tools play in helping organizations make data-based decisions. By the end of the course, students should be able to 1) understand the data and analytics challenges facing the sports industry and most organizations; 2) see practical applications of the role data, analytics, and tools play in helping organizations make data-based decisions; 3) use what you've learned in foundational QTM courses (e.g., QTM 100) in a 1 hour group \"hands on\" sports data project; and 4) understand the need in the workforce of the future for: data analysts, decision / data scientists, etc. who can use the latest data analysis tools to drive insights that inform business strategies and enable making better business decisions.",
    "course_description": "Topics course intended for early-career students. Topics allow students to explore the foundations, theory, and methods of data science, and examine the ways in which data driven solutions power industry, government, and the non-profit sector in an applied setting.",
    "prerequisites": null,
    "instructors": "Renee Ducre - Primary Instructor",
    "schedule_location": "T 6pm-8pm in Math & Science Center - W307C",
    "course_resources": null,
    "sections": "Class Nbr: 1543, Section #: 2, Type: SEM, Campus: ATL, Meets: T 6-8p, Instructor: R. Ducre, Status: Open",
    "date_accessed": "2024-03-30"
}