{
    "course_code": "QTM 398R",
    "course_title": "Peer Mentoring in Statistics",
    "credit_hours": "1-2",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Varies by section",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": null,
    "course_description": "Engage in statistical study and mentor peers in statistics; attend an orientation, develop mentoring skills, have weekly meetings with lecturer, attend one QTM 100 section per week, and hold mentoring sessions for current students. (2 credits)\nOR Aid TA in QTM 100 Lab (1 credit)",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: This section is full 6489, Section #: 1, Type: SEM, Campus: ATL, Meets: Does Not Meet, Instructor: Z. Gong, Status: Closed\nClass Nbr: 6602, Section #: 10, Type: SEM, Campus: ATL, Meets: Does Not Meet, Instructor: G. Sasso, Status: Open\nClass Nbr: 6490, Section #: 2, Type: SEM, Campus: ATL, Meets: Does Not Meet, Instructor: H. Kim, Status: Open\nClass Nbr: 6491, Section #: 3, Type: SEM, Campus: ATL, Meets: Does Not Meet, Instructor: J. Jacobson, Status: Open\nClass Nbr: This section is full 6482, Section #: 5, Type: SEM, Campus: ATL, Meets: Does Not Meet, Instructor: G. Sasso, Status: Closed\nClass Nbr: 6483, Section #: 6, Type: SEM, Campus: ATL, Meets: Does Not Meet, Instructor: A. Sanchez Becerra, Status: Open\nClass Nbr: This section is full 6487, Section #: 7, Type: SEM, Campus: ATL, Meets: Does Not Meet, Instructor: B. Montagnes, Status: Closed\nClass Nbr: This section is full 6488, Section #: 8, Type: SEM, Campus: ATL, Meets: Does Not Meet, Instructor: W. An, Status: Closed\nClass Nbr: 6603, Section #: 9, Type: SEM, Campus: ATL, Meets: Does Not Meet, Instructor: B. Montagnes, Status: Open",
    "date_accessed": "2024-03-30"
}