{
    "course_code": "QTM 490R",
    "course_title": "Advanced Seminar: Quantitative Literary Analysis",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 7 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Graded",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Complete Topic - Quantitative Literary Analysis: Theory and Practice)\nThe use of quantitative methods to study literature raises many questions: What does large-scale analysis reveal that cannot be revealed by reading alone? What happens when literary texts are converted into numbers, as they must be for any quantitative analysis to take place? What does it mean, both ethically and intellectually, to borrow methods developed in industry and the sciences for literary and cultural studies? Can ideas about language, metaphor, style, labor, and power, among others, be quantified, modeled, and/or otherwise explored at scale? \n \nThis course will take on these questions in both theory and practice, first by reading and discussing key texts that explore these questions, and then, as a class, thinking through possible projects in the area of quantitative literary studies that might intervene. The course will culminate in final projects undertaken in small groups, consisting of both graduate students in English (and related programs) and advanced undergraduates in QTM, which demonstrate how quantitative analysis can contribute to current conversations in the field of literary studies and beyond, as well as what those demonstrations reveal about the methods, infrastructure, and conceptual frameworks of quantitative analysis. \nTo be considered for enrollment in this course, please complete the following short questionnaire: https://lkle.in/qtm490",
    "course_description": "Selected advanced topics in quantitative sciences. Open only to junior and senior majors; others by permission of instructor.",
    "prerequisites": null,
    "instructors": "Lauren Klein - Primary Instructor",
    "schedule_location": "T 1pm-3:45pm in Callaway Center C201",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 5823, Section #: 1, Type: SEM, Campus: ATL, Meets: T 1-3:45p, Instructor: Klein/Miller, Status: Wait List",
    "date_accessed": "2024-03-30"
}