{
    "course_code": "EPI 799R",
    "course_title": "Research",
    "credit_hours": "1-12",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": null,
    "course_description": "Dissertation research and preparation for Epidemiology doctoral students in candidacy status.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 5277, Section #: 1, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: N. Gandhi, Status: Open\nClass Nbr: 5286, Section #: 10, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: S. Suglia, Status: Open\nClass Nbr: 5287, Section #: 11, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: V. Vaccarino, Status: Open\nClass Nbr: 5288, Section #: 12, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: K. Wall, Status: Open\nClass Nbr: 5289, Section #: 13, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: L. McCullough, Status: Open\nClass Nbr: 5452, Section #: 14, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Gazmararian, Status: Open\nClass Nbr: 5457, Section #: 15, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: P. Sullivan, Status: Open\nClass Nbr: 5582, Section #: 16, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: T. CLASEN, Status: Open\nClass Nbr: 5278, Section #: 2, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: T. Hartman, Status: Open\nClass Nbr: 5279, Section #: 3, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: P. Howards, Status: Open\nClass Nbr: 5280, Section #: 4, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: S. Jenness, Status: Open\nClass Nbr: 5281, Section #: 5, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: T. Lewis, Status: Open\nClass Nbr: 5282, Section #: 6, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: B. Lopman, Status: Open\nClass Nbr: 5283, Section #: 7, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: M. Kramer, Status: Open\nClass Nbr: 5284, Section #: 8, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Mulle, Status: Open\nClass Nbr: 5285, Section #: 9, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: R. Patzer, Status: Open",
    "date_accessed": "2024-03-30"
}