{
    "course_code": "FILM 285",
    "course_title": "Special Topics: Film and Media: The Diva",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 19Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "MCP elective.\n\n\nThis course examines the history of the diva as a performance figure within media from the late-19th-century to her modern incarnations. In studying this history, we examine how the female performer has offered compelling points of national and global identification on top of solidifying racial and gender ideologies within media industry. We begin tracing the legal rights of the diva within the bolstering of caselaw around ¿the right of publicity¿ before looking at how the diva served as a commodity within the introduction of the phonograph and Hollywood recording industries. Within this context, students examine how the disparate racial identities of the diva were organized by media industries of the period, partly through the racialized logic of commercial music classification, the emergence of blues/jazz music, the introduction of music to Hollywood cinema, and the development of some of the first music videos. Historicizing contemporary ideologies of diva worship through cultural liberalism, students then examine how this figure underwent ideological renovation during the civil rights movements of the 20th-century. This new tradition of celebrity can be observed in divas from this period on like Aretha Franklin, Bette Midler, Grace Jones, Madonna, Jennifer Lopez, Taylor Swift, and Beyoncé. To end, students consider contemporary aspects of female music industry as it intersects with recent developments in touring, music marketing, television, social media, and streaming.",
    "course_description": "Rotating topics in film and media. May be repeated for credit when the topic varies.",
    "prerequisites": "FILM 101 or FILM_OX 101 or equivalent transfer credit as prerequisite.",
    "instructors": "Michael Reinhard - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Rich Building 211\nT 8pm-10pm in White Hall 205",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_FILM_285_4_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3476, Section #: 4, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p; T 8-10p, Instructor: M. Reinhard, Status: Open",
    "date_accessed": "2023-10-31"
}