{
    "course_code": "ECON 799R",
    "course_title": "Dissertation Research",
    "credit_hours": "1-9",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": null,
    "course_description": "Research and writing of a Ph.D. dissertation on a topic previously approved by the Department faculty, under the supervision of a committee appointed with the advice and consent of the faculty. Students may register for this course on an S/U basis only.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 5373, Section #: 1, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: D. Jacho-Chavez, Status: Open\nClass Nbr: 5382, Section #: 10, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: K. Karbownik, Status: Open\nClass Nbr: 5383, Section #: 11, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: J. Rubio Ramirez, Status: Open\nClass Nbr: 5374, Section #: 2, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: E. Pesavento, Status: Open\nClass Nbr: 5375, Section #: 3, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: V. Yue, Status: Open\nClass Nbr: 5376, Section #: 4, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: I. McCarthy, Status: Open\nClass Nbr: 5377, Section #: 5, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: C. Hansman, Status: Open\nClass Nbr: 5378, Section #: 6, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: M. Jones, Status: Open\nClass Nbr: 5379, Section #: 7, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: T. Kim, Status: Open\nClass Nbr: 5380, Section #: 8, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: Z. Fang, Status: Open\nClass Nbr: 5381, Section #: 9, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: K. Kopecky, Status: Open",
    "date_accessed": "2024-03-28"
}