{
    "course_code": "TATT 605PSYC",
    "course_title": "Teaching Assistantship",
    "credit_hours": "2",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Varies by section",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "Varies by section",
    "course_description": "The nature of a teaching assistantship varies from department to department. The defining characteristic of this position across all departments and programs is a controlled, carefully monitored initial teaching opportunity. A teaching assistant may be responsible for 10 to 12 hours per week of discussion or laboratory supervision.",
    "prerequisites": "TATT 600 or equivalent transfer credit as prerequisite.",
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 3666, Section #: 1, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: A. Kazama, Status: Open\nClass Nbr: 3667, Section #: 10, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: P. Rochat, Status: Open\nClass Nbr: 3668, Section #: 11, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: K. Wallen, Status: Open\nClass Nbr: 3669, Section #: 12, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: H. Rodman, Status: Open\nClass Nbr: 3670, Section #: 13, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: B. Wilson, Status: Open\nClass Nbr: 3671, Section #: 14, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: Y. Cheong, Status: Open\nClass Nbr: 3672, Section #: 2, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: A. Kelly, Status: Open\nClass Nbr: 3673, Section #: 3, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: S. Botto, Status: Open\nClass Nbr: 3674, Section #: 4, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: S. Goulding, Status: Open\nClass Nbr: 3675, Section #: 5, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: E. Kim, Status: Open\nClass Nbr: 3676, Section #: 6, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: L. Nygaard, Status: Open\nClass Nbr: 3677, Section #: 7, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: E. Walker, Status: Open\nClass Nbr: 3678, Section #: 8, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: J. Barber, Status: Open\nClass Nbr: 3679, Section #: 9, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: P. Kragel, Status: Open",
    "date_accessed": "2024-03-30"
}