{
    "course_code": "PORT 101",
    "course_title": "Elementary Portuguese I",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 11Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall",
    "requirement_designation": "Humanities, Arts, Language [Foreign Language]",
    "permission": null,
    "dates": "2021-05-17 through 2021-06-23",
    "class_notes": "This course helps students develop a basic ability to communicate in Portuguese. Class time is dedicated to interactive activities that allow students to acquire skills in speaking, listening, reading and writing. Through music, videos, and readings of authentic materials, students are also introduced to many aspects of Brazilian culture as well as that of other countries where Portuguese is spoken. Class is conducted in Portuguese to maximize exposure to the language. Students who are Spanish speakers or/and have placed above Span 212 in the Spanish Placement Test are not allowed to take Port 101. They should register for Port 110. PARTICULARS: Evaluation is based on daily and active participation, homework, quizzes, writing activities, exams, final presentation, and Portuguese program activities.\n\n\nThis is an online course. Emory College Online summer courses have required synchronous/live sessions every week. Students must be available to sign into and virtually attend the course online during those times (noted as the course meeting times- all times listed are local to Atlanta). Each course will also involve significant asynchronous material that you access on your own time in addition to standard amounts of readings and course assignments. Students should plan to spend 15-20 hours/week on this course. Please also be aware that faculty will begin corresponding with students during Week Zero of the course (one week before the official start date of the course), and that some interaction with the course may be required at that time. Students should begin checking the Canvas course site regularly one week prior to the official start of the term.",
    "course_description": "The first half of a yearlong introductory course designed to train students to understand, speak, read, and write Portuguese.",
    "prerequisites": null,
    "instructors": "Marilia Ribeiro - Primary Instructor",
    "schedule_location": "TTh 10:15am-12:15pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 1310, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 10:15a-12:15p, Instructor: M. Ribeiro, Status: Open",
    "date_accessed": "2024-03-30"
}