{
    "course_code": "WR 630",
    "course_title": "Sacred Spaces Jud.Christ&Islam",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 27 / Seats Avail: 19",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-05-16 through 2022-05-27",
    "class_notes": "(ON CAMPUS)(site visits on some days may require variations on arrival/ departure times)\n(In this course, we take advantage of the summer school schedule, as well as the rich resources of the city of Atlanta, to explore religious architecture in four major world religions: Hinduism, Judaism, Christianity and Islam. Taking worship spaces as our focal point and common criterion allows us to compare and contrast different religious traditions and practices. This approach deepens our awareness and appreciation of the impact of space on ritual practices and spiritual experiences.  The intent of this class is to prepare leaders of the Church in the United States in the 21st century, a context that is both increasingly pluralistic and technologically fluid. Christian ministry best suited for this context is one that can find common touchstones for inter-faith dialogue and cross-community collaboration, while remaining deeply and reflectively rooted in a particular tradition and identity. Christian ministry that can embody its faith commitments in the way it exercises stewardship of its resources, including its building, is a ministry able to flourish in this context. For students from non-theology majors, the course complements their scientific and/or humanities focus with a heightened sensitivity for the spiritual and spatial dimensions of contemporary everyday spaces and design artifacts.)",
    "course_description": "This course uses the lens of religious architecture and ritual practice to study and compare several major world religions, including Judaism, Islam, Christianity and Hinduism. Students are able to develop a deeper understanding of other religions and gain an awareness of the theological significance of how believers use space to worship the divine.",
    "prerequisites": null,
    "instructors": "Hazem Ziada - Primary Instructor",
    "schedule_location": "MTWThF 1pm-5pm in Rita Anne Rollins Building_322",
    "course_resources": null,
    "sections": "Class Nbr: 1772, Section #: 1, Type: LEC, Campus: ATL, Meets: MTWThF 1-5p, Instructor: H. Ziada, Status: Open",
    "date_accessed": "2024-03-30"
}