{
    "course_code": "ENVS 190",
    "course_title": "Fresh Sem:Environmentl Studies: Anthropology & the Environment",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Same as ANT 190 2)\n\n\n(Freshmen Only)\nThis freshman seminar draws upon anthropological, historical, film, and literary sources to examine the dynamic relationship between human beings and their natural worlds. We will trace debates in cultural anthropology and political ecology to examine how humans understand, engage, and interact with and through their environments. This course does not offer a biological approach to the study of ecosystems; rather it draws on the social sciences and humanities to explore the diversity of ways in which people have conceptualized the environment and environmental issues, and the politics that have structured this diversity.  A primary focus will be on theories about the relationship between people, nature, place and the cultural forms through which they interrelate. \nWe will ask: How do different groups of people around the world understand the relation between human/non-human, nature/culture, and why does this matter? How have understandings of basic elements of human existence 'land, water, and air' varied across time and place? How do diverse groups manage their environment through social and political organization, subsistence and social practice, and technological innovation? And how are people around the world and here in Atlanta experiencing, producing, and fighting against toxicity, climate change, and environmental degradation? Students will participate in short on-campus field trips to explore their own situatedness in place, nature, and environmental practice.",
    "course_description": "The topics for freshman seminars are variable and change every semester. Past offerings include Climate Change, Global Earth Systems, Interpreting Behavior That You Can't See, Ecological Economics, Plants, People and Places and Ecological Restoration.",
    "prerequisites": null,
    "instructors": "Kristin D Phillips - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in Anthropology Building 105",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 5923, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 10-11:15a, Instructor: K. Phillips, Status: Wait List",
    "date_accessed": "2024-03-30"
}