{
    "course_code": "GH 522",
    "course_title": "Qualitative Methods for Research in Global Health",
    "credit_hours": "3",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-01-10 through 2022-04-25",
    "class_notes": null,
    "course_description": "This course will provide students with practical skills and theoretical principles for conducting and evaluating qualitative research. Weekly sessions will focus on different tasks in the process of conducting qualitative research. This course will include theory and concepts underpinning qualitative research, qualitative research design, ethical considerations and challenges, instrument design, key data collection methods used in public health (interviewing, group discussions and observations), and summarizing and presenting data. The course provides instruction on the challenges of applying qualitative methods in international settings and guidance on fieldwork planning and implementation to assist students in preparing for their practicum activities. This course uses a variety of approaches to foster the development of practical skills in qualitative research; formal lectures, interactive group sessions, discussions with experts, and task-based assignments. This course is a prerequisite for Qualitative Data Analysis (GH525).",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": "Varies by section",
    "course_resources": null,
    "sections": "Class Nbr: 2278, Section #: 1, Type: LEC, Campus: ATL, Meets: M 3-4:50p; M 5-5:50p, Instructor: Team, Status: Open\nClass Nbr: 2280, Section #: 2, Type: LEC, Campus: ATL, Meets: M 8-9:50a; M 3-3:50p, Instructor: Team, Status: Open\nClass Nbr: 6084, Section #: 3, Type: LEC, Campus: ATL, Meets: W 3-5:50p, Instructor: Team, Status: Open",
    "date_accessed": "2024-03-30"
}