{
    "course_code": "ARTHIST 103",
    "course_title": "Understanding Architecture",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 24 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "Architecture is a branch of knowledge that relies on abstract graphic and material conventions to convey its content. The ability to 'read' architecture, a language comprised of drawings, models, renderings, photographs, films, buildings, and landscapes, is a skill that must be acquired. This course is organized by the primary forms of architectural representation to cultivate in students new modes of seeing the built environment through mastery of architectural conventions. Lectures focus on design projects that highlight the potential of the representational tool in question, and seminal readings introduce students to varying modes of architectural writing. Course work includes reading responses, discussions, and hands-on drawing and modeling projects. We will study architecture as a process of imagination, design, negotiation, construction, and reception, and will explore critical and social issues of space, representation, and meaning. Class size is limited to allow for group pin-ups and reviews. \nArchitectural Studies minor: core requirement\nArt History major/minor: makers & materials course",
    "course_description": "An introduction to architecture considering the built environment we experience daily as well as historical buildings and practices. We will study architecture as a process of design, negotiation, construction, and reception and explore critical and social issues of representation and meaning.",
    "prerequisites": null,
    "instructors": "Christina Crawford - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in Math & Science Center - W307C",
    "course_resources": null,
    "sections": "Class Nbr: 3338, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 10-11:15a, Instructor: C. Crawford, Status: Open",
    "date_accessed": "2024-03-30"
}