{
    "course_code": "ARTHIST 221",
    "course_title": "Art & Architecture of Ancient Greece",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 2",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Same as CL 221 1)\n\n\nGreek Art and Architecture in the Age of the City-State (1050-323 BCE)\nFor good and ill, the art and architecture of the ancient Greeks has been conceived of as foundational for the development of \"Western\" Art. The Parthenon, the Diskobolos, and other works and imitations define modern cityscapes and museums, forming an apparently coherent style that would be challenged, revived, and reinterpreted over the centuries.\n \nYet, the actual history of ancient Greek material culture is a far more complex.  This course provides an in-depth survey of the art, architecture, and broader cultural practices of the ancient Greeks from the Early Iron Age to the rise of Alexander the Great and the creation of the Hellenistic World (1050-323 BCE). We will consider not only the city-states of the Aegean world, but also the traditions of Greek communities from Spain in the west to the Black Sea and Egypt in the east. With a coherent \"Greek\" identity evolving only later in our period of study, we will consider how shared social, artistic, and cultural practices, as evidenced in new archaeological discoveries, allow us to grapple with who the ancient Greeks were.\n \nThe course will consist of lectures, structured discussions of scholarly articles and controversial case studies, and engagement with craft practices. Students will gain hands-on experience working with ancient Greek objects in the Carlos Museum.",
    "course_description": "An investigation of ancient Greek art and architecture from its Iron Age beginnings through the legacy of Alexander the Great, concentrating on the creation of monumental stone sculpture and ordered buildings, visual interpretation of Greek mythology, and the interaction of art, ritual and politics.",
    "prerequisites": null,
    "instructors": "Andrew Ward - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in White Hall 207",
    "course_resources": null,
    "sections": "Class Nbr: 5183, Section #: 2, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: Ward/Kylindreas, Status: Open",
    "date_accessed": "2024-03-30"
}