{
    "course_code": "ARTHIST 349RW",
    "course_title": "Spec Stud:Renaissance Art History: Age of Michelangelo",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "Following the trajectory of Michelangelo's life as a painter, sculptor and architect, this course will visit the various contexts that informed his art and that of the other artists of his time. Beginning with Michelangelo's early practice as protégé of Lorenzo de Medici in late fifteenth-century Florence, the course will then move to Rome to consider his work and that of the other artists, including Raphael, who were drawn to Rome in the early 15th century. While in Rome, we will consider how artists of the time reacted to the unearthing of famous antique sculptures like the Laocoön. We will also explore how the establishment of major workshops and canonical values in Rome became a point of contention for artists working outside the city in places like Venice, the home city of Titian, whose long life and career as a painter overlapped chronologically with Michelangelo's, and whose art came to represent alternatives in the increasingly cosmopolitan court centers of Europe. Finally, we will return to Florence and consider the long shadow cast by Michelangelo and his growing myth on the practice and emerging mythology of Florentine art. Among other things we will consider upon returning to Florence is how the sculptor, Benvenuto Cellini, set himself and his metal casting abilities in dramatic opposition to the traditions of marble sculpture perpetuated by Michelangelo's followers in that city.\nArt History major/minor: Division II",
    "course_description": "Topics in Italian or Northern art, ranging from Giotto to Pieter Bruegel. From artistic centers such as Florence, Rome, and Venice, to Bruges, Antwerp, and Haarlem. May be repeated for credit when topic changes up to a maximum of twelve hours.",
    "prerequisites": null,
    "instructors": "C Jean Campbell - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Rich Building 211",
    "course_resources": null,
    "sections": "Class Nbr: 3362, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: C. Campbell, Status: Open",
    "date_accessed": "2024-03-30"
}