{
    "course_code": "ARTHIST 369R",
    "course_title": "Spec Stud:19th/20th Cent Art: The Architect + the City",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 3Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "Because the discipline of urban design did not emerge until the 1950s, architects long enjoyed a cultural position of expertise on city-building issues. But what are the benefits and pitfalls of framing the city as a discrete design problem? Architectural thinking is the lens through which the history of 20th century urbanization will be viewed in this course, which relies on primary textual and material evidence produced by design protagonists. Original texts written by architects will establish theoretical bases for lectures on specific urban interventions, and both built and unbuilt projects will be explored within the context of these claims. Each typical week will be composed of one lecture and one discussion session. A combination of weekly short writing assignments, presentations, discussion leading responsibilities, and one longer research paper will encourage students to speak and write critically about the various scales of environmental design, from the building, to the city, to the region.\nArt History major/minor: Division III\nArchitectural Studies minor: elective",
    "course_description": "Possible topics include Post-Impressionism and its consequences; Matisse &amp; Picasso; Art and Politics between the Wars; Dada and Surrealism; the Avant-Garde; Abstract Art; What is Art?; Theories of Modernism. May be repeated for credit when topic changes, up to a maximum of twelve hours.",
    "prerequisites": null,
    "instructors": "Christina Crawford - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Math & Science Center - W307C",
    "course_resources": null,
    "sections": "Class Nbr: 3363, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: C. Crawford, Status: Open",
    "date_accessed": "2024-03-30"
}