{
    "course_code": "ARTHIST 329",
    "course_title": "Topics: Art of Class Antiquity: Crafting Identity in Anc Rome",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 11Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Same as CL 329R 1)\n\"Crafting Identity in Ancient Rome\" \nThe Latin epic poet Vergil wrote that Rome's great strength was governing others who produced art for them. This was empire. The historian Tacitus too identifies in his narratives the processes of assimilation into the imperial world through increasing use of Roman visual culture and luxuries: \"The toga became fashionable. And little by little they were led to the temptation of vices: the lounge, the bath, the elegant banquet, all this in their ignorance they called civilization when it was in fact a part of their servitude.\" Taking up themes of imperialism, enslavement, assimilation, and acculturation, this course explores the various strategies used to craft and curate complex identities in Roman art and architecture. In this course we will observe, describe, and analyze individual and communal expressions of Romanitas, or what it meant to be Roman, or not, according to the people's collectively assumed social, political, and ethical principles. By exploring how social status, ethnic markers, sexuality, gender, and relationships were depicted throughout the Roman world, we will uncover a range of historical artistic practices for achieving cultural inclusion and exclusion. \nArt History major/minor: Division I",
    "course_description": "Topics could include ancient sanctuaries; early Greece: real and imagined and religious festivals; myth and art in ancient Greece; and Greek architecture. May be repeated for credit when topic changes, up to a maximum of twelve hours.",
    "prerequisites": null,
    "instructors": "Cody Houseman - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in Math & Science Center - N302",
    "course_resources": null,
    "sections": "Class Nbr: 5185, Section #: 3, Type: LEC, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: C. Houseman, Status: Open",
    "date_accessed": "2024-03-30"
}