{
    "course_code": "ARTHIST 329W",
    "course_title": "Topics: Art of Class Antiquity: Greek and Roman Gems",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 4 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Same as CL 329RW 1)\n\n\n\"Classical Antiquity in Miniature: Greek and Roman Gems\"Ancient Greek and Roma gems represent a rich microcosm of classical artistic production. Carved out of semi-precious stones such as sardonyx, amethyst, turquoise and rock crystal, cameos and intaglios depict a diverse array of imagery including mythological figures, animals, fantastic creatures, and portraits. Gems were produced for, collected and worn by a wide range of ancient society from prosperous middle class patrons through Hellenistic monarchs and Roman emperors. The Michael C. Carlos Museum has a very large and significant collection of Greek and Roman gems. The seminar will trace the history, development, iconography, and context of ancient cameos and intaglios through the Carlos gems in close conjunction with the exhibition, \"Making an Impression: The Art and Craft of Ancient Engraved Gemstones\" at the Carlos. Issues of conservation, collecting, and display will also be addressed. Students will work closely with individual gems throughout the semester.\nArt History major/minor: Division I\nArt History major with Museums Concentration: elective",
    "course_description": "Topics could include ancient sanctuaries; early Greece: real and imagined and religious festivals; myth and art in ancient Greece; and Greek architecture. May be repeated for credit when topic changes, up to a maximum of twelve hours.",
    "prerequisites": null,
    "instructors": "Eric Varner - Primary Instructor",
    "schedule_location": "T 1pm-3:45pm in Carlos Museum - Tate",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3949, Section #: 1, Type: LEC, Campus: ATL, Meets: T 1-3:45p, Instructor: E. Varner, Status: Wait List",
    "date_accessed": "2024-03-30"
}