{
    "course_code": "ARTHIST 480RW",
    "course_title": "Sem:Late18th Cont Eur&Am Art: Americans in Paris",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 2Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "Americans in Paris\n\"It sounds like a paradox,\" wrote the novelist Henry James in 1887, \"but it is a very simple truth, that when to-day we look for `American art,\" we find it mainly in Paris, In the decades between the Civil War and the first World War, unprecedented numbers of American artists flocked to Paris, the art capital of Europe. Knowing they would be compelled to compete with the French academic painters whose works were being avidly collected in the United States, young Americans enrolled in the prestigious École des Beaux-Arts or in private studios and academies; once established in their careers, American artists dreamed of exhibiting at the Paris Salon to burnish their reputations with cosmopolitan credentials. This seminar focuses on the experiences and achievements of those Paris-trained American artists of the Gilded Age, exploring their artistic education, their response to contemporary European art, their summers painting in the country, and their contributions to French exhibitions and world's fairs; ultimately, the seminar considers how the American artists' time abroad inspired their political activism when war broke out in Europe. To consolidate an understanding of the leading painters of the period, the seminar will travel to Washington, D.C., to view works by Whistler, Sargent, and Cassatt at the National Gallery of Art and the Freer Gallery of Art.\nArt History major/minor: Division III Art History major with Museums Concentration: elective",
    "course_description": "Advanced seminar with emphasis on critical texts, methods, and techniques of art historical investigation. Permission from instructor required.",
    "prerequisites": null,
    "instructors": "Linda Merrill - Primary Instructor",
    "schedule_location": "T 10am-12:45pm in Woodruff Library 874",
    "course_resources": null,
    "sections": "Class Nbr: 3941, Section #: 1, Type: SEM, Campus: ATL, Meets: T 10a-12:45p, Instructor: L. Merrill, Status: Open",
    "date_accessed": "2024-03-30"
}