{
    "course_code": "ARTHIST 480RW",
    "course_title": "Sem:Late18th Cont Eur&Am Art: Postwar/Contemp.German Art",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 8 / Seats Avail: 7",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "\"Postwar / Contemporary German Art\"This seminar will explore West German art from circa 1950 to the present. We will consider defining debates about the direction of art in the wake of National Socialism. For instance, is art obliged to confront the past or can it commence from a so-called Stunde Null (zero hour)? Close consideration of the oeuvres of Joseph Beuys, Gerhard Richter, Georg Baselitz, Bernd and Hilla Becher, Hanne Darboven and others will ground us in specific artistic practices even as it opens onto broader questions of art's responses to social, economic, and political contexts, from the FRG's rapid economic growth under the Marshall plan to the traumatic events of the German Autumn, from the rise of the Berlin Wall to reunification, from the guest worker program of the 1950s and 60s to the influx of migrants and refugees since 2015. This seminar coincides with the Corinth Colloquium in German Modernism, an event in October, during which some of the field's top scholars will present their work. \nArt History major/minor: Division III",
    "course_description": "Advanced seminar with emphasis on critical texts, methods, and techniques of art historical investigation. Permission from instructor required.",
    "prerequisites": null,
    "instructors": "Lisa Lee - Primary Instructor",
    "schedule_location": "M 1pm-3:45pm in Carlos Hall Conference",
    "course_resources": null,
    "sections": "Class Nbr: 3942, Section #: 2, Type: SEM, Campus: ATL, Meets: M 1-3:45p, Instructor: L. Lee, Status: Open",
    "date_accessed": "2024-03-30"
}