{
    "course_code": "ARTHIST 475RW",
    "course_title": "Sem:Med/Euro/Renais/Baroque Art: Medieval Bestiary",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 8 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "Gargoyles, griffins, manticores, babewyns, dragons, snails, and even domestic cats inhabit all kinds of medieval art, jostling for attention with its religious subjects.  The twelfth-century cleric Saint Bernard, whose detailed descriptions nonetheless betray a great attraction to the artistic creations, decried the \"comely deformity and deformed comeliness\" of the hybrid creatures carved in his cloister.  Yet medieval writers also found profound moral and mystical implications in the lore of the natural world.  This course will explore animal imagery in all media throughout the Middle Ages, but will focus on the bestiaries, the medieval illuminated books dedicated to animals. It is a literature greatly enhanced by scholarship associated with the Animal Turn, which seeks to recognize the massive interdependence of the human and animal realms. Major themes of the course include the importance of the ancient legacy and how it was adapted and transformed by medieval theologians and artists; the rising rates of literacy for which medieval bestiaries may have been instrumental; and the importance of contextualized study.\nArt History major/minor: Division II",
    "course_description": "Advanced seminar with emphasis on critical texts, methods, and techniques of art historical investigation. For art history majors; open to others with permission from the instructor.",
    "prerequisites": null,
    "instructors": "Elizabeth Pastan - Primary Instructor",
    "schedule_location": "T 1pm-3:45pm in Carlos Hall Conference",
    "course_resources": null,
    "sections": "Class Nbr: 3940, Section #: 2, Type: SEM, Campus: ATL, Meets: T 1-3:45p, Instructor: E. Pastan, Status: Open",
    "date_accessed": "2024-03-30"
}