{
    "course_code": "ARTHIST 759R",
    "course_title": "Seminar: 17th c./18th c. Art/Arch: Fiction-Making in the Vis Arts",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 4 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "LOCATION:  The Fox Center, 1635 N. Decatur, Room 101\nThe power to visualize myths, fables, and other sorts of fictional tales; affabulationes in Latin, favole in Italian, visieringhen in Dutch, constitutes one of the key links between poetry and painting.  Anchored in the imaginative faculty, the painter's ability to generate such fictions, to bring them to life in ways plausible and persuasive, served to demonstrate a ready command of poetic invention, as well as familiarity with a range of rhetorical devices, especially the major tropes: simile, metaphor, ekphrasis, allegory, prosopopoeia, syllepsis, metonymy, and synecdoche.  The term fable encompasses a wide range of pictorial types, from Illustrations of Ovid's Metamorphoses to newly coined allegories, sacred and/or profane.  The seminar examines various kinds and degrees of fictional image-making between the mid-fifteenth and mid-seventeenth centuries, focusing on key works by Botticelli, Mantegna, Raphael, Michelangelo, Dürer, Gossart, Floris, Goltzius, Cornelis Corneliszoon, Bloemaert, Rubens, Rembrandt, and Velázquez.\n\n\nRoom: Fox Center Seminar Room (1635 N. Decatur Road, Rm 101)",
    "course_description": "Advanced seminar on 17th and 18th century art and/or architecture with emphasis on critical texts, methods, and techniques of art historical investigation. For art history majors; open to others with permission from the instructor.",
    "prerequisites": null,
    "instructors": "Walter S Melion - Primary Instructor",
    "schedule_location": "Th 10am-12:45pm",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3945, Section #: 1, Type: SEM, Campus: ATL, Meets: Th 10a-12:45p, Instructor: W. Melion, Status: Closed",
    "date_accessed": "2024-03-30"
}