{
    "course_code": "GRK 201",
    "course_title": "Intermediate Greek: Prose",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 12",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "Humanities, Arts, Language [Foreign Language]",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "GRK 201: Intermediate Greek: Prose\t\t\t\nMWF 1 (in person) \nContent: This course offers students a review of grammar and an introduction to Greek prose through selections from the works associated with the second century AD sophist, Lucian of Samosata. We will begin with Lucian's Dialogues of the Dead (imagined chats in the Underworld with notables of myth and history) and, based on time and interest, may move on to The Ass, the adventures of one Lucius, magically and accidentally transformed into an ass.\nText: \tLucian's Dialogues of the Dead: An Intermediate Greek Reader: Greek Text with Running Vocabulary and Commentary, ed. S. Nimis and E. Hayes (Faenum Publishing, 2015) ISBN: 978-1940997100\nRecommended:\n\tL. Pratt, The Essentials of Greek Grammar: A Reference for Intermediate Readers of Attic Greek (University of Oklahoma Press, 2011) ISBN: 978-0806141435\nPossible Text (but do not purchase yet):\n\tLucian's The Ass: An Intermediate Greek Reader: Greek Text with Running Vocabulary and Commentary, ed. S. Nimis and E. Hayes (Faenum Publishing, 2012) ISBN: 978-0983222828\nParticulars:  occasional quizzes, three (possibly four) tests, and a final examination. Classwork and homework are important components of the final grade.",
    "course_description": "A review of grammar and introduction to Greek prose through selections from one or more authors such as Plato, Herodotus, Lysias, and Xenophon.",
    "prerequisites": null,
    "instructors": "Niall W Slater - Primary Instructor",
    "schedule_location": "MWF 1pm-1:50pm in Candler Library 222A",
    "course_resources": null,
    "sections": "Class Nbr: 2151, Section #: 1, Type: LEC, Campus: ATL, Meets: MWF 1-1:50p, Instructor: N. Slater, Status: Open",
    "date_accessed": "2024-03-30"
}