{
    "course_code": "ENGRD 349W",
    "course_title": "Writing for Publication",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Continuing Writing Requirement",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(This course will prepare you as a writer to participate in the world of non-fiction publication by developing your prose in various genres with an eye to sending that work to publishers for consideration. Additionally, you will learn about the mechanics of publication, the various forums and opportunities for publication, and even hear about the kinds of jobs available in the publishing industry, such as editing. You will do a mini-internship, seeing their work into print with The Wheel or another venue. You will also polish something already written for submission to an academic journal or contest. Finally, you will develop a full book proposal for a particular non-fiction market. The course is not about the actual production process, but rather the front end of publishing, the relationship between a writer and potential readers. No books required for class.)",
    "course_description": "Hands-on exploration of the editorial and publication process shaping different fields, genres and venues. Focus on mechanics of publication, various forums and opportunities for publication germane to student work in different disciplines, and professional opportunities in non-fiction publishing.",
    "prerequisites": null,
    "instructors": "Joonna Trapp - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Callaway Center S109",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2971, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: J. Trapp, Status: Closed",
    "date_accessed": "2024-03-30"
}