{
    "course_code": "CHN 375W",
    "course_title": "Topics in Chinese Studies: Between Cultures and Cuisines",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 9Waitlist Total: 0, Auto-Enroll",
    "waitlist_total": ": 0, Auto-Enroll",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": "HAPW w/Race & Ethnicity Req.",
    "permission": null,
    "dates": "2024-05-14 through 2024-05-31",
    "class_notes": "Between Cultures and Cuisines: Chinese Americans and Chinese American Food- Chinese food is among the most popular ethnic cuisines in America. The development and ascent of Chinese food in America are the results of the tremendous and sustained efforts of Chinese immigrants in adapting, preserving, and promoting their cuisines. Meanwhile,  attitudes about Chinese food in America have reflected broader political trends and societal sentiments toward the Chinese and Asian American population.  \nIn this 4-credit writing intensive course, Chinese American food is utilized as a medium to better understand the historical, political, social, and cultural aspects of Chinese immigration and community life. Through close readings of Chinese immigrant experiences, stories of Chinese restaurants and Chinese foods in America, students investigate the politics and poetics of Chinese American foodways and develop an understanding of the interplay between Chinese American food, racial politics in America, and the changes within the Chinese American population itself. \nThe course meets online via Zoom for two hours Monday through Friday during Maymester. In addition to online classes, students are also expected to engage in experiential learning by cooking a Chinese American dish, visit local Chinese restaurants, and/or interviewing Chinese immigrants.\n\n\nThis is an online course. Emory College Online summer courses have required synchronous/live sessions every week. Students must be available to sign into and virtually attend the course online during those times (noted as the course meeting times- all times listed are local to Atlanta). Each course will also involve significant asynchronous material that you access on your own time in addition to standard amounts of readings and course assignments. Students should plan to spend 15-20 hours/week on this course. Please also be aware that faculty will begin corresponding with students during Week Zero of the course (one week before the official start date of the course), and that some interaction with the course may be required at that time. Students should begin checking the Canvas course site regularly one week prior to the official start of the term.",
    "course_description": "Study of Chinese language, literature, thought or culture, alone or in conjunction with other literary or cultural trends. Topics to be announced in advance.",
    "prerequisites": null,
    "instructors": "Hong Li - Primary Instructor",
    "schedule_location": "MTWThF 10am-12pm in ONLINE",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_CHN_375W_1_A24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 1360, Section #: 1, Type: LEC, Campus: ATL, Meets: MTWThF 10a-12p, Instructor: H. Li, Status: Open",
    "date_accessed": "2024-03-29"
}