{
    "course_code": "CHN 273",
    "course_title": "The Heritage of China",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 15",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Summer",
    "requirement_designation": "Humanities and Arts(*)",
    "permission": "Department Consent Required",
    "dates": "2024-05-17 through 2024-08-07",
    "class_notes": "(Same as EAS 273 900)\nStudy Abroad. Course meets abroad from June 16 - August 10, 2024. Apply online at www.studyabroad.emory.edu.\n\n\nTopic for Summer 2024: Old Tales Retold -Tradition, Transformation, and Modern Appropriations of Popular Chinese Folktales \nIn this course we will explore the richness of traditional Chinese tales spanning across past and present times. We will focus on the so-called four great folktales of China as a window into the variety of the Chinese cultural tradition and its ever-changing significance in the contemporary world. From the military and sartorial exploits of Mulan and the filial feats of Dong Yong, to the tragic romance of Liang Shanbo and Zhu Yingtai, to the protean transformations of the White Snake, we will trace the curious trajectories taken by each of these tales along the centuries and across different media, including ritual performance, theater, film, and visual arts and crafts. Delving into these tales and their evolution will allow us to explore how traditional and modern Chinese societies have treated key cultural issues including gender roles, family and kinship, sexuality, folk religion, filial piety, and human/non-human interaction. With its dynamic intertwining of tradition and modernity, Taipei makes for an ideal setting to explore the vitality and transformation of these popular narratives.",
    "course_description": "This course is a general introduction to Chinese history, culture and literary tradition. It is designed to acquaint the students to ideas, institutions, aspects of life, literature and arts that are essential to an educated understanding of the Chinese world.",
    "prerequisites": null,
    "instructors": "Maria Franca Sibau - Primary Instructor",
    "schedule_location": null,
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_CHN_273_900_A24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 1623, Section #: 900, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: M. Sibau, Status: Open",
    "date_accessed": "2024-03-29"
}