{
    "course_code": "TATT 605PSYC",
    "course_title": "Teaching Assistantship",
    "credit_hours": "2",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Varies by section",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-01-10 through 2022-04-25",
    "class_notes": "(S/U Only)\n\n\n(Permission Required Prior to Enrollment)",
    "course_description": "The nature of a teaching assistantship varies from department to department. The defining characteristic of this position across all departments and programs is a controlled, carefully monitored initial teaching opportunity. A teaching assistant may be responsible for 10 to 12 hours per week of discussion or laboratory supervision.",
    "prerequisites": "TATT 600 or equivalent transfer credit as prerequisite.",
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 1878, Section #: 1, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: A. Kazama, Status: Open\nClass Nbr: 1887, Section #: 10, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: P. Wolff, Status: Open\nClass Nbr: This section is full 1888, Section #: 11, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: S. Goodman, Status: Closed\nClass Nbr: This section is full 1889, Section #: 12, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: P. Rochat, Status: Closed\nClass Nbr: 1890, Section #: 13, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: D. Maney, Status: Open\nClass Nbr: 1891, Section #: 14, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Manns, Status: Open\nClass Nbr: 1892, Section #: 15, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: H. Rodman, Status: Open\nClass Nbr: 1893, Section #: 16, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Barber, Status: Open\nClass Nbr: This section is full 1894, Section #: 17, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: J. McDowell, Status: Closed\nClass Nbr: This section is full 1895, Section #: 18, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: I. Waldman, Status: Closed\nClass Nbr: 1879, Section #: 2, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: R. Hampton, Status: Open\nClass Nbr: 1880, Section #: 3, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: A. Tasimi, Status: Open\nClass Nbr: 1881, Section #: 4, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: E. Kim, Status: Open\nClass Nbr: 1882, Section #: 5, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: S. Botto, Status: Open\nClass Nbr: 1883, Section #: 6, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: D. Edwards, Status: Open\nClass Nbr: 1884, Section #: 7, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: E. Walker, Status: Open\nClass Nbr: 1885, Section #: 8, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: P. Palmer, Status: Open\nClass Nbr: 1886, Section #: 9, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: S. Hamann, Status: Open",
    "date_accessed": "2024-03-30"
}