{
    "course_code": "ARTHIST 221",
    "course_title": "Art & Architecture of Ancient Greece",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "\"Making and Breaking Rules: Greek Art and Architecture in Transformation\"Ancient Greek artists and architects invented modes of visual expression that surround us today; ancient Greek myths and legends permeate our popular culture and resonate with our profoundest experiences as human beings. In this class, we investigate the fundamental highlights and transformations within the Greek visual arts and material culture from the emergence of communities in the early Iron Age to the Hellenistic world launched by Alexander the Great, using art, architecture, everyday objects and landscapes. Key themes include the decision to make the human form in imitation of nature; to invent systems of columnar architecture constructed with submillimeter accuracy; to decorate precious, mundane, and monumental objects with mythological creatures and heroic narratives; and to build urban and sacred environments that exploited the natural grandeur of the rugged terrain. We will work across media ranging from clay and thatch to marble, gold, and ivory. Throughout, we will focus on questions of interpretation, archaeological and art historical practice, ethics, and how recent archaeological discoveries are transforming our understanding of the Greek world.\nThe course will consist of lectures, discussions, case studies, and projects. Students will gain hands-on experience working with ancient Greek objects in the Carlos Museum.\n\n\nSame as CL 221-1",
    "course_description": "An investigation of ancient Greek art and architecture from its Iron Age beginnings through the legacy of Alexander the Great, concentrating on the creation of monumental stone sculpture and ordered buildings, visual interpretation of Greek mythology, and the interaction of art, ritual and politics.",
    "prerequisites": null,
    "instructors": "Katherine Harrington - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in Math & Science Center - N302",
    "course_resources": null,
    "sections": "Class Nbr: 2412, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: K. Harrington, Status: Open",
    "date_accessed": "2024-03-30"
}