{
    "course_code": "ARTHIST 203",
    "course_title": "Architectural Design Studio",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": "Department Consent Required",
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "(Prerequisite: ARTHIST 103 or 104\n\n\nThis hands-on design studio introduces intermediate architectural concepts and techniques to help students develop their competency in spatial analysis, design, representation, and presentation. It builds on ideas and terms encountered in ARTHIST 103 and/or ARTHIST 104. Through regular design presentations and feedback from instructor and colleagues, students will learn how a thoughtful and rigorous design methodology leads to meaningful contributions to the built environment. \nThe course is concerned with spatial analysis, the creative process, and the conventional modes of architectural communication. It provides students instruction in site analysis, sketching, modeling, collage, the design process, and the craft of presentation. Course work includes skills workshops, class discussions, design projects, group pinups, and reviews. The course will be scaffolded by three design exercises: two simple introductory / exploratory tasks, followed by a final longer design project that will build on the earlier work.\nStudents will present their final design projects before a jury of design critics and will collect their semester's work in a digital portfolio in lieu of a final exam. Class size is limited to allow for regular desk crits (individual meetings between the student and instructor), pin-ups, and reviews.\nThis class will meet in Cox Hall Computing Lab's Classroom B\n\n\nStudents that have met prerequisite should contact laurie.carter@emory.edu to request permission to enroll.",
    "course_description": "This hands-on design studio introduces basic architectural concepts and techniques through making. Regular design presentations and feedback on drawing and modeling projects will teach students rigorous design methodology and how it leads to meaningful contributions to the built environment.",
    "prerequisites": "ARTHIST 103 and (ARTHIST 104 or ART_OX 104) or equivalent transfer credit as prerequisite.",
    "instructors": "Ann Kennedy - Primary Instructor",
    "schedule_location": "T 1pm-5pm in COX 230B",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 1301, Section #: 1, Type: LAB, Campus: ATL, Meets: T 1-5p, Instructor: A. Kennedy, Status: Closed",
    "date_accessed": "2024-03-30"
}