{
    "course_code": "ARTHIST 276",
    "course_title": "Contemporary Architecture",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 30 / Seats Avail: 3Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "This course introduces students to the ideas and forms of the built environment from the end of WWII to the present. Through the study of selected works of architecture and \nurban design, issues of political + social ideology, economy, building technology, materiality, siting, and climate inform discussions of form, style, and performance. We will investigate together how buildings and urban spaces of the late 20th and early 21st century have been conceived and realized to affect local, and increasingly global, debates about the role of spatial design in society. \nThe semester divides roughly into two parts. Part I continues the history of Modernism in architecture and urban design from the end of WWII to the end of the 20th century. Part II introduces issues central to contemporary architectural and urban design discourse and practice. Each typical week is composed of one lecture and one discussion session. A combination of weekly short writing assignments, presentations, discussion leading responsibilities, and one longer research paper will encourage students to speak and write critically about the design of the built environment.\nArt History major/minor: Division III\nArchitectural Studies minor: elective",
    "course_description": "Introduces students to the ideas and forms of the built environment from WWII to the\npresent, investigating how buildings and urban spaces of the late 20th - early 21st\ncentury were conceived and realized to affect local, and increasingly global, debates\nabout the role of spatial design in society.",
    "prerequisites": null,
    "instructors": "Christina Crawford - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in New Psyc Bldg 230 (36 Eagle Ro",
    "course_resources": null,
    "sections": "Class Nbr: 1292, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 10-11:15a, Instructor: C. Crawford, Status: Open",
    "date_accessed": "2024-03-30"
}