{
    "course_code": "ARTHIST 329",
    "course_title": "Topics: Art of Class Antiquity: Soc Id & Vis Cul in Anc Greece",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 3Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "The ancient Greek world was a diverse place, full of people with complex social identities based on many intersecting aspects of how they represented themselves and how others saw them. Yet, what is identity? Why do we have categories like male, female, child, adult, citizen, and slave? And how did ancient Greek artists represent aspects of identity in depictions of the human form? This course is concerned with what we can learn about the lives of varied members of society from representations in ancient art, beginning in the Aegean Bronze Age and ending with Roman Greece. We will use visual culture as a jumping off point to explore issues such as conceptions of childhood and old age in the ancient world, changing notions of gender and sexuality, `elite' and `non-elite' culture, slaves, and the visual creation of the `other' in Greek. Examples will be drawn from a variety of contexts, including public monuments, religious architecture, private houses, and more local and vernacular styles across the Greek world. Materially, we will examine representations of the human (and divine!) form in bronze and marble sculpture, wall paintings, mosaics, vase paintings, and small portable objects. In addition to these representations, we will also discuss how scholars of the ancient world can use other evidence, such as literature, epigraphy, utilitarian objects, domestic architecture, and human osteology, to investigate aspects of ancient identity.\n\n\nSame as CL 329R-2",
    "course_description": "Topics could include ancient sanctuaries; early Greece: real and imagined and religious festivals; myth and art in ancient Greece; and Greek architecture. May be repeated for credit when topic changes, up to a maximum of twelve hours.",
    "prerequisites": null,
    "instructors": "Katherine Harrington - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in Candler Library 101",
    "course_resources": null,
    "sections": "Class Nbr: 2414, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 10-11:15a, Instructor: K. Harrington, Status: Open",
    "date_accessed": "2024-03-30"
}