{
    "course_code": "ARTHIST 485RW",
    "course_title": "Seminar in the Art of the Ancient Americas, Africa, the African Diaspora, Islam and Asia",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 8 / Seats Avail: 4Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "\"African Arts and Museum Politics\"While only a few minutes in length, the museum scene in the fictional Marvel superhero film Black Panther (2018) has highlighted for broad, worldwide audiences important questions about how actual European and Euroamerican museums acquire objects, how the institutions tell stories about objects, who tells the stories, and for whom the stories are told. Beyoncé and Jay-Z drew attention to similar questions about art and arts institutions through the video that they filmed in Paris's Louvre, one of the world's most visited arts museums, and released in 2018. In this seminar, we will think about how objects made on the African continent have traveled to galleries and museums in and beyond Africa. We will investigate how curators and other museum professionals have attempted to make meaning in museums, and we will consider the particular audiences for whom they may have tried to make meaning. We will also work to identify gaps and silences in museums. In addition, we will engage with past and present debates regarding restitution, repatriation, and return. The course does not require previous study of the African continent or of African arts.\n\n\nSame as AFS 489W-1",
    "course_description": "Advanced seminar with emphasis on critical texts, methods, and techniques of art historical investigation. For art history majors; open to others with permission from the instructor.",
    "prerequisites": null,
    "instructors": "Susan Elizabeth Gagliardi - Primary Instructor",
    "schedule_location": "Th 8:30am-11:15am in Callaway Center N203",
    "course_resources": null,
    "sections": "Class Nbr: 1298, Section #: 1, Type: LEC, Campus: ATL, Meets: Th 8:30-11:15a, Instructor: S. Gagliardi, Status: Open",
    "date_accessed": "2024-03-30"
}