{
    "course_code": "ARTHIST 769",
    "course_title": "Seminar:19th Century Art/Arch: The Fuller Era",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 4 / Seats Avail: 2",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-01-10 through 2022-04-25",
    "class_notes": "\"The Fuller Era, Or How We Got to Where We Are\"\"The Leonardo da Vinci of the 20th Century,\" was how Steve Jobs described Buckminster Fuller. Fuller was among the most influential figures of the twentieth century and his ideas continue to shape the basic character of contemporary thought. At the center of Fuller's thinking was the notion of \"doing more with less,\" what he called \"ephemeralization,\" and what we today call neoliberalism. This seminar aims to understand the ways in which Fuller shaped how we think today by looking at the range of figures he influenced including Marshall McLuhan, Charles and Ray Eames, Louis Kahn, Hugh Kenner, John Cage, Reyner Banham, Stewart Brand as well as looking at his impact on virtually every entrepreneur of Silicon Valley. A complex, confused, and deeply puzzling figure, Fuller provides a prism through which some of the key ideas of the contemporary world might be explored.\nArt History major/minor: Division III",
    "course_description": "Advanced seminar on 19th century art and/or architecture with emphasis on critical texts, methods, and techniques of art historical investigation. Permission from instructor required.",
    "prerequisites": null,
    "instructors": "Todd S Cronan - Primary Instructor",
    "schedule_location": "W 5:30pm-8pm in Carlos Hall Conference",
    "course_resources": null,
    "sections": "Class Nbr: 2934, Section #: 2, Type: SEM, Campus: ATL, Meets: W 5:30-8p, Instructor: T. Cronan, Status: Open",
    "date_accessed": "2024-03-30"
}