{
    "course_code": "EPI 798R",
    "course_title": "Pre-candidacy Research",
    "credit_hours": "1-12",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-05-12 through 2023-08-02",
    "class_notes": null,
    "course_description": "Progress towards the degree prior to entering candidacy that may include Research Assistantships and/or dissertation proposal preparation.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 2031, Section #: 1, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: A. Alonso, Status: Open\nClass Nbr: 2040, Section #: 10, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: S. Jenness, Status: Open\nClass Nbr: 2041, Section #: 11, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: D. Johnson, Status: Open\nClass Nbr: 2042, Section #: 12, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: M. Kramer, Status: Open\nClass Nbr: 2043, Section #: 13, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: T. Lash, Status: Open\nClass Nbr: 2044, Section #: 14, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: T. Lewis, Status: Open\nClass Nbr: 2045, Section #: 15, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: B. Lopman, Status: Open\nClass Nbr: 2046, Section #: 16, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: K. Nelson, Status: Open\nClass Nbr: 2047, Section #: 17, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: R. Patzer, Status: Open\nClass Nbr: 2048, Section #: 18, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: E. McQuade, Status: Open\nClass Nbr: 2049, Section #: 19, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: T. Sanchez, Status: Open\nClass Nbr: 2032, Section #: 2, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: H. Bradley, Status: Open\nClass Nbr: 2050, Section #: 20, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: A. Shah, Status: Open\nClass Nbr: 2052, Section #: 21, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: S. Suglia, Status: Open\nClass Nbr: 2054, Section #: 22, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: P. Sullivan, Status: Open\nClass Nbr: 2055, Section #: 23, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: Y. Sun, Status: Open\nClass Nbr: 2056, Section #: 24, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: V. Vaccarino, Status: Open\nClass Nbr: 2057, Section #: 25, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: L. McCullough, Status: Open\nClass Nbr: 2350, Section #: 26, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: S. Shah, Status: Open\nClass Nbr: 2358, Section #: 27, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: A. Naimi, Status: Open\nClass Nbr: 2033, Section #: 3, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: A. Chamberlain, Status: Open\nClass Nbr: 2034, Section #: 4, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: M. Chung, Status: Open\nClass Nbr: 2035, Section #: 5, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: A. Gaskins, Status: Open\nClass Nbr: 2036, Section #: 6, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: M. Goodman, Status: Open\nClass Nbr: 2037, Section #: 7, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Guest, Status: Open\nClass Nbr: 2038, Section #: 8, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: P. Howards, Status: Open\nClass Nbr: 2039, Section #: 9, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: A. Huels, Status: Open",
    "date_accessed": "2024-03-30"
}