{
    "course_code": "MESAS 270",
    "course_title": "Special Topics MESAS-200 Level: Immigrants/Ethnicity/Identity",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 5Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "(Same as HIST 285 3, AMST 285 3, JS 271 3, LACS 270 1)\nComplete topic: Immigrants, Ethnicities, and Identities in Latin America.\nLatin America has received large numbers of (im)migrants from Africa, Asia, Europe, and the Middle East, including Muslims, Jews, Christians, Buddhists, and those whose relationship to faith fell outside traditional religious categories.   Some came by choice, often seeking religious freedom and/or social and economic improvement.  Others were forced migrants, working on the plantations and mines that formed the basis of the exploitative colonial economy. At times (im)migrant entrance was encouraged by elites and in other moments anti-(im)migrant movements and legislation were widespread.  This course will put human movement into conversation with the creation of racial, ethnic, and national identities in Latin America. We will analyze the history of racial and ethnic discourses and their sociopolitical uses in the formation of modern nations and empires.  We will examine postcolonial societies and their constant tension with the legacies of (im)migration.",
    "course_description": "Special topics in Middle Eastern and South Asian Studies, at the 200 level; may be repeated when content varies.",
    "prerequisites": null,
    "instructors": "Jeffrey Lesser - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in Tarbutton Hall 218",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_MESAS_270_3_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3738, Section #: 3, Type: LEC, Campus: ATL, Meets: MW 10-11:15a, Instructor: J. Lesser, Status: Open",
    "date_accessed": "2024-03-29"
}