{
    "course_code": "PC 645",
    "course_title": "Spiritual Care in African Religious Traditions",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 0 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Closed",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Same as WR 645 1) (ONLINE: synchronous live sessions Tuesday 2:30pm-4:30pm; remaining contact time fulfilled via asynchronous online engagement)",
    "course_description": "The course will examine how spiritual care is conceptualized and practiced in various African religious traditions including African derived religions in South and Central America, the Caribbean, and North America. We will spend the first part of the course gaining theoretical grounding in African religious thought and philosophy. The second part of the course focuses on African traditional medicine, divination, rituals and practices of care. We will examine African healing systems, concepts of disease, traditional concepts of mental health, traditional beliefs and interpretations of various illnesses, as well as traditional healing and practices of medical and spiritual care. We also will explore some of the myths surrounding traditional healing in Africa. In the final part of the course African American and other African diasporan folk traditional understandings and practices of healing and spiritual care in the Americas and the Caribbean will be explored. (Race, Ethnicity, and Gender).",
    "prerequisites": null,
    "instructors": "Emmanuel Y Lartey - Primary Instructor",
    "schedule_location": "T 2:30pm-4:30pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 4265, Section #: 1, Type: DIS, Campus: ATL, Meets: T 2:30-4:30p, Instructor: E. Lartey, Status: Closed",
    "date_accessed": "2024-03-30"
}