{
    "course_code": "ARTVIS 220",
    "course_title": "Intermediate Graphic Design",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 8",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": "Department Consent Required",
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "In this intermediate course, students will expand upon and surpass the skills and projects from the prerequisite course, ARTVIS120. This class is less software-learning oriented than its precursor, which opens up time for students to focus more on technique and concept, working with iterations, and building a brand. Typography, color theory, and composition theory skills will be emphasized, such as working with a grid system to arrange elements of page layout, creating color swatch palettes and coordinating font samplers, as well as practicing drafting skills on paper that immediately translate to the digital page.\nResearch and conceptual interests of design will also be explored, splitting the focus of the semester equally on both the theory and the creation of digital design. \nCourse notes:\nA student subscription to Adobe CC will be necessary for this course and can be purchased at a rate of $19.99/mo (with a year contract, though you can cancel the year early for a partial refund). How to sign up for this subscription will be discussed at the beginning of class and does not need to be purchased prior to the semester start. No other fees or textbooks will be required for this class.\nPrerequisite: Please note,  students must have completed ARTVIS333R:Multidiscipline Design Studio: Introduction to Graphic Design to sign up for this class. Please contact the instructor, Jane Foley, for permission: jane.garver@emory.edu\n\n\n(Prerequisite: XXX)\n\n\n(Permission Required Prior to Enrollment)",
    "course_description": "Students will expand upon and surpass the skills and projects from the prerequisite course, ARTVIS120. This class is less software-learning oriented than its precursor,  which opens up time for students to focus more on technique and concept, working with iterations, and building a brand.",
    "prerequisites": "ARTVIS 120 or equivalent transfer credit as prerequisite.",
    "instructors": "Jane Foley - Primary Instructor",
    "schedule_location": "W 1pm-3:45pm in Visual Arts 105",
    "course_resources": null,
    "sections": "Class Nbr: 4777, Section #: 1, Type: ART, Campus: ATL, Meets: W 1-3:45p, Instructor: J. Foley, Status: Open",
    "date_accessed": "2024-03-30"
}