{
    "course_code": "ARTVIS 120",
    "course_title": "Introduction to Graphic Design",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "In this hands-on course, students will create digital designs and drawings, both for graphic design and for visual art purposes. Through these projects, students will gain fluency in using the Adobe Creative Suite software, specifically Photoshop, Illustrator, and InDesign. Research and conceptual interests of design will also be explored, splitting the focus of the semester equally onto both the theory and the creation of digital art and design.\nCourse notes:\nA student subscription to Adobe CC will be necessary for this course and can be purchased at a rate of $19.99/mo (with a year contract, though you can cancel the year early for a partial refund). How to sign up for this subscription will be discussed at the beginning of class and does not need to be purchased prior to the semester start. No other fees or textbooks will be required for this class. Please note; this class is a pre-requisite for ARTVIS220: Intermediate Graphic Design. Also note, this class was previously listed as ARTVIS333R.",
    "course_description": "Through a series of practical assignments, students will explore the research and conceptual interests of graphic design. Through these projects, students will learn and employ methodologies of visual communication through creating various graphic design projects in 2-dimensional, digital formats.",
    "prerequisites": null,
    "instructors": "Jane Foley - Primary Instructor",
    "schedule_location": "M 1pm-3:45pm in Visual Arts 145",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 4776, Section #: 1, Type: ART, Campus: ATL, Meets: M 1-3:45p, Instructor: J. Foley, Status: Closed",
    "date_accessed": "2024-03-30"
}