{
    "course_code": "ARTVIS 325",
    "course_title": "Contemporary Artist Issues",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 3",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "\"Contemporary Art Issues\"Each and every artist plays an active role in the process of constructing meaning about what it means to be a working artist. Much like making art, being an artist in the world requires tools such as curiosity, openness, and dialogue for engaging with those beyond your studio walls. In this class we are not going to be assessing whether your artwork is good or bad, but rather have an open-ended conversation, an inquiry-based approach, to thinking about what being a contemporary artist requires. This course will consider a wide range of current ideas, together we will rethink the familiar. For this class we will have visitors in and will be visitors out, going to studios, galleries, museums and art libraries. We will reflect on what resonates, what a working artist needs to survive. Students will create a website, a CV, write grant proposals, artists statements. We will look at exhibitions from around the world and talk about both what we like and what we do not. We will live local and talk globally. We will read and assess artist statements, curatorial statements, and wall labels, thinking about context, how to improve on this writing, what we would want these labels to one day say about us.\n\n\nThis class is an part of the Integrated Visual Arts Co-Major (IVAC) curriculum and does not count towards the Art History major, minor, or concentrations.",
    "course_description": "This course will explore the many ways in which contemporary artists engage their practice. Students will begin to situate themselves into the contemporary art landscape through a series of visiting artists and studio visits, writing exercise, and readings / discussion.",
    "prerequisites": null,
    "instructors": "Daniel Fuller - Primary Instructor",
    "schedule_location": "W 1pm-4:30pm in Visual Arts 117",
    "course_resources": null,
    "sections": "Class Nbr: 4778, Section #: 1, Type: ART, Campus: ATL, Meets: W 1-4:30p, Instructor: D. Fuller, Status: Open",
    "date_accessed": "2024-03-30"
}