{
    "course_code": "BUS 480",
    "course_title": "Senior Seminar: Applied Field Experience",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 50 / Seats Avail: 20",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "This class meets virtually through Canvas.\nThe goal of this Seminar is to enhance the value of an internship by helping students apply what they learn in the classroom in the workplace. In addition it will help the student to identify a set of skills and knowledge learned at an internship. We will examine the skill set, culture, and nature of the workplace and how you might utilize this learning for future career progression. The seminar is for students who have or will have obtained internships during the Fall or Spring semester. It is not for Summer work. The course will be conducted through a virtual electronic classroom with required responses to weekly queries. You are welcome to meet with the instructor in person at any time regarding the course. In consultation with their advisors, BBA students in their final term in the Business School are permitted to work up to 40 hours per week if they have a reduced course load of 1-11 credits. (If you are an international student completing an internship during the Fall or Spring Term this the required course for CPT approval.)",
    "course_description": "Senior seminar courses fall outside the scope of traditional academic coursework, and instead allow students to learn from and interact with experienced practitioners, and to develop industry-specific insights, fine-tune career skills, and increase professional exposure.",
    "prerequisites": "This section is reserved for students in the BBA program.",
    "instructors": "Andrea Hershatter - Primary Instructor",
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 1087, Section #: 1101, Type: SEM, Campus: ATL, Meets: Meets Online, Instructor: A. Hershatter, Status: Open",
    "date_accessed": "2024-03-30"
}