{
    "course_code": "BUS 599S",
    "course_title": "Special Topics: Coaching Problem Solving Team",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 66 / Seats Avail: 35Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-01-10 through 2022-04-25",
    "class_notes": "The Coaching a Problem-Solving Team course is a three-credit, graduate-level course which develops your skills as a leader and project coach by coaching one or more IMPACT360 full-time MBA teams through their problem-solving process to ensure learning objectives are achieved and high-impact work is delivered to the client. As part of the course, participants serve as IMPACT Coaching Fellows (ICFs) assigned to one or more IMPACT360 project teams in the two-year, full-time MBA program. The fundamental purpose of this course is to assist students in the development of essential leadership and problem-solving coaching skills to accelerate their careers.\nAs part of the course, each ICF receives access to an executive coach and credit towards the Advanced Leadership Certificate.\nThe course focuses on three craft skill areas of leadership and problem solving to nurture a problem-solving team to deliver high quality, high impact results:\n-\tPerforming effective coaching and communication\n-\tBuilding trust through credibility, reliability and intimacy in relationships while keeping self-orientation in check\n-\tApplying principles and processes of structured problem solving in a coaching context",
    "course_description": "This course is designed to offer a number of the new course topic.",
    "prerequisites": "This section is reserved for students in the One-Year or Two-Year MBA program.",
    "instructors": "Lynne Segall - Primary Instructor",
    "schedule_location": "T 4pm-6:15pm in Goizueta Business School 204",
    "course_resources": null,
    "sections": "Class Nbr: 5736, Section #: 3201, Type: LEC, Campus: ATL, Meets: T 4-6:15p, Instructor: L. Segall, Status: Open",
    "date_accessed": "2024-03-30"
}