{
    "course_code": "BUS 798R",
    "course_title": "Pre-Candidacy Dissertation Research",
    "credit_hours": "9",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-01-10 through 2022-04-25",
    "class_notes": null,
    "course_description": "Students are supervised by their advisor as they work on research for their dissertation leading up to applying for candidacy.",
    "prerequisites": "This section is reserved for students in the PhD program.",
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 5257, Section #: 5101, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: K. Kadous, Status: Open\nClass Nbr: 5258, Section #: 5102, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: K. Towry, Status: Open\nClass Nbr: 5259, Section #: 5103, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: T. Yohn, Status: Open\nClass Nbr: 5263, Section #: 5104, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: I. Dichev, Status: Open\nClass Nbr: 5264, Section #: 5105, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: K. Sedatole, Status: Open\nClass Nbr: 5265, Section #: 5106, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Shanken, Status: Open\nClass Nbr: 5266, Section #: 5107, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: C. Green, Status: Open\nClass Nbr: 5267, Section #: 5108, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: T. Chan, Status: Open\nClass Nbr: 5268, Section #: 5110, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: V. Todri, Status: Open\nClass Nbr: 5269, Section #: 5111, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: R. Cui, Status: Open\nClass Nbr: 5281, Section #: 5112, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: P. Adamopoulos, Status: Open\nClass Nbr: 5282, Section #: 5113, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: A. Bharadwaj, Status: Open\nClass Nbr: 5283, Section #: 5114, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: N. Osadchiy, Status: Open\nClass Nbr: 5285, Section #: 5115, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: D. Lee, Status: Open\nClass Nbr: 5286, Section #: 5116, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: R. Chellappa, Status: Open\nClass Nbr: 5288, Section #: 5117, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: D. Schweidel, Status: Open\nClass Nbr: 5289, Section #: 5118, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: M. Lewis, Status: Open\nClass Nbr: 5290, Section #: 5119, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: G. Negro, Status: Open\nClass Nbr: 5291, Section #: 5120, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: M. Williams, Status: Open\nClass Nbr: 5292, Section #: 5121, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Perry-Smith, Status: Open\nClass Nbr: 5293, Section #: 5122, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: E. Hall, Status: Open\nClass Nbr: 5294, Section #: 5123, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: W. Longhofer, Status: Open\nClass Nbr: 5295, Section #: 5124, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Bockstedt, Status: Open",
    "date_accessed": "2024-03-30"
}