{
    "course_code": "QTM 200",
    "course_title": "Applied Regression Analysis",
    "credit_hours": "3",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": "Mathematics and Quantitative Reasoning",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "This course will be offered fully ONLINE.\nThis course is a follow-up to QTM 100: Introduction to Statistical Inference. Students will apply many of the concepts and skills learned in QTM 100 to a broader field of statistical analysis: multivariable analysis and model building. Assignments are based on real-world data and problems in political science. Both labs and assignments allow students to apply concepts from class toward programming skills in R and Github, which are becoming standard practice in academics and industry. General topics covered include: - examining data and transforming data - one-way and two-way ANOVAs - linear regression - dummy variable regression - non-numeric outcomes (poisson, logistic regression) - diagnostics of unusual and influential data - non-linearity (splines) - non-constant variance, non-normality and collinearity - model selection.",
    "course_description": "Students will apply concepts and skills learned in QTM 100 to a broader field of statistical analysis: multivariable analysis and model building. Implementation of appropriate statistical methods, hands-on data analysis with statistical software, interpretation of analysis results.",
    "prerequisites": null,
    "instructors": "Jeffrey Ziegler - Primary Instructor",
    "schedule_location": "Varies by section",
    "course_resources": null,
    "sections": "Class Nbr: 3523, Section #: 1, Type: LEC, Campus: ATL, Meets: M 8-9:15a, Instructor: J. Ziegler, Status: Open\nClass Nbr: 4047, Section #: 2, Type: LEC, Campus: ATL, Meets: W 8-9:15a, Instructor: J. Ziegler, Status: Open",
    "date_accessed": "2024-03-30"
}