{
    "course_code": "QTM 398R",
    "course_title": "Peer Mentoring in Statistics",
    "credit_hours": "1-2",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Varies by section",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": null,
    "course_description": "Engage in statistical study and mentor peers in statistics; attend an orientation, develop mentoring skills, have weekly meetings with lecturer, attend one QTM 100 section per week, and hold mentoring sessions for current students. (2 credits)\nOR Aid TA in QTM 100 Lab (1 credit)",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 6076, Section #: 1, Type: SEM, Campus: ATL, Meets: Meets Online, Instructor: H. Kim, Status: Open\nClass Nbr: 6136, Section #: 10, Type: SEM, Campus: ATL, Meets: Meets Online, Instructor: H. Kim, Status: Open\nClass Nbr: This section is full 6077, Section #: 2, Type: SEM, Campus: ATL, Meets: Meets Online, Instructor: J. Jacobson, Status: Closed\nClass Nbr: 6078, Section #: 3, Type: SEM, Campus: ATL, Meets: Meets Online, Instructor: K. McAlister, Status: Open\nClass Nbr: This section is full 6079, Section #: 4, Type: SEM, Campus: ATL, Meets: Meets Online, Instructor: G. Sasso, Status: Closed\nClass Nbr: This section is full 6080, Section #: 5, Type: SEM, Campus: ATL, Meets: Meets Online, Instructor: G. Sasso, Status: Closed\nClass Nbr: This section is full 6081, Section #: 6, Type: SEM, Campus: ATL, Meets: Meets Online, Instructor: U. Mignozzetti, Status: Closed\nClass Nbr: This section is full 6082, Section #: 7, Type: SEM, Campus: ATL, Meets: Meets Online, Instructor: U. Mignozzetti, Status: Closed\nClass Nbr: This section is full 6083, Section #: 8, Type: SEM, Campus: ATL, Meets: Meets Online, Instructor: W. An, Status: Closed\nClass Nbr: This section is full 6135, Section #: 9, Type: SEM, Campus: ATL, Meets: Meets Online, Instructor: Z. Gong, Status: Closed",
    "date_accessed": "2024-03-30"
}