{
    "course_code": "QTM 325",
    "course_title": "Evolutionary Game Theory",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 30 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "Prerequisites: None\nPermission code request form (same for all QTM courses): http://bit.ly/Fall2021-QTM\nWhy do most species show a female-male ratio of 1:1? Why are within-species fights between males usually not deadly? And why do unrelated individuals cooperate with each other? Evolutionary Biology explains the natural world in terms of survival of the fittest: the traits we see are those that have benefitted the survival and reproduction of individuals carrying them, these individuals had more offspring than others, and these traits therefore spread in the population. But the success of traits relating to sex ratio, escalation of male-male fights, and cooperation, all depend on the outcomes of interactions with others in the population. For example, cooperating may be a good strategy when everyone cooperates, but a bad one when there are cheaters around. Evolutionary Game Theory draws on ideas from classic Game Theory to explain these natural phenomena and others. The course will introduce basic concepts from Evolutionary Biology and from Game Theory, and combine them together to find evolutionarily stable strategies everywhere around us.",
    "course_description": "Evolutionary Game Theory draws on ideas from classic Game Theory to explain these biological phenomena. The course will introduce basic concepts from Evolutionary Biology and from Game Theory, and combine them together to find evolutionarily stable strategies everywhere around us.",
    "prerequisites": null,
    "instructors": "Michal Arbilly - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in White Hall 102",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 5364, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: M. Arbilly, Status: Wait List",
    "date_accessed": "2024-03-30"
}