{
    "course_code": "QTM 385",
    "course_title": "Special Topics: QTM: Quant. Methods for Soc.Science",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 30 / Seats Avail: 27Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Prerequisites: QTM 220 or ECON 320 and all QTM core classes.)\n(Permission Required Prior to Enrollment)\n(Permission code request form (same for all QTM courses): https://forms.office.com/r/0Pt8qwQi1X)\n(The course is designed to introduce methods to handle a variety of features of micro-level data and related empirical studies. These include method to deal with discrete choices data, method to deal with endogenous issue in many scenarios, method to deal with sample selection bias, method to study the treatment effects/policy evaluation problem when the binary treatment choices are not randomly assigned, but from a behavior optimization process. The course will introduce students to a variety of empirical studies from different fields, e.g., labor market, industrial organization, political economics, sociology, health etc. After the course, students are expected to conduct empirical analyses of micro-level data on many topics.)",
    "course_description": "Special Topics Courses. Includes Game Theory I/II, Maximum Likelihood Estimation, Longitudinal Data Analysis, Experimental Methods, Survey Research Methods, Computational Modeling, and Advanced Topics: Bayesian Statistics.",
    "prerequisites": "QTM 110 and QTM 120 and QTM 210 or equivalent transfer credit as prerequisite.",
    "instructors": "Zhongjian Lin - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Tarbutton Hall 111",
    "course_resources": null,
    "sections": "Class Nbr: 5365, Section #: 7, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: Z. Lin, Status: Open",
    "date_accessed": "2024-03-30"
}