{
    "course_code": "QTM 385",
    "course_title": "Special Topics: QTM: Data Analytics",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Prerequisites: [QTM 220 or ECON 320] and QTM 110, QTM 150, [QTM 210 or ECON 220 or MATH 362], [MATH 210 or MATH 211], MATH 221)\n(Permission Required Prior to Enrollment)\nPermission code request form (same for all QTM courses): http://bit.ly/Fall2021-QTM\nDigital transformation has generated incredible demand for quantitative performance management, machine-driven decision making, and strategic insight discovery. This demand has created immense professional opportunity for college graduates who have the right training. \nThis course aims to train students in a range of real-world case studies that apply the skillsets developed in QTM to these high-demand problems in digital analytics. The course has five sections that address digital problems in the pharmaceutical, consumer packaged goods, healthcare, technology, and finance industries. \nEach section contains 1) an interactive lecture component, which introduces the case study and provides a problem solving framework, and; 2) a group work component, in which students work in groups of 4-5 to tackle the case and present their solution. \nStudents will complete the course prepared for the type of work that applies their educational background to jobs at the world's leading companies and consulting firms.",
    "course_description": "Special Topics Courses. Includes Game Theory I/II, Maximum Likelihood Estimation, Longitudinal Data Analysis, Experimental Methods, Survey Research Methods, Computational Modeling, and Advanced Topics: Bayesian Statistics.",
    "prerequisites": "QTM 110 and QTM 120 and QTM 210 or equivalent transfer credit as prerequisite.",
    "instructors": "Joe Sutherland - Primary Instructor",
    "schedule_location": "M 2:30pm-5:15pm in New Psyc Bldg 225 (36 Eagle Ro",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 1484, Section #: 3, Type: LEC, Campus: ATL, Meets: M 2:30-5:15p, Instructor: J. Sutherland, Status: Wait List",
    "date_accessed": "2024-03-30"
}