{
    "course_code": "OAM 499R",
    "course_title": "Special Topics: Venture Capital and Minority",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 0 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "Increasingly, entrepreneurial start-ups are dependent on angel investors and venture capitalists. Of great concern is the well-established fact that only 1 percent of venture capital-backed founders are Black, and less than 2 percent are Latinx or Native American. Research also indicates that the existing networks and a lack of diversity at venture capital firms may be contributing to very limited access to funding for these underrepresented minority entrepreneurs. This course will address these concerns through three critical components: 1) A review of the growing evidence from empirical research in sociology, economics, and psychology that identifies the underlying causes of inequality; 2) the presentation of the finance and strategy principles of new venture valuation and; 3) direct application of theory to practice through the identification of minority entrepreneurial ventures, rigorous screening of the candidates and finally recommendation of actual investments through the student-directed Peachtree Minority Venture Fund. Enrollment is via application, which will open on November 5th.",
    "course_description": "This advanced course explores topics of current interest in organization management.",
    "prerequisites": "This section is reserved for students in the BBA program.",
    "instructors": "Robert Kazanjian - Primary Instructor",
    "schedule_location": "W 6:30pm-9:30pm in Goizueta Foundation Ctr W300",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3965, Section #: 1176, Type: LEC, Campus: ATL, Meets: W 6:30-9:30p, Instructor: Kazanjian/Kurish, Status: Closed",
    "date_accessed": "2024-03-30"
}