{
    "course_code": "OAM 499R",
    "course_title": "Special Topics: People Analytics",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 66 / Seats Avail: 60Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "Course Overview\nOrganizations are engaged in a war for talent as human resources increasingly become a source of competitive advantage in many industries.  Talent management has traditionally revolved around standard operating procedures to hire, train and retain employees rather than deep analysis.  People analytics involves the use of data and analytic tools to inform decisions about how to manage people.  Leading organizations are increasingly using sophisticated methods to analyze employee, business, industry and labor market data instead of relying on 'gut feel' or practices that `worked in the past.'\nThis course aims to train students to produce fact-based insights into the demography of organizations and answers to critical talent questions such as:\n*\tWhom to hire?\n*\tHow engaged are our employees?\n*\tHow do we evaluate performance?\n*\tWhom to promote?\n*\tWho is at risk of leaving? What are we doing to keep them?\n*\tWhat training and development should we provide?\n*\tHow do we evaluate the effectiveness of incentives, training programs and other interventions?\nLearning Objectives of the Course:\nBy the end of this course, you should understand:\n*\tThe range of areas where analytics are being used to improve how people are managed\n*\tConceptual underpinnings of major people decisions\n*\tBasics of where to find appropriate data and how to set up analyses\n*\tOutlines of more sophisticated approaches to analyzing data\n*\tMajor pitfalls and best practices in people analytics",
    "course_description": "This advanced course explores topics of current interest in organization management.",
    "prerequisites": "This section is reserved for students in the BBA program.",
    "instructors": "Anand Swaminathan - Primary Instructor",
    "schedule_location": "TTh 4pm-5:15pm in Goizueta Business School 304",
    "course_resources": null,
    "sections": "Class Nbr: 1249, Section #: 1102, Type: LEC, Campus: ATL, Meets: TTh 4-5:15p, Instructor: A. Swaminathan, Status: Open",
    "date_accessed": "2024-03-30"
}