{
    "course_code": "ANT 265",
    "course_title": "Anthropology of Gender & Sexuality",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 17 / Seats Avail: 6Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "(Same as WGS 265 1)\n\n\nThe cross-cultural study of gender and sexuality has long been of central concern in anthropology, as evidenced by the pioneering research undertaken in the 1920s and 1930s by Margaret Mead and Bronislaw Malinowski. What have we learned from that work and from those who have developed altogether different paradigms of research in subsequent decades? This course endeavors to answer questions such as these by providing anthropological perspectives on gender and sexual diversity in a broad range of human societies. One of the primary objectives of the course is to develop an ethnographically grounded understanding of the enormous range of variation in human societies as regards gender roles and the constructions and entailments of femininity, masculinity, heteronormativity, gender variance, and same-sex relations. A second objective of the course is to develop a critical understanding of the types of theories, methods, and data that are relevant to the contemporary study of gender and sexuality -- and to scholarly production bearing on these domains -- in cultural anthropology, especially in relation to other axes of difference and inequality associated with race, class, and religion. The emphasis throughout the course will be on ethnographic and theoretical works that deal with gender and sexuality as culturally constructed, historically variable, and politically contested categories bearing on practice and desire, rather than immutable biological \"givens\".",
    "course_description": "This course introduces students to the cross-cultural study of gender and sexuality, providing anthropological perspectives on femininity, masculinity, heteronormativity, gender variance, same sex relations, and various theories and methods that are relevant to the study of these phenomena.Students who have taken ANT_OX 265 may not repeat this course for credit.",
    "prerequisites": null,
    "instructors": "Michael Peletz - Primary Instructor",
    "schedule_location": "MW 4pm-5:15pm in Math & Science Center - W307C",
    "course_resources": null,
    "sections": "Class Nbr: 2207, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 4-5:15p, Instructor: M. Peletz, Status: Open",
    "date_accessed": "2024-03-30"
}