{
    "course_code": "ANT 280R",
    "course_title": "Anthro. Perspectives: Indigenous Peoples of North America",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 35 / Seats Avail: 6Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "Indigenous Peoples of North America\nThis course is about listening to and engaging with Indigenous perspectives from Turtle Island (aka North America).  We will engage with present-day writings, talks, and cultural productions by contemporary Native American scholars, authors, artists, and wisdom keepers. Through the lens of vivid ethnographic writing, ethnographic film, cultural commentary, class visitors, political documents, and other material, this course invites students to listen to and learn from:\n(a) the cultural knowledge, wisdom, and lived experiences of Native American Peoples (including first arrival on the continent, European contact and settler-colonialism, and present-day initiatives for self-determination, visibility, and social justice);\n(b) the processes and experiences that have contributed to present day conditions of different Indigenous Nations, communities, and individuals; and\n(c) a range of cultures, governance systems, and sovereignty issues (based on selections from the 574 Native American Nations federally recognized by the U.S. government, and other Indigenous Nations in North America).\nWe will be challenged to sharpen our awareness of the importance of voice, perspective, positionality, and ethics in this work. Major themes this semester include: sovereignty, dispossession, decolonization, human rights, political activism, creativity, respectful engagement, and connections to land.",
    "course_description": "Anthropological perspectives on the people and cultures on different regions of the world.  May be repeated for credit when topic varies. HSC, may be repeated when topic changes.",
    "prerequisites": null,
    "instructors": "Debra Vidali - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Math & Science Center - N302",
    "course_resources": null,
    "sections": "Class Nbr: 2212, Section #: 2, Type: LEC, Campus: ATL, Meets: TTh 10-11:15a, Instructor: D. Vidali, Status: Open",
    "date_accessed": "2024-03-30"
}