{
    "course_code": "ANT 280R",
    "course_title": "Anthro. Perspectives: Middle East and North Africa",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 80 / Seats Avail: 25Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "(Same as MESAS 270 6, AFS 280 1)\n\n\nThis introductory course assumes that students have little or no background in the study of the Middle East and North Africa (MENA). While we will adopt an interdisciplinary approach to examining the region, our focus will be anthropological, and while we will historicize recent socio-economic and political transformations in the region, our focus will be contemporary. In our study of modern Middle Eastern social movements, we will address the role of art, faith, and politics, the impact of technology, media, women's rights, and LGBTQ organizing, as well as economic liberalization, entrepreneurship, and the politics of oil. Additional themes we will explore are the role of youth in catalyzing social change as well as the impact of conflict and violence. We will also trace the emergence and consequences of the \"Arab Spring.\" Thus, this is designed as a survey course, with no prerequisites in Anthropology or Middle Eastern Studies.",
    "course_description": "Anthropological perspectives on the people and cultures on different regions of the world.  May be repeated for credit when topic varies. HSC, may be repeated when topic changes.",
    "prerequisites": null,
    "instructors": "Sa'ed Atshan - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Math & Science Center - E208",
    "course_resources": null,
    "sections": "Class Nbr: 2209, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: Atshan/Chattopadhyay, Status: Open",
    "date_accessed": "2024-03-30"
}