{
    "course_code": "ANT 333",
    "course_title": "Disease & Human Behavior",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 170 / Seats Avail: 39Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Science, Nature, Technology",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "This course will survey a wide range of important human diseases at a level suitable for students with little scientific background but a keen interest in health and illness. Students who plan a career touching on disease in some way but unlikely to become doctors or nurses \"for example, in health education, public health services, health care administration, hospital-based social work, medical anthropology, medical sociology, medical economics, or aid to international development\" will find that it provides a basic foundation for thinking about all the things that go wrong with the human body. Those who will become doctors, nurses, or other health practitioners will find the course offers evolutionary, psychological, and cultural perspectives that they may not encounter again.\n\n\nWe will spend one class on each of about 22 disorders or syndromes. The choice of diseases for study was motivated, first, by their importance in the experience of either people in the developing world (malaria, diarrhea, tuberculosis, etc.), the developed world (coronary artery disease, stroke, breast cancer), or both (cervical cancer, COPD, depression). Second, the chosen diseases reflect the goal of touching on most major body systems and, more important, are intended to illuminate all major principles and processes\" genetic, physiological, nutritional, infectious, immunological, epidemiological, psychosocial, and cultural\" that contribute to disease. Students completing this course should be in a position to approach many other diseases using the principles mastered in relation to those covered in the course.",
    "course_description": "Biological and cultural adaptations to disease, the role of specific diseases in evolution, social epidemiological patterns related to culture, contemporary issues in disease control, and economic development. Diseases covered include malaria, tuberculosis, AIDS, diabetes, and depression.",
    "prerequisites": null,
    "instructors": "Melvin J Konner - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Anthropology Building 303",
    "course_resources": null,
    "sections": "Class Nbr: 2221, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: Konner/Joseph, Status: Open",
    "date_accessed": "2024-03-30"
}