{
    "course_code": "ANT 344",
    "course_title": "Blackness & Politics of Space",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "HSC w/Race & Ethnicity Req.",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "(Same as AAS 344 1)\n\n\nThe plantation. The trap. The dirty south. The skating rink. The maroon settlement. The strip club. The favela. The barber shop. The hair salon. Bahia. Oakland. Atlanta. Soweto. Detroit. The Mississippi Delta. New Orleans. South- and Westside of Chicago. Santo Domingo. Each of these sites signify race, particularly Blackness, in the popular imagination. Depending on your perspective, these places can be viewed as sites of conviviality, criminality, joy, racial violence, and sometimes, all of the above. To that end, this course makes a modest proposal: what can we learn about how these places are made and un-made when we focus on the lives and experiences of the Black people who live within them? Using insights from ethnography, Black cultural studies, cultural geography and African American literature, this course critically explores these \"Black geographies\" in an effort to understand the ways that race and space are mutually constituted in our modern world. Living in the Atlanta provides us key opportunities to consider these issues from a local context. Thus, throughout the course, students will be given structured opportunities to apply their critical lenses to the intersections of race, space, and place in contemporary Atlanta.",
    "course_description": "Using insights from cultural anthropology, Black cultural studies, & geography, this course critically explores \"Black geographies\" to theorize the ways race and space are mutually constituted in our modern world. Students will analyze intersections of race, space, and place in contemporary Atlanta.",
    "prerequisites": null,
    "instructors": "Justin Hosbey - Primary Instructor",
    "schedule_location": "TTh 4pm-5:15pm in Math & Science Center - W201",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2224, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 4-5:15p, Instructor: J. Hosbey, Status: Wait List",
    "date_accessed": "2024-03-30"
}