{
    "course_code": "ANT 455W",
    "course_title": "Current Issues in Primatology",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 8",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "Continuing Writing Requirement",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "Alternative pre-requisite: ANT 285 Found-Prim.Behavior/Cognition, or permission of instructor. If you've taken the ANT 285 section, please email hcarpe5@emory.edu for a permission number.\nFor decades, studies on primate behavior have provided us with a lens to observe our ancestral past. Since the onset of the discipline, primatology has continued to evolve, with the integration of novel methodologies that have placed studies on primate behavior at the forefront of anthropology, social sciences, animal behavior, psychology, and medicine. This seminar focuses on the past, present, and future of primatology by examining both the theoretical roots of the discipline and the groundbreaking studies that address current problems in the fields of primate behavior and primate cognition. By comparing current novel studies with \"old\" seminal scientific papers, this course will challenge you to understand historical perspective, consider theoretical advances, examine methodological approaches, and critically assess the future trajectories of primatology.",
    "course_description": "This seminar focuses on the past, present, and future of primate studies. In this course, students will delve into historical perspective, consider theoretical advances, examine methodological approaches, and critically assess the future trajectories of research in primate behavior and cognition.",
    "prerequisites": "ANT 302 or PSYC 320 or BIOL 320 or PSYC 325 or BIOL 325 or equivalent transfer credit as prerequisite.",
    "instructors": "Marcela Benitez - Primary Instructor",
    "schedule_location": "W 2:30pm-5:15pm in Anthropology Building 108",
    "course_resources": null,
    "sections": "Class Nbr: 4747, Section #: 1, Type: SEM, Campus: ATL, Meets: W 2:30-5:15p, Instructor: M. Benitez, Status: Open",
    "date_accessed": "2024-03-30"
}