{
    "course_code": "JPN 402",
    "course_title": "Adv Language & Cultural Studies II",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 7",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Spring",
    "requirement_designation": "Humanities, Arts, Language [Foreign Language]",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "This class contains synchronous and asynchronous material. It will meet synchronously at the listed day and  time, with all other content to be completed asynchronously.\n\tAtlas description: In this course students will continue to develop their spoken and written Japanese skills at the advanced level through the reading and discussion of materials selected from the textbook, online sources, and other relevant media. Particular attention will be given to developing the ability to accurately express one's opinion, both in speech and writing, on topics pertaining to Japanese culture, society and current events. Students will also be evaluated on their ability to both lead and participate in extended classroom discussions. A course project will expose students to the literary genre of science fiction in Japanese and will require students to create their own stories and audio recordings. This course is taught entirely in Japanese.\n\n\nIn this course students will continue to develop their spoken and written Japanese skills at the advanced level through the reading and discussion of materials selected from the textbook, online sources, and other relevant media. Particular attention will be given to developing the ability to accurately express one's opinion, both in speech and writing, on topics pertaining to Japanese culture, society and current events. Students will also be evaluated on their ability to both lead and participate in extended classroom discussions. A course project will expose students to the literary genre of science fiction in Japanese and will require students to create their own stories and audio recordings. This course is taught entirely in Japanese.",
    "course_description": "Prerequisite: JPN 401 or instructor consent. This course will provide exposure to business and technical Japanese. Students will practice formal styles of communication and read texts with technical orientation. Basic translation skills will be introduced. The course is conducted solely in Japanese.",
    "prerequisites": "JPN 401 or JPN 401W or equivalent transfer credit as prerequisite.",
    "instructors": "Seth J Goss - Primary Instructor",
    "schedule_location": "T 8am-9:15am in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 3587, Section #: 1, Type: LEC, Campus: ATL, Meets: T 8-9:15a, Instructor: S. Goss, Status: Open",
    "date_accessed": "2024-03-30"
}