{
    "course_code": "JPN 338",
    "course_title": "Bilingualism in Japanese Context",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 8",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "This class contains synchronous and asynchronous material. It will meet synchronously at the listed day and time, with all other content to be completed asynchronously.\nIn this course we explore bilingualism and multilingualism in the context of Japan. Often viewed from the outside, and branded from within, as a linguistically and culturally homogenous society, Japan's linguistic landscape is in fact more complex upon a deeper look. We will attempt to separate fact from fiction and learn how and why this assumption arose in the first place. To do this, you will gain the theoretical tools from the discipline of bilingualism and the broader field of applied linguistics, then use these to analyze the languages (e.g., Ryukyuan/Okinawan, Ainu, Japanese Sign Language; and 'community' languages like Korean, Chinese, and Portuguese) and dialects (e.g., Kansai, Tohoku) of Japan. The course will cover the sociolinguistic, cognitive, and cultural dimensions of bilingualism in Japan. Topics we will explore include language policy and planning, language attitudes, code switching, bilingualism in the media, lexical borrowing, bilingual education, and language maintenance and loss.\n\n\nIn this course we explore bilingualism and multilingualism in the context of Japan. Often viewed from the outside, and branded from within; as a linguistically and culturally homogenous society, Japan's linguistic landscape is in fact more complex upon a deeper look. We will attempt to separate fact from fiction and learn how and why this assumption arose in the first place. To do this, you will gain the theoretical tools from the discipline of bilingualism and the broader field of applied linguistics, then use these to analyze the languages (e.g., Ryukyuan/Okinawan, Ainu, Japanese Sign Language; and 'community' languages like Korean, Chinese, and Portuguese) and dialects (e.g., Kansai, Tohoku) of Japan. The course will cover the sociolinguistic, cognitive, and cultural dimensions of bilingualism in Japan. Topics we will explore include language policy and planning, language attitudes, code switching, bilingualism in the media, lexical borrowing, bilingual education, and language maintenance and loss.",
    "course_description": "This course explores the sociolinguistic, cognitive, and cultural dimensions of bilingualism and multilingualism as they relate to Japan. Students will gain familiarity with the linguistic landscape of Japan and learn theoretical tools from the field of bilingualism to analyze linguistic diversity.",
    "prerequisites": null,
    "instructors": "Seth J Goss - Primary Instructor",
    "schedule_location": "T 9:40am-10:55am in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 3635, Section #: 1, Type: LEC, Campus: ATL, Meets: T 9:40-10:55a, Instructor: S. Goss, Status: Open",
    "date_accessed": "2024-03-30"
}