{
    "course_code": "ICIVS 770",
    "course_title": "Special Topics in ICIVS: Gender,Sexuality,Mughal World",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 6 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Same as WGS 730R 1)\n(Scholars of Mughal India and the early modern Islamic world have taken bold interest in thinking the feminine and ambiguous figures (women, eunuch, concubines, wet nurses), spaces (harem, gardens, tents), and multiple forms of desire by critically re-engaging archival practices. In placing female courtly and wider worlds in history, the question, what constitutes the evidence, and the rich and vibrant feminist theory as it relates to the archive, is vital in this seminar. Soaked in present debates, and historiography, this graduate seminar rests upon reading seminal intellectual works - and sources, that include textual works, painterly forms, architectural spaces - that enabled radical departures in Mughal history. At the heart of our discussion is the key issue of knowledge-legacies, such as those of colonialism, and the heavy male dominated histories of the pre-modern world. Our goal in probing the fundamental departures made in Mughal historiography is to enable us to see closely the scholarly practices, which might fruitfully help us discern playful approaches in writing `other' histories. Located in the north Indian geography of the Mughal Empire, the context of our readings and discussions will delve into the wider Ottoman-Safavid nexus, the vitality of court life in relation to the early modern period, questions of domestic and state formation and the movement and migration of people throughout the Indian subcontinent and beyond.)",
    "course_description": "Special topics related to Islamic Civilizations Studies, at the graduate level; may be repeated when content varies.",
    "prerequisites": null,
    "instructors": "Ruby Lal - Primary Instructor",
    "schedule_location": "M 1pm-3:45pm in Callaway Center S319",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3342, Section #: 2, Type: LEC, Campus: ATL, Meets: M 1-3:45p, Instructor: R. Lal, Status: Closed",
    "date_accessed": "2024-03-30"
}