{
    "course_code": "FILM 392R",
    "course_title": "Genre Studies: Horror Media",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 10Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "Although American horror cinema and television have recently acquired cultural prestige due to key films' and cable/streaming programs' emphasis on sociopolitical allegory and historical memory amidst tumultuous world events, the genre has historically been derided by critics as campy, gaudy, and/or exploitative, despite its enduring appeal to marginalized audiences. This course will grapple with horror's consistencies and shifts in terms of narrative tropes, aesthetic sensibilities, industrial contexts, and viewer fandoms to explore affective significances and cultural impacts of suspense/supernatural storytelling across a variety of media. Students will engage numerous genre-variant writing assignments in preparation for a research-based final essay pertaining to a horror movie or show of particular interest.",
    "course_description": "History and theory of one or more major Hollywood genres, such as the Western, the gangster film, the musical, the horror film, film noir, and science fiction and their international analogues (e.g., the American Western and the Japanese chambara film). Weekly screenings required.",
    "prerequisites": "FILM 102 and (FILM 201 or FILM 202 or FILM 203 or FILM 204) or equivalent transfer credit as prerequisite.",
    "instructors": "Ben Kruger-Robbins - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Rich Building 103\nW 4pm-6pm in White Hall 206",
    "course_resources": null,
    "sections": "Class Nbr: 3739, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p; W 4-6p, Instructor: B. Kruger-Robbins, Status: Open",
    "date_accessed": "2024-03-30"
}