{
    "course_code": "ARTHIST 262",
    "course_title": "Europe In the Late 19th Century",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 50 / Seats Avail: 9Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "Europe in the Late Nineteenth Century: \"The Age of Impressionism\"An introduction to European art during the second half of the nineteenth century, this course focuses on France and Great Britain, the dominant world powers at that time. \nBy studying the period broadly and looking closely at individual works of art, we will trace the inception, emergence, and decline of several art movements, including Realism, Pre-Raphaelitism, and Aestheticism, with an emphasis on the artistic innovations of Impressionism. No previous experience in art history is required. \nARTHIST 262 investigates the range of social structures and institutions, aesthetic ideologies, and formal methods that conditioned the works and professional lives of artists in the second half of the nineteenth century. To sharpen our understanding of developments in the art world, we will look at both conservative champions of academic art and leading figures of the avant-garde; and we will consider the impact of the political revolutions of 1848, the influence of Japanese woodblock prints and the new medium of photography, and the barriers to success that confronted the growing ranks of women artists in Britain and France.  \nArt History major/minor: Division III",
    "course_description": "Focused survey of European art from around 1851 to 1900, including works by the Realists, Impressionists, Post-Impressionists, and Symbolists. Integrates art with the political, philosophical, and cultural currents of the time and examines the evolution of modernism.",
    "prerequisites": null,
    "instructors": "Linda Merrill - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in White Hall 111",
    "course_resources": null,
    "sections": "Class Nbr: 1066, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 10-11:15a, Instructor: Merrill/Pierce, Status: Open",
    "date_accessed": "2024-03-30"
}