{
    "course_code": "ARTHIST 232",
    "course_title": "Monastery & Cathedral, 900-1300",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 30 / Seats Avail: 14Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "When the eleventh-century monk, Raoul Glaber, observed of all the rebuilding taking place around him, \"It was as if the whole earth, having cast off the old, were clothing itself everywhere in the white robe of the church,\" he provided one of the earliest acknowledgements that there was something distinctive about the arts in this period. We'll examine other kinds of compelling evidence. The art of this era is sometimes referred to as Romanesque and Gothic, and also as High Medieval. \nOur focus will be multi-cultural, including a foundation in the rich artistic legacies of Byzantium, Ireland, and Islam before we follow the unprecedented developments in western Europe of which Raoul Glaber spoke. Major topics include the revival of monumental sculpture and the development of a stone vaulted architectural system that meets the seemingly antithetical goals of height and interior illumination. As we shall see, this transcendent devotional environment setting was accompanied by imagery and rituals that make new kinds of claims on the beholder.\nArt History major/minor: Division II",
    "course_description": "Arts of the Romanesque and Gothic period, including architecture, sculpture, stained glass, and manuscript illumination. Major topics include the revival of monumental sculpture, the cult of relics, the rise of urban centers, and the development of a stone-vaulted architecture.",
    "prerequisites": null,
    "instructors": "Elizabeth Pastan - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Math & Science Center - N306",
    "course_resources": null,
    "sections": "Class Nbr: 1063, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: E. Pastan, Status: Open",
    "date_accessed": "2024-03-30"
}