{
    "course_code": "ARTHIST 387",
    "course_title": "Issues in Art Conservation",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "Issues in Conservation of Art and Cultural Property\nThis course will provide an introduction to the field of Art Conservation as well as an overview of the principle issues surrounding the care and preservation of cultural properties.  Presentations and discussions will address historic materials and technologies, as well as aging properties, deterioration, and conservation treatment.  Discussions will consider issues of aesthetics, ethics, artist's intent, change over time, and compensation for damage.  We will also examine the use of science, review seminal debates in the recent history of conservation, and consider the role of conservation within collecting institutions and beyond. Examples will be drawn from a wide variety of cultures and will represent diverse media, including paper, paintings, stone, metals, ceramics, archaeological remains, and modern synthetic materials.   \nArt History major with Museums Concentration: elective",
    "course_description": "Students will explore the principle issues surrounding the care and preservation of art and cultural property, considering materials, deterioration, object history, and treatment.",
    "prerequisites": null,
    "instructors": "Renee Stein - Primary Instructor",
    "schedule_location": "M 1pm-3:45pm in Carlos Museum - 303",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 1070, Section #: 1, Type: LEC, Campus: ATL, Meets: M 1-3:45p, Instructor: R. Stein, Status: Closed",
    "date_accessed": "2024-03-30"
}