{
    "course_code": "ARTHIST 329",
    "course_title": "Topics: Art of Class Antiquity: Roman Sculpture in Context",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 3Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "Same as CL 329R 1\nSculpture of all types constitutes one of the great artistic legacies of ancient Rome.  Historical reliefs, realistic portraits, ideal depictions of gods and mythological figures, private funerary representations, architectural sculpture, and small scale carving on semi precious stones all provide important documentation of Roman culture.  This course will trace the development of Roman sculpture in all genres with emphasis on social, political and historical context, from the foundation of Rome in the 8th century B.C. until its transformation into an emerging Christian empire during the 4th century A.C.  The course will also incorporate important works of Roman sculpture preserved in the Michael C. Carlos Museum and graphic representations of Roman sculpture in the Rose Manuscript, Archive and Rare Book Library.\nArt History major/minor: Division I",
    "course_description": "Topics could include ancient sanctuaries; early Greece: real and imagined and religious festivals; myth and art in ancient Greece; and Greek architecture. May be repeated for credit when topic changes, up to a maximum of twelve hours.",
    "prerequisites": null,
    "instructors": "Eric Varner - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in White Hall 110",
    "course_resources": null,
    "sections": "Class Nbr: 1088, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: E. Varner, Status: Open",
    "date_accessed": "2024-03-30"
}