{
    "course_code": "ARTHIST 329",
    "course_title": "Topics: Art of Class Antiquity: Ancient Monuments,Mod.Politics",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 30 / Seats Avail: 26Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "\"Ancient Monuments, Modern Politics\"In 1934, the Italian fascist dictator Benito Mussolini tore down houses in a poor neighborhood in Rome to expose the Circus Maximus, an enormous ancient chariot-racing venue. He also rerouted roads and leveled other residences, all to highlight the city's ancient past and style himself after Rome's first emperor, Augustus. Mussolini was neither the first nor the last leader to use ancient monuments to further their political goals. This raises an important question: who owns the past? In this class, we will explore the ways in which state actors and political leaders have used and abused ancient Mediterranean history and archaeology in building modern national identities. Case studies will include the Nazi appropriation of the Greek past, ISIS and the destruction of Palmyra, Masada and nation-building in Israel, ancient Athenian manipulation of earlier monuments, competing `Roman' pasts in France, and the complexities of cultural heritage in North Africa. Ultimately, this course is concerned with the vital role of the past in the present. \nArt History major/minor: Division I\nArt History major with Museums Concentration: elective",
    "course_description": "Topics could include ancient sanctuaries; early Greece: real and imagined and religious festivals; myth and art in ancient Greece; and Greek architecture. May be repeated for credit when topic changes, up to a maximum of twelve hours.",
    "prerequisites": null,
    "instructors": "Katherine Harrington - Primary Instructor",
    "schedule_location": "MW 8:30am-9:45am in Callaway Center C101",
    "course_resources": null,
    "sections": "Class Nbr: 5262, Section #: 3, Type: LEC, Campus: ATL, Meets: MW 8:30-9:45a, Instructor: K. Harrington, Status: Open",
    "date_accessed": "2024-03-30"
}