{
    "course_code": "ARTHIST 475RW",
    "course_title": "Sem:Med/Euro/Renais/Baroque Art: Materials/Materiality Med.Art",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 8 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "Complete Topic: Materials & Materiality in Medieval Art\nThis course asks the question, how can an approach based on awareness of materials contribute to understanding the meanings conveyed by works of medieval art? As Caroline Bynum stated in her landmark study, Christian Materiality (2011): \"The stuff of which medieval images were made was not incidental.\" At play in the case studies we'll examine in the course are how medieval artists and commentators thought about materials such as rock crystal, porphyry, mosaics, ivory, stone, parchment, and stained glass, and skillfully used them to reinforce visual impact and symbolic meaning within works of art.  The focus will be on the 11th-14th century, a formative period, when the church came to embrace the role of art in devotions and rising rates of literacy contributed to surprisingly frank and engaged discussions about works of art. \nThis is an upper-level, writing-intensive seminar designed for students who have some experience with art history, typically having taken courses at the 200 or 300 level.\nArt History major/minor: Division II",
    "course_description": "Advanced seminar with emphasis on critical texts, methods, and techniques of art historical investigation. For art history majors; open to others with permission from the instructor.",
    "prerequisites": null,
    "instructors": "Elizabeth Pastan - Primary Instructor",
    "schedule_location": "M 4pm-6:45pm in Candler Library 212",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 1907, Section #: 2, Type: SEM, Campus: ATL, Meets: M 4-6:45p, Instructor: E. Pastan, Status: Wait List",
    "date_accessed": "2024-03-30"
}