{
    "course_code": "ARTHIST 485RW",
    "course_title": "Seminar in the Art of the Ancient Americas, Africa, the African Diaspora, Islam and Asia: Ancient Maya Painted Ceramics",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 8 / Seats Avail: 2Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "This seminar delves into ancient Maya painted ceramic vessels, examining their materials, painted images and texts, and archaeological and historical contexts. The class will include hands-on examination of ceramics in the Michael C. Carlos Museum and an introduction to materials analysis of ceramics, in order to combine understanding of the manufacture and use of ceramics with their artistic renderings and social contexts. This seminar also will address the historiography of ancient Maya ceramics and the history of collection and exhibition of these works.\nThis is a combined upper-division undergraduate seminar and graduate seminar. The class will meet weekly in-person for one session and will have asynchronous reading and writing assignments.\nThis is an upper-level, writing-intensive seminar designed for students who have some experience with art history, typically having taken courses at the 200 or 300 level.\nArt History major/minor: Division IV\nArt History major with Museums Concentration: elective",
    "course_description": "Advanced seminar with emphasis on critical texts, methods, and techniques of art historical investigation. For art history majors; open to others with permission from the instructor.",
    "prerequisites": null,
    "instructors": "Megan O'Neil - Primary Instructor",
    "schedule_location": "W 8:30am-11:15am in Carlos Museum - Tate",
    "course_resources": null,
    "sections": "Class Nbr: 1908, Section #: 1, Type: LEC, Campus: ATL, Meets: W 8:30-11:15a, Instructor: M. O'Neil, Status: Open",
    "date_accessed": "2024-03-30"
}