{
    "course_code": "ARTHIST 480RW",
    "course_title": "Sem:Late18th Cont Eur&Am Art: Priority & Belatedness",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 7 / Seats Avail: 5Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "'Strong poets,' writes Harold Bloom in his influential 1973 volume Anxiety of Influence, \"wrestle with their strong precursors, even to the death.\" This course will take up the situation of belatedness in which artists often find themselves vis-à-vis 'heroic' models and moments in the history of art. We will take up this problematic generally, but also with particular focus on artists of the latter half of the twentieth century, who resided in the wake of modernism and the historical avant-garde. Together we will consider strategies for dynamic engagement with epochal developments'e.g. homage, imitation, travesty, and pastiche-strategies, in other words, that aim to convert belatedness into priority.\nThis is an upper-level, writing-intensive seminar designed for students who have some experience with art history, typically having taken courses at the 200 or 300 level.\nArt History major/minor: Division III",
    "course_description": "Advanced seminar with emphasis on critical texts, methods, and techniques of art historical investigation. Permission from instructor required.",
    "prerequisites": null,
    "instructors": "Lisa Lee - Primary Instructor",
    "schedule_location": "T 1pm-3:45pm in Carlos Hall Conference",
    "course_resources": null,
    "sections": "Class Nbr: 1074, Section #: 1, Type: SEM, Campus: ATL, Meets: T 1-3:45p, Instructor: L. Lee, Status: Open",
    "date_accessed": "2024-03-30"
}