{
    "course_code": "ARTHIST 190",
    "course_title": "Freshman Seminar:Art History: The 12 Caesars:Sex, Lies& Politics in Ancient Rome",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 0 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First Year Seminar",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(Same as CL 190 3)\n(Freshmen Seminar - Limited to First Year Students Only)\n(Complete Topic - 12 Caesars: Sex, Lies and Politics in Ancient Rome)\n(This is a special first year seminar focused on evidence. Popular perceptions of Rome's first twelve Caesars (who included Julius Caesar, Augustus, Caligula, Claudius, Nero, Vespasian, Titus and Domitian) are often fueled by the ancient biographer Suetonius's lurid and scandalous accounts of the period. Suetonius's Twelve Caesars is filled with accusations of outrageous sexual behavior, madness, and political posturing, that are often in direct opposition to the visual record as embodied in official monuments of art and architecture commissioned by the Caesars themselves or their wives. This course will combine an in-depth examination of the artistic material including surviving portraits in sculpture and on coins and gems, together with a careful reading of Suetonius's text, as well as new biographical material on the twelve Caesars. Close attention will be paid to the visual evidence, the iconographic meaning of artistic monuments, their intended audiences, and their points of comparison and divergence from the textual evidence of Suetonius, thus revealing the complex nature of Roman culture and society in the early imperial period.)",
    "course_description": "Limited to freshmen and introductory in nature, these seminars may feature discussion, readings, museum visits, and presentations.",
    "prerequisites": null,
    "instructors": "Eric Varner - Primary Instructor",
    "schedule_location": "T 10am-12:45pm in Carlos Museum - Tate",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ARTHIST_190_2_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: This section is full 3038, Section #: 2, Type: SEM, Campus: ATL, Meets: T 10a-12:45p, Instructor: E. Varner, Status: Closed",
    "date_accessed": "2023-10-30"
}