{
    "course_code": "ARTHIST 345",
    "course_title": "The Formation of Islamic Art",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 3Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(Topic: Medieval Islamic Art)\n(This class follows the development of Islamic art from the emergence of Islam as a religion in 8th-century Arabia to the consolidation of three large Islamic empires in the early modern period. We will begin by studying the context in which Islam developed, considering the religious, cultural, and artistic influences that the new faith looked to in formulating its own visual vocabulary. We then turn to an in-depth examination of the media that medieval Islamic artists excelled at ceramics, textiles, and manuscript painting, before ending the semester with an overview of the artistic output of major Islamic dynasties throughout the Middle Ages, each of which reshaped their Islamic artistic heritage in unique ways. In addition to studying the development of Islamic art, we will also reflect on how Orientalism and Eurocentrism has shaped popular conceptions of Islam and its art in ways that are still apparent in movies, television shows, and art. \nArt History major/minor: Division II or IV)",
    "course_description": "An introduction to the early formative period of Islamic art in the sixth through the thirteenth centuries, drawing upon architecture, ceramics, textiles, metalwork, and manuscript illumination.",
    "prerequisites": null,
    "instructors": "Nicole Corrigan - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in Math & Science Center - N302",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ARTHIST_345_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3587, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: N. Corrigan, Status: Open",
    "date_accessed": "2024-03-30"
}