{
    "course_code": "ARTHIST 393R",
    "course_title": "Special Studies History of Art: Intro.3D Visualization& Inter.",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 7",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(Computer graphics are an essential aspect of modern computing. 3D computer graphics can now be manipulated in quasi real-time. This technology, which enabled interactions with 3D virtual objects, immediately made its way into several different mainstream industry including design, visualization, and video gaming.)\n(This course will introduce the concepts of 3D modeling, texturing, and visualization, using AutoDesk 3DSMax and its rendering abilities. We will go through hands-on assignments to learn and practice developing/modifying 3D assets with a focus on 3D modeling of architectural spaces. Additionally, this course will introduce architectural history, focusing on periods with associated Emory 3D reconstruction projects. We will review the fundamentals of architecture by studying important historical buildings. You will be able to put into practice your understanding of architecture elements by learning how to reconstruct them in 3D models. We shall learn (see demos) about various 3D visualization paradigms such as Virtual Reality (VR) and Augmented Reality (AR). We shall learn about various application (immersive) deployment strategies that real-time game engines, such as UnityTM and Unreal Engine, have to offer.)\n (Art History major/minor: makers & materials course \nArchitectural Studies minor: may be substituted for Art History 210 requirement)",
    "course_description": "Advanced seminars dealing with various specialized problems in the history of art from antiquity to modern times, such as individual artists, genres (e.g. portraiture, landscape); themes (e.g. theory, iconography); artistic movements and museum studies. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Ian Burr - Primary Instructor",
    "schedule_location": "MW 4pm-5:15pm in Math & Science Center - E301A",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ARTHIST_393R_3_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3591, Section #: 3, Type: SEM, Campus: ATL, Meets: MW 4-5:15p, Instructor: Burr/Mundy, Status: Open",
    "date_accessed": "2024-03-30"
}