{
    "course_code": "ARTHIST 485RW",
    "course_title": "Seminar in the Art of the Ancient Americas, Africa, the African Diaspora, Islam and Asia: Land.& Mem.in Anc.Maya Cities",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 7 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(Complete Topic: Landscape and Memory in Ancient Maya Cities)\n(This seminar will address landscape and memory in ancient Maya cities by focusing on sculpture, architecture, and relationships between the built environment and natural world. We will examine how Maya rulers and other nobles connected themselves to ancestors and deities through image and text and by recreating primordial landscapes in Maya cities. We also will study concepts of social and collective memory from various disciplines. Students will focus on one building throughout the semester, exploring various aspects of the structure, sculptures, and environment, in order to develop a research paper.)\n(Art History major/minor: Division IV\nArchitectural Studies minor: elective)\n(This is an upper-level, writing-intensive seminar designed for students who have some experience with art history, typically having taken courses at the 200 or 300 level. This is a combined undergraduate seminar and graduate seminar.)",
    "course_description": "Advanced seminar with emphasis on critical texts, methods, and techniques of art historical investigation. For art history majors; open to others with permission from the instructor.",
    "prerequisites": null,
    "instructors": "Megan O'Neil - Primary Instructor",
    "schedule_location": "Th 2:30pm-5:15pm in Emerson Chemistry Bldg. E103",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ARTHIST_485RW_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3819, Section #: 1, Type: SEM, Campus: ATL, Meets: Th 2:30-5:15p, Instructor: M. O'Neil, Status: Wait List",
    "date_accessed": "2024-03-30"
}