{
    "course_code": "ARTHIST 480RW",
    "course_title": "Sem:Late18th Cont Eur&Am Art: Monuments,Anti&CounterMonument",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 3 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(At various points in history, questions regarding the symbolic and functional significance of public space become acute. The momentum with which racist and colonialist monuments across the United States and in Europe are being toppled or removed signals, unequivocally, that we are in such a moment. To what extent might these events be seen to signal a \"mere\" symbolic politics? To what extent might symbolic politics be understood to be a galvanizing force in collective action? This seminar takes up the topic of the public monument in the 20th and 21st centuries. Crucially, it considers reactions against the conventions and presumptions of traditional monuments, such as permanence, gestalt form, unitary meaning, and centrality. Anti-monumental impulses refuse and denounce (sometimes violently) symbolic content imposed from above, as well as the formal means that are a vehicle for such content. Counter-monuments emphasize alternative values: ephemerality, fragmentation, ambiguity, and marginality. Together, the members of this seminar will grapple with manifestations of power, resistance, and collectivity in public space. We will follow closely and participate actively in the Twin Memorials project unfolding at Emory University.)\n(Art History major/minor: Division I)\n(This is an upper-level, writing-intensive seminar designed for students who have some experience with art history, typically having taken courses at the 200 or 300 level.)",
    "course_description": "Advanced seminar with emphasis on critical texts, methods, and techniques of art historical investigation. Permission from instructor required.",
    "prerequisites": null,
    "instructors": "Lisa Lee - Primary Instructor",
    "schedule_location": "Th 10am-12:45pm in Carlos Hall Conference",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ARTHIST_480RW_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3815, Section #: 1, Type: SEM, Campus: ATL, Meets: Th 10a-12:45p, Instructor: L. Lee, Status: Wait List",
    "date_accessed": "2024-03-30"
}