{
    "course_code": "ARTHIST 490W",
    "course_title": "Research with Primary Sources",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 2Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Irregularly",
    "requirement_designation": "Experience and Application with Cont.Comm(*)",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(Topic: Atlanta Architecture in the Modern Era)\n(For a large and culturally significant US city, Atlanta is surprisingly understudied as an architectural site. This advanced architectural history course asks why Atlanta's built environment remains under the radar of architectural historians and builds a case for its elevation through collective readings, discussion, and field trips. The issues inherent to Atlanta's built environment will unfold decade to decade in the course. Themes that impact spatial practices and that thread through the class modules include racial segregation; cycles of demolition and reconstruction; connections with international architectural trends; urban expansion, suburbanization, and sprawl; transit development and transportation inequity; disinvestment, neoliberalism, and gentrification; global cultural production. The hands-on final project requires students to select, research, and compose an image-rich \"building biography\" of a 20th century Atlanta building to be published on the seminar's public history website.)\n(Art History major/minor: Division III)\n(Architectural Studies minor: elective)",
    "course_description": "Topics. Focuses on research methods using primary sources. Examines original objects in archives, libraries, and museums. Supports original research and communication in various genres. Emphasizes first-hand experience of art, exhibitions, and archives through local field trips and domestic travel.",
    "prerequisites": null,
    "instructors": "Christina Crawford - Primary Instructor",
    "schedule_location": "T 1pm-3:45pm in Rich Building 201",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ARTHIST_490W_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 4102, Section #: 1, Type: SEM, Campus: ATL, Meets: T 1-3:45p, Instructor: C. Crawford, Status: Open",
    "date_accessed": "2024-03-30"
}