{
    "course_code": "AMST 201W",
    "course_title": "Introduction to American Studies",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 4Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "What does it mean to be American? Who counts as an American; and who doesn't? And who gets to decide? Over the past few years, these questions have come into sharp focus, starting a national conversation on the American society we live in and the one we would like to create. This class will look at current events, such as immigration, issues of social justice, and racial and class inequality, and set them in an historical context. We will draw connections between past events and the conversations they provoked about the idea of 'America' to events happening today. For example, how do current social movements, both progressive and conservative, build on history and react to one another? What role do social movements play in defining American identity? This course will explore how people experience disruptive cultural events given their own identities and roles in American society, how the media and other cultural artifacts frame such events, and how such events might encourage (or inhibit) social change. Using the methods and key ideas of American Studies scholarship, we will seek to begin to understand and define for ourselves what it means to be American.",
    "course_description": "An interdisciplinary, historically grounded introduction to scholarly approaches to the U.S. and the broader Americas, with emphasis on issues of class, ethnicity, gender, and cross-cultural studies. Prerequisite: ENGRD 223 Rhetorical Grammar (1 credit), which can be taken simultaneously.",
    "prerequisites": "ENGRD 223 or equivalent transfer credit as co-requisite.",
    "instructors": "Kim Loudermilk - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Callaway Center S420",
    "course_resources": null,
    "sections": "Class Nbr: 3595, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: K. Loudermilk, Status: Open",
    "date_accessed": "2024-03-30"
}