{
    "course_code": "AMST 385",
    "course_title": "Special Topics: American Studies: US Women's History 1800-1900",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 10Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Same as HIST 385 5, WGS 385 5)\nThis course is the second in a two-part series investigating U.S. women's history through the lens of myths. This semester, we will focus on the period from the early republic to post-Reconstruction to examine how myths about women developed and how they were perpetuated and by whom. Topics include political and economic activities of different groups of women; how ideas about race and class influenced expectations regarding women's work; women's lives across divisions of public vs. private; laws and customs that prescribed or criminalized women's activities and behavior; practices in medicine and healing; and family, marriage, and sexuality. We will also investigate connections between these and larger political, social, cultural, and economic developments and institutions that shaped the trajectory of U.S. history. Class discussions and papers will focus on the circumstances in which women of different groups appear in primary sources, myths formed and perpetuated in some of these sources, and evidence that challenges these myths. We will also discuss what women's history is, how it has been written, and ongoing debates around it.",
    "course_description": "Specialized courses in American culture and history. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "J.E. Morgan - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in Rich Building 108",
    "course_resources": null,
    "sections": "Class Nbr: 3817, Section #: 3, Type: LEC, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: J. Morgan, Status: Open",
    "date_accessed": "2024-03-30"
}