{
    "course_code": "AMST 385",
    "course_title": "Special Topics: American Studies: Native American Environments",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 6Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Same as HIST 385 6)\n(Recovering Indigenous environments and societies of a vast continent before partition by international borders, this hemispheric history of Turtle Island (North America) spans the land's geological origins through the end of the \"Little Ice Age\" in mid nineteenth century. This interdisciplinary course will introduce students to the study of environmental history and Indigenous political ecology by recovering how Native American societies and cultures developed in relationship with dynamic ecosystems in present-day North America. We will interpret Native American creation stories with careful attention to original instructions for living on the land, traditional ecological knowledge (TEK), and the ways the land constituted Indigenous legal systems and community governance. Likewise, we will read colonial sources against the grain such as early modern ethnographies, cartographies, treaties, and land deeds to recover the ways diverse Native American communities cared for their homelands, adapted to European ecological imperialism, and responded to environmental crises triggered by cyclical fluctuations in the Atlantic climate. Moreover, readings and assigned media will challenge mythologies of the unchanging ecological Indian living in an unspoiled wilderness to recognize Indigenous peoples as imperfect but consistent historical actors on the lands and waters that sustained and continue nourish their communities.)",
    "course_description": "Specialized courses in American culture and history. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Loren Michael Mortimer - Primary Instructor",
    "schedule_location": "MW 4pm-5:15pm in Math & Science Center - N304",
    "course_resources": null,
    "sections": "Class Nbr: 3818, Section #: 4, Type: LEC, Campus: ATL, Meets: MW 4-5:15p, Instructor: L. Mortimer, Status: Open",
    "date_accessed": "2024-03-30"
}