{
    "course_code": "BIOL 141",
    "course_title": "Foundations of Modern Biol I",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 40 / Seats Avail: 36Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "Science, Nature, Technology",
    "permission": null,
    "dates": "2023-05-12 through 2023-06-21",
    "class_notes": "This is the first semester of a two-semester introductory biology course that is required for all Biology majors.  This courses will provide a topic-driven overview of evolution, molecular and cellular biology, biochemistry, genetics, and ecology.  The topics covered in LECTURE will address major issues in human biology, medicine, evolution, and ecology, with an emphasis on the basic principles and critical thinking involved in modern biological discovery.  \nStudents must also register for a BIOLOGY 141 Laboratory (BIOL 141L).  In LAB, students will design and perform experiments using several important model systems.  These courses include classical and molecular genetics and meet the biology premedical requirements.  Some exams may be administered in the evening.  AP Biology scores of 4 or 5 count for the Biology 141 LECTURE ONLY.  Students with AP credit for the lecture are required to take the Lab (BIOL 141L).  Co-requisite: Biology 141L.",
    "course_description": "Major topics include: biomolecules, cell structure and function, energy metabolism, and cell reproduction. Fulfills biology major and pre-health requirements. Note: students receiving credit for Biol 141 must still take Biol 141L.",
    "prerequisites": null,
    "instructors": "Kathleen Campbell - Primary Instructor",
    "schedule_location": "MWF 2:30pm-4:45pm in 1462 Clifton Rd 230",
    "course_resources": null,
    "sections": "Class Nbr: 1561, Section #: 1, Type: LEC, Campus: ATL, Meets: MWF 2:30-4:45p, Instructor: K. Campbell, Status: Open",
    "date_accessed": "2024-03-30"
}