{
    "course_code": "BIOETH 505",
    "course_title": "Special Topics in Bioethics: Ethical Issues US Hlth.Policy",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 12",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-05-13 through 2022-08-03",
    "class_notes": "Class Title: Ethical Issues in US Health Policy\nCourse Description: This course will familiarize students with the processes by which health policies are enacted and implemented in the United States. Students will explore the moral and normative assertions of major policies that impact US health care, as well as examine how health policy at the federal, state, and local levels may give rise to issues in clinical ethics and public health ethics. The course will begin with an introduction to the major policy making processes relevant to the US health care context. Students will then learn about the intent and implementation of key policies (e.g., Medicaid work requirements, use of patient satisfaction scores in physician reimbursement), and, informed by literature from health policy and bioethics, assess the ethical implications of these policies. Additionally, students will apply diverse moral theories and ethical frameworks to examine case studies in clinical and public health ethics as they relate to the policies that directly or indirectly contribute to the observed moral tensions.",
    "course_description": "Topics and professors for the Bioethics elective change every semester.",
    "prerequisites": null,
    "instructors": "Kelsey Drewry - Primary Instructor",
    "schedule_location": "Th 1pm-4pm in Center for Ethics 162",
    "course_resources": null,
    "sections": "Class Nbr: 2241, Section #: 1, Type: LEC, Campus: ATL, Meets: Th 1-4p, Instructor: K. Drewry, Status: Open",
    "date_accessed": "2024-03-30"
}