{
    "course_code": "LACS 385",
    "course_title": "Special Topics in Latin American and Caribbean Studies: AfroCuban Music and Literature",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(This course is taught in English)\n(This course does NOT carry a GER tag)\nThis course will explore the significant aesthetical connections present in Afro-Cuban Literature and Music. We will examine the birth and the intersections of influential Afro Cuban aesthetics that have shaped culture and society in Cuba, emerging in literary texts and musical compositions, but also in philosophical essays analyzing Cuban literature and music. We will examine how throughout time Afro Cuban aesthetics have significantly influenced postcolonial cultural expressions / artistic representations in the island. Our analytic endeavor should focus on the developments of Afro Cuban culture and its instrumental effects into shaping Cuban culture.\nWe will attempt to answer questions such as: How Afro-Cuban Aesthetics are present in Cuban culture? Have Afro-Cuban Aesthetics expressed a socio-politics of racial inclusion and multiculturalism in the island? To what extent Cuban Aesthetics are Afro Cuban? What is Afro Cuban Aesthetics?\nPARTICULARS: The evaluation of the seminar is based in attendance / participation (a two (2) students' presentation), a short essay (3 pages) due by the four week of classes, one midterm essay (5 pages) and one comparative final paper (10 pages).",
    "course_description": "Special Topics in Latin American and Caribbean Studies. Topics vary.",
    "prerequisites": null,
    "instructors": "Axel Presas - Primary Instructor",
    "schedule_location": "TTh 4:20pm-5:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2459, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 4:20-5:35p, Instructor: A. Presas, Status: Closed",
    "date_accessed": "2024-03-30"
}