{
    "course_code": "LAW 668X",
    "course_title": "Employment Law",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 45 / Seats Avail: 7Waitlist Total: 0 of 5",
    "waitlist_total": ": 0 of 5",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-01-03 through 2023-04-18",
    "class_notes": "Employment law is a rapidly expanding area of law and policy, and one that touches many other practice areas, including corporate law, contracts, benefits law, and torts. Even if you don't seek to be an employment lawyer, if you advise clients who have employees, it is helpful to know the basics of employment law. This course will cover the rights and duties of employers and employees in the private workplace, including: the employment relationship, including at-will employment and exceptions; employment contracts, including agreements regarding non- competition and trade secrets; wage and hour and family leave laws; discrimination in the workplace; employee rights including under whistleblower and other laws; and more. We will discuss the major federal statutes, regulations, and common law doctrines of employment law. This course will not cover labor law (the law governing the rights of employees to organize collectively). The class will include exercises that simulate the types of issues lawyers encounter in practice in this field.",
    "course_description": "This three-hour course will cover many of the major legal aspects of the employment relationship not treated in Labor Law. We will examine legal principles applicable to the hiring process, the key terms and conditions of employment, employment discrimination, occupational safety and health, employment termination, and post-employment issues.",
    "prerequisites": null,
    "instructors": "Karen Cooper - Primary Instructor",
    "schedule_location": "TTh 10:30am-12pm in Gambrell Hall 5B",
    "course_resources": null,
    "sections": "Class Nbr: 1813, Section #: 001, Type: LEC, Campus: ATL, Meets: TTh 10:30a-12p, Instructor: K. Cooper, Status: Open",
    "date_accessed": "2024-03-30"
}