{
    "course_code": "LAW 659R",
    "course_title": "Doing Deals: Representing Investment Funds",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 22 / Seats Avail: 15Waitlist Total: 0 of 3",
    "waitlist_total": ": 0 of 3",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-01-03 through 2023-04-18",
    "class_notes": "Access to Justice provides second and third year law students the unique opportunity to see how justice is actually administered in criminal cases in Georgia State Courts as well as to develop their courtroom oral advocacy skills in a real-world setting. We will examine, through readings and classroom discussion, the ways in which poor and underserved populations access justice within the framework of the traditional criminal justice system, including the barriers that may prevent justice from being served in those processes.  We will also discuss the increasing role of accountability courts for defendants experiencing drug, alcohol, mental health and other related challenges.",
    "course_description": "Simulate the structuring, formation, & regulatory work that would be performed by a junior associate or in-house counsel representing public investment companies, private investment funds, or other pooled investment vehicles. Students will gain experience in analyzing statutes & regulations that govern a fund's structure & operations; structuring public & private offerings; reviewing & drafting various documents included in a fund offering; and considering ethical issues that may arise.",
    "prerequisites": "Business Associations, Contract Drafting, and Deal Skills are pre-requisites for this course. If you have not satisfied all courses, then you are not eligible to enroll at this time. Please contact Kelli.Pittman@emory.edu with all inquiries.",
    "instructors": "Martin Dozier - Primary Instructor",
    "schedule_location": "W 4:15pm-7:15pm in Gambrell Hall 5J",
    "course_resources": null,
    "sections": "Class Nbr: 5921, Section #: 001, Type: LEC, Campus: ATL, Meets: W 4:15-7:15p, Instructor: M. Dozier, Status: Open",
    "date_accessed": "2024-03-30"
}