{
    "course_code": "LAW 659B",
    "course_title": "Doing Deals: Deal Skills",
    "credit_hours": "3",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Varies by section",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-01-03 through 2023-04-18",
    "class_notes": "DO NOT TRY TO ENROLL IF YOU DID NOT RECEIVE A SPECIFIC ENROLLMENT WINDOW! Registration for this class is only for students in the Transactional Certificate Program. Non-certificate students can try to enroll during Open Enrollment, if there are open seats.",
    "course_description": "Deal Skills builds on the skills and concepts learned in Contract Drafting and emphasizes the skills and thought processes involved in, and required by, the practice of transactional law. The course introduces students to business and legal issues common to commercial transactions, such as M&A deals, license agreements, commercial real estate transactions, financing transactions, and other typical transactions. Students learn to interview, counsel, and communicate with simulated clients; conduct various types of due diligence; translate a business deal into contract provisions; understand basic transaction structure, finance, and risk reduction techniques; and negotiate and collaboratively draft an agreement for a simulated transaction. Classes involve both individual and group work, with in class exercises, role-plays and oral reports supported by lecture and weekly homework assignments. Note: Open enrollment will be available to non-transactional certificate students on a space-available basis to students with required pre-reqs once open enrollment starts.",
    "prerequisites": "B.A. & Contract Drafting are pre-requisites for this course. Only Certificate students are allowed to register at this time. Open seats will be released during the next open enrollment period.  Please contact Kelli.Pittman@emory.edu with all inquiries.",
    "instructors": null,
    "schedule_location": "Varies by section",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 1984, Section #: 001, Type: LEC, Campus: ATL, Meets: M 2-5p, Instructor: Hill/Koops, Status: Wait List\nClass Nbr: This section is full 1983, Section #: 002, Type: LEC, Campus: ATL, Meets: M 4:15-7:15p, Instructor: Delaney/Blanchard, Status: Wait List\nClass Nbr: This section is full 1987, Section #: 003, Type: LEC, Campus: ATL, Meets: T 4:15-7:15p, Instructor: Alperin/Klemperer, Status: Wait List\nClass Nbr: 1672, Section #: 004, Type: LEC, Campus: ATL, Meets: T 4:15-7:15p, Instructor: Kolodkin/McMorries, Status: Open\nClass Nbr: 1985, Section #: 005, Type: LEC, Campus: ATL, Meets: W 4:15-7:15p, Instructor: Smith/Carroll II, Status: Open\nClass Nbr: This section is full 1986, Section #: 006, Type: LEC, Campus: ATL, Meets: W 2-5p, Instructor: Crawley/Townsend Jr., Status: Wait List",
    "date_accessed": "2024-03-30"
}