{
    "course_code": "LAW 700",
    "course_title": "Ethics Criminal Justice Practice",
    "credit_hours": "2",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 3",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-01-03 through 2023-04-18",
    "class_notes": null,
    "course_description": "How far does prosecutorial discretion reach? How does a prosecutor know what to ethically charge, and how to proceed? How does a defense attorney balance his client¿s best interests and remain within ethical boundaries? Students will study ethical rules as they pertain to prosecutors and defense attorneys, review cases, and constitutional issues that surround and permeate the practice of criminal law, and engage in real-world scenarios that should prepare students for the ethical dilemmas that face both prosecutors and defense attorneys in criminal litigation practice. In this course, students will review real world examples where defense attorneys and prosecutors have been censured and even in some cases, disbarred. The expectation is that students will know not only how to practice within the ethical and professional rules of conduct but to also use their own moral compass to guide their behavior and decisions. This class will largely be discussion based. Participation in weekly discussion is expected and will be part of the grading criteria. Students will be assigned a judge, prosecutor or defense attorney to interview regarding ethics in their own practice. They will then do a presentation in which they discuss what they learned, the good. the bad and the ugly. At the end of the course there will be an exam.",
    "prerequisites": null,
    "instructors": "Shyamal Patel - Primary Instructor",
    "schedule_location": "W 6pm-8pm in Gambrell Hall 5B",
    "course_resources": null,
    "sections": "Class Nbr: 2009, Section #: 0, Type: LEC, Campus: ATL, Meets: W 6-8p, Instructor: S. Patel, Status: Open",
    "date_accessed": "2024-03-30"
}