{
    "course_code": "LAW 691",
    "course_title": "Asylum, Refugee,and Removal",
    "credit_hours": "2",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 8",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-01-03 through 2023-04-18",
    "class_notes": null,
    "course_description": "This course will cover what happens once a non-citizen has been charged and placed in immigration removal proceedings (formerly called deportation proceedings). The student will study each step of the proceeding, with the choices that the client and her representative must make in the effort to avoid removal: responding to the charges and putting the government to its proof; determining the client's immigration history; determining the client's eligibility for any relief from removal; preparing a winning case on paper; preparing the client and other witnesses to testify what options are available for appeal and the requirements for filing a motion to reopen. The course will cover the legal standards and the preparation of the following applications for relief cancellation of removal, Violence Against Women Act (VAWA), 212 (c), LPR and non-LPR cancellation of removal, and affirmative and defensive asylum relief, along with withholding of removal and relief under the Convention Against Torture. We will also discuss federal court litigation of immigration related matters. Given that recent developments have greatly increased the complexity of asylum law, the course will cover this area in depth. The course will also briefly cover adjustment of status and voluntary departure, as well as the admission process. The course will not emphasize courtroom skills; however, we will discuss how to handle an immigration case in the court context.  In addition, members of the class are welcome to arrange with me an opportunity to attend hearings in Immigration Court at any time during the semester.  In addition, the skills necessary to prepare court cases will be emphasized throughout the course, with class discussions.",
    "prerequisites": null,
    "instructors": "Charles Kuck - Primary Instructor",
    "schedule_location": "W 10:30am-12:30pm in Gambrell Hall 5D",
    "course_resources": null,
    "sections": "Class Nbr: 1938, Section #: 0, Type: LEC, Campus: ATL, Meets: W 10:30a-12:30p, Instructor: C. Kuck, Status: Open",
    "date_accessed": "2024-03-30"
}