{
    "course_code": "LAW 833",
    "course_title": "SEM: Law & Vulnerability",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 8",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-01-03 through 2023-04-18",
    "class_notes": "Cross-listed with WGS 585\nStudents must complete the Preselection form to be considered for this class.",
    "course_description": "This seminar presents vulnerability theory as an alternative to a human rights paradigm for thinking about state responsibility. The seminar explores the relationship between law and the theoretical concept of vulnerability, from both an abstract and a practical perspective. The course is anchored in the understanding that fundamental to our shared humanity is our shared vulnerability, which is universal and constant and inherent in the human condition. It will offer students an opportunity to engage with multiple perspectives on vulnerability, with an emphasis on law, justice, state policy, and legislative ethics. While vulnerability can never be eliminated, society through its institutions confers certain \"assets\" or resources, such as wealth, health, education, family relationships, and marketable skills on individuals and groups. These assets give individuals \"resilience\" in the face of their vulnerability. This seminar will explore how as society now is structured, however, certain individuals and groups operate from positions of entrenched advantage or privilege, while others are disadvantaged in ways that seem to be invisible as we engage in law and policy discussions. This seminar offers new ways to conceptualize and argue for reform in the interest of achieving social justice.",
    "prerequisites": null,
    "instructors": "Martha Fineman - Primary Instructor",
    "schedule_location": "T 12:15pm-2:15pm in Gambrell Hall - 5K",
    "course_resources": null,
    "sections": "Class Nbr: 1723, Section #: 001, Type: SEM, Campus: ATL, Meets: T 12:15-2:15p, Instructor: Fineman/Moradi, Status: Open",
    "date_accessed": "2024-03-30"
}