{
    "course_code": "LAW 885",
    "course_title": "Emory Law Journal:Second Year",
    "credit_hours": "2",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Varies by section",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2023-01-03 through 2023-04-18",
    "class_notes": "Students must submit the appropriate form with the professor's approval to be enrolled.",
    "course_description": null,
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 1641, Section #: 001, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Nash, Status: Open\nClass Nbr: 1782, Section #: 002, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: F. Smith, Status: Open\nClass Nbr: 1783, Section #: 003, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: P. Koster, Status: Open\nClass Nbr: 1785, Section #: 009, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: G. Georgiev, Status: Open\nClass Nbr: This section is full 1786, Section #: 010, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: P. Price, Status: Closed\nClass Nbr: This section is full 1787, Section #: 011, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: G. Shepherd, Status: Closed\nClass Nbr: 1788, Section #: 013, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: S. Pill, Status: Open\nClass Nbr: 1789, Section #: 014, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: M. Sag, Status: Open\nClass Nbr: This section is full 1790, Section #: 015, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: H. Ludsin, Status: Closed\nClass Nbr: This section is full 1791, Section #: 016, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: M. Nevitt, Status: Closed\nClass Nbr: This section is full 1792, Section #: 020, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Shepherd, Status: Closed\nClass Nbr: This section is full 1793, Section #: 021, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: K. Cooper, Status: Closed\nClass Nbr: This section is full 1794, Section #: 022, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: L. Carroll, Status: Closed\nClass Nbr: This section is full 1977, Section #: 023, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: M. Goldstein, Status: Closed\nClass Nbr: This section is full 1978, Section #: 024, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: R. Freer, Status: Closed\nClass Nbr: This section is full 2006, Section #: 025, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: K. Pinder, Status: Closed\nClass Nbr: This section is full 2015, Section #: 026, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Mathews, Status: Closed\nClass Nbr: This section is full 2016, Section #: 027, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: D. Waters Jr., Status: Closed\nClass Nbr: This section is full 1802, Section #: 028, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Witte Jr., Status: Closed\nClass Nbr: This section is full 2018, Section #: 029, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: I. Bedzow, Status: Closed\nClass Nbr: 2017, Section #: 030, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: D. Hutchinson, Status: Open\nClass Nbr: This section is full 1856, Section #: 031, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Schwartz, Status: Closed\nClass Nbr: This section is full 1857, Section #: 032, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: M. Lawrence, Status: Closed\nClass Nbr: This section is full 1858, Section #: 033, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: T. Arthur, Status: Closed",
    "date_accessed": "2024-03-30"
}