{
    "course_code": "LAW 889",
    "course_title": "Int'l Law Review:Second Year",
    "credit_hours": "2",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2023-01-03 through 2023-04-18",
    "class_notes": "Students must submit the appropriate form with the professor's approval to be enrolled.",
    "course_description": null,
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 1645, Section #: 001, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: B. Farley, Status: Open\nClass Nbr: 1772, Section #: 002, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: E. Davis, Status: Open\nClass Nbr: 1845, Section #: 003, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: P. Koster, Status: Open\nClass Nbr: 1773, Section #: 004, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: A. Kirk, Status: Open\nClass Nbr: 1965, Section #: 005, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: M. Fineman, Status: Open\nClass Nbr: 1774, Section #: 006, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Smibert, Status: Open\nClass Nbr: 1775, Section #: 009, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: P. Price, Status: Open\nClass Nbr: 1776, Section #: 014, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: S. Allard, Status: Open\nClass Nbr: 1777, Section #: 015, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Schwartz, Status: Open\nClass Nbr: 1778, Section #: 017, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: M. Tulibacka, Status: Open\nClass Nbr: 1969, Section #: 019, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: M. Nevitt, Status: Open\nClass Nbr: 1779, Section #: 020, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Mathews, Status: Open\nClass Nbr: 1780, Section #: 021, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: R. Freer, Status: Open\nClass Nbr: 1968, Section #: 022, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Shepherd, Status: Open\nClass Nbr: 1781, Section #: 023, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Nash, Status: Open\nClass Nbr: 2020, Section #: 024, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: N. Morris, Status: Open\nClass Nbr: 1846, Section #: 026, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: H. Ludsin, Status: Open\nClass Nbr: 1847, Section #: 027, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: A. Satz, Status: Open\nClass Nbr: 1848, Section #: 028, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: A. Volokh, Status: Open\nClass Nbr: 1849, Section #: 029, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: Van der Vyver/Tulibacka, Status: Open\nClass Nbr: 1850, Section #: 030, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: Staff, Status: Open",
    "date_accessed": "2024-03-30"
}