{
    "course_code": "LAW 952",
    "course_title": "Race, Religion, and Law in the Making of America",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 11",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": "Instructor Consent Required",
    "dates": "2023-01-03 through 2023-04-18",
    "class_notes": "Students must complete the Preselection form to be considered for this class\nCross-Listed with Candler School of Theology\nRace and religion have both played an integral part in the creation of the United States as a nation and a state. Through primary legal and historical documents, as well as secondary literature on these themes, this seminar will examine the way that race and religion shaped U.S. law, particularly the law of sovereignty, citizenship, and territory, as well as how law has shaped the \"American\" nation along racial and religious lines. While many of the laws and court decisions grounded in racial and religious animus have been repealed or overturned, others have not. Even in those cases where a particular law or case is no longer applied on its original terms, many of the legal concepts such as the plenary power in immigration, dependent sovereignty, and alienage remain important elements of our legal vocabulary. Furthermore, the narratives of who and what \"America\" is or should be as a nation or people, continue to haunt contemporary law and politics. Thus, it is important to trace and critique this legal history, which the U.S. has not left behind.",
    "course_description": "Through primary legal and historical documents, as well as secondary literature on these themes, this seminar will examine the way that race and religion shaped U.S. law, particularly the law of sovereignty, citizenship, and territory, as well as how law has shaped the \"American\" nation along racial and religious lines. While many of the laws and court decisions grounded in racial and religious animus have been repealed or overturned, others have not. Even in those cases where a particular law or case is no longer applied on its original terms.",
    "prerequisites": null,
    "instructors": "Silas Allard - Primary Instructor",
    "schedule_location": "M 9am-12pm in Gambrell Hall - 5K",
    "course_resources": null,
    "sections": "Class Nbr: 5252, Section #: 1, Type: SEM, Campus: ATL, Meets: M 9a-12p, Instructor: S. Allard, Status: Open",
    "date_accessed": "2024-03-30"
}