{
    "course_code": "LAW 918",
    "course_title": "Advanced Corporate Law",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 40 / Seats Avail: 2Waitlist Total: 0 of 5",
    "waitlist_total": ": 0 of 5",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-01-03 through 2023-04-18",
    "class_notes": "This course offers an advanced treatment of key topics in corporate law and governance. It represents a continuation of the introductory business associations course and covers the regulation of public companies at the federal level by the Securities and Exchange Commission, as well as state and federal laws pertaining to mergers and acquisitions. Major topics include: federalism and corporate governance; board structure and composition; the board's oversight duties, including regulations governing the audit process and internal controls; executive compensation; shareholder activism; and mergers and acquisitions. A solid grasp of these topics is essential for those interested in practicing corporate law at a law firm or in-house.",
    "course_description": "This course offers a continuation of the introductory business associations course and covers the regulation of public companies at the federal level by the Securities and Exchange Commission, as well as state and federal laws pertaining to mergers and acquisitions. Major topics include: corporate purpose; federalism and corporate governance; the roles and functions of the board of directors; director independence; the board's oversight duties, including regulations governing the audit process and internal controls; executive compensation; shareholder activism; and mergers and acquisitions.",
    "prerequisites": "LAW 500X or equivalent transfer credit as prerequisite.",
    "instructors": "George Georgiev - Primary Instructor",
    "schedule_location": "MW 10:30am-12:10pm in Gambrell Hall 5C",
    "course_resources": null,
    "sections": "Class Nbr: 5241, Section #: 01, Type: LEC, Campus: ATL, Meets: MW 10:30a-12:10p, Instructor: G. Georgiev, Status: Open",
    "date_accessed": "2024-03-30"
}