{
    "course_code": "REL 190",
    "course_title": "Fresh Sem: Religion: Poetry & the Art of Attention",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "This course satisfies the new Religion major requirement:- Theme.\nNone of us is immune to distraction. My cellphone buzzes and I lose track of what my neighbor was trying to tell me; I head to the library to get in a few solid hours of studying, but a daydream catches and derails me; I throw myself into an exciting new project, and in a few months I have all but forgotten about my closest friend. We may never be able to completely eliminate our tendency to distraction. What we can do, however, is try to combat this tendency that is, try to work on our attention.\n\n\nIn this course, we will explore the idea that poetry is a privileged means of working on attention. For just as poets frequently direct our attention to worthy objects (e.g., gods, saints, heroes, beloveds, natural objects, values, ways of the world, social causes), reading and writing poetry can affect the quality of our attention (by improving its steadiness, for instance, or by making our attitude toward some particular object more just and loving). Characterizing poetry as an instrument of attention provides fresh answers to such basic questions as \"Why is poetry often difficult to read?' and 'What counts as `getting' a poem?\" For example, we will consider whether the difficulty of poetry reflects how hard it is to pay attention; whether reading a poem is more like praying than reading a novel; and whether 'getting' a poem has less to do with contemplating its formal and rhetorical elements \"its rhyme scheme, meter, figures of speech, etc.\" than with understanding what and how it asks us to see. The readings are drawn from a range of traditions, and include essays by Simone Weil, Pierre Hadot, and Jonathan Culler, as well as the poetry of Buddhist nuns, Tamil saints, Wordsworth, Whitman, and Bob Dylan.",
    "course_description": "Dynamics of inquiry on a focused research topic. Will include discussion, debate, oral and written presentations. Topic varies.",
    "prerequisites": null,
    "instructors": "Shiv Subramaniam - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Ignatius Few Building_131",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 5707, Section #: 5, Type: SEM, Campus: ATL, Meets: MW 1-2:15p, Instructor: S. Subramaniam, Status: Closed",
    "date_accessed": "2024-03-30"
}