{
    "course_code": "REL 190",
    "course_title": "Fresh Sem: Religion: Holocaust Amer. Consciousness",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 6 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Same as JS 190 4)\nThis course satisfies the new Religion major requirement:- Theme, Region. \nWhether it's a debate on masks and vaccines, humanitarian crisis on the border, or censoring books, the Holocaust is an ever-present point of reference in American public discourse. In this seminar, we will explore how the genocide of European Jews 'which took place far from the United States and involved few Americans' came to play such central role in American consciousness. \nWe will ask how Holocaust memory relates to reckoning with legacies of slavery, anti-black racism, and settler colonialism. Our topics will include Anne Frank and 'Americanization' of the Holocaust; debates that surrounded the creation of the United States Holocaust Memorial Museum in Washington, DC; the Holocaust's impact on the U.S. responses to other genocides; and the contentious issue of comparisons. We will also examine the relationship between white nationalism, neo-Nazism, antisemitism, and Holocaust denial. \nFor our analysis, we will use film and TV, media coverage, politicians' speeches, museum displays, and monuments. We will utilize Emory's special collections relating to the Holocaust and explore relevant sites of memory in Atlanta",
    "course_description": "Dynamics of inquiry on a focused research topic. Will include discussion, debate, oral and written presentations. Topic varies.",
    "prerequisites": null,
    "instructors": "Alicja Podbielska - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in Anthropology Building 105",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 5499, Section #: 4, Type: SEM, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: A. Podbielska, Status: Wait List",
    "date_accessed": "2024-03-30"
}