{
    "course_code": "REL 190",
    "course_title": "Fresh Sem: Religion: The Lord of the Rings",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 2",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Freshmen Seminar - Limited to First Year Students Only)\nThis course satisfies the new Religion major requirement:- Theme.\n\"The Lord of the Rings is by a large margin the most influential fantasy book ever.\" China Mieville.\nWe will explore religious aspects of LOTR (with some reference to The Hobbit and The Silmarillion): Tolkien's Catholicism, magic and the elves, the creation of the world, death and the afterlife, good and evil, fate, and prophecy. We will consider problems of translating Tolkien into other languages, and consider a Buddhist reading of LOTR. We will do close readings of key passages.\nWe can use the example of LOTR to delve into bigger questions. How do we experience fictional 'worlds'? How do we connect our everyday lives to these infinite impossibilities? How do we know what the moral of a story is? What is the difference between the real and the unreal; between 'this world' and Faerie? What is the common ground of religions and fantasies, and what are the key differences? How are religion, science, fantasy, and science fiction inter-related?\nThere is one prerequisite. You should already have read The Lord of the Rings (The Fellowship of the Ring. The Return of the King. & The Two Towers.)",
    "course_description": "Dynamics of inquiry on a focused research topic. Will include discussion, debate, oral and written presentations. Topic varies.",
    "prerequisites": null,
    "instructors": "Eric Reinders - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Emerson Chemistry Bldg. E504",
    "course_resources": null,
    "sections": "Class Nbr: 2888, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 10-11:15a, Instructor: E. Reinders, Status: Open",
    "date_accessed": "2024-03-30"
}