{
    "course_code": "REL 210R",
    "course_title": "Classic Religious Texts: Talmud",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 8 / Seats Avail: 3Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Same as JS 210R 1)\nThis course satisfies the new Religion major requirement:- Tradition-Judaism.\nOther than the Bible, no text has had as profound an impact on the development of Judaism as the Talmud - a work produced by a small community of Rabbis over several centuries 1500 years ago.  A massive work covering all aspects of religious, social and communal Jewish life, the Talmud includes law, theology, stories, advice, and even humor.  In this course, we will examine three dimensions of the Talmud: its history - how the text came into being; its expansion - how study and commentary on it generated the religious life Jews practiced up to the modern period; and its symbolism - how it came to be seen by both Jews and non-Jews as embodying the essence of Judaism.  Each class will include readings (in translation) of the primary text to be discussed and analyzed seminar style.  Grades will be based on short weekly assignments, a take-home mid-term assignment, and a final take-home project.",
    "course_description": "This course will explore classic religious texts in depth, developing skills to interpret sacred, philosophical and ethical works. Social, cultural, and/or philosophical contexts at work will provide interpretive frameworks.",
    "prerequisites": null,
    "instructors": "Michael Berger - Primary Instructor",
    "schedule_location": "Th 2:30pm-5:15pm in Woodruff Library 215",
    "course_resources": null,
    "sections": "Class Nbr: 2889, Section #: 1, Type: LEC, Campus: ATL, Meets: Th 2:30-5:15p, Instructor: M. Berger, Status: Open",
    "date_accessed": "2024-03-30"
}