{
    "course_code": "REL 190",
    "course_title": "Fresh Sem: Religion: Race/Slavery/Violence:Mid.Ages",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 4 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "FSEM w/Race & Ethnicity Req",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Same as HIST 190 1)\nThe enslavement of people due to war, conquest, and piracy is a grisly characteristic of the premodern world. In the Middle Ages, the Crusades and the increase of commerce in the Mediterranean went hand-in-hand with an ever-expanding slave trade that brought Muslims, Tartars from Central Asia, Turks, Africans, Orthodox Greeks, and slaves from the Balkans into Europe while Christian slave traders made huge profits selling slaves to their religious and political enemy, the Mamluk sultanate. This course focuses on the slave trade in the medieval Mediterranean and considers the practice of enslavement and the experiences of the enslaved, which includes the sexual exploitation of women and children, the role of eunuchs (castrated male slaves) serving in royal courts, and the integration of the enslaved into Christian and Islamic society through domestic or military service. We will spend a great deal of time discussing how Europeans used religious and socio-cultural differences to racialize Muslims, Tartars, Mongols, and the Jewish communities living among Christians to justify their enslavement of non-Christians and their persecution and violence aimed at Jews.",
    "course_description": "Dynamics of inquiry on a focused research topic. Will include discussion, debate, oral and written presentations. Topic varies.",
    "prerequisites": null,
    "instructors": "Michelle Armstrong-Partida - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Bowden Hall 323",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 4739, Section #: 3, Type: SEM, Campus: ATL, Meets: TTh 10-11:15a, Instructor: M. Armstrong-Partida, Status: Closed",
    "date_accessed": "2024-03-30"
}