{
    "course_code": "REL 270",
    "course_title": "Special Topics in Religion: American Jewish Pop. Culture",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 14 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Same as JS 273 1)\n\n\nAmerican Jewish Popular Culture:\nThis course will introduce you to Jewish cultures and the many cultural lives of Jews in America. We will focus on the rise of a mass consumer culture in order to ask: How did American (Jewish) popular culture become so massive? What role have Jews and Judaism played in its development and transformation? We'll consider the relationship between Jewish cultures and American cultures, how Jews have contributed to American cultures, and how America has shaped contemporary understandings of what it means to be both Jewish and American. Using an expansive definition of culture - including but not limited to literature, music, performance, print, film, comedy, architecture, and material objects - we'll investigate how American Jews and Judaism both changed and were changed by their interactions with American culture, politics, and society. This course satisfies the new Religion major requirement: Tradition- Judaism, Region, as well as a JS major or minor elective.",
    "course_description": "Variety of subjects pertaining to religion. Content will vary in successive offerings. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Katherine Rosenblatt - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Math & Science Center - N302",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 4480, Section #: 8, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: K. Rosenblatt, Status: Closed",
    "date_accessed": "2024-03-30"
}