{
    "course_code": "REL 270",
    "course_title": "Special Topics in Religion: Remembering Stonewall Uprising",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 10Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Same as WGS 285 3)\nThis course satisfies the new Religion major requirement: - Region, Theme.\nThe Stonewall Uprising (also called the Stonewall Riots), which began in the early morning hours of Saturday, June 28, 1969 on Christopher Street in New York City's Greenwich Village, is remembered as a watershed moment or inflection point in American (and, indeed, worldwide) LGBTQ+ history. This seminar course will explore the events of the Stonewall Uprising and its aftermath, and how those events have been remembered and given meaning through the cultural agency of LGBTQ+ identifying people. Through its special focus on the Stonewall Uprising, the course will engage theoretical questions about historical and collective memory; the categories of  'legend,' 'myth,' and 'sacred story'; and the role of ritual performance in the commemoration of significant historical events. Particular attention will be given to how insights and ideas from the academic study of religion can illuminate the interpretation of the Stonewall Uprising and how investigation of such an apparently 'non-religious' event can contribute to the study of religion.",
    "course_description": "Variety of subjects pertaining to religion. Content will vary in successive offerings. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "William K Gilders - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Candler Library 124",
    "course_resources": null,
    "sections": "Class Nbr: 2890, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: W. Gilders, Status: Open",
    "date_accessed": "2024-03-30"
}