{
    "course_code": "REL 270",
    "course_title": "Special Topics in Religion: Believing Brown.  Gender, Race",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 11 / Seats Avail: 9",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Same as LACS 270 2, WGS 285 1)\nThis course satisfies the new Religion major requirement: - Theme, Region. \nA theoretical, historical, and critical analysis of gender and race within and without the various constitutions of Latinx religions. Class discussions will engage readings, film, and music to inquire about matters of sex, sexuality, embodiment, race, flesh, and relationality as they happen in relation to Latinx religions.  Rather than studying religious traditions such as Catholicism, Protestantism, Pentecostalism, Judaism, or Islam, and how Latinx people are subjects attached to those major traditions, this seminar invites students to interrogate these religions and to see the ways in which religion envelopes and, more often than not, renders brown gendered bodies opaque, weak, or invisible.  Ultimately, the course will ask students to see how Latinx peoples engage religions inside and out of institutional spaces to mobilize sex, sexuality, race, flesh, and relationality in various systems of belief.",
    "course_description": "Variety of subjects pertaining to religion. Content will vary in successive offerings. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "María Carrión - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Candler Library 114",
    "course_resources": null,
    "sections": "Class Nbr: 2895, Section #: 5, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: M. Carrión, Status: Open",
    "date_accessed": "2024-03-30"
}