{
    "course_code": "REL 306",
    "course_title": "Tibetan Buddhism:Psyc Of Enlighten",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 3Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "This course satisfies the new Religion major requirement: - Tradition-Buddhism.\nBuddhism developed in various phases in ancient India, each of which was marked by a particular set of theories, teachings and practices for transforming one's confused, ordinary mind into a progressively more enlightened state of awareness. These phases, which have come to be known as the three yanas or vehicles, are called the Hinayana, Mahayana (paramitayana) and Vajrayana.\nTibetan Buddhism as a living tradition is unique in that it represents the latest phase of the\nBuddhist teachings. The tradition itself enjoyed over 1300 years of uninterrupted development, and it incorporates all three seemingly distinct Buddhist vehicles or approaches in a coherent way. This course will present the various psychological principles, theories and methods that underlie these approaches. We will examine how these principles do or do not converge with western philosophical and psychological understandings. For purposes of context, the course will begin with a brief survey of the basic terms and concepts that inform the Buddhist worldview.",
    "course_description": "Introduction to philosophical, psychological, and contemplative dimensions of Tibetan Buddhism.",
    "prerequisites": null,
    "instructors": "Geshe Lobsang Tenzin Negi - Primary Instructor",
    "schedule_location": "TTh 4pm-5:15pm in Callaway Center S101",
    "course_resources": null,
    "sections": "Class Nbr: 2897, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 4-5:15p, Instructor: Negi/Linton Jr., Status: Open",
    "date_accessed": "2024-03-30"
}