{
    "course_code": "REL 365",
    "course_title": "Buddhist Philosophy",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 4Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "This course satisfies the new Religion major requirement: - Tradition-Buddhism.\nThis course on Buddhist philosophy introduces the life and teachings of the Buddha as preserved in the classical texts, and the key philosophical ideas and contemplative practices expanded by Buddhist philosophers in the subsequent centuries. Exploring selected translations of primary texts from Pali, Sanskrit, and Tibetan languages, and academic articles and book chapters by contemporary scholars, in this course, students will gain a substantial understanding of social and philosophical context where Buddhism emerged as a distinct religious practice, the ethical life as envisioned in Buddhism, meditative techniques presented in the early Buddhist texts, the phenomenological analysis by the Abhidharma scholars, Madhyamaka philosophy of the Middle or emptiness, and the Yog'c'ra. the philosophy of Idealism, and finally. Additionally, we will also watch documentary movies and feature films that illustrate the life of the Buddha and aspects of Buddhist cultures.",
    "course_description": "Explores the features that distinguish Buddhist thought from other traditions, as well as the unique tenets of major philosophical movements such as Shravakayana, Mahayana, and Vajrayana.",
    "prerequisites": null,
    "instructors": "Upali Sraman - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in Rich Building 211",
    "course_resources": null,
    "sections": "Class Nbr: 4678, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: U. Sraman, Status: Open",
    "date_accessed": "2024-03-30"
}