{
    "course_code": "REL 370",
    "course_title": "Special Topics in Religion: Law and Religion:Comp.Perspec.",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 2 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": "Department Consent Required",
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "Topic: Law & Religion: Religion, Culture, and Law in Comparative Perspective\nThis course satisfies the new Religion major requirement: - Theme\nPermission Required Prior to Enrollment. To request permission to register, contact Prof. María M. Carrión - mcarrio@emory.edu\nLaw school schedule - Tuesday & Thursday, 12:00pm - 1:30pm\nDESCRIPTION: Debates rage worldwide over what role religion and culture should play in law and governance and whether granting them a role conflicts with democratic principles. Increasingly, religious and ethnic groups are demanding that religious and cultural practices form the basis of the legal system or, at the very least, a separate legal system governing only their members. Western policymakers are finding it difficult to respond to these claims. While they see them as possibly antithetical to the principles of tolerance and equality built into liberal democratic theory, there is something uncomfortable about rejecting these demands when they come from a majority of a population or from a minority group that has suffered severe discrimination. This course will explore the issues that arise in the debates about the appropriate role for religion and culture in democratic governance. It will examine different models for incorporating religion and culture into law as well as at models that wholly reject this incorporation using case studies from the US, Europe, Asia, and Africa \nATTENDANCE POLICY: See professor.",
    "course_description": "Variety of subjects pertaining to religion. Content will vary in successive offerings. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Hallie Ludsin - Primary Instructor",
    "schedule_location": "TTh 12pm-1:30pm in Gambrell Hall - 1B",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 5213, Section #: 5, Type: LEC, Campus: ATL, Meets: TTh 12-1:30p, Instructor: H. Ludsin, Status: Closed",
    "date_accessed": "2024-03-30"
}