{
    "course_code": "REL 370",
    "course_title": "Special Topics in Religion: Muslim Women's Storytelling",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 3 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Same as IDS 385 2, WGS 385 )\nThis course satisfies the new Religion major requirement:-Tradition-Islam, Theme.\nThis class critically examines how Muslim women negotiate their experience, identity, and narrative in different genres and styles. Students will read Muslim women's stories through scholarship, fiction, autobiography, embodied theory, memoir, music, television, and film. Additionally, students will learn relevant theoretical approaches from the field of religious studies and examine materials through the lenses of feminist literary theory. Learning materials are multimodal, including written, visual, audio, and in-person accounts of the lives of Muslim women. For this class, storytelling is both an object of analysis and a method for learning and presenting research. This class will include engagement and storytelling activities with Atlanta-based Muslim women from various walks of life and professional sectors. Students will learn to identify and analyze some of the diverse socio-cultural contexts that shape how Muslim women see and express themselves in public discourse.",
    "course_description": "Variety of subjects pertaining to religion. Content will vary in successive offerings. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Rose Deighton - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in Callaway Center S420",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 5737, Section #: 6, Type: LEC, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: R. Deighton, Status: Wait List",
    "date_accessed": "2024-03-30"
}