{
    "course_code": "ELSP 517",
    "course_title": "Communication Skills for Advanced Speakers I",
    "credit_hours": "1.5",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 6",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "Flexible/Hyflex",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(S/U Only)\n\n\nAudience: Advanced-low or advanced-mid speakers of English as an additional language\nMeeting times: Once per week, with details to be determined based on participants' Fall schedules.\nThis elective supports students who command an advanced-low or advanced-mid level of English (OPI 3.0-3.6) 1. Classes aim to help students move toward superior proficiency, focusing on the graduate student context. The course will emphasize the development of specific speaking skills, such as networking skills, participating effectively in academic discussions, and communicating to both field-expert and lay audiences. Individual language feedback is provided on a weekly basis to help participants make noticeable gains in their English-speaking abilities. \nContact: Heather Boldt, ELSP Director, hboldt@emory.edu",
    "course_description": "Advanced speakers (OPI level 3) can narrate and describe in the past, present, and future time frames in paragraph-length discourse. Although they may have varying degrees of fluency and accuracy, advanced speakers can convey their message without confusion and be understood by listeners not accustomed to ESL speakers. However, they may lack the language to discuss topics extensively, participate in formal and professional conversations, and consistently provide a structured argument in extended discourse. ELSP 517 is designed to improve the communication skills of advanced students.",
    "prerequisites": null,
    "instructors": "Heather P Boldt - Primary Instructor",
    "schedule_location": "T 4pm-5:15pm in North Decatur Bldg 101D",
    "course_resources": null,
    "sections": "Class Nbr: 6575, Section #: 1, Type: LEC, Campus: ATL, Meets: T 4-5:15p, Instructor: H. Boldt, Status: Open",
    "date_accessed": "2024-03-30"
}