{
    "course_code": "ELSP 505",
    "course_title": "Foundations in Oral Communication I",
    "credit_hours": "2",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "Blended/Hybrid",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(S/U Only)\n\n\nAudience: International graduate students who speak English as a second or additional language\nRequired for: Intermediate Low, Intermediate Mid and Intermediate High speakers of English\nMeeting times: Once per week in-person plus online lab; time, day of week, and other details based on enrolled students' course schedules\nELSP 505 is designed to help graduate students improve their spoken communication skills in English as they converse with peers and professors, participate in discussions, and deliver academic presentations. Participants in this course, which combines in-class meetings and online coursework, will have the opportunity to learn and practice strategies that will help improve fluency, accuracy, and clarity of speech.\nContact: Heather Boldt, ELSP Director, hboldt@emory.edu",
    "course_description": "Intermediate speakers can handle many of the speaking exchanges of routine life and work; however, they typically require a sympathetic listener accustomed to ESL speakers. Intermediate speakers may have difficulty sequencing and/or linking ideas into paragraph-length discourse, maintaining appropriate past, present, and future time frames, sustaining fluency, and/or being readily comprehensible.",
    "prerequisites": null,
    "instructors": "Grace Song - Primary Instructor",
    "schedule_location": "Varies by section",
    "course_resources": null,
    "sections": "Class Nbr: 6573, Section #: 1, Type: LEC, Campus: ATL, Meets: W 1-2:15p, Instructor: G. Song, Status: Open\nClass Nbr: 6736, Section #: 2, Type: LEC, Campus: ATL, Meets: Th 4-5:15p, Instructor: G. Song, Status: Open",
    "date_accessed": "2024-03-30"
}