{
    "course_code": "ELSP 510",
    "course_title": "ESL 510: Fundamentals of Graduate Writing I",
    "credit_hours": "2",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "Blended/Hybrid",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(S/U Only)\n\n\nAudience: International graduate students who speak English as a second or additional language\nRequired for: Intermediate Low, Intermediate Mid, and Intermediate High writers of English\nRecommended for: Advanced Low writers of English\nMeeting times: Once per week for 75 minutes plus 30-minute lab; day, time and other details to be determined based on enrolled students' course schedules\nELSP 510 is designed to help graduate students improve their written communication skills in English as they engage in common writing tasks such as writing emails, describing research interests, defining field-specific concepts, and illustrating discipline-specific problems and solutions. Participants in the course, which combines in-class meetings and online coursework, will learn key considerations to apply to any academic writing task while receiving extensive individualized feedback. \nContact: Heather Boldt, hboldt@emory.edu, ELSP Director",
    "course_description": "Few skills will be as important to you as a graduate student and professional scholar as writing. ELSP 510 sets priorities for learning to help you build a solid foundation of writing standards, strategies, and skills to position yourself as a successful writer in the academic community. To be recognized as a member of an academic community, you must write purposefully and correctly, which requires effort. ELSP 510 emphasizes the importance of continuous practice, revising, and editing in developing this skill.",
    "prerequisites": null,
    "instructors": "Peggy Wagner - Primary Instructor",
    "schedule_location": "Varies by section",
    "course_resources": null,
    "sections": "Class Nbr: 6574, Section #: 1, Type: LEC, Campus: ATL, Meets: M 4-5:15p, Instructor: P. Wagner, Status: Open\nClass Nbr: 6735, Section #: 2, Type: LEC, Campus: ATL, Meets: W 11:30a-12:45p, Instructor: P. Wagner, Status: Open\nClass Nbr: 6800, Section #: 3, Type: LEC, Campus: ATL, Meets: W 2:30-3:45p, Instructor: P. Wagner, Status: Open",
    "date_accessed": "2024-03-30"
}