{
    "course_code": "BIOL 120",
    "course_title": "Concepts In Biology",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 35 / Seats Avail: 11Waitlist Total: 0, Auto-Enroll",
    "waitlist_total": ": 0, Auto-Enroll",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Natural Sciences(*)",
    "permission": null,
    "dates": "2024-07-01 through 2024-08-07",
    "class_notes": "This is an ON-LINE, NON-SCIENCE MAJOR course.  Students under the OLD GERs must also register for the laboratory portion.   Students under the NEW GERs are not required to take the laboratory portion.  \nEmory College Online summer courses have required synchronous/live sessions every week. Students must be available to sign into and virtually attend the course online during those times (noted as the course meeting times- all times listed are local to Atlanta). Each course will also involve significant asynchronous material that you access on your own time in addition to standard amounts of readings and course assignments. Students should plan to spend 15-20 hours/week on this course. Please also be aware that faculty will begin corresponding with students during Week Zero of the course (one week before the official start date of the course), and that some interaction with the course may be required at that time. Students should begin checking the Canvas course site regularly one week before the official beginning of the course.  This course does NOT fulfill requirements for medical and dental schools OR for a biology major.",
    "course_description": "Principles of genetics, physiology, ecology, taxonomy, and evolution with special reference to contemporary life situations. Intended for non-science majors. This course does not fulfill requirements for medical and dental schools or for a biology major.",
    "prerequisites": null,
    "instructors": "Eladio Abreu - Primary Instructor",
    "schedule_location": "TTh 9:45am-11:15am in ONLINE",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_BIOL_120_1_A24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 1262, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 9:45-11:15a, Instructor: E. Abreu, Status: Open",
    "date_accessed": "2024-03-29"
}