{
    "course_code": "PSYC_OX 385R",
    "course_title": "Special Topics In Psychology: Social Media Psychology",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 9Waitlist Total: 0 of 6",
    "waitlist_total": ": 0 of 6",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Irregularly",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Open to all (including first-year) students\n\n\nThis course counts as an elective in the Film and Media Major and Minor.\n\n\nMisinformation and conspiracies have been identified as a threat that affects everything from Covid response to election integrity and social media have been identified as the fuel that has amplified the political and cultural fire that threatens our society and democratic system. Media psychologists have an important role in understanding the psychology behind misinformation and conspiracy. Important questions that will guide our inquiry in this course include: (a) what are conspiracy theories?\n(b) exploration of their history pre-social media; (c) are conspiracy theories rational? Examples of critical thinking? Delusions? what are the psychosocial constructs behind conspiracies? Why do people believe? (d) what are the unique characteristics of social media that contribute to conspiracies? (e) what is the relative role of social media and psychological factors in contributing to the popularity and spread of misinformation and conspiracies? (f) can we reduce conspiracy theories?",
    "course_description": "Seminar in selected topics of psychology or directed individual course of study. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Scott Garner - Primary Instructor",
    "schedule_location": "TTh 4pm-5:15pm in Oxford Science Bldg. 415",
    "course_resources": null,
    "sections": "Class Nbr: 4223, Section #: 2, Type: LEC, Campus: OXF, Meets: TTh 4-5:15p, Instructor: S. Garner, Status: Open",
    "date_accessed": "2024-03-30"
}