{
    "course_code": "PSYC_OX 385R",
    "course_title": "Special Topics In Psychology: Foundations ofMedia Psychology",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 15Waitlist Total: 0 of 6",
    "waitlist_total": ": 0 of 6",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Irregularly",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Open to all (including first-year) students\n\n\nThis course counts as an elective in the Film and Media Major and Minor.\n\n\nOver the last 15 years, the internet has disrupted traditional media platforms, such as print, television, and film.  While a significant amount of media research since the 1950s has been focused on the former, the volume and pace of the proliferating platforms and app-based technologies are only just beginning to be discovered in scholarly.  Media Psychology sits at the intersection between the media and the human mind.  This course is designed as an interdisciplinary course between the Psychology and the Film and Media Studies departments for Oxford College, Emory University.  This foundations course provides a solid framework for students to understand the interdisciplinary elements of how media and psychology operate with one another. The following are the three vital philosophical tenants that underscore the importance of the examination of why media psychology: (a) it buttresses positive applications of mediated technology to understand the world better, (b) it connects environmental, and cultural constructs to anchor meaning consumers' cognitive capacities, meaning-making narrative, and personal self-efficacy impact how media is consumed, and (c) it psychologically grounds the consumer in the social world in terms of the lived experience one gains through media.",
    "course_description": "Seminar in selected topics of psychology or directed individual course of study. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Scott Garner - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Oxford Science Bldg. 415",
    "course_resources": null,
    "sections": "Class Nbr: 4222, Section #: 1, Type: LEC, Campus: OXF, Meets: TTh 2:30-3:45p, Instructor: S. Garner, Status: Open",
    "date_accessed": "2024-03-30"
}