{
    "course_code": "LAW 883",
    "course_title": "Bankruptcy Develop Journal:Second Year",
    "credit_hours": "2",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2021-01-19 through 2021-04-26",
    "class_notes": null,
    "course_description": null,
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 2169, Section #: BROY, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: M. Broyde, Status: Open\nClass Nbr: 2277, Section #: BRWN, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: D. Brown, Status: Open\nClass Nbr: 2181, Section #: CARR, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: L. Carroll, Status: Open\nClass Nbr: 2179, Section #: CLOU, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: A. Cloud, Status: Open\nClass Nbr: 2180, Section #: GEOR, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: G. Georgiev, Status: Open\nClass Nbr: 2176, Section #: GOLD, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: M. Goldstein, Status: Open\nClass Nbr: 2173, Section #: JSHP, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: J. Shepherd, Status: Open\nClass Nbr: 2174, Section #: PARD, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: R. Pardo, Status: Open\nClass Nbr: 2171, Section #: PARR, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: R. Parrish, Status: Open\nClass Nbr: 2282, Section #: PAYN, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: S. Payne, Status: Open\nClass Nbr: 2178, Section #: PENN, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: J. Pennell, Status: Open\nClass Nbr: 2172, Section #: PIND, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: K. Pinder, Status: Open\nClass Nbr: 2182, Section #: ROMI, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: J. Romig, Status: Open\nClass Nbr: 2175, Section #: SCHP, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: R. Schapiro, Status: Open\nClass Nbr: 2170, Section #: SCHW, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: J. Schwartz, Status: Open\nClass Nbr: 2177, Section #: SHEP, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: G. Shepherd, Status: Open\nClass Nbr: 2029, Section #: SYBB, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: M. Sybblis, Status: Open",
    "date_accessed": "2024-03-30"
}