{
    "course_code": "LAW 885",
    "course_title": "Emory Law Journal:Second Year",
    "credit_hours": "2",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Varies by section",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2021-01-19 through 2021-04-26",
    "class_notes": null,
    "course_description": null,
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 2193, Section #: BAGL, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: M. Bagley, Status: Open\nClass Nbr: 2194, Section #: BRWN, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: D. Brown, Status: Open\nClass Nbr: 2195, Section #: CARR, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: L. Carroll, Status: Open\nClass Nbr: 2213, Section #: CART, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: M. Carter, Status: Open\nClass Nbr: 2268, Section #: CLOU, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: A. Cloud, Status: Open\nClass Nbr: 2269, Section #: COOP, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: K. Cooper, Status: Open\nClass Nbr: 2198, Section #: FRER, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: R. Freer, Status: Open\nClass Nbr: 2197, Section #: GEOR, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: G. Georgiev, Status: Open\nClass Nbr: 2199, Section #: KOST, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: P. Koster, Status: Open\nClass Nbr: 2200, Section #: LAWR, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: M. Lawrence, Status: Open\nClass Nbr: 2201, Section #: NASH, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: J. Nash, Status: Open\nClass Nbr: 2202, Section #: PARR, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: R. Parrish, Status: Open\nClass Nbr: 2204, Section #: PIND, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: K. Pinder, Status: Open\nClass Nbr: 2031, Section #: PRIC, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: P. Price, Status: Open\nClass Nbr: 2270, Section #: PURD, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: R. Purdom, Status: Open\nClass Nbr: 6007, Section #: ROMI, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: J. Romig, Status: Open\nClass Nbr: 2271, Section #: SAVA, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: A. Savage, Status: Open\nClass Nbr: 2203, Section #: SCHP, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: F. Smith, Status: Open\nClass Nbr: 2272, Section #: SMIT, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: F. Smith, Status: Open\nClass Nbr: 2196, Section #: SYBB, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: M. Sybblis, Status: Open\nClass Nbr: 2205, Section #: VERT, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: L. Vertinsky, Status: Open\nClass Nbr: 2206, Section #: VOLO, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: A. Volokh, Status: Open\nClass Nbr: 5593, Section #: WALD, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: R. Waldman, Status: Open\nClass Nbr: 2207, Section #: WITT, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: J. Witte Jr., Status: Open",
    "date_accessed": "2024-03-30"
}