{
    "course_code": "LAW 897",
    "course_title": "Directed Research:Specific Topics",
    "credit_hours": "1-12",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Varies by section",
    "instruction_method": "Varies by section",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Varies by section",
    "dates": "2021-01-19 through 2021-04-26",
    "class_notes": "Varies by section",
    "course_description": null,
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 6036, Section #: ARTH, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: T. Arthur, Status: Open\nClass Nbr: 2146, Section #: BAGL, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: M. Bagley, Status: Open\nClass Nbr: 2145, Section #: BLNK, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: L. Blank, Status: Open\nClass Nbr: 2211, Section #: BROY, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: M. Broyde, Status: Open\nClass Nbr: 6133, Section #: BRWN, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: D. Brown, Status: Open\nClass Nbr: 2216, Section #: CART, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: M. Carter, Status: Open\nClass Nbr: 6028, Section #: CLOD, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: A. Cloud, Status: Open\nClass Nbr: 6115, Section #: DOMI, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: Domingo/Liwanga, Status: Open\nClass Nbr: 2143, Section #: ECGR, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: D. Brown, Status: Open\nClass Nbr: 2279, Section #: EGR2, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: J. Romig, Status: Open\nClass Nbr: 2280, Section #: EGR3, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: K. Cooper, Status: Open\nClass Nbr: 2217, Section #: EGR4, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: K. Pinder, Status: Open\nClass Nbr: This section is full 6288, Section #: EGR5, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: G. Georgiev, Status: Closed\nClass Nbr: 6050, Section #: GOLD, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: M. Goldstein, Status: Open\nClass Nbr: 6032, Section #: HOLB, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: T. Holbrook, Status: Open\nClass Nbr: 2141, Section #: HWRD, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: D. Howard, Status: Open\nClass Nbr: 2139, Section #: JSHP, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: J. Shepherd, Status: Open\nClass Nbr: 2137, Section #: KOST, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: P. Koster, Status: Open\nClass Nbr: 2297, Section #: PENN, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: J. Pennell, Status: Open\nClass Nbr: 2220, Section #: PILL, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: S. Pill, Status: Open\nClass Nbr: 6131, Section #: PURD, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: R. Purdom, Status: Open\nClass Nbr: 2148, Section #: ROMI, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: J. Romig, Status: Open\nClass Nbr: 6055, Section #: RUSK, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: T. Ruskola, Status: Open\nClass Nbr: 5941, Section #: TULI, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: Tulibacka/Shepherd, Status: Open\nClass Nbr: 6054, Section #: VERT, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: L. Vertinsky, Status: Open\nClass Nbr: 2140, Section #: WALD, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: R. Waldman, Status: Open\nClass Nbr: 2133, Section #: WITT, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: J. Witte Jr., Status: Open\nClass Nbr: 2295, Section #: ZWIE, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: Team, Status: Open",
    "date_accessed": "2024-03-30"
}