{
    "course_code": "LAW 889",
    "course_title": "Int'l Law Review:Second Year",
    "credit_hours": "2",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2021-01-19 through 2021-04-26",
    "class_notes": null,
    "course_description": null,
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 2259, Section #: ARTH, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: T. Arthur, Status: Open\nClass Nbr: 2035, Section #: BAGL, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: M. Bagley, Status: Open\nClass Nbr: 2183, Section #: BLNK, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: L. Blank, Status: Open\nClass Nbr: 2184, Section #: DUNC, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: M. Duncan, Status: Open\nClass Nbr: 2263, Section #: KIRK, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: A. Kirk, Status: Open\nClass Nbr: 2264, Section #: KOST, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: P. Koster, Status: Open\nClass Nbr: 2186, Section #: MORI, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: N. Morris, Status: Open\nClass Nbr: 2187, Section #: PARR, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: R. Parrish, Status: Open\nClass Nbr: 2188, Section #: ROMI, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: J. Romig, Status: Open\nClass Nbr: 2189, Section #: RUSK, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: T. Ruskola, Status: Open\nClass Nbr: 2266, Section #: SATZ, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: A. Satz, Status: Open\nClass Nbr: 2261, Section #: SCHW, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: J. Schwartz, Status: Open\nClass Nbr: 2185, Section #: SMIT, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: F. Smith, Status: Open\nClass Nbr: 2265, Section #: SYBB, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: M. Sybblis, Status: Open\nClass Nbr: 2190, Section #: VERT, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: L. Vertinsky, Status: Open\nClass Nbr: 2191, Section #: VOLO, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: A. Volokh, Status: Open\nClass Nbr: 2262, Section #: WALD, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: R. Waldman, Status: Open\nClass Nbr: 2267, Section #: WITT, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: J. Witte Jr., Status: Open\nClass Nbr: 2192, Section #: ZWIE, Type: LEC, Campus: ATL, Meets: Meets Online, Instructor: P. Zwier, Status: Open",
    "date_accessed": "2024-03-30"
}