{
    "course_code": "PHYS 499R",
    "course_title": "Undergraduate Research",
    "credit_hours": "2-4",
    "seats": "Seats: Maximum Enrollment: 999 / Seats Avail: 999",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Experience and Application(*)",
    "permission": "Varies by section",
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": null,
    "course_description": "Prerequisite: consent of instructor. For students who wish to participate in physics research with the instructor acting as research director.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 1863, Section #: 1, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: A. Bans, Status: Open\nClass Nbr: 1864, Section #: 10, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: A. Srivastava, Status: Open\nClass Nbr: 1865, Section #: 11, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: D. Sussman, Status: Open\nClass Nbr: 1866, Section #: 12, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Burton, Status: Open\nClass Nbr: 1867, Section #: 13, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: H. Harutyunyan, Status: Open\nClass Nbr: 1868, Section #: 14, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: L. Finzi, Status: Open\nClass Nbr: 1869, Section #: 15, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: E. Weeks, Status: Open\nClass Nbr: 1870, Section #: 16, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: I. Nemenman, Status: Open\nClass Nbr: 1871, Section #: 17, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: W. Benalcazar, Status: Open\nClass Nbr: 1872, Section #: 18, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: M. Kim, Status: Open\nClass Nbr: 1873, Section #: 19, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: S. Urazhdin, Status: Open\nClass Nbr: 1874, Section #: 2, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: T. Bing, Status: Open\nClass Nbr: 1875, Section #: 20, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: C. Roth, Status: Open\nClass Nbr: 1876, Section #: 21, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: S. Shekhar, Status: Open\nClass Nbr: 1877, Section #: 22, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Rieser, Status: Open\nClass Nbr: 1878, Section #: 23, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: Team, Status: Open\nClass Nbr: 2032, Section #: 24, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: S. Boettcher, Status: Open\nClass Nbr: 1879, Section #: 3, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: D. Weissman, Status: Open\nClass Nbr: 1881, Section #: 4, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Brody, Status: Open\nClass Nbr: 1882, Section #: 5, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: E. Bonning, Status: Open\nClass Nbr: 1883, Section #: 6, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: L. Santos, Status: Open\nClass Nbr: 1884, Section #: 7, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Malko, Status: Open\nClass Nbr: 1885, Section #: 8, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: K. Warncke, Status: Open\nClass Nbr: 1886, Section #: 9, Type: RSC, Campus: ATL, Meets: Does Not Meet, Instructor: K. Berland, Status: Open",
    "date_accessed": "2023-10-31"
}