{
    "course_code": "MKT 648",
    "course_title": "Marketing Channel Strategy and B2B",
    "credit_hours": "3",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-01-09 through 2023-04-24",
    "class_notes": null,
    "course_description": "A key source of value is through the use of strategic partnering agreements, innovative distribution design, and understanding how customers want to buy. This course is about how to leverage value through the firm's distributor, supplier, and retailer networks to make products and services available at the right place and time. Topics include but are not limited to the following: how to manage multiple online and offline channels, how to structure and manage business partnerships for maximum returns, how to select and incentivize partners and how to design and redesign routes to market. We will also discuss conflict management, channels in emerging economies, and other generalizable frameworks applicable to a wide variety of B2B issues.  Ideal for individuals targeting opportunities in consulting and strategy, organizational customer sales and procurement, marketing management, entrepreneurship and business development.",
    "prerequisites": "Varies by section",
    "instructors": "Sandy Jap - Primary Instructor",
    "schedule_location": "Varies by section",
    "course_resources": null,
    "sections": "Class Nbr: 1376, Section #: 2172, Type: LEC, Campus: ATL, Meets: W 6:30-9:30p, Instructor: S. Jap, Status: Open\nClass Nbr: 1558, Section #: 2283, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: S. Jap, Status: Open\nClass Nbr: 1186, Section #: 3272, Type: LEC, Campus: ATL, Meets: W 6:30-9:30p, Instructor: S. Jap, Status: Open\nClass Nbr: 1560, Section #: 6283, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: S. Jap, Status: Open",
    "date_accessed": "2024-03-30"
}