{
    "course_code": "HIST 145",
    "course_title": "The History of Now",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 50 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "The course covers European history from the devastation of World War II into the present. Team-taught by specialists on German and Russian history, the course takes an expansive view of what constitutes Europe and considers select topics in European postwar history such as postwar economic recovery and affluence, decolonization, war memories, environmental challenges, migration, and others, from a pan-European perspectives. It traces how experiences of the war years rippled through postwar Europe, merged with Cold War exigencies, and reverberated in new ways after the fall of Communism. The course offers students not only an overview of postwar European history but also encourages them to think of major contemporary issues ripped from the headlines, like pandemics, strongmen and environmental devastation. This introductory course is designed for students without any prior knowledge of History as an academic discipline. It is nonetheless suitable for students who intend to take a few history courses or become history majors/minors.",
    "course_description": "The course offers students not only an overview of postwar European history but also introduces them to ways of analyzing current events in regard to their deep roots in the continent's past.",
    "prerequisites": null,
    "instructors": "Astrid M. Eckert - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in New Psyc Bldg 290 (36 Eagle Ro",
    "course_resources": null,
    "sections": "Class Nbr: 2775, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: Eckert/Payne, Status: Open",
    "date_accessed": "2024-03-30"
}