{
    "course_code": "HIST 196",
    "course_title": "Special Topics: Cross-listed",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 7 / Seats Avail: 7",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "(Same as JS 101 1, REL 170 1)\nIntroduction to Jewish Civilization\nDescription:\tThis course introduces students to Jewish beliefs, practices, and history from the biblical period to the present. Diversity within the Jewish world-- according to geography, gender, and religious expression-- will be explored.  It presumes no prior knowledge of Jewish history, religion, or culture.\nDetails:\tAre Jews a people with a shared history based on collective experiences?  Or, are they defined by religion, cohering around a common set of beliefs and rituals?  Or, are Jews an ethnic group, united by common cultural traditions?  Rather than imposing any one definition, our goal is to study the diversity of Jewish civilization from antiquity to the present, and to employ a range of academic perspectives when analyzing the varieties of Jewish experience and expression over time.  Our course will follow the rhythm of the Jewish life cycle and calendar and ask how Jews have constructed meaning out of history through rites of passage and holidays.  As we study the history and texts of Jewish civilization, we will focus on two recurring themes: shifting notions of \"diaspora\" and \"homeland\" , and the boundaries of Jewish identity.",
    "course_description": "Selected topics in history for students in non-history originating (cross-listed) courses. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Ellie Schainker - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Candler Library 114",
    "course_resources": null,
    "sections": "Class Nbr: 2600, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 10-11:15a, Instructor: E. Schainker, Status: Open",
    "date_accessed": "2024-03-30"
}