{
    "course_code": "HIST 190",
    "course_title": "Freshman Seminar: Images of Africa",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 8 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "(Freshmen Seminar - Limited to First Year Students Only)\n(Same as AFS 190 )\n\n\nThe African past continues to be marginal to our understanding of the present. African societies and states are portrayed as underdeveloped, primitive, and backward, despite a rich scholarship that proves the opposite. This erroneous image creates stereotypes about Africa and African descendants, affecting our communities. This seminar will explore the history of how Africa is represented, both visually and textually, and interrogate the ways Africa has been imagined, depicted, fantasized about in European cultures, among African-Americans, and in U.S. popular culture. This seminar introduces the history of the peoples of Africa and will problematize the creation of images about Africa and Africans in the past 200 years. Participants will have a chance to explore how media influences the ways we think about the African past and will leave the course knowing much more about Africa's history than what is available on newspapers or television. This knowledge will be valuable to understand the African past, include it in our classroom teaching, as well as to have a better understanding of the world where we live in.",
    "course_description": "Introduces first-year students to the discipline of history, particularly historical sources and methods; aims to improve critical reading, analytical, and writing skills in small group discussion.",
    "prerequisites": null,
    "instructors": "Mariana Candido - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Ignatius Few Building_129",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2777, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 1-2:15p, Instructor: M. Candido, Status: Closed",
    "date_accessed": "2024-03-30"
}