{
    "course_code": "HIST 190",
    "course_title": "Freshman Seminar: Forced Removals/Native People",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 6",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "(Freshmen Seminar - Limited to First Year Students Only)\n\n\nIndian Removal was a sustained, structuring process that unfolded over a long period of time and changed the course of American history and the fortunes of Black and White Americans, as well as Indigenous people. What most Americans think of as the \"Trail of Tears,\" forced marches of thousands of Native people from their homes in the southeast, was one part of a policy which also unfolded nationwide for dozens of tribal communities, in the Midwest, Southwest, Northeast, and the Great Plains. The dispossession of Native communities also deepened the regional and national commitment to the enslavement of people of African descent and to anti-Black racism. Strategies to resist and accommodate Removal policies catalyzed Native governments and transformed Native education, gender roles, economies, and religions. U.S. federal and state governments colluded with ordinary citizens to create and impose Removal policies. Students will conduct original research to explore Removal's role in Emory's history.",
    "course_description": "Introduces first-year students to the discipline of history, particularly historical sources and methods; aims to improve critical reading, analytical, and writing skills in small group discussion.",
    "prerequisites": null,
    "instructors": "Malinda Lowery - Primary Instructor",
    "schedule_location": "T 1pm-3:45pm in Bowden Hall 323",
    "course_resources": null,
    "sections": "Class Nbr: 2778, Section #: 2, Type: SEM, Campus: ATL, Meets: T 1-3:45p, Instructor: M. Lowery, Status: Open",
    "date_accessed": "2024-03-30"
}