{
    "course_code": "HIST 285",
    "course_title": "Topics: Historical Analysis: East Asia and the West",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 13Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "Complete title:  East Asia and the West:  From the Silk Road to The Belt and Road.\n\n\n(Same as EAS 285 1)\nThis course introduces the history of the interaction between East Asia and the West in the past two millenniums. It examines how people, goods, and ideas flowed between the two ends of Eurasia and their political, economic, and cultural repercussions. The course touches on various empires, states, and cities, the Roman Empire, the Mongol Empire, the Dutch Republic, Macau, Taiwan, Nagasaki, and Batavia, etc. The classes are structured chronologically, from the birth of Eurasia to the twentieth century. The first half of the course focuses on the Silk Road overland interaction; while the second half looks at the maritime trade and globalization that followed the age of discovery. In the class, students will be introduced to various types of historical sources, including chronicles, traveling diaries, maps, and pictures.\nThis is an introductory lecture-oriented course. There are no prerequisites. You need no background in history, in Asia, or in any Asian languages.",
    "course_description": "An introductory course on the nature and methods of history. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Michael Chung - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in Tarbutton Hall 218",
    "course_resources": null,
    "sections": "Class Nbr: 2787, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 10-11:15a, Instructor: M. Chung, Status: Open",
    "date_accessed": "2024-03-30"
}