{
    "course_code": "HIST 241",
    "course_title": "Topics in History and Text: Survival/Identity: Byzantines",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 5Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "In 330 AD emperor Constantine moved the capital of the Roman Empire from Rome to a city deemed New Rome, or Constantinople. Quickly a small ancient city formerly called Byzantium became the nexus of the empire for over a thousand years after its founding. This course surveys Byzantine history from the founding of Constantinople in 330 CE through the sack of Constantinople by the Ottomans in 1453 CE. We will examine the rise and development of Christianity, the fraught political relationship between the eastern and western Romans, heresy in the church, and the shaping of Byzantine identity through analysis of primary sources such as: literary sources, law, art, and archaeology. Students will engage with a period of history that challenges the concept of the `fall' of the Roman Empire in the fifth century by showing that the Romans existed in what modern historians have labeled the Byzantine Empire for hundreds of years after the sack of Rome in 410 CE.",
    "course_description": "The course demonstrates how literary, artistic, and/or cinematic texts, when understood in relation to the context of their production, can be used to study selected historical themes.",
    "prerequisites": null,
    "instructors": "Kaelyn McAdams - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in Rich Building 211",
    "course_resources": null,
    "sections": "Class Nbr: 2785, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: K. McAdams, Status: Open",
    "date_accessed": "2024-03-30"
}