{
    "course_code": "HIST 249W",
    "course_title": "Tropical Encounters",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "HAPW w/Race & Ethnicity Req.",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "Innocent sexuality \"savage violence\" pure humanity? What did European travelers seek, and find, among the peoples of the South Pacific, South America, and Africa? Through lecture and discussion, original sources and works by historians, this course examines both the encounters with other peoples and cultures in parts of the world previously little known to Europeans, and the uses to which the resultant travel accounts were put in disputes surrounding notions of race, the nature of humankind, and the practice of politics back in Europe. It traces the connections between journeys of scientific exploration, European imperialism, and the emerging disciplines of ethnography and anthropology from the eighteenth century through the twentieth. In this Continuing Writing course, students build up to analyzing a travel account themselves in a final research paper (10-12 pp.); a short essay, two short reading analyses, and active participation round out the graded assessments.",
    "course_description": "This course examines European encounters with indigenous peoples\nof the tropical regions, and the uses to which the resultant travel accounts and images were put back in Europe in disputes surrounding notions of race, the nature of humankind, and the practice of politics.",
    "prerequisites": null,
    "instructors": "Brian Vick - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Tarbutton Hall 218",
    "course_resources": null,
    "sections": "Class Nbr: 2786, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: Vick/Cocking, Status: Open",
    "date_accessed": "2024-03-30"
}