{
    "course_code": "HIST 296",
    "course_title": "Special Topics: Cross-listed: Plato&Social Issues ofHis Time",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 5",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "(Same as ANCMED 202R 1, PHIL 285 2)\n\n\nPlato's philosophy emphasizes unchanging moral truths, but the philosopher himself (427-347 BCE) lived in an era of dramatic social change, both in his home city of Athens and in the larger Greek world.  The military conflict  (the so-called Peloponnesian War 431-404 BCE) that raged almost continuously during Plato's youth, fought  between the cities (and kingdoms) aligned with Athens and those aligned with Sparta, shook the basic foundations of Greek society and led into the changed and changing world of the fourth century.  The fourth century  witnessed, for example,  the expansion of  both the religious healing of Asclepius and the medical science of Hippocratic physicians; the emergence of new forms of monarchy and city leagues (or city consolidation); and  notably the emancipation of the slave population of Messenia after the defeat of their Spartan owners. \nThis course focuses on Plato's philosophical engagement with three critical social issues of his world: the practice and consequences of slavery; the religious and medical contributions to health and healing; and the challenge of \"new gods\" to civic religion and piety.  The three themes will be the interwoven threads of our discussion, as  we read and engage selections from Plato's dialogues against a background of 4th century Greek history.",
    "course_description": "Selected topics in history for students in non-history originating (cross-listed) courses. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Cynthia Patterson - Primary Instructor",
    "schedule_location": "MW 4pm-5:15pm in Candler Library 123",
    "course_resources": null,
    "sections": "Class Nbr: 4638, Section #: 5, Type: LEC, Campus: ATL, Meets: MW 4-5:15p, Instructor: C. Patterson, Status: Open",
    "date_accessed": "2024-03-30"
}