{
    "course_code": "HIST 324",
    "course_title": "Age of Religious Wars",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 2Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "Religious toleration has long been seen as a founding principle of liberal-democratic societies.  The idea of toleration arose in sixteenth- and seventeenth-century Europe, an age of bitter religious divisions compounded by war, revolution, and violent social and political uprisings.  Religious persecution was the norm in a period when rulers considered it their duty to uphold religious uniformity in the face of growing dissent.  Not to do so, they believed, was to risk political disorder or, even worse, to threaten the salvation of millions of Christian souls by allowing pernicious beliefs and practices to spread unchecked. In such a context, how did religious diversity and deviance from orthodoxy provoke such fear and antagonism in early modern Europe? Why were Christian dissenters, not to mention Jews and Muslims, deemed so dangerous as to merit expulsion or even execution?  Grading: Midterm (25%), Final (30%), 2 short papers (25%), Class participation (20%)  This course can be applied to the History major concentrations as either Early European History (pre-1750) or Early Empires, Nations, and Citizenship.",
    "course_description": "Course examines the interplay of religion, war, and politics in early modern Europe. Major topics include Ottoman expansion, the expulsion of the Jews and Moriscos in Spain, the Protestant and Catholic Reformations, the French Wars of Religion, the Thirty Years War, and the rise of toleration.",
    "prerequisites": null,
    "instructors": "James VH Melton - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Tarbutton Hall 106",
    "course_resources": null,
    "sections": "Class Nbr: 2788, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: J. Melton, Status: Open",
    "date_accessed": "2024-03-30"
}