{
    "course_code": "HIST 359",
    "course_title": "American Routes",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 3Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "HAP w/Race & Ethnicity Req.",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "(Same as AMST 321 1)\n\n\nAmerican Routes explores the roots of selected musical genres and styles in the U.S., their historical-geographical beginnings, and their cultural meanings. \nThis course considers major vernacular genres, emblematic performers, song content, audiences, circulation, and preservation. Where, when, and why do musical genres and styles emerge and spread? How does popular music express social history, cultural identities, ranges of feeling, \"authenticity,\" displacement and mobility, and political critique? Genres include: African American spirituals and gospel, the beginnings and early routes of jazz and blues, Appalachian secular and sacred styles, Louisiana Cajun and Zydeco, 'old time' and country music, the origins of rock and roll, soul, episodes of protest music, as well as the cultural contexts of klezmer, conjunto, salsa, rap, and recent 'singer-songwriter' styles.   \nListening and reading assignments are linked from the course syllabus and/or will be made available on Emory e-reserves. Grading is based on attendance and participation, a midterm and final exam, and an annotated playlist developed in consultation with the professor.",
    "course_description": "Explores the variety of traditional musical cultures in the United States, their historical and geographical influences on each other, and their influences on contemporary popular music.",
    "prerequisites": null,
    "instructors": "Allen Tullos - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in Rich Building 108",
    "course_resources": null,
    "sections": "Class Nbr: 2792, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: A. Tullos, Status: Open",
    "date_accessed": "2024-03-30"
}