{
    "course_code": "HIST 385",
    "course_title": "Spec Topics: History: The History of Skiing",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 30 / Seats Avail: 8Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "This course explores the history of snow sports, especially skiing and snowboarding, from the 18th century to today.  This class is not only for history majors or athletes, but also for business students, and anyone interested in environmental history, sports history, business history, and the history of gender and race.  The Beijing 2022 Olympics take place in February. We will pay particular attention to the history of those games. \nThis is the second time that this course is being taught. We will repeat some topics, while adding some new ones. The class will look at the military uses of skiing in World War II, the expansion of leisure sports after 1960 around the globe (Japan, Europe, southern hemisphere skiing), the development of ski schools and ski patrols, emerging environmental issues, avalanche control, the history of the land and the indigenous peoples, snow fashions, and the business of ski resorts, among others.  \nStudents who have never taken a history course and first-year students are welcome. Each student will do a short final research project that will contribute to a website hosted by Emory. As American Historical Association Executive Director Jim Grossman says, 'Everything has a history.'  Skiing and snow sports have fascinating histories.  \nAssignments: Weekly readings and videos, pop quizzes, and a final research project and lead-in assignments for that project.",
    "course_description": "Selected topics in history for advanced students. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Judith Miller - Primary Instructor",
    "schedule_location": "TTh 5:30pm-6:45pm in Rich Building 104",
    "course_resources": null,
    "sections": "Class Nbr: 2798, Section #: 4, Type: LEC, Campus: ATL, Meets: TTh 5:30-6:45p, Instructor: J. Miller, Status: Open",
    "date_accessed": "2024-03-30"
}