{
    "course_code": "HIST 417W",
    "course_title": "Germany after 1945",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 8 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Continuing Writing Requirement",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "(Same as JS 417W 1)\n\n\nIn 1945, Germany was defeated in military and in moral terms. Pundits predicted that the country would be occupied for decades, economically dependent, politically crippled. The rise of the Cold War ruled otherwise: two German states emerged in the heart of Europe, one a liberal democracy, the other a socialist dictatorship. Germany today is arguably the most affluent country in Europe, a destination for migrants, and a reliable democracy. To understand this trajectory, this course explores select topics in the history of postwar Germany: the experience of defeat and military occupation, economic reconstruction and Cold War competition, Germany's reckoning with the Nazi past, the effects of immigration in East and West Germany, as well as the unexpected unification of the country in 1989/90 and its aftermath. This is a seminar with strong emphasis on active participation. The assignments are designed to practice scholarly debate and writing, and culminate in a research paper.",
    "course_description": "Jr/Sr Colloquium.\nThis course explores the history of Germany after 1945, paying special attention to the circumstances under which two independent German states emerged and how they developed diverging societies and independent policies during the Cold War.",
    "prerequisites": null,
    "instructors": "Astrid M. Eckert - Primary Instructor",
    "schedule_location": "W 2:30pm-5:15pm in Callaway Center S104",
    "course_resources": null,
    "sections": "Class Nbr: 2803, Section #: 1, Type: SEM, Campus: ATL, Meets: W 2:30-5:15p, Instructor: A. Eckert, Status: Open",
    "date_accessed": "2024-03-30"
}