{
    "course_code": "HIST 453W",
    "course_title": "China and the World",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 8 / Seats Avail: 2Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Continuing Writing Requirement",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "(Same as EAS 453W 1)\n\n\nThis course is designed as a capstone course for history majors. It is strongly recommended that students have taken at least one or two courses in history or a related field prior to registering.\n\n\nChina is known to its own people as Zhongguo, meaning \"The Middle Country,\" an appellation that smacks of arrogance, and many have considered imperial China to be ossified and closed to outside influences. In fact, however, China was for much of its history an \"Open Empire,\" receptive to ideas from outside and in close contact with other areas of the world. This course attempts to resolve or at least clarify this paradox by approaching Chinese history from a global perspective. We will explore topics such as the so-called tribute system and China's relations with Western powers. \nThis course is an advanced history course, designed as a capstone experience for majors in history. Each student will complete a fifteen- to twenty-page work of historical scholarship based on a topic to be decided in consultation with the instructor. We will focus on the elements of effective writing at the micro and macro levels: how to select a topic that engages with preexisting literature, how to locate and select sources, how to evaluate and read sources, how to outline, how to write rough drafts, etc. Each student will also deliver several oral presentations. Given the specialized nature of the work, students should have taken at least one or two courses in history or a related field at the college level.  Grading: Final Paper: 40%; Regular Class Participation: 20%; Oral Presentations: 20%; Other Assignments: 20%",
    "course_description": "Jr/Sr Colloquium. \nThis course examines China's relations with and connections to the rest of the world, with a focus on China's relations with Europeans, focusing on the period 1400 -1911. It is a writing-intensive course, and the writing of a history research paper is the primary goal.",
    "prerequisites": null,
    "instructors": "Tonio Andrade - Primary Instructor",
    "schedule_location": "M 6pm-8:45pm in Candler Library 121",
    "course_resources": null,
    "sections": "Class Nbr: 2805, Section #: 1, Type: SEM, Campus: ATL, Meets: M 6-8:45p, Instructor: T. Andrade, Status: Open",
    "date_accessed": "2024-03-30"
}