{
    "course_code": "HIST 487RW",
    "course_title": "Jr/Sr Colloquium: Europe: Late Roman Empire:Law/Religion",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 5Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Continuing Writing Requirement",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "Complete topic: Later Roman Empire: Law, Society & Religion.\n\n\nWe often think of the later Roman Empire as a society in decline, about to \"fall.\" But in reality it was a vibrant and diverse world undergoing intense change and stress, a society in transition between classical antiquity and the early Middle Ages. We will look at the political, social, religious and legal changes in the Empire from the late 3rd century to the year 476, when the last emperor in the western Empire was deposed. Topics include political and military developments, religious conflict, the beginnings of monasticism, late Roman law as seen in the Theodosian Code, the disintegration of the western half of the Empire into regional, \"barbarian\" states, and changes in private life and gender roles. \n\tReadings include the Histories of the 4th century soldier 'turned' historian Ammianus Marcellinus, the Confessions of the 4th century bad boy 'turned' bishop, \"saints' lives\" of men and women, selections from Roman law, and modern scholarship on law, society, and religion in the late Empire.  Assignments and Grading: This is a writing course that also requires extensive reading and participation in class discussions. Grades are based on: Participation and weekly short (1 page) reading responses (no rewrites) 20 pts; 4-page analysis of 1-3 primary source documents (with rewrite) 20 pts;\n6-page midterm essay on the Theodosian Code (with rewrite) 25 pts; 10-page research paper on topic relevant to the course (with rewrite) 35 pts.",
    "course_description": "All history majors except those who complete the Honors Program must take two colloquia (HIST 487, 488 or 489). Each colloquium treats a special theme by reading, discussion, and writing of papers. Enrollment in each is limited to twelve; non-majors are welcome within space limitations.",
    "prerequisites": null,
    "instructors": "Judith Evans-Grubbs - Primary Instructor",
    "schedule_location": "Th 4pm-6:45pm in Rich Building 103",
    "course_resources": null,
    "sections": "Class Nbr: 2808, Section #: 1, Type: SEM, Campus: ATL, Meets: Th 4-6:45p, Instructor: J. Evans-Grubbs, Status: Open",
    "date_accessed": "2024-03-30"
}