{
    "course_code": "HIST 443W",
    "course_title": "Crime/Punishment in U.S. Culture",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 3Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Continuing Writing Requirement",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "This course will explore the role that crime and punishment have played in shaping the history and culture of the United States from 1945 to the present. Our questions will come from a range of academic disciplines, from the philosophical (How do we define crime? Why do we punish?) to the sociological (Why and how has race, gender, class influenced what gets defined as criminal and who gets punished?) to the political (Why are some harms not considered criminal while some crimes are, strictly speaking, victimless?) to the poetic (How does crime and punishment exist in popular culture?). And yet, as historians, we will be especially attuned to questions of historical context. How and why do answers to these questions change from the end of World War II, when the very word \"punishment\" was seen as barbaric by elites, to the early 21st century, when one out of every 100 adults were incarcerated, making the United States the most punitive democracy in the world?",
    "course_description": "Jr./Sr. Colloquium.\n A study of the cultural and historical causes of the punitive turn in the United States, the ratcheting up of incarceration and other forms of punishment in the late 20th century.",
    "prerequisites": null,
    "instructors": "Daniel LaChance - Primary Instructor",
    "schedule_location": "W 4pm-6:45pm in Woodruff Library 215",
    "course_resources": null,
    "sections": "Class Nbr: 2811, Section #: 1, Type: SEM, Campus: ATL, Meets: W 4-6:45p, Instructor: D. LaChance, Status: Open",
    "date_accessed": "2024-03-30"
}