{
    "course_code": "HIST 411W",
    "course_title": "Jane Austen's World",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Continuing Writing Requirement",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "The recent television and film versions of Jane Austen's novels have generated great, and well deserved, interest in her works.  Along with reading her masterpieces, Pride and Prejudice and Persuasion, our class will place her work into a rich historical context.  How did her work interpret changing views of love and family? How does it reflect rising consumer capitalism and new styles of fashion? What did her novels say about women's rights to property?  About the Napoleonic war and the British slave trade? Austen wrote during one of the most turbulent periods of British (and world) history.  How can novels help us understand the conflicts of an era? Our course will deepen our understanding of what one observant and candid woman had to say about British society and culture.  A main focus of the course will be the development and writing of a research paper that meets the requirements for the department's junior-senior papers, based on each student's individual interests.  \nFulfills the following History Concentrations: \nWomen, Gender, and Sexuality; Empires, Nations, and Citizenship; Law, Economics and Human Rights; European History; General Studies in History . \nGrading: Library Scavenger Hunt and short assignments leading toward a 20-25-page research paper on topic developed by the students, and very active class participation.",
    "course_description": "Jr/Sr Colloquium. \nThis course looks at global history through the works of Jane Austen. It treats new gender roles, imperialism and the material life of the era. Students write research papers on topics of their choosing to meet the department and College requirements.",
    "prerequisites": null,
    "instructors": "Judith Miller - Primary Instructor",
    "schedule_location": "W 6pm-8:45pm in Bowden Hall 118",
    "course_resources": null,
    "sections": "Class Nbr: 2802, Section #: 1, Type: SEM, Campus: ATL, Meets: W 6-8:45p, Instructor: J. Miller, Status: Open",
    "date_accessed": "2024-03-30"
}