{
    "course_code": "HIST 585",
    "course_title": "Special Topics in History: Anthro/Hist: Research Methods",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 8 / Seats Avail: 4",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-01-10 through 2022-04-25",
    "class_notes": "(Same as ANT 585 9)\nHistory and anthropology have mutually shaped each other since the 1960s, when historians looked to anthropologists for ways to think about culture reflexively, while anthropologists looked to historians for methods for tracing change over time. In this course, we will engage with recent attempts to conceive of these two fields as \"methodological sensibilities,\" or as sets of tools and questions that could be transported across disciplinary boundaries to open up new avenues for inquiry. We will look at a variety of different ways in which anthropologists have engaged with history, as change over time that could denaturalize the present, as individual and collective memory, as a profession. Conversely, we will consider how historians have drawn inspirations from anthropologists, concern with social practice, \"the local,\" the everyday, and non-formalized knowledge that has historically been excluded from the academy. Along with other interdisciplinary alignments, confluences between anthropologists and historians have challenged traditionally authoritative sources of knowledge, such as the institutional archive or the allegedly unsituated persona of the ethnographer. In this course, we ask: What does it mean to write a history or an ethnography in which 'authority' does not take a traditional academic form (individualized, exclusive, decontextualized, unsituated)?",
    "course_description": null,
    "prerequisites": null,
    "instructors": "Adriana Chira - Primary Instructor",
    "schedule_location": "W 6pm-9pm in Candler Library 121",
    "course_resources": null,
    "sections": "Class Nbr: 2830, Section #: 1, Type: SEM, Campus: ATL, Meets: W 6-9p, Instructor: A. Chira, Status: Open",
    "date_accessed": "2024-03-30"
}