{
    "course_code": "HIST 489RW",
    "course_title": "Jr/Sr Coll: LatAm&NonWest Wrld: Conquest & Conversion in Latin America",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 5",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Continuing Writing Requirement",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "The objective of this course is to help you learn the practice and art of researching and writing history by doing so: over the course of the semester, we will develop the skills that you need to produce a 20-page major research paper. The theme for the course addresses one of the most controversial, destructive, and dynamic chapters in the early modern history of the western hemisphere: the violent collision of European, Indigenous, and African worlds in the region that is known today as Latin America. In particular, Spanish exploration and colonialism left an indelible mark on the territory that had been ruled and occupied by the formidable Mexica (Aztec) and Inca empires. From 1521-1821, three hundred long years, Spanish missionary officials, priests, and settlers extracted unimaginable wealth from Spanish American territory, subjected Indigenous peoples and Africans to forced labor regimes, and attempted to claim the souls of those same peoples for the Catholic Church. Their objectives met with varied responses from colonized natives and enslaved African peoples: adaptation, survival, and resistance. As a result, Spanish America resembled neither the ideal of the Spanish overlords, nor the pre-Hispanic empires of old. Rather, it was a new society, characterized by the interaction of diverse peoples and cultural systems.",
    "course_description": "All history majors except those who complete the Honors Program must take two colloquia (HIST 487, 488 or 489). Each colloquium treats a special theme by reading, discussion, and writing of papers. Enrollment in each is limited to twelve; non-majors are welcome within space limitations.",
    "prerequisites": null,
    "instructors": "Yanna Yannakakis - Primary Instructor",
    "schedule_location": "W 2:30pm-5:15pm in Callaway Center N204",
    "course_resources": null,
    "sections": "Class Nbr: 2845, Section #: 1, Type: SEM, Campus: ATL, Meets: W 2:30-5:15p, Instructor: Y. Yannakakis, Status: Open",
    "date_accessed": "2024-03-30"
}