{
    "course_code": "HIST 495BW",
    "course_title": "Intro Historical Interpretation II",
    "credit_hours": "1-8",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Varies by section",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Continuing Writing Requirement",
    "permission": "Department Consent Required",
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "(Permission Required Prior to Enrollment)",
    "course_description": "For honors students in history. Addresses historiographical and methodological issues, and offers practical guidance in thesis design and research, with details and emphases at discretion of instructor.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2823, Section #: 1, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: P. Buchholz, Status: Closed\nClass Nbr: 5924, Section #: 10, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: W. Rucker, Status: Open\nClass Nbr: This section is full 5925, Section #: 11, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Crespino, Status: Closed\nClass Nbr: This section is full 5926, Section #: 12, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: C. Suh, Status: Closed\nClass Nbr: This section is full 5927, Section #: 13, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: B. Vick, Status: Closed\nClass Nbr: 5928, Section #: 14, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Ward, Status: Open\nClass Nbr: This section is full 5929, Section #: 2, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Candido, Status: Closed\nClass Nbr: 5930, Section #: 3, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Chira, Status: Open\nClass Nbr: This section is full 5931, Section #: 4, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Eckert, Status: Closed\nClass Nbr: This section is full 5932, Section #: 5, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Evans-Grubbs, Status: Closed\nClass Nbr: This section is full 5933, Section #: 6, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Fu, Status: Closed\nClass Nbr: This section is full 5934, Section #: 7, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. LaChance, Status: Closed\nClass Nbr: This section is full 5935, Section #: 8, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Miller, Status: Closed\nClass Nbr: This section is full 5936, Section #: 9, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Payne, Status: Closed",
    "date_accessed": "2024-03-30"
}