{
    "course_code": "HIST 585",
    "course_title": "Special Topics in History: ATL's New Deal Public Housing",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 2 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-01-10 through 2022-04-25",
    "class_notes": "(Same as ARTHIST 769 1)\n\"Mining the Archives: Atlanta's New Deal Public Housing\"Atlanta was the site of both the first so-called 'slum clearance' project in the United States, in 1934, and of America's first completed, though segregated, federally-funded public housing: Techwood Homes (for white families), and University Homes (for Black families). These projects became models for New Deal housing projects built throughout the U.S. in the years following enactment of the National Housing Acts of 1934 and 1937, and will be the focus of this archivally-based seminar. Students will gain facility working in the archival environment through theoretical and historical readings and discussions, workshops with archival and library representatives, and, critically, through hands-on experience working in an Atlanta-area archive. Each student will be assigned a research repository to mine for materials on one or both of the two housing projects; these include archives at the Atlanta University Center (Woodruff Library), Georgia Tech, and Emory's own Stuart A. Rose Manuscript, Archives, & Rare Book Library. Students will formulate a final public history-oriented research project based upon their findings in the archive.",
    "course_description": null,
    "prerequisites": null,
    "instructors": "Christina Crawford - Primary Instructor",
    "schedule_location": "T 10am-12:45pm in Callaway Center C201",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 5103, Section #: 8, Type: SEM, Campus: ATL, Meets: T 10a-12:45p, Instructor: C. Crawford, Status: Closed",
    "date_accessed": "2024-03-30"
}