{
    "course_code": "ANCMED 101",
    "course_title": "Introduction to Ancient Mediterranean Societies",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 2Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Same as REL 170 3, JS 180 1)\nThrough a special focus on cultural phenomena identified with the categories of 'sexuality' and 'religion,' this course provides an introduction to the distinctive and interrelated cultures of the ancient Mediterranean world, from the Bronze Age until the Christianization of the Roman Empire. Emphasizing the complex ways in which 'sexuality' and 'religion' interacted in the lives of ancient Mediterranean people, the course will investigate (for example) myths about the creating and sustaining of the world through sexual activity, beliefs about sexual unions between human beings and gods and other powerful beings, and ideas about how gods and other powerful beings regulated and judged human sexual desires and behaviors. The course will give special attention to the emergence and development of Judaism and Christianity in the ancient Mediterranean context and to how those internally diverse traditions engaged with questions about sexual desire and behavior.",
    "course_description": "Social, anthropological, and cultural aspects of two or more ancient Mediterranean cultures from a comparative perspective.",
    "prerequisites": null,
    "instructors": "William K Gilders - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in New Psyc Bldg 230 (36 Eagle Ro",
    "course_resources": null,
    "sections": "Class Nbr: 2577, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 10-11:15a, Instructor: W. Gilders, Status: Open",
    "date_accessed": "2024-03-30"
}