{
    "course_code": "BUS 799R",
    "course_title": "Dissertation",
    "credit_hours": "9",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-05-17 through 2021-08-04",
    "class_notes": null,
    "course_description": "Students who have reached candidacy and are working on dissertation completion are enrolled in this course and supervised by their advisor as they complete their degree requirements.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 2210, Section #: 5101, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: K. Kadous, Status: Open\nClass Nbr: 2211, Section #: 5102, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: K. Sedatole, Status: Open\nClass Nbr: 2212, Section #: 5103, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: G. Maturana, Status: Open\nClass Nbr: 2213, Section #: 5104, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: J. Busse, Status: Open\nClass Nbr: 2214, Section #: 5105, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: T. Chordia, Status: Open\nClass Nbr: 2215, Section #: 5106, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: C. Green, Status: Open\nClass Nbr: 2216, Section #: 5107, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: D. KC, Status: Open\nClass Nbr: 2217, Section #: 5108, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: M. Lewis, Status: Open\nClass Nbr: 2219, Section #: 5110, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: A. Swaminathan, Status: Open\nClass Nbr: 2221, Section #: 5111, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: D. Lewis, Status: Open\nClass Nbr: 2222, Section #: 5112, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: M. Williams, Status: Open\nClass Nbr: 2342, Section #: 5113, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: G. Negro, Status: Open",
    "date_accessed": "2024-03-30"
}