{
    "course_code": "MATH 190",
    "course_title": "Fresh Sem: Math: Sports, Games and Gambling",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "In this class we will learn some mathematics from the areas of probability, combinatorial counting and game theory by playing and studying competitive games of strategy (including backgammon),card games (including hearts), casino games (including a little roulette and a lot of blackjack) and possibly some board games(Othello, for example). We will also consider some of the gambling involved in the last games of the NFL season and in all of the NCAA Basketball Tournament (Men's and Women's). The class, unlike Professor Gould's offerings in the past, will not treat sports analytics.It is expected that students who enroll will have a basic familiarity with (and at least a mild interest in) professional football and American college basketball. I plan to show two or three movies in the evening at various points during the semester. Attendance will be required but I'm sure you'll enjoy attending. A remark about blackjack: although the complexity of the game and the use of multiple deck shoes make a mathematical analysis beyond the scope of this seminar, we can still make intelligent empirical observations about various playing strategies and betting schemes;i.e., we can still have a good time playing.",
    "course_description": "Topics will be announced each semester when class is scheduled.",
    "prerequisites": null,
    "instructors": "Robert Roth Jr. - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Math & Science Center - E406",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 5582, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: R. Roth Jr., Status: Wait List",
    "date_accessed": "2024-03-30"
}