{
    "course_code": "MATH 561",
    "course_title": "Matrix Analysis",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 6",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": null,
    "course_description": "Main topics: Eigenvalues and eigenvectors of matrices, invariant subspaces, Schur triangular form, diagonalizable matrices, minimal polynomial, characteristic polynomial, Hamilton-Cayley Theorem, localization of eigenvalues, Gerschgorin's Theorem. Unitary, Hermitian and skew-Hermitian matrices. Normal matrices and the Spectral Theorem. Orthogonalization. Householder matrices and the QR factorization. Moore-Penrose pseudoinverse. Applications to the solution of under- and over-determined systems of linear equations. Other generalized inverses. Applications to data fitting (least-squares approximation). The Singular Value Decomposition. Matrix norms: spectral norm and Frobenius norm. Solution to matrix nearness problems. Applications to signal processing and information retrieval. Jordan canonical form. An algorithmic proof. Powers of matrices. Matrix functions. Applications to systems of differential equations. Bilinear and quadratic forms. Hermitian forms. Congruence. Sylvester's Law of Inertia. Rayleigh's principle. Courant-Fischer Theorem. Positive definite and semidefinite matrices. Applications to statistics (covariance matrices) and numerical analysis (PDE's). Additional topics: Nonnegative matrices. The spectral radius. Positive matrices. Directed graphs. Nonnegative irreducible matrices. Perron-Frobenius Theorem. M-matrices. Applications to probability theory (Markov chains), economics (Leontiev's input-output model), and numerical analysis (iterative methods for linear systems). Structured matrices: circulant, Toeplitz, Hankel, Cauchy, Vandermonde, others. Block generalizations. Applications in signal processing, image processing, and numerical analysis (PDE's, interpolation).",
    "prerequisites": null,
    "instructors": "Julianne Chung - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in Math & Science Center - E408",
    "course_resources": null,
    "sections": "Class Nbr: 3843, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: J. Chung, Status: Open",
    "date_accessed": "2024-03-30"
}