{
    "course_code": "HIST 799R",
    "course_title": "Advanced Research",
    "credit_hours": "1-9",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Varies by section",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2021-05-17 through 2021-08-04",
    "class_notes": null,
    "course_description": null,
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2063, Section #: 1, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: T. Andrade, Status: Closed\nClass Nbr: This section is full 2072, Section #: 10, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: C. Crais, Status: Closed\nClass Nbr: This section is full 2073, Section #: 11, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Crespino, Status: Closed\nClass Nbr: This section is full 2074, Section #: 12, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Evans-Grubbs, Status: Closed\nClass Nbr: This section is full 2315, Section #: 13, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Yannakakis/Harris, Status: Closed\nClass Nbr: This section is full 2323, Section #: 14, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Andrade/Ravina, Status: Closed\nClass Nbr: This section is full 2417, Section #: 15, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Eckert, Status: Closed\nClass Nbr: This section is full 2422, Section #: 16, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: C. Anderson, Status: Closed\nClass Nbr: This section is full 2064, Section #: 2, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Evans-Grubbs/Pastan, Status: Closed\nClass Nbr: This section is full 2065, Section #: 3, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Goldstein/Schainker, Status: Closed\nClass Nbr: This section is full 2066, Section #: 4, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. LaChance, Status: Closed\nClass Nbr: This section is full 2067, Section #: 5, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Lesser/Rogers, Status: Closed\nClass Nbr: This section is full 2068, Section #: 6, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Payne, Status: Closed\nClass Nbr: 2069, Section #: 7, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Tullos, Status: Open\nClass Nbr: This section is full 2070, Section #: 8, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Villa-Flores, Status: Closed\nClass Nbr: This section is full 2071, Section #: 9, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Y. Yannakakis, Status: Closed",
    "date_accessed": "2024-03-30"
}