{
    "course_code": "QTM 285",
    "course_title": "Topics in Quantitative Science: Data Sci. Startups&Enterprise",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 13Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "Many executives know they should be using data science, but most have no idea\nwhere to start. This seminar trains both functional and technical professionals in\nthe business of data science, so that they may provide that guidance to executives\nand their teams. As a result, QTM students learn to apply their top-tier training\nsuccessfully in the business environment. This course is structured as a seminar with\ninvited guest speakers.\nIn the first part of the course, students learn how to identify data science use\ncases and build business cases around them, carefully differentiating the nature of\na startup's business case from an enterprise one. In the second part of the course,\nstudents survey methodologies for turning \"data science as a hobby\" into \"data science\nas a business\" by building an organizational capability around those use cases. In\nthe third part of the course, students gain a broader perspective on the strategic\nimplications of these use cases, especially in an environment increasingly subject to\nstatutory and regulatory scrutiny.\nEach part of the course contains 1) an interactive lecture component, which\nintroduces the topic and provides a problem solving framework; 2) a group work\ncomponent, in which students work in groups of 4-5 to tackle the topic and present\ntheir solutions, and; 3) invited guests, who provide key context with their experiences\nin the startup and enterprise spaces.\n\n\nThis course counts for a QSS minor upper-level elective but does NOT count as a QSS, PPA, AMS or BBA+QSS upper-level elective",
    "course_description": "Includes topics related to statistical computing.",
    "prerequisites": null,
    "instructors": "Joe Sutherland - Primary Instructor",
    "schedule_location": "M 2:30pm-5:30pm in Candler Library 121",
    "course_resources": null,
    "sections": "Class Nbr: 5553, Section #: 1, Type: LEC, Campus: ATL, Meets: M 2:30-5:30p, Instructor: J. Sutherland, Status: Open",
    "date_accessed": "2024-03-30"
}