{
    "course_code": "QTM 385",
    "course_title": "Special Topics: QTM: Decisions and Organizations",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 30 / Seats Avail: 2Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "(Permission Required Prior to Enrollment)\nPrerequisites: [MATH 210 or 211] and [QTM 100 or QTM 210 or ECON 220 or MATH 361 or MATH 362]\nPermission code request form (same for all QTM courses: https://forms.office.com/r/UhnG2BB437\nThis course will cover incentives and information in organizations and individual decision making. We start by exploring incentives and choices for an individual decision maker. We then move to examining incentives provision and information flows within organizations and how they work differently for different organizational types such as firms, bureaucracies, and non-profits. We will also consider topics such as organizational culture, cooperation, and leadership. Finally, we turn to recent work in behavioral economics and psychology and their implication for earlier topics. Throughout, we will discuss applications to areas including education, health, crime, national security, and political economy. We will also cover the necessary game theory for all models used in this course. No prior experience with game theory is necessary, but we will make use of  calculus and basic probability.",
    "course_description": "Special Topics Courses. Includes Game Theory I/II, Maximum Likelihood Estimation, Longitudinal Data Analysis, Experimental Methods, Survey Research Methods, Computational Modeling, and Advanced Topics: Bayesian Statistics.",
    "prerequisites": "QTM 110 and QTM 120 and QTM 210 or equivalent transfer credit as prerequisite.",
    "instructors": "Gregory Sasso - Primary Instructor",
    "schedule_location": "TTh 8:30am-9:45am in Rich Building 104",
    "course_resources": null,
    "sections": "Class Nbr: 2162, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 8:30-9:45a, Instructor: G. Sasso, Status: Open",
    "date_accessed": "2024-03-30"
}