{
    "course_code": "QTM 385",
    "course_title": "Special Topics: QTM: Models of Int'l Relations",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 3",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "(Same as POLS 385 2)\nThis course will be taught entirely online and will meet synchronously on Thursdays only; remaining course content will be delivered asynchronously.\nHow and why do states bargain, cooperate, and fight? This class will explore the strategic interactions at the heart of international relations. We will use models; primarily game theoretic models, to examine how actors make decisions when confronting friends or foes, under constraints, and in environments filled with uncertainty. This class will be an introduction to one way of thinking about international relations, which emphasizes constructing logical (often mathematical) frameworks to answer questions like: Why do wars start and end? How do states trade? When does globalization affect development? There are no formal prerequisites for this course. However, this class will involve analysis of logical statements and systems, and comfort with mathematical reasoning will be very helpful.",
    "course_description": "Special Topics Courses. Includes Game Theory I/II, Maximum Likelihood Estimation, Longitudinal Data Analysis, Experimental Methods, Survey Research Methods, Computational Modeling, and Advanced Topics: Bayesian Statistics.",
    "prerequisites": "QTM 110 and QTM 120 and QTM 210 or equivalent transfer credit as prerequisite.",
    "instructors": "Jessica Sun - Primary Instructor",
    "schedule_location": "TTh 5:30pm-6:45pm in Tarbutton Hall 105",
    "course_resources": null,
    "sections": "Class Nbr: 4040, Section #: 13, Type: LEC, Campus: ATL, Meets: TTh 5:30-6:45p, Instructor: J. Sun, Status: Open",
    "date_accessed": "2024-03-30"
}