{
    "course_code": "QTM 385",
    "course_title": "Special Topics: QTM: Nonparam.Stat. &Mach. Learning",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 30 / Seats Avail: 21Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "(Permission Required Prior to Enrollment)\nPrerequisites: [QTM 220 or ECON 320], QTM 110, QTM 150, [QTM 210 or ECON 220 or MATH 362], [MATH 210 or MATH 211], and MATH 221)\nPermission code request form (same for all QTM courses): https://forms.office.com/r/UhnG2BB437\n\n\nWhen we teach statistics, we often act as if simple models were right. For example, we might find the line that best fits the data, then act as if that line were a useful description of reality. With the right blend of intuition and luck, this can work --- we can get by with a model that is wrong but not too wrong --- but it's often helpful to have a more nuanced perspective. This class is an introduction to the theory and practice of doing statistics without simplistic modeling assumptions. We will cover regression, model selection, and optimal aggregation of estimators using a variety of models including kernel machines and neural networks. Our focus will be on understanding why estimators do or don't work and developing intuition about what to estimate and what modeling assumptions to use. Drawing exercises, computer visualization, and computer simulations will be used to get a feel for things.",
    "course_description": "Special Topics Courses. Includes Game Theory I/II, Maximum Likelihood Estimation, Longitudinal Data Analysis, Experimental Methods, Survey Research Methods, Computational Modeling, and Advanced Topics: Bayesian Statistics.",
    "prerequisites": "QTM 110 and QTM 120 and QTM 210 or equivalent transfer credit as prerequisite.",
    "instructors": "David Hirshberg - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Rich Building 211",
    "course_resources": null,
    "sections": "Class Nbr: 2928, Section #: 9, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: D. Hirshberg, Status: Open",
    "date_accessed": "2024-03-30"
}