{
    "course_code": "REL 190",
    "course_title": "Fresh Sem: Religion: Buddhism and Human Flourishing",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 0 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First Year Seminar",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "(Same as PHIL 190 2)\nThis course satisfies the Religion major requirement: - Tradition-Buddhism.\nSuffering is a universal feature of human life. No one who lives does not also suffer. This insight is the starting point for the Buddha's teachings on the nature of the human condition and the possibility of human flourishing. Although suffering is universal, diverse causes of suffering can be identified. Once identified, these causes can be mitigated so that the suffering they produce is either less harmful or eliminated. Humans can learn to transform suffering into something beautiful, just as a gardener uses manure to nourish beautiful flowers. To turn suffering into a path of well-being, however, requires many skills. We need to learn how to look deeply to see the complex causes of suffering. Then we need to learn how these causes can be ameliorated or undone. And we need to train in the methods for ameliorating and undoing the causes of suffering. These methods require work at the personal as well as the communal levels, at the surface as well as the deeper levels of our embodied minds. This course is an introduction to traditional and contemporary Buddhist theories of well-being, happiness, and flourishing, along with some of the methods designed to bring these about.",
    "course_description": "Dynamics of inquiry on a focused research topic. Will include discussion, debate, oral and written presentations. Topic varies.",
    "prerequisites": null,
    "instructors": "Sara L McClintock - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in Woodruff Library 773",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_REL_190_2_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: This section is full 2828, Section #: 2, Type: SEM, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: S. McClintock, Status: Closed",
    "date_accessed": "2024-03-29"
}