{
    "course_code": "REL 121",
    "course_title": "Introduction to Jewish Studies",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 10Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "Humanities and Arts(*)",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "Same as JS 101-1 and HIST 107-1\n\n\nThis course serves as an introduction to the various questions, texts, methodologies, and perspectives that constitute the broad interdisciplinary field of Jewish studies.  Students will gain an insight into the sweep of Jewish culture (how it developed through time and in relation to its own origins) as well as how an understanding of the relationships between Jewish cultures and their neighbors (how it has been shaped through interactions, conflicts, and dialogues with non-Jewish cultures).  To that end, we will investigate various forms of religious, legal, and literary expression; key historical movements and institutions; as well as shifting notions of peoplehood, religiosity, and ethnicity.  As we move forward, we'll focus on the tension between Jewish culture and Jewish cultures, noting both commonalities amid the diversity, and that which is distinctive, \"strange,\" and/or local.  \nWe will follow a rough chronological trajectory, moving from antiquity to the modern period, reading materials as varied as biblical and rabbinic texts, histories, memoirs, folklore, and poems.  Though the course has a clear emphasis on literary culture and the written word, we'll also investigate elements of nonwritten - visual, aural, mimetic, and material - culture.",
    "course_description": "This course introduces students to the various questions, texts, methodologies, and perspectives that constitute the broad field of Jewish Studies. It presumes no prior knowledge of Jewish history, religion or culture.",
    "prerequisites": null,
    "instructors": "Katherine Rosenblatt - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in White Hall 207",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_REL_121_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 4144, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: K. Rosenblatt, Status: Open",
    "date_accessed": "2024-03-29"
}