{
    "course_code": "REL 354R",
    "course_title": "Ethics: Secular Ethics: Dalai Lama's",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 40 / Seats Avail: 40Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "This course satisfies the Religion major requirement:- Theme.\nComplete Topic: Secular Ethics: The Dalai Lama's Approach\nRecipient of the Nobel Peace Prize, the U.S. Congressional Gold Medal, and a host of other awards and honors for his lifelong dedication and efforts to the promotion of nonviolent approaches to conflict resolution, His Holiness the XIV Dalai Lama is the spiritual leader of the Tibetan people and is internationally recognized as an emissary for global peace and justice. At the turn of the century, the Dalai Lama called for a holistic approach to education that cultivates, alongside traditional academic subjects, a compassionate and ethical mindset grounded in the basic human values that can be discerned from common sense, common experience, and science. He refers to this approach as 'secular ethics,' an approach to ethics that is not dependent on a particular belief system or religious framework but is inclusive of people with any or no religious affiliation. In 2019 the Center for Contemplative Science and Compassion-Based Ethics developed a secular ethics curriculum to carry out the Dalai Lama's vision, called Social, Emotional and Ethical (SEE) Learning.\n\n\nThe Dalai Lama's vision for secular ethics is grounded in the fundamental principle of compassion. In this course, we will explore this approach to ethics across three overlapping domains: Self-Cultivation: Personal Domain, Relating to Others: Social Domain, and Responsible Decision Making: Systems Domain. Each domain contains specific skills that can be practiced and cultivated, such as attention training, emotional regulation, appreciation for others, and systems-level thinking. This course is designed for you to engage with the critical and analytic aspects of Secular Ethics through practice.\nUsing a critical self-reflection approach, this course emphasizes first person empiricism, which expands to questions about and experiences of relating to others and responsible decision making. The course serves as a moral experiment emphasizing practice.",
    "course_description": "Analysis of methods and/or texts pertaining to ethical decision-making for individual and social problems such as race, sex/marriage, justice, war, biomedical technology, and environmental pollution. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Geshe Lobsang Tenzin Negi - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in White Hall 111",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_REL_354R_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2880, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: Team, Status: Open",
    "date_accessed": "2024-03-29"
}