{
    "course_code": "REL 371",
    "course_title": "Special Topics in Religion and Law: Comparative Religious Laws",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 20Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "The prerequisite for this course will be waived for Fall 2024. No permission number or approval is needed. If you have questions, please feel free to contact Prof. Ariel Liberman- ariel.liberman@emory.edu\n\n\nThis course satisfies the Religion major requirement:- Theme.\nTo many, `religion and law¿ is a field of study limited only to lawyerly engagement in constitutional conversations about religious freedom, or guidance from clergy concerning religious codes.  This is part of it, but it¿s not the full story. The field contemplates all manner of questions, issues, topics, events that mark our deeply diverse and divided society. These `topics¿ courses are designed to give students a flavor of the diverse intellectual pathways in our field.\n\n\n`Comparative Religious Laws¿ introduces students the theory and practice of comparative studies, with a specific focus on to the study of major religious law systems. The course begins with an overview of traditional comparative legal methods, but quickly moves into exploring the different legal traditions ¿ in terms social customs and formal institutions ¿ and how these foundational regimes have impacted (and still impact) millions of our friends and neighbors today, not to mention national and global legal systems. The questions this class especially focuses on include: where the law comes from? (i.e. oral tradition, religious texts, legislation, etc.); how it is adjudicated? (i.e. ritual, courts); and how do legal systems change over time, particularly in the context of globalization? We will also consider the meanings people give to legal systems in their everyday lives. In addition, we will look at substantive legal topics including religious perspectives on human rights, church/state relations, family law and marriage, property law, education, legal norms and values, and community consideration of the ¿other.¿",
    "course_description": "Through variables such as arts, politics, freedom, race, nd coloniality, this repeatable special topics course will explore various ways in which religion and law intersect and pose questions in political life, social justice struggles, community conversations and spaces, and cultural consciousness.",
    "prerequisites": null,
    "instructors": "Ariel Liberman - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in 1462 Clifton Rd 123",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_REL_371_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2894, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: A. Liberman, Status: Open",
    "date_accessed": "2024-03-29"
}