{
    "course_code": "GRK 312",
    "course_title": "Tragedy",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 14",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "Humanities, Arts, Language [Foreign Language]",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "Greek 312. Pratt. MWF 1-1:50 pm\nWe will read a complete tragedy in Greek with close attention to language, performance, (including staging) and interpretation.  We will also discuss Greek tragedy more broadly, both in its original context and in re-performance, by watching films and by reading in English translation additional tragedies and criticism of tragedy, both ancient and modern, both comedic (such as Aristophanes' Frogs) and philosophical (such as Aristotle's Poetics). \nMy current plan is to read Euripides' Bacchae in Greek, though I am open to other suggestions by students enrolled in the class, so please e-mail me (lpratt@emory.edu) if you are particularly interested in another play. The Bacchae is the only surviving Greek tragedy on the subject of the god of drama, Dionysus, and affords plenty of room to explore various topics in culture and religion as well as in literature.\nTwo translation tests, plus a final exam. Daily classwork will also be a component of the grade, as will some short writing assignments and/or oral reports. Students will also normally be required to do one substantial additional project of their own choice/devising: for example, a final paper or a staging of a scene. \nI have not yet made up a syllabus for this class, but I will be happy to talk to students who are considering taking it more about what I expect to do. Email me for an appointment or with questions: lpratt@emory.edu\nPrerequisite: Greek 202 or equivalent.",
    "course_description": "Reading of one or more tragedies by Aeschylus, Sophocles, or Euripides, with attention to language, staging, and dramatic form and meaning.",
    "prerequisites": null,
    "instructors": "Louise Pratt - Primary Instructor",
    "schedule_location": "MWF 1pm-1:50pm in Candler Library 222A",
    "course_resources": null,
    "sections": "Class Nbr: 3056, Section #: 1, Type: SEM, Campus: ATL, Meets: MWF 1-1:50p, Instructor: L. Pratt, Status: Open",
    "date_accessed": "2024-03-30"
}