{
    "course_code": "GRK 202",
    "course_title": "Intermediate Greek: Poetry",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 14 / Seats Avail: 12",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "Humanities, Arts, Language [Foreign Language]",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "Greek 202. Poetry (Homer's Iliad)\nMWF 8:30-9:20\nContent: This course offers an introduction to Greek epic poetry through close reading of selections from one of the most influential and fascinating poems of all time, the Iliad of Homer. The goal of this course is to learn to read Homeric Greek with facility and appreciation and to discuss the poem, its interpretation, history, and influence. In addition to reading selections from the poem in Greek, we will read the entire Iliad in English as well as selected essays and articles on a range of topics relevant to the poem.\nRequired Texts: \n1. A.R. Benner, Selections from Homer's Iliad; \n2. a translation of the Iliad (the Lattimore translation is recommended as most useful for students of Greek due to its faithfulness to the original).\t\n \nRequirements: two hour exams, final, quizzes, an oral report. Classwork will be an important component of the course and will include regular in-class translation of Homer, reading Homeric poetry aloud in Greek, and discussion. \nPrerequisite: GREEK 201 or equivalent. Students with the equivalent of a full year of college level Greek (Greek 101-102 or Greek 110) are also eligible; consult the instructor, Louise Pratt (lpratt@emory.edu) if you're uncertain.",
    "course_description": "Spring. Selected reading in Homer's Iliad or Odyssey, with attention to poetic art as well as grammar and syntax.",
    "prerequisites": null,
    "instructors": "Louise Pratt - Primary Instructor",
    "schedule_location": "TThF 10am-10:50am in Candler Library 222A",
    "course_resources": null,
    "sections": "Class Nbr: 1305, Section #: 1, Type: LEC, Campus: ATL, Meets: TThF 10-10:50a, Instructor: L. Pratt, Status: Open",
    "date_accessed": "2024-03-30"
}