{
    "course_code": "QTM 398R",
    "course_title": "Peer Mentoring in Statistics",
    "credit_hours": "1-2",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Varies by section",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": null,
    "course_description": "Engage in statistical study and mentor peers in statistics; attend an orientation, develop mentoring skills, have weekly meetings with lecturer, attend one QTM 100 section per week, and hold mentoring sessions for current students. (2 credits)\nOR Aid TA in QTM 100 Lab (1 credit)",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: This section is full 6185, Section #: 1, Type: SEM, Campus: ATL, Meets: Does Not Meet, Instructor: H. Kim, Status: Closed\nClass Nbr: 6199, Section #: 10, Type: SEM, Campus: ATL, Meets: Does Not Meet, Instructor: A. Glynn, Status: Open\nClass Nbr: This section is full 6201, Section #: 11, Type: SEM, Campus: ATL, Meets: Does Not Meet, Instructor: W. Loh, Status: Closed\nClass Nbr: This section is full 6202, Section #: 12, Type: SEM, Campus: ATL, Meets: Does Not Meet, Instructor: D. Hirshberg, Status: Closed\nClass Nbr: This section is full 6242, Section #: 13, Type: SEM, Campus: ATL, Meets: Does Not Meet, Instructor: R. Franzosi, Status: Closed\nClass Nbr: This section is full 6241, Section #: 14, Type: SEM, Campus: ATL, Meets: Does Not Meet, Instructor: N. Silverblatt, Status: Closed\nClass Nbr: This section is full 6186, Section #: 2, Type: SEM, Campus: ATL, Meets: Does Not Meet, Instructor: M. Arbilly, Status: Closed\nClass Nbr: This section is full 6187, Section #: 3, Type: SEM, Campus: ATL, Meets: Does Not Meet, Instructor: K. McAlister, Status: Closed\nClass Nbr: 6188, Section #: 4, Type: SEM, Campus: ATL, Meets: Does Not Meet, Instructor: K. McAlister, Status: Open\nClass Nbr: This section is full 6189, Section #: 5, Type: SEM, Campus: ATL, Meets: Does Not Meet, Instructor: G. Sasso, Status: Closed\nClass Nbr: This section is full 6190, Section #: 6, Type: SEM, Campus: ATL, Meets: Does Not Meet, Instructor: G. Sasso, Status: Closed\nClass Nbr: 6203, Section #: 7, Type: SEM, Campus: ATL, Meets: Does Not Meet, Instructor: J. Jacobson, Status: Open\nClass Nbr: 6204, Section #: 8, Type: SEM, Campus: ATL, Meets: Does Not Meet, Instructor: Z. Gong, Status: Open\nClass Nbr: This section is full 6205, Section #: 9, Type: SEM, Campus: ATL, Meets: Does Not Meet, Instructor: J. Estrada, Status: Closed",
    "date_accessed": "2024-03-30"
}