{
    "course_code": "PORT 485",
    "course_title": "Adv.Topics Luso-Afro-Braz.St.: Neurosciences in Brazil",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 7 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "1.\tNeuroscience is a research area in Brazil where it connects to society broadly and across class, racial, and regional lines due to its translational character. Since Brazil is a big country, with many distinct regions that are geographically, culturally, and economically different, neuroscience thus reflects that. Research in the Amazon region often focuses on etnopharmacology, a field of pharmacology research using the knowledge and tradition of indigenous people on the usage of plants to treat diseases. Research funding in Brazil operates differently than in US, creating new fields of study. This multi-disciplinary course treats neuroscience as a case study for understanding the complexity of Brazil Thus we will combine scientific study with the history of neuroscience in Brazil, an analysis of regional differences and cultures, and how scientific funding impacts national research agendas. This course is aimed at students in both the Sciences and the Humanities and thus different student backgrounds is an advantage. The scientific background of some students will be added to the cultural and areas studies knowledge of others so we can deepen our understanding of how neuroscience is similar, and different, in Brazil and the United States. To stimulate each week's discussion, and respect the different strengths students brings to the class, we will start each week by discussing 3 different words/concepts that students have read for the first time in that week's assignment.",
    "course_description": "Advanced-level studies of the language, discourse, literature, and/or culture of the Portuguese-speaking world. May be taught in English or Portuguese. Students may take multiple SPAN 485 courses provided that they focus on different topics.",
    "prerequisites": null,
    "instructors": "Simone Motta - Primary Instructor",
    "schedule_location": "W 4pm-6:45pm in Emerson Chemistry Bldg. E103",
    "course_resources": null,
    "sections": "Class Nbr: 4160, Section #: 1, Type: SEM, Campus: ATL, Meets: W 4-6:45p, Instructor: S. Motta, Status: Open",
    "date_accessed": "2024-03-30"
}