{
    "course_code": "PORT 110",
    "course_title": "Portuguese for Spanish Speakers",
    "credit_hours": "3",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Language [Foreign Language]",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "CONTENT: PORT 110 is an intensive course for students with little or no preparation in the language, but are Spanish speakers (or of another Romance Language). It stresses the fundamental language skills of understanding, speaking, reading and also writing. Aspects of Lusophone culture will also be presented. Classes will be taught mostly in Portuguese in order to expose the students to the language. It is also a goal of the course to create a positive interaction among the students. Group work will be frequent, as well as the use of the students' different background and experience with the language. It covers the equivalent of two semesters (PORT 101 and PORT 102). PARTICULARS: Evaluation is based on daily and active participation, homework, quizzes, writing activities, exams, and Portuguese program activities. PREREQUISITES: No preparation in the language is required but the course is designed specifically for speakers of another Romance Language. Students who have taken the Spanish Placement exam and have been placed at the 300 level or above are encouraged to take Port 110. Students who place in SPAN 212 should contact ana.teixeira@emory.edu for placement information.\nNOTE: This class will occasionally meet online (via zoom) for pedagogical and/or practical reasons",
    "course_description": "Builds oral proficiency and increases knowledge of Portuguese, Lusophone African, and Brazilian cultures through discussion, listening, reading, and writing on topics pertaining to current events and literature.",
    "prerequisites": null,
    "instructors": "Ana Catarina Teixeira - Primary Instructor",
    "schedule_location": "Varies by section",
    "course_resources": null,
    "sections": "Class Nbr: 1530, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 10-11:15a, Instructor: Team, Status: Open\nClass Nbr: 2444, Section #: 2, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: Team, Status: Open",
    "date_accessed": "2024-03-30"
}