{
    "course_code": "ANT 207",
    "course_title": "Foundation Development Studies",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 35 / Seats Avail: 16Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "Social Sciences(*)",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Responding to pervasive problems of Third World poverty, industrialized nations around the world have attempted to provide poor countries with the equipment, training and know-how necessary to develop strong economies.  Despite the fact that this assistance has been offered over a period of half a century, and has amounted to huge sums of money, it has had little positive impact.  In fact, most aid and the majority of development programs have either failed completely or have exacerbated already serious problems. This dilemma provides the point of departure for the introduction for the Master's in Development Practice program.  We will first examine theoretical and applied literature representative of early approaches to problems of development.  After reviewing the strengths and weaknesses of this body of work we will turn to an examination of the political context in which concern about development arose in the industrialized world.  We will then examine the ways in which the global structure of affluence and poverty has been shaped by the evolving geopolitical concerns of the United States, and the changing economic interests of transnational corporations. Toward the end of the course will look at responses to development, and alternatives to mainstream definitions of development.",
    "course_description": "Introduces students to the growing field of development studies and provides a solid foundation for subsequent course work in the Minor. Key topics include human rights, gender, environment, poverty and inequality, democratic reforms and governance, market reforms, rural development, and conflict.",
    "prerequisites": null,
    "instructors": "David L Nugent - Primary Instructor",
    "schedule_location": "TTh 5:30pm-6:45pm in Math & Science Center - N302",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ANT_207_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3275, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 5:30-6:45p, Instructor: D. Nugent, Status: Open",
    "date_accessed": "2024-03-30"
}