{
    "course_code": "ANT 204",
    "course_title": "Introduction To Archaeology",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 24 / Seats Avail: 5Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "Social Sciences(*)",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "This course uses tiered enrollment. Additional seats will be added in advance of junior registration (Oct 30), and all seats will be opened for sophomore registration (Nov 6).  Senior and junior majors may request enrollment permission during the pre-registration window by emailing hcarpe5@emory.edu.\n\n\nThis course provides an introduction to the history, methods, theory, and broader social context of modern archaeology. Archaeology is an incredibly diverse discipline unified by its use of material remains to study the human past. Modern archeologists work in all parts of the world studying time periods from the remote evolutionary past to the modern day. They investigate subjects ranging from ancient environments and climate change to prehistoric technology and social identity, using techniques that range from scientific excavation to satellite imaging, materials analysis, paleopathology, underwater exploration, landscape phenomenology, and more. In this class, we will explore some of the major questions that interest archeologists and the sources of evidence they use to investigate them. Among other things, we will consider the different kinds of information that can be gained from plant and animal remains, manufactured goods, and evidence of structures, as well as the use of modern analogs and experiments. The focus throughout will be on how archeologists know what they know and how this specialist knowledge is relevant to people throughout the world today.",
    "course_description": "Principles of archaeological analysis and field excavation.",
    "prerequisites": null,
    "instructors": "Cheng Liu - Primary Instructor",
    "schedule_location": "TTh 4pm-5:15pm in New Psyc Bldg 235 (36 Eagle Ro",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ANT_204_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3274, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 4-5:15p, Instructor: C. Liu, Status: Open",
    "date_accessed": "2024-03-30"
}