{
    "course_code": "ANT 101",
    "course_title": "Introduction To Anthropology",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 10",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Social Sciences(*)",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Enrollment is tiered to prioritize first and second year students. Additional seats will be added with each level of pre-registration, with most seats reserved for sophomores and freshmen. Questions email hcarpe5@emory.edu.\n\n\nThe goals of this course are to introduce students to the field of anthropology and to showcase the multi-disciplinary nature of anthropological knowledge.  Anthropology, and therefore this course, explores the broad question \"what does it mean to be human?\"  In answering this question, the field takes a holistic approach, meaning anthropologists study all aspects of humanity with methods from four main subdisciplines:  cultural anthropology (studying modern cultures around the world), biological anthropology (studying human evolution and diversity), archaeology (studying past cultures through the material remains they left behind), and linguistic anthropology (studying language).  The first part of this class is a survey of the major theories and methods in each of these subdisciplines.  Then, we will discuss current anthropological approaches to different aspects of the human condition, such as language, kinship, evolution, identity, and more.  We will pay particular attention to the ways that the subdisciplines, with their varied and unique frameworks, can each contribute to building a fuller picture of these topics and of humanity.",
    "course_description": "Survey of the study of the human species: its evolution, prehistory, language, and comparative social and cultural systems.",
    "prerequisites": null,
    "instructors": "Kristen Broehl - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Anthropology Building 303",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ANT_101_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3259, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 10-11:15a, Instructor: K. Broehl, Status: Open",
    "date_accessed": "2023-10-30"
}