{
    "course_code": "ANT 201",
    "course_title": "Concepts And Methods in Biol Anth",
    "credit_hours": "4",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Natural Sciences(*)",
    "permission": "Varies by section",
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Request permission to enroll by completing this form: https://forms.office.com/r/kjz36FRN6E\nPermission questions contact Heather Carpenter (hcarpe5@emory.edu).\n\n\nThe overall goal of this course is to build an understanding of (1) the processes that led to modern human biocultural variation and (2) how we know what we know. Like other anthropological fields, we will attempt to answer the question: what does it mean to be human? Our focus is on biological and evolutionary processes, but that includes behavior and culture because these are impacted by, and have impacts on, our biology. This class begins with an overview of genetics and evolutionary theory, providing a foundation for the rest of the course. Then we use this knowledge to explore examples of adaptation and microevolution among modern humans and to address misconceptions about human variation. Next, we will turn to macroevolution of our species, Homo sapiens, using comparative and paleoanthropological approaches. With the comparative approach, we focus on anatomy and behavior of living non-human primates to identify traits we share with them and traits that are uniquely human. Paleoanthropology combines our knowledge of living primates with observations from the fossil record to trace the evolution of primates and hominins (humans and their ancestors) over millions of years. Therefore, we will gain insight into our own evolutionary past and attempt to identify where, when, why, and how our biological and cultural traits emerged.",
    "course_description": "Biological and cultural evolution and adaptation of the human species, fossil populations, human variation, and primate behavior. Methods in biological anthropology, survey of the prehistoric evolution of cultures, contemporary issues in paleoanthropology. Weekly lab in biological anthro methods.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": "Varies by section",
    "course_resources": null,
    "sections": "Class Nbr: 3262, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 10-11:15a, Instructor: K. Broehl, Status: Open\nClass Nbr: 3263, Section #: L1, Type: LAB, Campus: ATL, Meets: F 9-11a, Instructor: Staff, Status: Open\nClass Nbr: 3264, Section #: L2, Type: LAB, Campus: ATL, Meets: F 12-2p, Instructor: Staff, Status: Open",
    "date_accessed": "2023-10-30"
}