{
    "course_code": "ANT 337",
    "course_title": "Religion Health and Healing",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 4 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(Same as EAS 337 1, REL 358R 1)\n\n\nReligion, therapy, healing, and spirituality are important concepts being studied across a wide range of disciplines. The view that therapy is scientific and rational, whereas religion is unscientific, irrational, and therefore primitive, has increasingly come under question. The rise of contemplative practices that may have had religious origins but have now taken on more secular forms also challenges any clear divide between religion and therapy. Culture often influences the needs, processes, and outcomes of healing; however, this does not necessarily mean that the experience of healing is utterly culture-bound, as evidenced by the spread of many therapies and therapeutic techniques across perceived cultural boundaries in the process of globalization. It is therefore important to critically reflect on the extent to which experiences of healing resemble or diverge from each other in varied cultural and religious contexts. Drawing on disciplines such as anthropology, sociology and psychology, students will learn about healing practices that emerge from various world and diverse spiritual/religious traditions. Class projects and discussions will consider themes such as: what makes for a healthy \"self\" or person; the role of religious practice or belief in healing; the globalization of different spiritually informed therapeutic methods; and the place of culture in therapeutic experience.",
    "course_description": "This class explores issues such as what makes for a healthy self or person, the role of religious practices and belief in healing, and the relationship of body and mind.",
    "prerequisites": null,
    "instructors": "Chikako Ozawa-de Silva - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Candler Library 123",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ANT_337_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 4141, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: C. Ozawa-de Silva, Status: Open",
    "date_accessed": "2024-03-30"
}