{
    "course_code": "ANT 265",
    "course_title": "Anthropology of Gender & Sexuality",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 9Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "Social Sciences(*)",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(Same as WGS 265 1)\nThis course provides cultural anthropological perspectives on gender and sexual diversity in a broad range of human societies, emphasizing ethnographic and theoretical works that deal with gender and sexuality as culturally constructed, historically variable, and politically contested categories bearing on practice and desire, rather than immutable biological \"givens.\" One of the primary objectives of the course is to develop an understanding of the enormous range of variation in human societies regarding gender roles and the constructions and entailments of femininity, masculinity, heteronormativity, gender variance, and same-sex erotics, particularly in relation to axes of difference and inequality associated with race, class, and religion. We begin with early anthropological debates (from the 1970s) on \"the status of women\", the prevalence of male dominance, and the ways scholars involved in these debates drew upon 19th- and early 20th-century theorists (e.g., Marx, Engels, Freud, and Levi-Strauss) to frame both their research questions and their contributions to these debates. We will continue with psychoanalytic approaches to cultures of masculinity and sexuality; queer feminist understandings of heteronormativity, same-sex sexuality and gender variance both, at home, and transnationally; and the contributions of Black feminist anthropology and intersectional perspectives on race, class, gender, and sexuality.",
    "course_description": "This course introduces students to the cross-cultural study of gender and sexuality, providing anthropological perspectives on femininity, masculinity, heteronormativity, gender variance, same sex relations, and various theories and methods that are relevant to the study of these phenomena.Students who have taken ANT_OX 265 may not repeat this course for credit.",
    "prerequisites": null,
    "instructors": "Michael Peletz - Primary Instructor",
    "schedule_location": "MW 4pm-5:15pm in Math & Science Center - N304",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ANT_265_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3278, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 4-5:15p, Instructor: M. Peletz, Status: Open",
    "date_accessed": "2024-03-30"
}