{
    "course_code": "ANT 377W",
    "course_title": "Fieldwork into Performance",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 0Waitlist Total: 1",
    "waitlist_total": ": 1",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Experience and Application with Cont.Comm(*)",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(Same as THEA 377W 1)\nThis is a participatory course where students learn and practice creative forms of research-based theater making. Every day will be dynamic, in action, observing/documenting/exploring the human condition and humans' relations to lived environments and the natural world. Think: multisensorial qualitative research-based seminar-lab-workshop-collaboratory! Students will learn how contemporary anthropologists are engaged in a range of theater making initiatives, forging new connections and engagements across techniques, traditions, and stakeholders. We will explore -- and practice -- the crafts of transitioning between ethnographic research, scriptwriting, acting, and staging. Our questions include: How does the ethnographer vividly convey the textures of life? How is analysis integrated with description? How are embodiment, affect, and multisensorial experiences documented ethnographically -- and conveyed through performance modalities? What are the ethical and moral responsibilities and implications of this kind of work? What are its political and liberatory potentialities? Students will develop skills through fieldwork exercises, movement techniques, theater games, and physical theater methods. Over the semester, students will produce ethnographic performances based on their own original research and will present their projects in a semester-end showcase. No prior acting or performance experience is required.",
    "course_description": "This course introduces students to ethnographic fieldwork methods and explores through both case study analysis and class-based ethnodrama processes how applied theater and performance (theater, dance, and spoken word) can be used\nto present anthropological insights and ethnographic material.",
    "prerequisites": null,
    "instructors": "Debra Vidali - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in Anthropology Building 107",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ANT_377W_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: This section is full 3308, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: D. Vidali, Status: Wait List",
    "date_accessed": "2023-10-30"
}