{
    "course_code": "ANT 285",
    "course_title": "Anthropology; Special Topics: Indigenous North America",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 4Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "This course is about listening to and engaging with a range of Indigenous perspectives from Turtle Island (aka North America). This semester we will focus on theatrical works and performance projects by Native scholars, artists, and wisdom holders. Performance genres and styles span from historical documentary to modern day comedy, to decolonial praxis, and everything in between. We will read and view work by: Joy Harjo, Muscogee (Creek) Nation citizen and 23rd Poet Laureate of the United States; Mary Kathryn Nagle, playwright, lawyer, and citizen of the Cherokee Nation of Oklahoma; The 1491s, \"a sketch comedy group based in the wooded ghettos of Minnesota and buffalo grass of Oklahoma\" (1491s website); NYC-based Spiderwoman Theater, whose \"work bridges the traditional cultural art forms of storytelling, dance, and music and the practice of contemporary Western theater\" (Spiderwoman Theater website); and Guillermo Gómez-Peña, \"performance artist, writer, radical pedagogue, Public Citizen & activist against all borders. Intellectual Coyote (Nanabush)...fighting colonialism since 1492\" (GGP artist website). We will be challenged to sharpen our listening and our awareness of the importance of relationality, voice, care, and ethics in this work. Major themes this semester include: sovereignty, dispossession, decolonization, human rights, political activism, social justice, creativity, respectful engagement, futurity, and connections to land.",
    "course_description": "Seminar or lecture series on topics of anthropological interest at an intermediate level. Maybe repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Debra Vidali - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in New Psyc Bldg 230 (36 Eagle Ro",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ANT_285_2_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 5079, Section #: 2, Type: LEC, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: D. Vidali, Status: Open",
    "date_accessed": "2024-03-30"
}