{
    "course_code": "ANT 386",
    "course_title": "Special Topics:Anthropology: Self & Otherness in Japanese",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 8 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(Same as EAS 385 1)\nComplete Topic:  Self & Otherness in Japanese Anime & Manga\nThe globalization of Japanese anime and manga over the past twenty years has been a remarkable phenomenon. Once seen as products of a Japanese sub-culture (otaku), anime and manga have gone mainstream with popularity within and outside of Japan. Through direct reading and viewing of a few of the more popular series, critical analysis of their content, and an ethnographic approach to the global phenomenon of anime fandom, this course explores the content and context of this distinctive form of storytelling. Particular attention will be paid to how series highlight and validate forms of diverse and marginalized identities; how it reflects issues of social and economic precarity in contemporary Japan; and how recreation facilitates re-creation of self, identity, and relations, as well as the formation of a moral life by exploring themes of comradeship (nakama), loneliness, belonging, and courage. We will also ask how anime/manga and the real-life communities it establishes can serve as tools for addressing issues of stigma, shame and marginalization, rather than the reinscription of violence not just as social commentary, but as transformative media.",
    "course_description": "May be repeated for credit when topic varies. Seminar or lecture series of topics of anthropological concern.",
    "prerequisites": null,
    "instructors": "Chikako Ozawa-de Silva - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in MODERN LANGUAGE_330",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ANT_386_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: This section is full 5259, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: C. Ozawa-de Silva, Status: Closed",
    "date_accessed": "2023-10-30"
}