{
    "course_code": "ANT 513",
    "course_title": "Gender & Sexual Diversity",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 3 / Seats Avail: 2",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(Same as WGS 513 1)\nThis course aims to provide advanced undergraduates and graduate students with anthropological perspectives on gender and sexual diversity both cross-culturally and historically. We begin with early anthropological debates (from the 1970s) on 'the status of women', the prevalence of male dominance, and the ways scholars involved in these debates drew upon 19th- and early 20th-century theorists (such as Marx, Engels, Freud, and Levi-Strauss) to frame both their research questions and their contributions to these debates. We continue with an introduction to the work of Foucault on discourses of sexuality and gender hegemonies. Subsequent sections of the course explore: gender, race, and colonialism; non-binary expressions of gender and sexuality; Black feminist anthropology, and intersectional perspectives on race, class, gender, sexuality, and stratified reproduction. The final sections of the course will examine some of the implications for gender and sexuality of the recent global turn toward punitiveness, authoritarianism, conservativism, and illiberalism, particularly in the U.S., Malaysia, and Turkey.",
    "course_description": null,
    "prerequisites": null,
    "instructors": "Michael Peletz - Primary Instructor",
    "schedule_location": "T 2:30pm-5:15pm in Emerson Chemistry Bldg. E103",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ANT_513_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3413, Section #: 1, Type: SEM, Campus: ATL, Meets: T 2:30-5:15p, Instructor: M. Peletz, Status: Open",
    "date_accessed": "2023-10-30"
}