{
    "course_code": "ITAL 375",
    "course_title": "Tops in Ital Lit in Trans",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 9Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Summer",
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "ITAL 375 sec 1 Sustainable Food Fair (in English) 1 credit Muratore     M-W 4:00- 5:15pm (15 seats)  CO-TEACH with Taylor, Spicer \nThis is a one-credit course that provides students an opportunity to lead and promote a deeper understanding of sustainable food and ecological justice among the members of the Emory Community at large. This course enables students to learn about and engage with like-minded individuals within the Atlanta food and beverage industry, local farmers and other specialists committed to sustainable food production practices. We will also examine the concepts of sustainability in relation to food production and the history and principles of the \"Slow Food Movement\", which was founded in 1989 in Italy to counteract fast food, and to promote local and organic food traditions.\n\n\nTasking the students with the execution of this project will allow them to further their leadership skills, demonstrate their commitment to sustainability and enable them to become agents of social change.  \nThe fair will be held on Tuesday, October 4. \nThe class meets on Mondays and Wednesday from 4:00 to 5:15pm. Last day of class is October 5th, 2021 \nThe Sustainable Food Fair is supported by the Emory Office of Sustainability Initiative.  \nThis class is suitable for First Year students.",
    "course_description": "Topics to be announced each semester. Course taught in English. May be repeated for credit when syllabus changes. Focus on developing critical analysis and reasoning skills.",
    "prerequisites": null,
    "instructors": "Simona Muratore - Primary Instructor",
    "schedule_location": "MW 4pm-5:15pm in New Psyc Bldg 290 (36 Eagle Ro",
    "course_resources": null,
    "sections": "Class Nbr: 3653, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 4-5:15p, Instructor: Muratore/Spicer, Status: Open",
    "date_accessed": "2024-03-30"
}