{
    "course_code": "ITAL 376",
    "course_title": "Topics in Italian Culture in Translation: The Cinema of Federico Fellini",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 9 / Seats Avail: 6Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Same as FILM 395R 1)\nITAL 376 Dreams and desire: the cinema of Federico Fellini\nA. Porcarelli and M. Bernstein (TTh 2:30-3:45 / W 7:30-10:30pm all in person)\nContent: This course provides an in-depth examination of the cinema of Federico Fellini, one of the most distinctive, celebrated and influential directors of all time. His vision and style were so innovative that a new adjective had to be coined: Felliniesque. In this course, we will tease out the meaning of this adjective by identifying, analyzing, and interpreting Fellini's artistic production in its aesthetic innovations and philosophical content while paying special attention to the Italian historical and cultural context of the post-war period. The course will be offered in conjunction with required in-class screenings, special events with guest speakers, and the exhibition \"Fellini and Fantasy\" hosted at the Carlos Museum which will display film scripts, photographs, program and press clippings, correspondence, and, most importantly, color drawings by Fellini representing characters or scenes eventually incorporated into his movies.",
    "course_description": "Topics to be announced each semester. Course is offered in English. Course content will vary, including topics of literature, history, culture, art history, political thought, current trends, and more. May be repeated for credit when syllabus changes.",
    "prerequisites": null,
    "instructors": "Matthew Bernstein - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Rich Building 103\nW 7:30pm-10:30pm in White Hall 208",
    "course_resources": null,
    "sections": "Class Nbr: 4057, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p; W 7:30-10:30p, Instructor: Porcarelli/Bernstein, Status: Open",
    "date_accessed": "2024-03-30"
}