{
    "course_code": "MLP_OX 101",
    "course_title": "Milestone Project",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Permission Required Prior to Enrollment)",
    "course_description": "A digital portfolio reflection project in which each student curates coursework, experiential learning opportunities, co-curricular experiences, and leadership endeavors and reflects upon the connections among and impact of this academic work.",
    "prerequisites": null,
    "instructors": "Tasha Dobbin-Bennett - Primary Instructor",
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 5925, Section #: 1, Type: SEM, Campus: OXF, Meets: Does Not Meet, Instructor: M. Adams, Status: Open\nClass Nbr: 5934, Section #: 10, Type: SEM, Campus: OXF, Meets: Does Not Meet, Instructor: M. Hempfling, Status: Open\nClass Nbr: This section is full 5935, Section #: 11, Type: SEM, Campus: OXF, Meets: Does Not Meet, Instructor: J. Hulgan, Status: Closed\nClass Nbr: 5936, Section #: 12, Type: SEM, Campus: OXF, Meets: Does Not Meet, Instructor: D. Leinweber, Status: Open\nClass Nbr: This section is full 5937, Section #: 13, Type: SEM, Campus: OXF, Meets: Does Not Meet, Instructor: S. Lewis, Status: Closed\nClass Nbr: This section is full 5939, Section #: 14, Type: SEM, Campus: OXF, Meets: Does Not Meet, Instructor: M. Martin, Status: Closed\nClass Nbr: This section is full 5940, Section #: 15, Type: SEM, Campus: OXF, Meets: Does Not Meet, Instructor: J. McGee, Status: Closed\nClass Nbr: 5941, Section #: 16, Type: SEM, Campus: OXF, Meets: Does Not Meet, Instructor: P. McLellan, Status: Open\nClass Nbr: This section is full 5942, Section #: 17, Type: SEM, Campus: OXF, Meets: Does Not Meet, Instructor: P. Oser, Status: Closed\nClass Nbr: 5943, Section #: 18, Type: SEM, Campus: OXF, Meets: Does Not Meet, Instructor: L. Parker, Status: Open\nClass Nbr: This section is full 5944, Section #: 19, Type: SEM, Campus: OXF, Meets: Does Not Meet, Instructor: F. Pohl, Status: Closed\nClass Nbr: This section is full 5926, Section #: 2, Type: SEM, Campus: OXF, Meets: Does Not Meet, Instructor: S. Ashmore, Status: Closed\nClass Nbr: This section is full 5945, Section #: 20, Type: SEM, Campus: OXF, Meets: Does Not Meet, Instructor: G. Reid, Status: Closed\nClass Nbr: This section is full 5946, Section #: 21, Type: SEM, Campus: OXF, Meets: Does Not Meet, Instructor: M. Saadein, Status: Closed\nClass Nbr: 5949, Section #: 22, Type: SEM, Campus: OXF, Meets: Does Not Meet, Instructor: A. Scharf, Status: Open\nClass Nbr: This section is full 5947, Section #: 23, Type: SEM, Campus: OXF, Meets: Does Not Meet, Instructor: D. Shannon, Status: Closed\nClass Nbr: This section is full 5948, Section #: 24, Type: SEM, Campus: OXF, Meets: Does Not Meet, Instructor: D. Walter, Status: Closed\nClass Nbr: This section is full 6060, Section #: 25, Type: SEM, Campus: OXF, Meets: Does Not Meet, Instructor: C. Loflin, Status: Closed\nClass Nbr: This section is full 6196, Section #: 26, Type: SEM, Campus: OXF, Meets: Does Not Meet, Instructor: L. Taliaferro-Smith, Status: Closed\nClass Nbr: This section is full 6197, Section #: 27, Type: SEM, Campus: OXF, Meets: Does Not Meet, Instructor: A. Ivey, Status: Closed\nClass Nbr: This section is full 5927, Section #: 3, Type: SEM, Campus: OXF, Meets: Does Not Meet, Instructor: H. Bayerle, Status: Closed\nClass Nbr: This section is full 5928, Section #: 4, Type: SEM, Campus: OXF, Meets: Does Not Meet, Instructor: F. Chen, Status: Closed\nClass Nbr: This section is full 5929, Section #: 5, Type: SEM, Campus: OXF, Meets: Does Not Meet, Instructor: M. Davis, Status: Closed\nClass Nbr: 5930, Section #: 6, Type: SEM, Campus: OXF, Meets: Does Not Meet, Instructor: A. DeNicola, Status: Open\nClass Nbr: This section is full 5931, Section #: 7, Type: SEM, Campus: OXF, Meets: Does Not Meet, Instructor: T. Dobbin-Bennett, Status: Closed\nClass Nbr: This section is full 5932, Section #: 8, Type: SEM, Campus: OXF, Meets: Does Not Meet, Instructor: A. El Younssi, Status: Closed\nClass Nbr: This section is full 5933, Section #: 9, Type: SEM, Campus: OXF, Meets: Does Not Meet, Instructor: B. Gunnels, Status: Closed",
    "date_accessed": "2024-03-30"
}