{
    "course_code": "BUS 799R",
    "course_title": "Dissertation",
    "credit_hours": "9",
    "seats": "Seats: Maximum Enrollment: 66 / Seats Avail: 66",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-05-17 through 2024-08-07",
    "class_notes": null,
    "course_description": "Students who have reached candidacy and are working on dissertation completion are enrolled in this course and supervised by their advisor as they complete their degree requirements.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 2185, Section #: 5101, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: O. Kocak, Status: Open\nClass Nbr: 2218, Section #: 5102, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: V. Todri, Status: Open\nClass Nbr: 2219, Section #: 5103, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. Schweidel, Status: Open\nClass Nbr: 2220, Section #: 5104, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: K. Kadous, Status: Open\nClass Nbr: 2221, Section #: 5105, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Busse, Status: Open\nClass Nbr: 2222, Section #: 5106, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Busse, Status: Open\nClass Nbr: 2223, Section #: 5107, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: K. Sedatole, Status: Open\nClass Nbr: 2224, Section #: 5108, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: C. Green, Status: Open\nClass Nbr: 2225, Section #: 5110, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. KC, Status: Open\nClass Nbr: 2226, Section #: 5111, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Swaminathan, Status: Open\nClass Nbr: 2227, Section #: 5112, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Williams, Status: Open\nClass Nbr: 2228, Section #: 5113, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: G. Negro, Status: Open\nClass Nbr: 2229, Section #: 5114, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Bharadwaj, Status: Open\nClass Nbr: 2230, Section #: 5115, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: I. Dichev, Status: Open\nClass Nbr: 2231, Section #: 5116, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: P. Adamopoulos, Status: Open\nClass Nbr: 2232, Section #: 5117, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. Lewis, Status: Open\nClass Nbr: 2233, Section #: 5118, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. McCarthy, Status: Open\nClass Nbr: 2234, Section #: 5119, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: W. Longhofer, Status: Open\nClass Nbr: 2235, Section #: 5120, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: T. Chordia, Status: Open\nClass Nbr: 2236, Section #: 5121, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: G. Maturana, Status: Open\nClass Nbr: 2237, Section #: 5122, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: R. Cui, Status: Open\nClass Nbr: 2238, Section #: 5123, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: N. Osadchiy, Status: Open\nClass Nbr: 2239, Section #: 5124, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Lewis, Status: Open\nClass Nbr: 2240, Section #: 5125, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: R. Chellappa, Status: Open",
    "date_accessed": "2024-03-29"
}