{
    "course_code": "LING 101",
    "course_title": "History of the American Languages",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 65 / Seats Avail: 14Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "This course presents a linguistic view of the history, society, and culture of the United States. It discusses the many languages and forms of language that have been used in this country over its history, including standard and nonstandard forms of English, different social and geographical dialects, African American English, creoles, Native American languages, and immigrant languages from Asia and Europe. Students examine the inherent diversity of these communicative systems both as a form of cultural enrichment and as the basis for socio-political conflict, and also investigate possible solutions to these problems through class discussion and debate. In addition, students study the universal phenomenon of language change and explore how it affects understanding of language behavior.\n\n\nLING 101 is required for the Linguistics, Psychology/Linguistics, Spanish/Linguistics, and the QSS major w/ Linguistics concentration. Linguistics minors must take LING 101 or 401W.",
    "course_description": "A historical examination of the various languages and dialects used in American society and the development of an American identity through language use and language policy.",
    "prerequisites": null,
    "instructors": "Robyn Clarke - Primary Instructor",
    "schedule_location": "MWF 1pm-1:50pm in White Hall 102",
    "course_resources": null,
    "sections": "Class Nbr: 1782, Section #: 1, Type: LEC, Campus: ATL, Meets: MWF 1-1:50p, Instructor: Tamasi/Clarke, Status: Open",
    "date_accessed": "2024-03-30"
}