{
    "course_code": "LING 328",
    "course_title": "Historical Ling & Lang Change",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 7",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "Prerequisite: Linguistics 201 (or equivalent) or instructor consent is required for this course.\n\n\nAll linguists agree that languages change, but they do not necessarily agree about how or why such change occurs. Linguists have also disagreed about whether linguistic systems should be studied primarily as synchronic or diachronic phenomena. This course will privilege the view that linguistic systems cannot be completely understood from a purely synchronic perspective. We will explore the ways in which such systems have arisen, particularly as understood by contemporary historical linguists and (historical) sociolinguists. We will begin by surveying types of change that can affect linguistic systems, using data from a range of languages to illustrate such changes. We will then explore how one can know about language states and changes of the past, reviewing and critiquing methods of linguistic reconstruction (e.g. the comparative method) and corpus analysis. We will be concerned not only with describing and classifying changes but also with explaining how and why changes occur when and where they do.\n\n\nParticulars: \nCourse grades will be based on a combination of participation, homework/preparation, and four take-home exams. Students interested in carrying out a research project in historical linguistics should speak with the instructor about enrolling concurrently or subsequently in Ling 497R.",
    "course_description": "Linguists agree that languages change; they do not agree about how such change occurs. This course views that linguistic systems cannot be completely understood from a purely synchronic perspective. The course surveys types of change, which can affect the linguistic systems, using data from various languages.",
    "prerequisites": null,
    "instructors": "Donald Tuten - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in Callaway Center C101",
    "course_resources": null,
    "sections": "Class Nbr: 1942, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: D. Tuten, Status: Open",
    "date_accessed": "2024-03-30"
}