{
    "course_code": "LING 385",
    "course_title": "Special Topics in Linguistics: Korean Loanword Phonology",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 2",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "(Same as KRN 386 1)\nNo prior Korean knowledge is required to take this course.\n\n\nThis course is designed to provide an overview of the crucial issues in loanword adaptation. As we live in a global world, various cultures are in contact and we inevitably exchange words. \"Loanwords\" are words loaned from one language to another. Unfamiliar sounds and sound sequences in the source language are adapted to conform to the sound pattern of the recipient language. The ways in which the recipient language adapts words from the source language provide a direct window for probing into the grammatical knowledge of speakers in ways that native data alone cannot. In this course, we will mostly focus on investigating the ways how English words are adapted into Korean. However, the analytical tools used in this class can be applied to any language.\n\n\nSelected articles and chapters from other sources will be uploaded on the Canvas webpage.",
    "course_description": "Investigation of a particular issue or topic in the study of language, linguistics, and communication. May be repeated when topic varies. Topics may include: the Romance languages; intercultural communication; words and the world; language and human nature.",
    "prerequisites": null,
    "instructors": "Yun Kim - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Callaway Center S105",
    "course_resources": null,
    "sections": "Class Nbr: 1940, Section #: 2, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: Kim/Oh, Status: Open",
    "date_accessed": "2024-03-30"
}