{
    "course_code": "LING 498R",
    "course_title": "Directed Reading: Language & Linguistics Sci-Fi",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "Prerequisite: LING-101 or LING-201 or equivalent. Students who took LING-190 in Spring 2021 aren't eligible to enroll for credit, but may be allowed to audit (email Dr. Pak about this).\n\n\nWhat will we do in this class? We'll discuss short works of fiction that deal with some of the big questions in linguistics: What makes language unique? What makes it not so unique? What does language tell us about the human mind? What is its role in the human experience? Sci-fi helps us imagine possibilities that might not otherwise occur to us, adding nuance to our thinking on these big questions.\n\n\nEach week there will be an assigned short story, novella, novel excerpt or film to read or watch ahead of time; see list below. Grading will be based on participation (including some discussion-leading), weekly informal reading responses/reports, and a ~5-page final essay.\n\n\nReadings will likely be selected from the following list. All will be made available for free online. \nEvery Boy Should Have a Man by Preston Allen\n`Funes the Memorious [Funes el memorioso]' by Jorge Luis Borges\n`Speech Sounds' by Octavia Butler\n`Story of Your Life' by Ted Chiang\n`The Truth of Fact, the Truth of Feeling' by Ted Chiang\n`The Easthound' by Nalo Hopkinson\n`Message in a Bottle' by Nalo Hopkinson\n`Solitude' by Ursula LeGuin\n`The Gods Will Not Be Chained' by Ken Liu\nEmbassytown (excerpts) by China Miéville\nFrankenstein (excerpts) by Mary Shelley\nArrival [film] directed by Denis Villeneuve",
    "course_description": "Students study, read, and write on a topic under the direction or supervision of a faculty\nmember. Permission of the department and a supervising faculty member is required.",
    "prerequisites": null,
    "instructors": "Marjorie Pak - Primary Instructor",
    "schedule_location": "F 11:30am-12:45pm in Modern Language 201",
    "course_resources": null,
    "sections": "Class Nbr: 4794, Section #: 1, Type: SUP, Campus: ATL, Meets: F 11:30a-12:45p, Instructor: M. Pak, Status: Open",
    "date_accessed": "2024-03-30"
}