{
    "course_code": "FIN 629",
    "course_title": "Fixed Income Portfolio Management",
    "credit_hours": "3",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": null,
    "course_description": "This course deals with the valuation and use of fixed income securities. It begins with the concept of the time-value-of-money and interest rates applied to bond pricing, and progresses through an examination of complex structured products and fixed income derivatives.Initially the focus is on the markets for fixed income securities, and the tools of pricing through the discounting of cash flows. Next, we study primary fixed income securities: Treasury bonds, corporate bonds, and municipal bonds. From there we move into the structured products of fixed income: mortgage-backed securities and CMOs. We conclude the course with coverage of fixed income derivatives, both over-the-counter (OTC) and exchange-traded (listed) products. Throughout, the course maintains a dual objective: to educate you in the principles of fixed income securities and structured finance, while at the same time giving you an understanding of how Wall Street is involved with the financial markets and the economy. Although at various points the material may appear to become advanced and mathematically technical, this course has been intentionally designed for students with no prior background in fixed income, and with a grasp of mathematics only at the level of high school algebra.",
    "prerequisites": "Varies by section",
    "instructors": "Nicholas Valerio III - Primary Instructor",
    "schedule_location": "T 6:30pm-9:30pm in Goizueta Foundation Ctr W330",
    "course_resources": null,
    "sections": "Class Nbr: 4743, Section #: 2150, Type: LEC, Campus: ATL, Meets: T 6:30-9:30p, Instructor: N. Valerio III, Status: Open\nClass Nbr: 4744, Section #: 3250, Type: LEC, Campus: ATL, Meets: T 6:30-9:30p, Instructor: N. Valerio III, Status: Open",
    "date_accessed": "2024-03-30"
}