{
    "course_code": "RUSS 271W",
    "course_title": "Imperial Russian Culture",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 13 / Seats Avail: 2",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Same as IDS 285 1)\n\n\nAtlas: What are causes of the tragic war in Ukraine?  Does the Russian state have imperial ambitions?   Is Vladimir Putin a new kind of tsar?  Russia is the largest country in the world; and to understand contemporary Russia, we must consider Russia's imperial and colonial legacies. Imperial Russia under the tsars was a powerful autocracy, but it also was a site of great diversity, daring intellectual inquiry, and vibrant creativity.  Imperial Russia produced leading contributors to global culture like Dostoevsky, Tolstoy, and Tchaikovsky, as well as political terrorists and revolutionaries like Lenin, Trotsky, and Stalin.  Straddling the continents of Europe and Asia, Tsarist Russia was torn between those who wanted Russia to follow Western models and those who wanted Russia to define her own Eurasian path.  Because such controversies and the issues they raised are relevant to views of Russia today, it is important to examine them.  To do this, our course will focus on the complex forum of Russian culture in the pivotal 19th and early 20th centuries. While our inter-art journey through Russian thought and experience will be grounded in works by leading writers of that time, we will explore them through their political, economic, and social contexts.   Themes addressed in the course include questions of violence and power, issues of personal and national identity, the nature of freedom and justice, and dilemmas of conflicting realities.",
    "course_description": "Prerequisite: none. Knowledge of Russian is not required. Survey of the masterpieces of the Golden Age of Russian literature presented against the background of historical, cultural, social, and political developments.",
    "prerequisites": null,
    "instructors": "Juliette Stapanian Apkarian - Primary Instructor",
    "schedule_location": "TTh 4pm-5:15pm in Callaway Center S105",
    "course_resources": null,
    "sections": "Class Nbr: 2123, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 4-5:15p, Instructor: J. Apkarian, Status: Open",
    "date_accessed": "2024-03-30"
}