{
    "course_code": "GER 375",
    "course_title": "Spec. Topics in German Studies: The Jewish Return to Germany",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 14 / Seats Avail: 9",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "Through the lenses of different genres such as reportage, memoir, essay, novella, and film, this class explores works by German-Jewish writers who had to leave Germany due to Nazism and yet decided to return to the country of the perpetrators, temporarily or for good. What feelings, thoughts, and perspectives on Germany and the German people did these writers experience or articulate upon coming back to a country that forced them into exile? How did they conceive their tasks as writers in a country that had burned books and extinguished the lives of their families and friends? How are their writings shaped by what had now become a divided country in a Cold War world? Why did writers choose to come back to either side of the border, to West or East Germany? \nSpecial attention is given to how gender relations are discussed in the texts and to writers who were exiled to the Americas. Requirements: Between sessions, students will engage in active, attentive reading that includes formulating questions, as well as writing two reflection papers, or one and produce one podcast episode on an author/text of their choosing.",
    "course_description": "Taught in English. An interdisciplinary course intended to provide in-depth study of formative elements, influences, and movements in German-speaking culture(s). May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Frank Voigt - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in MODERN LANGUAGE_330",
    "course_resources": null,
    "sections": "Class Nbr: 1035, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: F. Voigt, Status: Open",
    "date_accessed": "2024-03-30"
}