{
    "course_code": "MATH 597R",
    "course_title": "Directed Study",
    "credit_hours": "1-9",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": null,
    "course_description": null,
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 5877, Section #: 1, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. Borthwick, Status: Open\nClass Nbr: 6122, Section #: 17, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Nagy, Status: Open\nClass Nbr: 6095, Section #: 21, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: V. Powers, Status: Open\nClass Nbr: 6106, Section #: 24, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: V. Rodl, Status: Open\nClass Nbr: 6411, Section #: 25, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: L. Ruthotto, Status: Open\nClass Nbr: 6116, Section #: 28, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: S. Venapally, Status: Open\nClass Nbr: 5890, Section #: 29, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Veneziani, Status: Open\nClass Nbr: 6416, Section #: 33, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: S. Yang, Status: Open\nClass Nbr: 5706, Section #: 35, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. Zureick-Brown, Status: Open\nClass Nbr: 6097, Section #: 44, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Y. Xi, Status: Open\nClass Nbr: 6105, Section #: 48, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: T. Mayo, Status: Open\nClass Nbr: 6101, Section #: 51, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: B. Ullery, Status: Open\nClass Nbr: 6132, Section #: 54, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Y. Wang, Status: Open\nClass Nbr: 6123, Section #: 57, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: L. Yepremyan, Status: Open\nClass Nbr: 6092, Section #: 59, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Chung, Status: Open",
    "date_accessed": "2024-03-30"
}