{
    "course_code": "ELSP 530R",
    "course_title": "Laboratory in Professional Communication",
    "credit_hours": "2",
    "seats": "Seats: Maximum Enrollment: 8 / Seats Avail: 8",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "Blended/Hybrid",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "--Meets once per week. Day/time TBD --ELSP 530 offers support to international graduate students and professionals who are advanced-high or superior speakers of English (as determined by an ELSP assessment) or have completed advanced ELSP coursework in the past. In this course, participants will focus on improving the performance of complex, linguistic tasks (relevant to and determined by each individual participant). Participants will advance their communication skills through group and individual work, with feedback from the instructor and peers. Some areas of focus may include attending to pronunciation or grammatical errors that are patterned, using effective voice & body language when speaking, presenting arguments and hypotheses to evaluate problems and solutions, and employing organizational strategies for effective research story-telling and flow.\nContact: Heather Boldt, hboldt@emory.edu",
    "course_description": "This course will focus on the enhancement of spoken skills required in a professional and/or teaching environment. To continue to build professional speaking skills & learn beyond the classroom, students need individualized practice and feedback, and training in self-monitoring. In this course, students will monitor their individual communication patterns of themselves while conducting professional speaking tasks. These tasks will be followed by individual consultations with the ELSP instructor.",
    "prerequisites": null,
    "instructors": "Peggy Wagner - Primary Instructor",
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 6031, Section #: 1, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: P. Wagner, Status: Open",
    "date_accessed": "2024-03-30"
}