{
    "course_code": "ELSP 521",
    "course_title": "Laboratory in Graduate and Professional Writing",
    "credit_hours": "2",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "Blended/Hybrid",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "Course format =  once per week/mix of online and in-person  ---ELSP 521 is designed to support participants who need to make significant progress on a particular graduate or professional writing. The text can be a research article for publication, a second- or third-year paper, a research proposal, or any other text focused on research broadly defined.  Participants will design a writing plan, work on crafting strong arguments/claims, and practice writing clearly and cohesively. To familiarize themselves with writing in their disciplines, they will collect and analyze exemplars of their text type with respect to common rhetorical moves and language. Participants will also apply the strategies and skills covered in class to revise and edit drafts of their own text. Participants will be asked to submit a short description of the target text prior to enrollment to ensure its appropriateness. Contact Heather Boldt, hboldt@emory.edu",
    "course_description": "ELSP 521 an intensive analysis of the principles and revision practices of research article writing. Tools such as rhetorical, genre, and corpus analysis may be used to analyze published literature in their own field and then apply conclusions to an original piece of writing. Course content focuses on the central role of rhetorical organization, development of identifying an argument, a research gap, construction of logical arguments, data interpretation, as well other important concepts including reader-oriented writing, style, and tone.",
    "prerequisites": null,
    "instructors": "Grace Song - Primary Instructor",
    "schedule_location": "Th 2:30pm-4:10pm in North Decatur Bldg 101E",
    "course_resources": null,
    "sections": "Class Nbr: 6003, Section #: 1, Type: LEC, Campus: ATL, Meets: Th 2:30-4:10p, Instructor: G. Song, Status: Open",
    "date_accessed": "2024-03-30"
}