{
    "course_code": "MDP 514R",
    "course_title": "Applied Development Practice: Grant Writing and Management",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 17",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2023-03-01 through 2023-04-19",
    "class_notes": "Description: In this course, you will learn about identifying, pursuing, and maintaining funding opportunities. Students will learn what the grant writing process entails for major donors such as FCDO and USAID and what the donors are truly looking for in a proposal. Students will not only learn how to prepare the narrative of the proposal but how to develop a budget and other important annexes. Students will also learn about maintaining relationships with the donors and important aspects of managing the funds once they are received.\n\n\nThis class will start March 1st and end April 19th",
    "course_description": "Applied Development is a module-based course through which experts from leading global development agencies (CARE, Habitat, World Bank, etc.) present students with a practical approach to various components of global development. Topics of discussion may include microfinance, resettlement, housing, market inclusion, education, or health topics. Experts allow students increased access to development agencies, while offering a practical approach to lectures and in-class exercises. Many of these modules and activities will be tied to case-studies and hands-on learning activities.",
    "prerequisites": null,
    "instructors": "Rachel Lastinger - Primary Instructor",
    "schedule_location": "W 5:30pm-7:30pm in Candler Library 101",
    "course_resources": null,
    "sections": "Class Nbr: 6007, Section #: 1, Type: LEC, Campus: ATL, Meets: W 5:30-7:30p, Instructor: R. Lastinger, Status: Open",
    "date_accessed": "2024-03-30"
}