{
    "course_code": "DM 700",
    "course_title": "Becoming a Reflective Practitioner",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Closed",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": null,
    "course_description": "This course orients students to the action reflection model of the reflective practitioner, applying it specifically to the practice of ministry and practical theology. The research methods and dispositional habits that are learned in this foundational course will be practiced throughout the curriculum, especially in the final project. As the general introductory course, DM700 is taken by first-year students in both tracks, though students are enrolled by cohort. It has two major objectives: (1) to equip students with reflective and analytical capacities for understanding themselves as leaders, the congregations and organizations in which they serve, and their social contexts; and (2) the formation of a community of scholar-pastors and practical theologians. The course is made up of four major movements: engagement with contemporary scholarly discussions about what constitutes practical theology; theories and practices for understanding the self as a leader in the context of a community; models of congregational study and description; and methods of social analysis. Throughout the course, students will be introduced to diverse methods of theological reflection in relationship to the self, the faith community, and the social context.",
    "prerequisites": null,
    "instructors": "Elizabeth W Corrie - Primary Instructor",
    "schedule_location": "W 2pm-3:30pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 5123, Section #: 1, Type: SEM, Campus: ONLIN, Meets: W 2-3:30p, Instructor: E. Corrie, Status: Closed",
    "date_accessed": "2024-03-30"
}