{
    "course_code": "GRK 201",
    "course_title": "Intermediate Greek: Prose",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 16",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "Intercultural Communication(*)",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Content: This course offers students a review of grammar and an introduction to Greek prose through selections from the works associated with the second century AD sophist, Lucian of Samosata. We will begin with a text probably not by Lucian, but transmitted with his genuine works, The Ass, the story of a young man in pursuit of magic who accidentally turns himself into an ass.  If time permits at the end of the term, we will also read some of Lucian's A True Story (fabulous voyages and adventures beyond the then know world).\nText: \tLucian's The Ass: An Intermediate Greek Reader: Greek Text with Running Vocabulary and Commentary, ed. S. Nimis and E. Hayes (Faenum Publishing, 2012) ISBN: 978-0983222828\nRecommended:\nL. Pratt, The Essentials of Greek Grammar: A Reference for Intermediate Readers of Attic Greek (University of Oklahoma Press, 2011) ISBN: 978-0806141435\nLucian's A True Story: An Intermediate Greek Reader: Greek Text with Running Vocabulary and Commentary, ed. E. Hayes and S. Nimis (Faenum Publishing, 2011) ISBN: 978-0983222804\nCourse Mechanics\nOccasional quizzes, three (possibly four) tests, and a final examination. Classwork and homework are important components of the final grade.\nPlease note:  students with a conflict at the scheduled time should contact the instructor in the first week of classes to see if rescheduling is possible.",
    "course_description": "A review of grammar and introduction to Greek prose through selections from one or more authors such as Plato, Herodotus, Lysias, and Xenophon.",
    "prerequisites": null,
    "instructors": "Niall W Slater - Primary Instructor",
    "schedule_location": "MWF 1pm-1:50pm in Candler Library 222A",
    "course_resources": null,
    "sections": "Class Nbr: 2431, Section #: 1, Type: LEC, Campus: ATL, Meets: MWF 1-1:50p, Instructor: N. Slater, Status: Open",
    "date_accessed": "2024-03-30"
}