{
    "course_code": "ITAL 190",
    "course_title": "Freshmen Seminar: Italian",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First Year Seminar with Race & Ethnicity(*)",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "ITAL 190:  Social Justice in Italy and Beyond Through Memoir\nC. Ristaino / MW 11:30am-12:45pm\nContent:  A memoir, whether one essay or a book, concentrates on a moment that resonates, a dramatic incident, a time when something came into focus, a journey that changed the author. The most effective memoirs explore what the author can't stop thinking about yet cannot fully grasp. In writing, the memoirist both relates what happened and discovers new meaning. This course will introduce you to memoir through the lens of social justice movements in Italy and beyond. Class discussions and assignments will focus on the literary qualities of each text and explore topics specific to social justice, memoir and your own lives.\n\n\nThe class is designed to develop your critical faculties, to help you become better readers, writers, and activists, and to advance your ability to discuss, assess, and write about world events while you learn about Italian culture, world-wide social justice movements, and yourselves in the process. You will have the opportunity to write short pieces about yourselves as well as imitate the varied styles of our memoirists and explore poignant moments of your own lives. Key to our discussions will be your understanding of each memoir's form, structure, historical placement, cultural context, and content: how the story is told, the way it is told, and what it communicates about Social Justice issues, Italian or other cultures, and your own social justice efforts. Books: course reader",
    "course_description": "Seminar designed to engage freshmen in aspects of inquiry and research into areas of Italian culture through mutual exploration of subject matter. Primary mode of classroom discourse is dialogue and group projects.",
    "prerequisites": null,
    "instructors": "Christine Ristaino - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in Callaway Center S104",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 4036, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: C. Ristaino, Status: Closed",
    "date_accessed": "2024-03-30"
}