{
    "course_code": "AMST 348",
    "course_title": "Ethnic Experience in America",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 2Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "HSC w/Race & Ethnicity Req.",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Same as HIST 348 1, JS 371 1)\nThis course will explore the unfolding experience of assorted ethnic groups and the changing meanings of ethnicity in America from colonial times to the present. Moving between particular case studies--including consideration of Native Americans, African-Americans, Irish, Jews, Italians, Hispanics, and Asians, among others--and broad themes and topics--immigration and immigration laws, assimilation (and its limits), prejudice, racism, and economic dynamics--the course aims to provide a context for understanding both the variety and general structure of ethnicity and American history. Assignments will include screening of several movies (including the Jazz Singer and Lone Star) and readings from primary and secondary sources including: Anne Moody, Coming of Age in Mississippi Ronald Takaki, A Different Mirror: A History of Multicultural America Amy Tan, Joy Luck Club Oscar Handln, Boston's Immigrants Dee Brown, Bury My Heart at Wounded Knee Rodolfo Acuna, Occupied America: A History of Chicanos Assignment/Exam/Details: one take-home midterm examination; written analysis of a primary document; take-home final examination.",
    "course_description": "African Americans, Indians, Irish, and Jews in recent American history. Explores patterns of immigration and the limits of assimilation. Also treats anti-ethnic reactions such as racism and anti-Semitism.",
    "prerequisites": null,
    "instructors": "Jonathan Prude - Primary Instructor",
    "schedule_location": "TTh 5:30pm-6:45pm in Woodruff Library 773",
    "course_resources": null,
    "sections": "Class Nbr: 4163, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 5:30-6:45p, Instructor: J. Prude, Status: Open",
    "date_accessed": "2024-03-30"
}