{
    "course_code": "PSYC 331",
    "course_title": "Positive Psychology",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 30 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Content: Positive psychology, as defined by its proponents, is the scientific study of how humans prosper in the face of adversity.  Its goal is to identify and enhance human strengths and virtues. This course is designed to explore the concepts and research on positive psychology as well as techniques and exercises that enhance well-being. The course integrates related findings from the fields of personality psychology, life-span development, behavioral economics, biopsychology, and social psychology.  There is particular emphasis on the models and practices of well-being as a function of socio-cultural context (e.g., nation, region, gender, age, and social class). The format of the course is didactic, experiential, and interactive.\nText:  This course uses a set of original sources online in lieu of a textbook.\n\n\nParticulars: Classes consist of analysis and discussion of readings, occasional lectures/presentations, as well as evaluation of various well-being enhancement techniques.  Course requirements include weekly response papers, active participation in class exercises, and a project to be determined by the class in collaboration with the instructor.\n\n\nPrerequisite: Successful completion of statistics or research methods course in the social sciences.",
    "course_description": "This course explores concepts and research on positive psychology as well as techniques and exercises that enhance well being. Integrates findings from personality psychology, life-span development, cognitive psychology, behavioral economics, biological bases of behavior, and social psychology.",
    "prerequisites": "This course requires QTM100 equivalent transfer credit as a prerequisite",
    "instructors": "Nancy G. Bliwise - Primary Instructor",
    "schedule_location": "MW 4pm-5:15pm in New Psyc Bldg 230 (36 Eagle Ro",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_PSYC_331_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3632, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 4-5:15p, Instructor: N. Bliwise, Status: Open",
    "date_accessed": "2024-03-31"
}