{
    "course_code": "PSYC 420W",
    "course_title": "Psychobiology of Visual Perception",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 14 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "Continuing Communication(*)",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "The overall focus of this course is how the nervous system interacts with the mind in generating visual experience, while writing will be used to help you think deeply about the course topics.  The course combines discussion, some lecture background, writing exercises, brief presentations, and one or two lab sessions to examine vertebrate eyes and brain material. Readings include a selection of chapters and journal articles.  Grading is based on reading summaries, a short paper, in-class writings, blog entries, participation, and a final project.\nWe'll cover three topics within the psychology and neuroscience of vision, as follows:\nI. Comparative perception and evolution of color vision. We'll explore individual and species differences in color vision, and how they are reflected in perception, behavior, and the structure and function of eyes and visual systems.\nII. The neural basis of visual experience and visual awareness.  We'll ask how we can study the neural basis of visual awareness in humans, how it can be modeled in animals, and what brain mechanisms appear to reflect specific aspects of visual consciousness.\nIII. The experience of visual beauty. We'll explore mechanisms of visual aesthetics as applied to facial attractiveness, scientific illustration, and visual imagery of food.\nPrerequisites: Exposure to psychobiology at an intro college level, plus any other course in psychology, NBB, biology, anthropology, or philosophy.",
    "course_description": "Theories and research about how the brain interacts with mind in generating perceptions.",
    "prerequisites": null,
    "instructors": "Hillary R Rodman - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in New Psyc Bldg 393 (36 Eagle Ro",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_PSYC_420W_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: This section is full 3646, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: H. Rodman, Status: Closed",
    "date_accessed": "2024-03-31"
}