{
    "course_code": "HISP 510R",
    "course_title": "Understanding Hispanic Studies: Theories and Methods: Potency of Horror",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 10",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Complete Topic - Potency of Horror: Sensationalism as Archive)\n(Horror is a potent force: it attracts and disturbs, distresses and exhilarates in one and the same movement. Genres across the spectrum of culture - from Gothic novels to comics to horror films to TV series - have used the potency of horror to great effect, but no genre of communication has unleashed it with the impact and reach of sensationalist journalism. But what exactly is the potency of horror? How is it channeled in crime tabloids and the crime section of newspapers, the most emblematic expressions of sensationalist journalism? How has the potency of horror been re-appropriated (in art and activism, for instance) for the purposes of resisting the social systems where violence is conceived?)\n\n\nThis course requires department consent. Please contact Liz Mills (emills9@emory.edu) to request permission.",
    "course_description": "Defining what is signified by the term 'Hispanism' presents an epistemological and ideological challenge to scholars. This seminar will introduce students to Hispanism's key disciplinary debates and controversies. Students will be equipped to develop and articulate their own positioning in these debates while cultivating their critical-analytical skills through a range of written and oral exercises.",
    "prerequisites": null,
    "instructors": "Sergio Delgado Moya - Primary Instructor",
    "schedule_location": "F 10am-12:45pm in Callaway Center S104",
    "course_resources": null,
    "sections": "Class Nbr: 3659, Section #: 1, Type: LEC, Campus: ATL, Meets: F 10a-12:45p, Instructor: S. Delgado Moya, Status: Open",
    "date_accessed": "2024-03-30"
}