{
    "course_code": "EAS 450W",
    "course_title": "Seminar in East Asian Studies",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 5",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Continuing Writing Requirement",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "Confucian Traditions in East Asia:\nThis course offers a chronological overview of one of the most foundational and powerful philosophical and religious systems in East Asian civilizations, known as Confucianism, from its beginning to the late imperial period. Reading and analyzing numerous primary and secondary writings selected for the major topic of the tradition every week, students will discuss how Confucians have initiated and developed their diverse and complex views on self, family, community, state, and cosmos over time. For the most part, students will focus on the tradition in China, but near the end of the semester, they will also explore how this Sinic philosophico-religious tradition was adapted and transformed to different socio-political and cultural contexts beyond its origin, namely, Korea, Japan, and Vietnam. Ultimately, despite these regional variations, students will understand that the tradition laid the critical foundation for the perception and interpretation of self and the world in all East Asians' minds.",
    "course_description": "Required for East Asian Studies majors. An advanced seminar probing themes in the study of East Asia. Topics may include issues in comparative colonialism, the volatility of shared meanings of identity as well as reconstructions of national subjects in literature, popular culture, and the arts.",
    "prerequisites": null,
    "instructors": "Tae Hyun Kim - Primary Instructor",
    "schedule_location": "MW 4pm-5:15pm in Modern Language 201",
    "course_resources": null,
    "sections": "Class Nbr: 1554, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 4-5:15p, Instructor: T. Kim, Status: Open",
    "date_accessed": "2024-03-30"
}