{
    "course_code": "AAS 385",
    "course_title": "Topics in Afr American Studies: African American Language",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "African American Language (AAL) is by far the most researched, the most publicly recognized, and most controversial language variety in the United States. AAL has long been a central object of study in North American sociolinguistics, where researchers have investigated its structure, its origins, and its current trajectories of change relative to Mainstream American English, and have simultaneously sought to combat misunderstandings about AAL (and all language differences) held by the public and the press. \nThis course will be broken into four major sections: \n1.) Present-Day Features of AAE, with a focus on its vocabulary (lexicon), pronunciation features (phonetics and phonology) and grammar (morphology and syntax); \n2.) The History of AAL and its ongoing trajectory of change, focusing on earlier examples of AAL, its possible origins and whether or not AAL is diverging from Mainstream American English (MAE) and other varieties of English; \n3.) AAL as a Living Art will discuss AAL as it is employed as an expression of art by writers, musicians, as well as its use in African American speech events, and avenues for outreach; \n4.) AAL, Education and Society will examine issues related to AAL and education, the justice system, linguistic profiling and discrimination in other areas of society such as housing and employment.\n\n\nAll course readings will be posted on Canvas. We will draw much of our general discussion from chapters in the Oxford Handbook of African American Language (OHAAL, ed. Lanehart 2015), with supplemental readings of primary scholarship to enrich our discussions.\n\n\n(Same as LING 340 1 & ANT 340 1)",
    "course_description": "This course explores one of a wide range of topics pertaining to the African American experience in the fields of human and civil rights, social and literary texts, and the social sciences.",
    "prerequisites": null,
    "instructors": "Jason McLarty McLarty - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Anthropology Building 303",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3978, Section #: 8, Type: LEC, Campus: ATL, Meets: TTh 10-11:15a, Instructor: J. McLarty, Status: Closed",
    "date_accessed": "2024-03-30"
}