{
    "course_code": "GER 375",
    "course_title": "Spec. Topics in German Studies: Crisis & Creativity: J.Intel.",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 9",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as JS 380 1, PHIL 385 1)  Topic: Crisis and Creativity: Jewish Intellectuals in Weimar, Germany.  \nThe current political and economic crisis exacerbated by the pandemic has been compared with the influenza pandemic at the end of World War One as well as the economic collapse and crisis of 1929 in the US and around the world. This course investigates how the 1929 political and economic crisis was perceived by representatives of early critical theory and intellectuals of Jewish origin during Germany's first democracy, the Weimar Republic. How did the crisis influence the thinking of such intellectuals as Siegfried Kracauer, Walter Benjamin, and Max Horkheimer? What new concepts did it inspire and in what ways did it allow for new configurations in philosophy, literary and film criticism? We will examine how the relationship of these three to Judaism is changing and, if so, what role concepts from Jewish traditions play in their perception of the crisis. Course requirements include three response papers of five pages each.",
    "course_description": "Taught in English. An interdisciplinary course intended to provide in-depth study of formative elements, influences, and movements in German-speaking culture(s). May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Frank Voigt - Primary Instructor",
    "schedule_location": "TTh 4:20pm-5:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 2776, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 4:20-5:35p, Instructor: F. Voigt, Status: Open",
    "date_accessed": "2024-03-30"
}