{
    "course_code": "GER 470",
    "course_title": "Topics in German Culture and Civilization: Multicultural Germany 1989-Tdy",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 7",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "In this course, we will explore the influence of immigration on German culture since the fall of the Berlin Wall in 1989 to today by analyzing a variety of materials created by people of immigrant experience or heritage, including literary texts, films, music videos, and journalistic sources. Key themes will include: real and imagined border crossings; transnational and transcultural exchange; multilingual expression; coming to terms with the German past and present with regard to Germany's treatment of minority groups; intersectional experiences of (non-)belonging; complex identity formation; and resilience and activism against the backdrop of a hegemonic society that is often hostile to the contributions of people of color and immigrants or their descendants. Developing an understanding of political and historical conditions will provide crucial context for our examination of cultural objects. We will read works by some of the most celebrated contemporary German-language writers on the global stage, including Yoko Tawada, Herta Müller, and Saša Staniši'. In addition to brief presentations, students will write one close reading essay (3-4 pages) and will be guided through the process of writing one longer research essay (8-10 pages). All course readings and assignments will be in German.",
    "course_description": "An interdisciplinary course intended to provide a comprehensive, historically oriented overview of the formative elements, influences, and movements of German culture and civilization. Taught in German.",
    "prerequisites": null,
    "instructors": "Didem Uca - Primary Instructor",
    "schedule_location": "MW 11:20am-12:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 2775, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 11:20a-12:35p, Instructor: D. Uca, Status: Open",
    "date_accessed": "2024-03-30"
}