{
    "course_code": "HIST 270",
    "course_title": "Survey of Jewish History",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 19",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Social Sciences(*)",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Same as JS 270-1 and MESAS 275-1\n\n\nThis course is a survey of Jewish history from antiquity to the present. It presumes no prior knowledge of Jewish history, religion or culture. We will examine how Jews have defined themselves socially and politically in a number of historical and geographical settings, how Jewish theology and religious practice have been shaped and transformed, and how Jews have interacted with and responded to the societies in which they have lived. A central question during the ancient period will be, what was \"Judaism\" and how did it emerge out of the diverse religious landscape of antiquity? The medieval period will focus on the interface between Jewish communities and the states or empires in which they lived. Particular attention will be paid to the interactions between Jews, Christians, and Muslim peoples and cultures. In the modern period, we will analyze the processes by which governments, politicians and some segments of Jews attempted to incorporate the Jews and Judaism into European society and the various problems and reactions engendered by the quest for Jewish emancipation and social integration.",
    "course_description": "This course offers a general overview of the history of Jews and Judaism, beginning with the Biblical period and ending with modern times.",
    "prerequisites": null,
    "instructors": "Craig Perry - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in White Hall 111",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_HIST_270_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 4414, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: C. Perry, Status: Open",
    "date_accessed": "2023-10-31"
}