{
    "course_code": "HIST 285",
    "course_title": "Topics: Historical Analysis: Leisure Time: An American Hist",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 40 / Seats Avail: 39Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(Same as AMST 285 1)\n(In this course, we will examine the development of commercialized forms of leisure in American history-experiences, performances, and texts that can be had for a price. How have Americans spent the time when they are not working or sleeping? And how have their pursuits during their leisure time reflected-and even shaped-their values and identities? Plays, musical performances, circuses, movies, horse racing, board games, sporting events, bowling leagues, novels, radio and television programs, museums, amusement parks, and social media-these experiences are much more than distractions or breaks from the business of living. From attending theatrical melodramas in the Nineteenth Century to donning virtual reality goggles in the Twenty First Century metaverse, how Americans spend their leisure time has shaped the operation of power in the United States in ways comparably important to their votes for political office or their overt resistance to injustice.)",
    "course_description": "An introductory course on the nature and methods of history. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Daniel LaChance - Primary Instructor",
    "schedule_location": "TTh 4pm-5:15pm in White Hall 103",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_HIST_285_4_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3698, Section #: 4, Type: LEC, Campus: ATL, Meets: TTh 4-5:15p, Instructor: LaChance/Prude, Status: Open",
    "date_accessed": "2023-10-31"
}