{
    "course_code": "HIST 323",
    "course_title": "Reformation Europe and Beyond",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 35 / Seats Avail: 31Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Why were sixteenth-century Europeans willing to kill and be killed in the name of religion? How did these religious upheavals shape the spread of Christianity to Asia and the Americas? This course examines the causes and consequences of the tumult known as the Reformation but tells the story from a more global perspective. Although we will survey major theological differences, we will focus on how religious change impacted society, politics, and culture across the globe between 1500 and 1650. Topics include the complex interplay between religion and politics; censorship, the Inquisition, and Protestant forms of social discipline; ghettoization, forced conversion, and the making of religious refugees; and European attitudes towards Indigenous peoples. Readings include primary sources in translation; discussions and film clips will be woven into lectures. Grading: class participation and professionalism; take-home midterm exam; short quizzes; final paper in lieu of a final examination.",
    "course_description": "Examines the causes and consequences of the religious tumult known as the Reformation from a global perspective. Surveys the major theological differences that emerged between 1500 and 1650. Analyzes the impact on society, politics, and culture.",
    "prerequisites": null,
    "instructors": "Sharon Strocchia - Primary Instructor",
    "schedule_location": "TTh 4pm-5:15pm in Rich Building 104",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_HIST_323_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3703, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 4-5:15p, Instructor: S. Strocchia, Status: Open",
    "date_accessed": "2023-10-31"
}