{
    "course_code": "HIST 296",
    "course_title": "Special Topics: Cross-listed: Mem of Jewish Eastern Europe",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 18",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Topic Title: Memories of Jewish Eastern Europe\nSame as JS 271-2\n\n\nBefore World War II, Eastern Europe contained the largest concentration of Jews in the world and was the place of origin of most Jewish immigrants to the United States and other global destinations. During the Holocaust, however, this once great community was reduced to only a small remnant. Nonetheless, the region has remained a major site for Jewish memory and an anchor for Jewish identity around the world. Perceived as a place of Jewish \"authenticity\" - both rich in its culture and violent in its persecution - it has served as a foil for those struggling to understand themselves in the context of contemporary acculturation, assimilation, and cultural fluidity. Meanwhile, the Jewish past in Eastern Europe has also served as a touchstone for non-Jewish Eastern Europeans attempting to understand what it means to live in societies with a history of genocide and repression. By examining a host of cultural materials, this course will explore the central role of Eastern Europe in Jewish memory and identity from the nineteenth century to the present, as well as the way in which memories of Jews continue to play a major role in the Eastern European spaces they once inhabited. Assignments will include occasional short homework questions to help students process and respond the readings, a midterm exam, and an end-of-term project (which could be, but is not limited to, a paper) that will allow students to explore an area of interest in greater depth.\n\n\nStudents are encouraged (but not required) to participate in the related 1-credit study-abroad trip, \"Jews of Poland: History and Memory\" , which will take place in Krakow and Warsaw, Poland, from May 9-31 and is sponsored by the Tam Institute for Jewish Studies and Emory's Office of International and Summer Programs.",
    "course_description": "Selected topics in history for students in non-history originating (cross-listed) courses. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Eric L Goldstein - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in Math & Science Center - N302",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_HIST_296_2_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 4420, Section #: 2, Type: LEC, Campus: ATL, Meets: TTh 1-2:15p, Instructor: E. Goldstein, Status: Open",
    "date_accessed": "2023-10-31"
}