{
    "course_code": "HIST 285W",
    "course_title": "Topics: Historical Analysis: Jews of the U.S. South",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 3Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "This course explores the history and culture of Jews in the U.S. South from the 18th century to the present. We will examine the impact of region on ethnic and religious identity, asking how the particular social, political, economic, and racial/ethnic setting of the South created a context for Jewish life different than that in other parts of the country, particularly in the urban North and Midwest where most American Jews concentrated. An optional visit to some relevant local historical sites will be offered, schedules permitting. Assignments include short homework questions about the readings, one short (5 page) essay where students reflect more significantly on one week's readings, and a longer final research paper (approx. 10 pages) in which students can explore a topic of interest. Texts will include Ferris and Greenberg, Jewish Roots in Southern Soil, and Alfred Uhry, The Last Night of Ballyhoo, as well as several online readings.\n\n\n(Same as JS 280W 1)",
    "course_description": "An introductory course on the nature and methods of history. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Eric L Goldstein - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Bowden Hall 323",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_HIST_285W_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3702, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 10-11:15a, Instructor: E. Goldstein, Status: Open",
    "date_accessed": "2024-03-30"
}