{
    "course_code": "HIST 353",
    "course_title": "Sports in U.S. History",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "Race and Ethnicity(*)",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(Same as AAS 353 1)\n\n\nSports history is an invaluable way to bring American history to life. And not just for sports fans. From the late nineteenth century to the present, sports reveal important aspects of American history and \nculture. \"In a huge and diverse nation experiencing waves of immigration, struggling with bitter racial divisions, and undergoing a pace of economic change unmatched by any society in the world\", historian Mark Naison penned, \"sports have provided many Americans with a visceral connection to America's lived traditions and cultural values while providing them with a much-needed escape from the \nhardships of their daily lives.\" This course will examine the history of modern sports in the United States with a particular focus on \nrace, gender, and politics. Through lectures, readings, and varying multimedia platforms, we will explore how sports have shaped and reshaped the social, cultural, economic, and political makeup of American society since the nineteenth century.",
    "course_description": "This course explores the complex history of sports in the United States since the late nineteenth century. With a particular emphasis on race, gender, and politics, we examine pivotal moments, athletes, and social justice issues in sports that have impacted our nation¿s history.",
    "prerequisites": null,
    "instructors": "Carl Suddler - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Tarbutton Hall 106",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_HIST_353_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 4619, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: C. Suddler, Status: Wait List",
    "date_accessed": "2024-03-30"
}