{
    "course_code": "HIST 373",
    "course_title": "History of Modern China",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(Same as EAS 379 1)\n\n\nAround 1500, in the middle of the Ming Dynasty, China was the largest, richest, and most powerful country in the world. Its technology was cutting edge, its cities prosperous, and its culture glorious. Four centuries later, it was being torn apart by foreign invaders as its citizens argued ineffectually. What had gone wrong? What could be done to revive and restore China? This course examines traditional China多s collision with the forces of modernity 多 global trade, rapid population growth, the scientific and industrial revolutions, and modern imperialism. Today, after a century of revolution, China appears at last to have met the challenges of modernity, but what unfinished projects remain?\nRequired Textbooks:\nTextbooks haven多t yet been decided but may include: \nJonathan Spence, The Search for Modern China, W.W. Norton & Company, 2012 (ISBN: 978-0-393-93451-9).\nJonathan Spence, Emperor of China: Self Portrait of K多ang-hsi, Vintage Books, 1988 (ISBN: 978-0679720744).\nShen Fu, Six Records of a Floating Life, Viking Press, 1983 (ISBN: 978-0140444292).\nJonathan Spence, God's Chinese Son: The Taiping Heavenly Kingdom of Hong Xiuquan, W.W. Norton & Company, 1997 (ISBN: 978-0393315561).\nJung Chang, Wild Swans: Three Daughters of China, Touchstone, 2003 (ISBN: 978-0743246989).\nGrading:\nFinal grades will be determined as follows: \nParticipation\t25% \nNews Presentation\t\t25%\nMidterm Examination\t\t25%\nFinal Examination\t25%",
    "course_description": "China since the Opium War. Nineteenth-century dynastic decline, Western impact, and modernization efforts; Republican, Nationalist, and Communist revolutions of the twentieth century; and the development of the People's Republic of China since 1949.",
    "prerequisites": null,
    "instructors": "Tonio Andrade - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Tarbutton Hall 106",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_HIST_373_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: This section is full 3708, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: T. Andrade, Status: Open",
    "date_accessed": "2023-10-31"
}