{
    "course_code": "HIST 361",
    "course_title": "Brazil: Country of the Future",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 35 / Seats Avail: 6Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "HSC w/Race & Ethnicity Req.",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Brazil spent much of the past century hailed as the country of the future. Why? Which future did the country aspire to embody? And why has it seemed like a future that will never arrive? This course seeks answers, exploring the history of Brazil since its colonization. We will focus on questions of race and identity, the image of the country in the wider world, and the methods we use to understand its past. We will highlight Brazil's regional heterogeneity, transformations of its environment, and the emergence and shifts of its cultures broadly conceived. Brazil stands in interesting relation to the United States, as both are large, economically important western hemisphere countries with histories of slavery and rapid growth. Contrasts between the two countries have informed dialogues between North Americans and Brazilians and have influenced the ways Brazilians perceive their own identities.",
    "course_description": "Covering the history of Brazil since Portuguese colonization, this course addresses conquest, colonial structures and legacies, questions of race and identity, political institutions, and migration. Themes include slavery, cultural diversity, economic development, and Brazil's role in the world.",
    "prerequisites": null,
    "instructors": "Thomas Rogers - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in Math & Science Center - N306",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_HIST_361_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3707, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: Rogers/Digiacomo Cerveira Coutinho, Status: Open",
    "date_accessed": "2024-03-30"
}