{
    "course_code": "HIST 488RW",
    "course_title": "Jr./Sr. Colloquium: U.S.: The International City:Atlanta",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 8 / Seats Avail: 5Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Continuing Communication(*)",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(Same as AMST 489W 1)\n(Complete Topic -  Making the International City: Atlanta)\n\n\nThis course centers the development of the city of Atlanta and surrounding metropolitan region from the Reconstruction Era \"New South\" through 21st century iterations of a diverse, global \"Nuevo South\". Course themes revolve heavily around questions of race, ethnicity, class, and migration. To this end, course materials and discussions will especially center the perspectives and voices of BIPOC authors and community members to allow us to narrate the history of the internationalization of Atlanta from the bottom-up.  \n \nAs an advanced history colloquium, students are required to write original research papers engaging and analyzing primary source materials related to historical and/or contemporary efforts to develop Atlanta in an international city spatially, politically, economically, and/or culturally. At least two class sessions, which will take the form of field trips, will be co-taught with Associate Professor of Art History Christina Crawford, whose advanced Art History seminar investigates Atlanta's built environment. To offer further synergy between these LINC courses, students will be trained on best practices for adapting their research papers into accessible, public-facing pieces to be shared digitally (optional).",
    "course_description": "All history majors except those who complete the Honors Program must take two colloquia (HIST 487, 488 or 489). Each colloquium treats a special theme by reading, discussion, and writing of papers. Enrollment in each is limited to twelve; non-majors are welcome within space limitations.",
    "prerequisites": null,
    "instructors": "Iliana Rodriguez - Primary Instructor",
    "schedule_location": "T 1pm-3:45pm in Atwood Chemistry Bldg. 280",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_HIST_488RW_3_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3742, Section #: 3, Type: SEM, Campus: ATL, Meets: T 1-3:45p, Instructor: I. Rodriguez, Status: Open",
    "date_accessed": "2024-03-30"
}