{
    "course_code": "HIST 799R",
    "course_title": "Advanced Research",
    "credit_hours": "1-9",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Varies by section",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": null,
    "course_description": null,
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: This section is full 5555, Section #: 1, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: T. Andrade, Status: Closed\nClass Nbr: This section is full 5645, Section #: 10, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: C. Crais, Status: Closed\nClass Nbr: This section is full 5646, Section #: 11, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Crespino/Tullos, Status: Closed\nClass Nbr: This section is full 6081, Section #: 12, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Lesser/Rogers, Status: Closed\nClass Nbr: This section is full 5637, Section #: 2, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Eckert, Status: Closed\nClass Nbr: This section is full 5638, Section #: 3, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Evans-Grubbs, Status: Closed\nClass Nbr: This section is full 5639, Section #: 4, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Evans-Grubbs/Master, Status: Closed\nClass Nbr: This section is full 5640, Section #: 5, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. LaChance, Status: Closed\nClass Nbr: This section is full 5641, Section #: 6, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Lowery, Status: Closed\nClass Nbr: This section is full 5642, Section #: 7, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Miller/Sasson, Status: Closed\nClass Nbr: This section is full 5643, Section #: 8, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Tullos/Ward, Status: Closed\nClass Nbr: 5644, Section #: 9, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Y. Yannakakis, Status: Open",
    "date_accessed": "2024-03-30"
}