{
    "course_code": "CS 599R",
    "course_title": "Research",
    "credit_hours": "1-9",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Varies by section",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Varies by section",
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": null,
    "course_description": "Thesis Research (Pre-Candidacy)",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 5728, Section #: 1, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. Arnold, Status: Open\nClass Nbr: 5742, Section #: 10, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Z. Qin, Status: Open\nClass Nbr: 5743, Section #: 11, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Reyna, Status: Open\nClass Nbr: 5744, Section #: 12, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: L. Ruthotto, Status: Open\nClass Nbr: 5746, Section #: 13, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: R. Sameni, Status: Open\nClass Nbr: 5748, Section #: 14, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Sarker, Status: Open\nClass Nbr: 5749, Section #: 15, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: V. Sunderam, Status: Open\nClass Nbr: 5750, Section #: 16, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: Y. Vigfusson, Status: Open\nClass Nbr: 5752, Section #: 17, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: E. Wall, Status: Open\nClass Nbr: 5754, Section #: 18, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: H. Wu, Status: Open\nClass Nbr: 5756, Section #: 19, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: L. Xiong, Status: Open\nClass Nbr: 5730, Section #: 2, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: E. Agichtein, Status: Open\nClass Nbr: 5758, Section #: 20, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: C. Yang, Status: Open\nClass Nbr: 5759, Section #: 21, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: L. Zhao, Status: Open\nClass Nbr: 6078, Section #: 22, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Wildani, Status: Open\nClass Nbr: 6103, Section #: 23, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: X. Yang, Status: Open\nClass Nbr: This section is full 6619, Section #: 24, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Brody, Status: Closed\nClass Nbr: This section is full 5731, Section #: 3, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Bhasin, Status: Closed\nClass Nbr: 5734, Section #: 4, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Choi, Status: Open\nClass Nbr: 5736, Section #: 5, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: G. Clifford, Status: Open\nClass Nbr: 5737, Section #: 6, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Ho, Status: Open\nClass Nbr: 5738, Section #: 7, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: R. Kamaleswaran, Status: Open\nClass Nbr: 5740, Section #: 8, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: B. Mahmoudi, Status: Open\nClass Nbr: 5741, Section #: 9, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. McKay, Status: Open",
    "date_accessed": "2024-03-30"
}