{
    "course_code": "CS 598R",
    "course_title": "Rotation Project",
    "credit_hours": "3",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Varies by section",
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": null,
    "course_description": "Computer Science and Informatics PhD students are required to complete two rotation projects prior to their qualifying exams and dissertation research. Projects often involve interdisciplinary work, and can be co-supervised by a Math/CS faculty and an external faculty member or researcher (e.g., Schools of Medicine and Public Health, the CDC). Students are required to submit a project proposal and a final report.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 5787, Section #: 1, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. Arnold, Status: Open\nClass Nbr: 6073, Section #: 2, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: R. Kamaleswaran, Status: Open\nClass Nbr: 6124, Section #: 3, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: E. Wall, Status: Open\nClass Nbr: 6125, Section #: 4, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: L. Xiong, Status: Open\nClass Nbr: 6130, Section #: 5, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: L. Zhao, Status: Open\nClass Nbr: 6139, Section #: 6, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: G. Clifford, Status: Open\nClass Nbr: 6142, Section #: 7, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Bhasin, Status: Open\nClass Nbr: 6419, Section #: 8, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Reyna, Status: Open\nClass Nbr: 6538, Section #: 9, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: L. Klein, Status: Open",
    "date_accessed": "2024-03-30"
}