{
    "course_code": "EHS 798R",
    "course_title": "Pre-candidacy Research",
    "credit_hours": "1-9",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 8",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "EHS doctoral students engage in research prior to candidacy. The type of research training that students complete during these research hours vary widely. Most research activities that contribute to students' overall training and allow them to make progress in the program will qualify toward these credits. Examples of typical student research activities include: conducting primary data collection, performing an analysis, writing a manuscript, studying for the qualifying exam, or preparing a grant proposal. EHS PhD students Only",
    "course_description": "EHS doctoral students engage in research prior to candidacy. The type of research training that students complete during these research hours vary widely. Most research activities that contribute to students' overall training and allow them to make progress in the program will qualify toward these credits. Examples of typical student research activities include: conducting primary data collection, performing an analysis, writing a manuscript, studying for the qualifying exam, or preparing a grant proposal.",
    "prerequisites": null,
    "instructors": "William Michael Caudle - Primary Instructor",
    "schedule_location": null,
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_EHS_798R_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 1274, Section #: 1, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: W. Caudle, Status: Open",
    "date_accessed": "2024-03-30"
}