{
    "course_code": "ENG 389W",
    "course_title": "Special Topics:Literature: English Short Fiction",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 7",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2022-05-10 through 2022-05-27",
    "class_notes": "Course Title: When Less is More: English Short Fiction, Modern to Contemporary\n\n\nIn this Maymester course, we will ask: what happens when we look at short stories not as workshops for lengthier accomplishments, but rather as artistic achievements that can only be realized in this economical and exciting form? We will read a few stories by a new writer every day, moving from the turn of the twentieth century to works written in the last few years. As we explore the modernist and contemporary short story in Britain and beyond, we'll keep two objectives in mind: 1) to familiarize ourselves with some of the genre's important critical vocabulary; and 2) to see how modernist and contemporary writers of global English literature stretched the limits of what stories can do, deliberately complicating their epiphanies through abstraction, ambiguity, subversion, and provocation. The stories we read will touch upon the major currents of 20th- and 21st-century history and life, bridging the everyday and the extraordinary. We will read a diverse set of writers, including some of the following: Thomas Hardy, Oscar Wilde, Katherine Mansfield, Virginia Woolf, James Joyce, D. H. Lawrence, Muriel Spark, Alan Sillitoe, Graham Greene, Sam Selvon, Doris Lessing, Angela Carter, Salman Rushdie, Ali Smith, Zadie Smith, Kazuo Ishiguro, Jackie Kay, and Hanif Kureishi.\nThe course will require participation in online discussions, short reflection writing, and a paper that synthesizes the work of several writers we have studied\n\n\nThis is an online course. Full participation in synchronous sessions is required (meeting times listed are local to Atlanta), and students should plan to spend at least 15-20 hours/week on the course. Students should begin checking the Canvas course site regularly one week prior to the official start of the term.",
    "course_description": "Literary topics vary. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Erwin Rosinberg - Primary Instructor",
    "schedule_location": "MTWThF 9:30am-11am in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 1161, Section #: 1, Type: LEC, Campus: ATL, Meets: MTWThF 9:30-11a, Instructor: E. Rosinberg, Status: Open",
    "date_accessed": "2024-03-30"
}