{
    "course_code": "CL 150",
    "course_title": "Masterworks of Classical Literature",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 7",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities and Arts(*)",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Western literature begins with the songs of Homer. Epic song begets drama, and drama, both tragic and comic, shapes patterns of narrative that flow on into various forms of prose. This course introduces you to masterworks of Greek and Roman literature by which these cultures both defined themselves and shaped the imagination (cultural, moral, and literary) of the peoples who succeeded them in the Mediterranean and European worlds.\nTexts:\nR. Lattimore, trans., The Iliad of Homer \nGrene and Lattimore, trans., Aeschylus II: The Oresteia \nD. Franklin, J. Harrison, trans., Sophocles: Antigone  \nD. Franklin, J. Harrison, trans., Euripides: Bacchae \nAristophanes, Four Plays by Aristophanes: The Birds; The Clouds; The Frogs; Lysistrata \nW.H.D. Rouse, trans., M. Santirocco, intro., Great Dialogues of Plato \nS. Bartsch (trans.), Vergil: The Aeneid \nJ. Lindsay, trans., Apuleius: The Golden Ass\nNote on translations:  As translations considerably, it is essential that we are all working from exactly the same text, and you are therefore required to use these translations.\nVoluntary Core Curriculum\nThis course is a part of the shared enterprise of Emory's Voluntary Core Curriculum, and we encourage you to enroll in other VCC courses as a means of thinking about connected themes and issues as you complete the General Education program at Emory.",
    "course_description": "This reading-intensive class introduces students to some of the major authors, works, and genres of the classical canon, stretching from the 8th century BC epics of Homer to the works of Imperial Rome. We will wrestle with the major themes and concerns of a variety of ancient poetic and prose texts.",
    "prerequisites": null,
    "instructors": "Niall W Slater - Primary Instructor",
    "schedule_location": "MWF 10am-10:50am in Candler Library 121",
    "course_resources": null,
    "sections": "Class Nbr: 2429, Section #: 1, Type: LEC, Campus: ATL, Meets: MWF 10-10:50a, Instructor: N. Slater, Status: Open",
    "date_accessed": "2024-03-30"
}