{
    "course_code": "CL 221",
    "course_title": "Art & Architecture of Ancient Greece",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities and Arts(*)",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Same as ARTHIST 221 1)\n(Greek Art and Architecture in the Age of the City-State (1200-150 BCE):\nFor millennia, the art and architecture of the ancient Greeks has been conceived of as foundational for the development of \"Western\" Art. The Parthenon, the Venus di Milo, and other works and imitations define modern cityscapes and museums, and the Greek model has been challenged, revived, and reinterpreted over the centuries.\nThis course aims to consider the material culture of the peoples we understand as the ancient Greeks on their own terms, through an in-depth survey of the arts, architecture, and archaeology of Greek communities from the end of the Bronze Age to the Roman conquests (1200-150 BCE). Students will not only learn about cultural centers like Athens, but also about the arts of the wider Greek diaspora from the Iberian Penninsula to modern day Afghanistan.   \nThe course will consist of lectures supplemented by structured discussion of scholarship and case studies. Student performance will be assessed through the completion of a midterm and final, as well as a visual analysis paper building on several instructor-led trips to the Carlos Museum.  \nArt History major/minor: Division I\nArchitectural Studies minor: elective)",
    "course_description": "An investigation of ancient Greek art and architecture from its Iron Age beginnings through the legacy of Alexander the Great, concentrating on the creation of monumental stone sculpture and ordered buildings, visual interpretation of Greek mythology, and the interaction of art, ritual and politics.",
    "prerequisites": null,
    "instructors": "Andrew Ward - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Math & Science Center - N304",
    "course_resources": null,
    "sections": "Class Nbr: 4087, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 10-11:15a, Instructor: A. Ward, Status: Wait List",
    "date_accessed": "2024-03-30"
}