{
    "course_code": "SOC 289",
    "course_title": "Special Topics in Sociology: Music&Society: Soc. Approach",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 34 / Seats Avail: 8Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "You must have permission to enroll in-person.\n(Complete Topic - Music and Society: The Sociological Approach) The sociology of music has a long history. Its initial development benefited from the work of scholars who played central roles in the sociological discipline, including WEB Du Bois and Max Weber. Its subsequent development was aided by emergent schools of thoughts whose respective proponents accumulated systematic analyses of musical life .At its core this scholarship deals with the social aspects of music, emphasizing the context that surrounds and enables musical content. We delve into this exciting literature and grapple with the social aspects of music in three broad sections, considering (1) the production of music,(2) the content of music, and (3) the reception and uses of music. Along the way, we address a number of important questions, which include the following: How did we come to have the current system of music, with its particular notes and forms of composition? Why does much music often sound so similar? What types of environments foster innovative music and musical diversity? Why are some types of music (e.g., the works of Beethoven) deemed as 'high culture' while other types (e.g., hip hop) are often classified as 'popular culture?' How do issues of race, gender, and class shape the production and consumption of music? How do people use music in their everyday lives?",
    "course_description": "A seminar or lecture series on topics of special sociological concern.",
    "prerequisites": null,
    "instructors": "Timothy J Dowd - Primary Instructor",
    "schedule_location": "MW 11:20am-12:35pm in Math & Science Center - E208",
    "course_resources": null,
    "sections": "Class Nbr: 4852, Section #: 2, Type: LEC, Campus: ATL, Meets: MW 11:20a-12:35p, Instructor: T. Dowd, Status: Open",
    "date_accessed": "2024-03-30"
}