{
    "course_code": "SOC 245",
    "course_title": "Individual & Society",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 40 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "Synchronous meetings on Wednesdays,  Asynchronous on Mondays.  How do groups, ranging from small friendship circles to ethnic groups to entire societies, affect the life of an individual and how does the individual, in turn, affect the group? This course examines the reciprocal relationship between individual-level and group-level phenomena, beginning with a focus on the nature of social psychology and its methodology. Attention then turns to defining situations and the identity processes that unfold. The second part of the course examines the cognitions, attitudes, and feelings of individuals in social interaction. The course concludes with an analysis of dynamics both within and between groups, including issues of social influence, power and status structures, intergroup interactions, prejudice, and discrimination. These issues provide a springboard for considerations of fairness regarding inequalities that emerge in interaction and that have consequences for larger groups. \nReadings from required text and others available on course Canvas site. \nParticulars: Participation required, three take-home exams, one short paper proposal. \n \n1.\tCathy Johnson and Karen Hegtvedt. 2018.  Social Psychology: Individuals, Interactions, and Inequality. Thousand Oaks, CA: Sage.\nISBN: 9781412965040",
    "course_description": "Conditions and processes of group formation and change, and the effects of these on individual behavior and adaptation.",
    "prerequisites": null,
    "instructors": "Karen A Hegtvedt - Primary Instructor",
    "schedule_location": "W 1pm-2:15pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 1969, Section #: 1, Type: LEC, Campus: ATL, Meets: W 1-2:15p, Instructor: K. Hegtvedt, Status: Open",
    "date_accessed": "2024-03-30"
}