{
    "course_code": "SOC 307",
    "course_title": "Sociology of Education",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 45 / Seats Avail: 4Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "The course is about the structure, roles, and the collective and individual functions of schooling. This sociology course is also ideal for those students interested in public policy, education processes, and social inequalities. It surveys the social, political, economic, and cultural influences on schooling and educational outcomes in contemporary U.S. and, to a degree, global society. It will focus especially on schooling inequalities according to racial, ethnic, immigrant, class, gender, and sexual status, as measured by educational achievement and attainment, and which are often inherent to the structures and processes of U.S. schooling. The course also examines the interconnection of schooling to important social institutions, such as families, and their contribution to schooling inequality.  The course will consider classic and current theories in the sociology of education, and address controversies within existing educational policy, including current reform efforts and recent neoliberal developments such as school choice.",
    "course_description": "The modern school system as part of the functioning of modern communities in the United States. Attention to problems of interrelating school and community in the light of population change, social class differences, and shifting values.",
    "prerequisites": null,
    "instructors": "Anthony Healy - Primary Instructor",
    "schedule_location": "MW 11:20am-12:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 1973, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 11:20a-12:35p, Instructor: A. Healy, Status: Open",
    "date_accessed": "2024-03-30"
}