{
    "course_code": "SOC 289",
    "course_title": "Special Topics in Sociology: Asian Americans: Immigration",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 35 / Seats Avail: 6Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "This course introduces Asian Americans in a changing global context, by highlighting how and why Asian immigrants come to the U.S. and how these immigrants and their decedents adjust to a new society, negotiate their identities, and reconstruct their lifestyles and culture.  \nThis course will proceed in two parts. In the first part, we begin the class by looking at the general migration theories, and immigration trends in the U.S. history, particularly after World War II, to map out why Asian immigrants move and how they stay in the U.S. We will tackle some key historical events and contemporary arguments, and analyze a range of geopolitical, economic and sociocultural factors that shape the Asian American communities, through different lenses, such as colonization, nation-state-building, migration regulation, economic development, politics, international relations, and diasporic networks. In the second part, we will study the contemporary Asian Americans, family and community building, education and career opportunities, and media presentations, by addressing how they are transformed and are transforming the society and the future of the United States.",
    "course_description": "A seminar or lecture series on topics of special sociological concern.",
    "prerequisites": null,
    "instructors": "Xinxin Yang - Primary Instructor",
    "schedule_location": "TTh 9:40am-10:55am in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 5750, Section #: 5, Type: LEC, Campus: ATL, Meets: TTh 9:40-10:55a, Instructor: X. Yang, Status: Open",
    "date_accessed": "2024-03-30"
}