{
    "course_code": "SOC 497R",
    "course_title": "Directed Research",
    "credit_hours": "Varies by section",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Varies by section",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "Varies by section",
    "course_description": "Supervised work on a faculty member's research project, normally for students who have demonstrated superior performance in sociology.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 1987, Section #: 1, Type: RSC, Campus: ATL, Meets: Meets Online, Instructor: J. Mullis, Status: Open\nClass Nbr: 6139, Section #: 10, Type: RSC, Campus: ATL, Meets: Meets Online, Instructor: C. Johnson, Status: Open\nClass Nbr: 6148, Section #: 11, Type: RSC, Campus: ATL, Meets: Meets Online, Instructor: J. Easley, Status: Open\nClass Nbr: 6156, Section #: 12, Type: RSC, Campus: ATL, Meets: Meets Online, Instructor: A. Dixon, Status: Open\nClass Nbr: 5937, Section #: 2, Type: RSC, Campus: ATL, Meets: Meets Online, Instructor: B. Xu, Status: Open\nClass Nbr: 5952, Section #: 3, Type: RSC, Campus: ATL, Meets: Meets Online, Instructor: H. Sohn, Status: Open\nClass Nbr: 5953, Section #: 4, Type: RSC, Campus: ATL, Meets: Meets Online, Instructor: K. Yount, Status: Open\nClass Nbr: 6004, Section #: 5, Type: RSC, Campus: ATL, Meets: Meets Online, Instructor: I. Browne, Status: Open\nClass Nbr: This section is full 6033, Section #: 6, Type: RSC, Campus: ATL, Meets: Meets Online, Instructor: T. Scott, Status: Closed\nClass Nbr: 6038, Section #: 7, Type: RSC, Campus: ATL, Meets: Meets Online, Instructor: R. Franzosi, Status: Open\nClass Nbr: 6110, Section #: 8, Type: RSC, Campus: ATL, Meets: Meets Online, Instructor: F. Lechner, Status: Open\nClass Nbr: 6127, Section #: 9, Type: RSC, Campus: ATL, Meets: Meets Online, Instructor: A. Sewell, Status: Open",
    "date_accessed": "2024-03-30"
}