{
    "course_code": "SPAN 102",
    "course_title": "Elementary Spanish II",
    "credit_hours": "4",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Varies by section",
    "instruction_method": "Distance Learning",
    "typically_offered": "Spring",
    "requirement_designation": "Humanities, Arts, Language [Foreign Language]",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(This course is a continuation of Spanish 101 and is an integrated-skills course designed to further promote basic communication in and with Hispanic communities and to heighten cultural awareness. The goals of this course include: 1) learning to use Spanish to communicate (through intensive interaction), primarily in speaking and listening, but also in reading and writing; 2) learning of and about the tools of communication, including pronunciation, grammar and vocabulary; and 3) continuing the study of Hispanic cultures to learn more about how culture affects language use.)\n(REQUIRED COURSE MATERIAL: Contraseña: Your Passport to Foundational Spanish (LingroLearning). Contraseña is a completely mobile and digital immersive experience, so there is no required printed textbook. Access is available for purchase directly from LingroLearning at www.lingrolearning.com)\n(PARTICULARS: Classes meet four times per week and are conducted in Spanish to maximize exposure to the language. Evaluation is based on daily and active participation, online homework assignments, portfolio projects, and exams.)\n(PREREQUISITES: SPAN 101 or SPAN_OX 101. A waitlist will be created after tiered enrollment.)",
    "course_description": "The second half of a yearlong introductory course designed to train students to understand, speak, read, and write Spanish.",
    "prerequisites": "SPAN 101 or SPAN_OX 101 or equivalent transfer credit as prerequisite.",
    "instructors": null,
    "schedule_location": "Varies by section",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 1007, Section #: 1, Type: LEC, Campus: ATL, Meets: MWF 8-9:15a, Instructor: J. Feldman, Status: Wait List\nClass Nbr: This section is full 1845, Section #: 2, Type: LEC, Campus: ATL, Meets: MWF 9:40-10:55a, Instructor: J. Feldman, Status: Wait List\nClass Nbr: 1869, Section #: 3, Type: LEC, Campus: ATL, Meets: TThF 11:20a-12:35p, Instructor: A. Presas, Status: Open\nClass Nbr: This section is full 1870, Section #: 4, Type: LEC, Campus: ATL, Meets: TThF 1-2:15p, Instructor: A. Presas, Status: Wait List",
    "date_accessed": "2024-03-30"
}