{
    "course_code": "SPAN 301W",
    "course_title": "Early Hispanic Texts & Contexts",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Language with Writing",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "CONTENT: Spanish 301W is a foundational course for the Spanish Major and Minor. This course engages in an in-depth study of Spanish and Colonial Spanish American cultures and societies from the Middle Ages through the seventeenth century. The course incorporates a variety of primary texts of all sorts in order to explore a wide range of topics, such as Islamic Spain, the Spanish Reconquest, the Inquisition, the origins of the Spanish language, Sephardic culture in Spain, the pilgrimage route to St. James, picaresque literature, golden age drama, pre-columbian civilizations, the conquest of the New World, and the establishment of colonial rule in Spanish America. The course also establishes the base for carrying out and reporting on research related to the production and reception of primary and secondary texts arising in Hispanic communities.\nTEXTS: Selection of texts available at Canvas.\nEVALUATION: Final grade is based on one research essay, one oral presentation, two exams, short daily assignments, and class participation.\nPREREQUISITES: Spanish 212, official placement for foundational courses or permission from instructor.",
    "course_description": "A survey course in Spanish and Spanish American culture from the Middle Ages and Pre-Columbian periods to the seventeenth century.",
    "prerequisites": null,
    "instructors": "Cesar Sierra - Primary Instructor",
    "schedule_location": "Varies by section",
    "course_resources": null,
    "sections": "Class Nbr: 1882, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 8-9:15a, Instructor: C. Sierra, Status: Open\nClass Nbr: 1885, Section #: 2, Type: LEC, Campus: ATL, Meets: MW 9:40-10:55a, Instructor: C. Sierra, Status: Open",
    "date_accessed": "2024-03-30"
}