{
    "course_code": "SPAN 330",
    "course_title": "Theater Workshop in Spanish",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Spring",
    "requirement_designation": "Humanities, Arts, Language [Foreign Language]",
    "permission": "Department Consent Required",
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as THEA 385 1)\n(Permission required prior to enrollment. Please contact Prof. Gonzalez at egonza3@emory.edu for enrollment info.)\n(The objective of this course is the development of linguistic and cultural understanding in the context of theatrical performance. The course is both critical and experiential.Through close readings of texts, script analysis, memorization, development of character, and writing assignments, students will develop a deeper understanding of Spanish language and Hispanic cultures through a combination of the perspectives of both disciplines, Hispanism and Theater Studies. This critical/interpretive dimension will be complemented and enriched at all stages of the course by the experiential dimension: the physical and vocal embodiment/performance of the target language and texts. Course taught in Spanish) (Texts: readings will be made available on Canvas.Particulars: Class exercises will involve physical and vocal warm-ups and improvisation, and assignments, including writing essays and reading plays, will include individual activities as well as other which will require outside class preparation with partners) \n(Prerequisite: One foundational course (SPAN 300-318W)",
    "course_description": "Overview of cultural production and ideas through history. May deal with Latin America as a whole or with a smaller region or individual country.",
    "prerequisites": null,
    "instructors": "Maria Gonzalez - Primary Instructor",
    "schedule_location": "TTh 11:20am-12:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 1013, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 11:20a-12:35p, Instructor: Gonzalez/Owen, Status: Open",
    "date_accessed": "2024-03-30"
}