{
    "course_code": "SPAN 410",
    "course_title": "Topics in Spanish Linguistics: Teaching a Third Language",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 3Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "Taught in Spanish, this course provides an overview of third-language (L3) teaching, a subfield of applied linguistics in which language learners are encouraged to draw upon their own multilingual competence in the classroom. Throughout the semester, students will examine efforts to teach various L3s from both curricular and pedagogical standpoints, and will gain direct experience with L3 learning and teaching. Special attention is given to classes in which Spanish is used as a pivot language (i.e. Portuguese for Spanish Speakers). It may therefore be helpful, though not required, for students to have some degree of familiarity with another Romance language. The research component of this course will additionally give students an opportunity to contribute in meaningful ways to the field's development. This course counts as one of the required 400-level courses for the Joint Major in Spanish and Linguistics, and the Spanish Major/Minor.\n \nPrerequisites: A general background in linguistics (SPAN/LING 303, SPAN/LING 304, or LING 201) is highly recommended for all students; for Spanish majors and minors, at least one foundational course (SPAN 300-318W) is required.",
    "course_description": "Upper-level research seminar on topics of Hispanic linguistics and communication, such as history of the language, bilingualism, or translation. Students may take multiple SPAN 410 courses provided that they focus on different topics.",
    "prerequisites": null,
    "instructors": "Will Travers - Primary Instructor",
    "schedule_location": "TTh 6pm-7:15pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 1890, Section #: 2, Type: SEM, Campus: ATL, Meets: TTh 6-7:15p, Instructor: W. Travers, Status: Open",
    "date_accessed": "2024-03-30"
}