{
    "course_code": "SPAN 410",
    "course_title": "Topics in Spanish Linguistics: Spanish in the US",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 8 / Seats Avail: 2Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "DESCRIPTION: This course provides a descriptive and critical overview of the linguistic practices of different Spanish-speaking communities in the United States, as well as a methodology for the study of these practices. Students will learn about the linguistics characteristics of the different Spanish varieties spoken by these communities, including phonetic, morphological, syntactic and lexical aspects. Special attention is given to the relationship between language and society, particularly on topics such as ethnic and cultural identity, multilingualism and language policy. The course also presents a theoretical and practical approach to the ethnographic research method. Students will read and analyze studies carried out by different scholars and will design their own research project on the topic of their preference. Special attention is given to ethical principles, for this reason students will need to complete the web-based Collaborative IRB Training Initiative (CITI) Program in the Protection of Human Subjects in Research.\nBackground on general Linguistics is recommended, such as the one provided in Span/Ling 303, Span/Ling 304 or Ling 201.This course meets the sociocultural requirement of the Linguistics Major and can be used as one of the required 400-level courses for the Joint Major in Spanish & Linguistics or for the Major/Minor in Spanish\n(Prerequisite: At least one foundational course for the Spanish Major and Minor (preferably Span/Ling 303 or Span/Ling 304).",
    "course_description": "Upper-level research seminar on topics of Hispanic linguistics and communication, such as history of the language, bilingualism, or translation. Students may take multiple SPAN 410 courses provided that they focus on different topics.",
    "prerequisites": null,
    "instructors": "Jose Luis Boigues-Lopez - Primary Instructor",
    "schedule_location": "MW 11:20am-12:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 1889, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 11:20a-12:35p, Instructor: J. Boigues-Lopez, Status: Open",
    "date_accessed": "2024-03-30"
}