{
    "course_code": "SPAN 411W",
    "course_title": "Translation Theory and Practice",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": "Continuing Writing Requirement",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "Translators are both skilled writers and-equally important-excellent readers. Translation involves analyzing and interpreting original texts, strategy and creativity; it's a process far more complex than its final product and its choices have important political and cultural implications. Context is vital: Who is the audience? What is the explicit aim of each particular translation? This course will challenge your knowledge of syntax, slang, colloquialisms; expand the registers you are comfortable with (advertising, literary, poetic) and compel you to consider linguistic nuance in both English and Spanish. You will learn the history and theories of translation, and basic methods/techniques and problems of translating between English and Spanish. The focus is on Spanish as source language (SL) and English as target (TL), though you will do limited translation into Spanish, as well as English-to-English translation. Some classes will be devoted to workshops, comparing multiple translations of a text, and discussion of translations done both by students and professional translators.  \nTexts: Susan Bassnett McGuire. Translation Studies, S Hervey et al; Thinking Spanish Translation, 2nd edition  \nNOTE: This course requires a high proficiency in Spanish and is not recommended as your first 400-level course.  \nEvaluation: Active participation; translation homework; oral presentation; reading responses; final translation project  \nPrerequisites: 3 foundational courses (SPAN 300-318W)",
    "course_description": "This course presents the history and multiple theories of translation, as well as basic methods/techniques and problems of translating between English and Spanish. A portion of class time will be devoted to translation practice and the comparison of multiple translations of a single text.",
    "prerequisites": null,
    "instructors": "Lisa Dillman - Primary Instructor",
    "schedule_location": "TTh 9:40am-10:55am in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 1888, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 9:40-10:55a, Instructor: L. Dillman, Status: Wait List",
    "date_accessed": "2024-03-30"
}