{
    "course_code": "SPAN 385",
    "course_title": "Topics in Language and Culture: Hispanic Utopias/Dystopias",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 4Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Humanities, Arts, Language [Foreign Language]",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Content: Utopia and dystopia represent opposing sides of the same coin. Dissatisfied with the contemporary political and social conditions in which they live, Spanish and Latin American authors and filmmakers express their critiques in speculative fictions and activist projects that imagine society differently, inventing alternative realities that are either sunnier or bleaker than their own. Such critiques may look nostalgically to the past; in other instances they are introduced by picturing a terrifying future. Beginning in the Renaissance, we find many examples of texts that envision a more idyllic world; since the 19th century, ambivalence surrounding the ideas of progress and modernity has given rise to darker, dystopian views. Students will enter the weird cosmographies-sometimes comical, sometimes apocalyptic, always thought-provoking-of these alternative worlds that give expression to debates over such topics as gender identity and relations, political systems, urbanization, technological innovation, and environmental degradation. In addition to narratives, films, and television we will consider experimental communities (physical and online) and protest movements.) (Evaluation: Active class participation; midterm exam; short written responses to readings/viewings; final project.)\n(Prerequisites: At least 1 foundational course. Students wishing to enroll without this prerequisite should consult with the instructor.)",
    "course_description": "Advanced study of a topic related to the language, discourse, literature, and/or culture of the Hispanic world. Students may take multiple SPAN 385 courses provided that they focus on different topics.",
    "prerequisites": null,
    "instructors": "Hazel Gold - Primary Instructor",
    "schedule_location": "MW 11:20am-12:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 1887, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 11:20a-12:35p, Instructor: H. Gold, Status: Open",
    "date_accessed": "2024-03-30"
}