{
    "course_code": "SPAN 423",
    "course_title": "Madrid, Barcelona, New York",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 3Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "Content: How does the experience of urban life change in concert with the development of the American and European city from modernity (the commercial-industrial city) to postmodernity (the global informational city)? This course will focus on ways in which writers and artists express conflicting reactions to the city as a seductive and/or dangerous place to live, work and play, a place where people may interact via the shared culture of neighborhood communities or remain isolated by spatial segregation and the mobile nature of contemporary society. Centering on representations of Madrid, Barcelona, and New York-sites of exchange and circulation among Spaniards, Latin Americans, and Latinxs-we will ask: how are real cities imagined and remembered by those who live, visit, or immigrate there? How does the city map performances of social class, gender/sexuality, and ethnicity? The concepts of \"streetwalking\" and \"networking\" will guide discussions of cultural production focused on evolving urban identities. Readings will be drawn from a variety of genres: memoirs, short stories, essays, novels, poetry, film, theater, websites. Evaluation: Active participation in class discussions, midterm, web project, final research paper. Prerequisite: Two 300-level foundational courses for the Spanish Major or Minor, or one 400-elective. Students wishing to enroll without these prerequisites should consult with the instructor.",
    "course_description": "Centered on cultural representations of Madrid, Barcelona, and New York - sites of exchange and circulation among Spaniards, Latin Americans, and Latinos - this course asks how real cities are remembered or imagined by those who live, visit, or immigrate there; focus on performance of urban identities.",
    "prerequisites": null,
    "instructors": "Hazel Gold - Primary Instructor",
    "schedule_location": "MW 2:40pm-3:55pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 2367, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 2:40-3:55p, Instructor: H. Gold, Status: Open",
    "date_accessed": "2024-03-30"
}