{
    "course_code": "AAS 190",
    "course_title": "Fresh Sem: Africn Amer Studies: Civil Rights in the Archives",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Freshmen Seminar - Limited to First Year Students Only)\n(Complete Topic - Civil Rights in the Archives)\nDescription:  The civil rights movement was one of the most important sources of social change in the twentieth century United States.  The struggle against white supremacy involved a host of different people, strategies, and locations.  Scholars debate how much credit such be accorded top-down actors such as presidents and Supreme Court justices in contrast to grassroots activists including women and sharecroppers; white people's role in the movement; and the importance of protest and struggle outside of the South.  Using Emory University's Rose Library and other materials provided by the professor, this seminar will seek to understand the nuances, challenges, successes, and limitations of the classical phase (1955-1965) of the civil rights movement.  Students will be introduced to major issues and actors and key historiographical debates within civil rights scholarship.  By examining historical arguments critically, students will develop the skills and background needed to craft a research paper, based on primary sources, on some aspect of the civil rights movement.",
    "course_description": "Variable topics in African American Studies.",
    "prerequisites": null,
    "instructors": "Crystal Sanders - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Emerson Chemistry Bldg. E101",
    "course_resources": null,
    "sections": "Class Nbr: 1022, Section #: 2, Type: SEM, Campus: ATL, Meets: MW 1-2:15p, Instructor: C. Sanders, Status: Open",
    "date_accessed": "2024-03-30"
}