{
    "course_code": "AAS 259",
    "course_title": "Race, Place, and Political Economy",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "This course examines the political, racial, and economic evolution of American cities and towns in the post-Civil Rights Movement era. The first half of the course focuses on dominant themes in political economy, political geography, and political behavior literature. The intersection of race and class at the local level is addressed, while exploring issues of institutional discrimination and redistribution. The second part of the course, applies learned concepts and ideas to 4 case studies: deindustrialization in Chicago, the rural healthcare crisis in Mississippi, rapid population change in Atlanta, and public education funding in Los Angeles. Students will gain an understanding of how the local political economy shapes opportunity, mobility, and racial relations in America.",
    "course_description": "This course focuses on dominant themes in political economy, geography, and behavior literature in the post-Civil Rights Movement era. The intersection of race and class at the local level is addressed while exploring issues of institutional discrimination and redistribution.",
    "prerequisites": null,
    "instructors": "Jessica Lynn Stewart - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Emerson Chemistry Bldg. E103",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3955, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: J. Stewart, Status: Wait List",
    "date_accessed": "2024-03-30"
}