{
    "course_code": "ANT 311",
    "course_title": "Nutritional Anthropology",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Nutritional anthropologists study the evolution, current diversity and clinical and social significance of the human diet and nutrition. This course will introduce students to nutritional anthropology as a distinct field of study that draws on methods, theory and data from anthropology, sociology, gender studies, ecology, biology, epidemiology and nutritional science. The overall goal of the course is to understand why people eat what they eat. We will concentrate on how ecology and evolution as well as social, cultural, and political forces influence our dietary choices and nutritional status, and how dietary choices impact on society. We will achieve this goal through lectures, readings, films, measurement activities, and group discussions. By the end of the course students should have a greater appreciation and understanding of the role of food in the shaping of society and culture across time and space. They should also have a general understanding of some basic human nutrition and be able to carry out nutritional assessment. The course is heavily biased towards a biocultural and empirical perspective, an emphasis on health, and on critical thinking and hands-on exercises.",
    "course_description": "Introduction to the evolution, diversity, and social significance of human diet and nutrition.",
    "prerequisites": null,
    "instructors": "Craig Hadley - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Math & Science Center - N302",
    "course_resources": null,
    "sections": "Class Nbr: 2751, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: C. Hadley, Status: Wait List",
    "date_accessed": "2024-03-30"
}