{
    "course_code": "ANT 385",
    "course_title": "Special Topics: Anthropology: Anthropology of Crisis",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 7Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "The first two decades of the 21st century have been marked by a growing sense of uncertainty, crisis, and collapse. The global war on terror, the 2008 financial crisis, accelerating rates of climate change, massive social inequality, and the COVID-19 pandemic have shattered what was left of the illusion of the progress narrative of modernity. While conventionally used to describe a rupture to a state of normalcy, crisis has diverse historical definitions and contemporary interpretations. This course will explore anthropological approaches to understanding crisis and uncertainty in today's world. How are narratives of crisis constructed and who do they serve? What are the different temporalities of crisis? How are \"global\" crises such as pandemics and climate change contextualized in different places and what does this tell us about relations of power? What are the alternative scripts (such as hope and nostalgia) that stand in the shadows of crisis narratives? Drawing on ethnographic case studies from around the world as well as popular media, this course will equip students to situate crisis in context and analyze the political implications of crisis narratives more broadly. Topics explored may include climate change, pandemics, racialized violence, war, humanitarianism, and economic collapse. Students will be encouraged to bring their own topics of interest to the course for discussion and analysis.",
    "course_description": "Seminar or lecture series of topics of anthropological concern. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Katy Lindquist - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Anthropology Building 105",
    "course_resources": null,
    "sections": "Class Nbr: 3259, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: K. Lindquist, Status: Open",
    "date_accessed": "2024-03-30"
}