{
    "course_code": "ANT 391",
    "course_title": "Law, Discipline, and Justice",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 6Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Same as WGS 385 3)\nThis course introduces students to the cultural and political dimensions of law, discipline, and social justice in a wide array of human societies. Readings and discussions provide anthropological and historical perspectives on the ways people organize and experience different types of justice, power, discipline, policing, state violence, and institutionalized racism and heterosexism in the context of neoliberal globalization. In exploring these topics, we will draw upon feminist scholarship, critical legal studies, and theoretical perspectives associated with Marx and Foucault. With respect to case studies and areal focus, some of the initial readings deal with the U.S. colonization of Hawaii; most of the rest of course focuses on the West (especially the U.S. and France) and the Muslim world (particularly Malaysia).",
    "course_description": "This course examines the social and cultural-political dimensions of law, discipline, and disorder in a wide variety of human societies, providing cross-cultural perspectives on how people manage conflict, construe justice, and organize and experience power, discipline, and resistance.",
    "prerequisites": null,
    "instructors": "Michael Peletz - Primary Instructor",
    "schedule_location": "MW 4pm-5:15pm in Anthropology Building 105",
    "course_resources": null,
    "sections": "Class Nbr: 2716, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 4-5:15p, Instructor: M. Peletz, Status: Open",
    "date_accessed": "2024-03-30"
}