{
    "course_code": "ANT 385",
    "course_title": "Special Topics: Anthropology: Humans and Their Environment",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 16Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "What is the environment?  Humans ascribe a range of meanings to the \"environment\" in which they make their lives, viewing it as a resource, an ecosystem, or a landscape, among others. These distinct notions of what the environment is are complemented by distinct forms of practice: from cultivation, economic exploitation, and scientific management to aesthetic creation and spiritual contemplation. Farming, logging, gardening, foraging, hiking, painting, designing, and building are but some examples of environmental practice guided by environmental thought. This course will explore various ways of conceptualizing the environment, focusing mainly on the notion of the \"landscape,\" an increasingly salient term in both environmental anthropology and historical ecology. This term emphasizes the interaction between humans and their environment over time, leading anthropologist Tim Ingold to describe the landscape as \"an enduring record of - and testimony to - the lives and works of past generations who have dwelt within it, and in so doing, have left there something of themselves.\" Thus will we consider the relationship between landscape and cultural practices of history, memory, myth, art, politics, and ritual.  \nClass discussions will be anchored in texts, films, and photography from anthropology, historical ecology, and related disciplines. Students will also participate in several field trips on campus and around Atlanta to practice environmental thinking outdoors.",
    "course_description": "Seminar or lecture series of topics of anthropological concern. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Sasha Tycko - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Anthropology Building 105",
    "course_resources": null,
    "sections": "Class Nbr: 3262, Section #: 2, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: S. Tycko, Status: Open",
    "date_accessed": "2024-03-30"
}