{
    "course_code": "ANT 510",
    "course_title": "Medical Anthropology",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 9 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "This course is designed as an introduction to medical anthropology. The course is\norganized thematically and examines some of the important issues in contemporary\nmedical anthropology, including: Illness, disease and sickness; illness as metaphor of\nsocio-cultural distress; the process of medicalization; current paradigm shifts in\nbiomedicine; culture-bound syndromes; contestation for medical legitimacy in plural\nsocieties; non-western medical systems; body and mind in illness and healing; cross cultural psychiatric anthropology; infectious disease and inequality; power/knowledge and medical practices; and ambiguity in death and dying in the era of high technology. This course will explore the role of medicine in our society, how anthropological analysis can be applicable in understanding the complexity of human conditions such as health, illness and sickness, physical and mental pain, suffering, death and dying.",
    "course_description": "The course is organized thematically and examines some of the important issues in contemporary medical anthropology, including: Illness, disease and sickness; illness as metaphor of socio-cultural distress; the process of medicalization; current paradigm shift in biomedicine; culture-bound syndromes; \"naturalizing\" processes; contestation for medical legitimacy in plural societies; non-western medical systems; body and mind in illness and healing; cross-cultural psychiatric anthropology; infectious disease and inequality; power/knowledge and medical practices; and ambiguity in death and dying in the era of high technology. This course will explore the role of medicine in our society, how anthropological analysis can be applicable in understanding the complexity of human conditions such as health, illness and sickness, physical and mental pain, suffering, death and dying.",
    "prerequisites": null,
    "instructors": "Chikako Ozawa-de Silva - Primary Instructor",
    "schedule_location": "T 1pm-3:45pm in MODERN LANGUAGE_302",
    "course_resources": null,
    "sections": "Class Nbr: 3250, Section #: 1, Type: SEM, Campus: ATL, Meets: T 1-3:45p, Instructor: C. Ozawa-de Silva, Status: Open",
    "date_accessed": "2024-03-30"
}