{
    "course_code": "IDS_OX 290R",
    "course_title": "Interdisciplinary Sidecar",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "Course meets on selected dates throughout the semester during the scheduled class period; specific dates will be communicated at the start of the semester. Sidecar description: Shakespeare's plays confront different models and representations of gender, including the permeability of gendered differences and the construction of gendered identities. His plays interrogate, rather than answer, a fixed idea of gender. In ENG_OX 312, students examine how Shakespeare presents a reversibility and often a confusion between what seems to correspond culturally to the masculine or the feminine. Similarly, Neuroscience and Behavioral Biology interrogates many of the same issues by exploring how hormones influence social behaviors. In NBB_OX 304 and its Lab, students focus on the relationship between hormones, brain function, and behavior, as well as the techniques used to investigate them. They identify how brain neurochemistry affects social behavior. In this Sidecar course, students will explore gender through both art and science, both dramatic aesthetics and hormonal influences.",
    "course_description": "A side-car course brings together a subset of students from two courses that overlap in methodologies, topics, etc., to create a short interdisciplinary course that runs simultaneously with its two sponsoring courses. One credit, S/U only. Schedule and format arranged by sponsoring professors.",
    "prerequisites": null,
    "instructors": "Sarah Higinbotham - Primary Instructor",
    "schedule_location": "Th 5:30pm-7:20pm in Humanities Hall 201",
    "course_resources": null,
    "sections": "Class Nbr: 6208, Section #: 1, Type: SEM, Campus: OXF, Meets: Th 5:30-7:20p, Instructor: Team, Status: Open",
    "date_accessed": "2024-03-30"
}