{
    "course_code": "PHIL 134",
    "course_title": "Intro to Phil of Human Nature",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 22 / Seats Avail: 2",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "This course is an introduction to some of the central themes in the philosophy of human nature. We will approach these themes by considering the following questions: Why does the concept of human nature matter? How is the concept of human nature utilized in evaluations of human individuals and groups of individuals? What are the contents and limitations of scientific perspectives on human nature? Are human beings inherently selfish or altruistic? How are accounts of human nature used to justify how we organize our society? What motivates human beings? What is necessary or unnecessary to human existence and how can we determine which is which? How does human nature related to technology? What role does human nature play in our interpersonal relationships and our relationship to our environment and non-human beings?",
    "course_description": "What is distinctive about a human being? What did it mean to be a human in ancient times, as it differs from what it means in modernity? Who are we, and what are our possibilities? What can we become? The responses to these questions affect our ethics, our politics, and the meaning of our lives.",
    "prerequisites": null,
    "instructors": "Shouta Brown - Primary Instructor",
    "schedule_location": "MW 4pm-5:15pm in Tarbutton Hall 218",
    "course_resources": null,
    "sections": "Class Nbr: 1373, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 4-5:15p, Instructor: S. Brown, Status: Open",
    "date_accessed": "2024-03-30"
}