{
    "course_code": "PHIL 300",
    "course_title": "Metaphysics and Epistemology",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 24 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "Epistemology is the branch of philosophy concerned with the study of knowledge. It delves into the definition, scope, and parameters of knowledge and knowledge formation, seeking to explain how we acquire knowledge, how we can justify what we know to others, how we form our beliefs about the world, and how we can be certain of what we think we know. Epistemology deals with questions like, \nwhat is knowledge? What can we know for certain? How do we know what we know? How can we acquire knowledge? What is a justified belief, and what makes it justified? \n\tMetaphysics is the branch of philosophy that studies reality, existence, the nature of being, the physical world, and the universe. It seeks to answer questions like, what is the nature of reality? How can we say that the world exists outside of our thoughts? How was the universe made? Was the universe made?  How can our minds control or affect our physical bodies? How can we prove the existence of something? Can 'nothingness' exist?",
    "course_description": "An inquiry into fundamental questions in epistemology and metaphysics, with special attention to how problems in one area impacts problems in the other. The course will include texts from various historical periods, providing students with some sense of philosophical questions evolve over time.Philosophy course.",
    "prerequisites": null,
    "instructors": "Rebekah Spera - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in Math & Science Center - N306",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 1374, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: R. Spera, Status: Closed",
    "date_accessed": "2024-03-30"
}