{
    "course_code": "PHIL 185",
    "course_title": "Special Topics: Great Works",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 22 / Seats Avail: 6",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(This course is part of Emory College's Voluntary Core Curriculum)\nThe Modern period in Europe (which spans roughly from the end of the Renaissance up through the end of the 18th century) was an era of tremendous upheaval not only in social, political, and economic spheres but also in the arena of philosophy. Philosophers shifted away from the version of Aristotle inherited from scholastic Medieval philosophy as they questioned anew the humanity's place in the cosmos, the possibility of knowledge about the world, the nature of matter and causality, the link between the mind and body, and the methods proper to philosophical inquiry. These philosophical currents and controversies shape the contours of philosophical thought to this day. In this course, we will look at how philosophers in the 16th through the 18th century wrestled with questions concerning knowledge, the nature of reality, and the method proper to philosophical inquiry.",
    "course_description": "An opportunity to explore special topics and thinkers not offered in the standard curriculum, or to explore aspects of the standard curriculum in greater depth and detail than the ordinary curriculum courses allow.",
    "prerequisites": null,
    "instructors": "Rebekah Spera - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in Tarbutton Hall 106",
    "course_resources": null,
    "sections": "Class Nbr: 1367, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 1-2:15p, Instructor: R. Spera, Status: Open",
    "date_accessed": "2024-03-30"
}