{
    "course_code": "PHIL 415W",
    "course_title": "Ethics",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "Course Overview\nWe will consider three topics in normative ethics: hope, trust, and forgiveness. The task is to clarify {a} your sense of the basic character of each phenomenon, {b} its relative value, and {c} how it functions in ethical life.\n Principal Course Objectives\no\tTo help you clarify your own conceptions of hope, trust, & forgiveness.\no\tTo enable you, in writing and orally, to cogently discuss, compare, contrast, and evaluate a variety of philosophical accounts of hope, trust, and forgiveness.\no To increase your ability to present and critically engage your own ideas in your own language.\nSecondary Course Objectives\no\tBy the end of the course, you should be able to: \no\trecognize and pursues various modes of ethics as a philosophical subdiscipline,\no\tconcretely engage various modes of philosophical inquiry and presentation,\no\teffectively engage primary and secondary philosophical literature in the course of your research and writing.",
    "course_description": "This course will investigate moral theories as presented by their famous proponents, including such topics as virtue ethics, deontology, and utilitarianism.",
    "prerequisites": "Two PHIL courses or equivalent transfer credit as prerequisite.",
    "instructors": "John Lysaker - Primary Instructor",
    "schedule_location": "MW 4pm-5:15pm in Math & Science Center - N306",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 5371, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 4-5:15p, Instructor: J. Lysaker, Status: Closed",
    "date_accessed": "2024-03-30"
}