{
    "course_code": "AMST 385",
    "course_title": "Special Topics: American Studies: Race, Place, and Belonging",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as AAS 385 6 and SOC 389 6)\n(Complete Topic: Race, Place, and Belonging: Black (and Brown) Bodies and White Spaces)\n(The human body is constructed through political and social processes and practices. These processes mark certain bodies as suspect or outsiders, but the white male body remains the unmarked somatic norm (Mills. 1997: 53). As such, it only has the natural right to freely navigate public spaces without the presumptions to which other bodies are subject. Razack (2002: 15) notes, \"To interrogate bodies travelling in space is to engage in complex historical mapping; [and] tracking of multiple systems of domination.\" This course examines historical and contemporary processes of spatial and social exclusion. In so doing, this class will ask students to analyze: What can expectations about bodies, space, place, and belonging tell us about the ways racism is perpetuated? What historical, social, and political processes and/or practices influence the perception of being a body out of place? What impact (if any) do these continuing historical, social, and political processes and practices have on contemporary race relations?)",
    "course_description": "Specialized courses in American culture and history. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Barb Combs - Primary Instructor",
    "schedule_location": "T 4:20pm-5:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 4889, Section #: 7, Type: LEC, Campus: ATL, Meets: T 4:20-5:35p, Instructor: B. Combs, Status: Open",
    "date_accessed": "2024-03-30"
}