{
    "course_code": "AMST 385",
    "course_title": "Special Topics: American Studies: US Legal & Constitutional Hist",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as HIST 354 1)\nLaw is traditionally studied vocationally. That is, students of the law often learn about it strategically, in order to eventually write legislation, advocate for a client, or decide cases. In this course, students will be introduced to a historical analysis of law. Rather than just studying \"law,\" legal historians study \"legality\" - a term that refers to statutes and Supreme Court decisions, to be sure, but one that also describes symbols, images, stories, relationships, and ways of thinking. And rather than studying law as an enterprise that operates autonomously, historians study it as a human activity that cannot be understood apart from the social, political, and cultural - and, most importantly, temporal - contexts in which it has operated. Rather than providing a broad and necessarily shallow overview of U.S. Legal and Constitutional History, we will examine the history of three topics in depth. In Part I of the course, \"Law from Above and Below,\" we will examine the structure of the American legal system and explore the different ways elite and ordinary Americans have defined law and understood the act of judging throughout American history. In Part II of the course, \"The Borders of Belonging,\" we will examine the history of citizenship. In Part III of the course, \"The Monopoly on Violence and its Discontents\" we will study how and why the state's monopoly of violence in the United States has historically been more tenuous than it has in other western nations.)",
    "course_description": "Specialized courses in American culture and history. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Daniel LaChance - Primary Instructor",
    "schedule_location": "MW 2:40pm-3:55pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 3112, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 2:40-3:55p, Instructor: Team, Status: Open",
    "date_accessed": "2024-03-30"
}