{
    "course_code": "AMST 285",
    "course_title": "Special Topics: American Questions: Found of Amer Society to 1877",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as HIST 285 1)\n(Considers the development of American society from its beginnings through Reconstruction. Special emphasis is given to certain critical periods including the British colonial era, the American Revolution, and the Civil War.\nThis course introduces students to central themes, issues, events, and personalities in early American history. Focusing on central issues in the social, cultural, and political history, it is driven by two guiding assumptions: that an informed awareness of the present begins with a responsible and sophisticated awareness of the past; and that gaining a sophisticated awareness of early American history provides important insight into the American story as a whole.)\nRequired Texts:\nJames L.Roark, Michael P. Johnson, et al, The American Promise: A History of the United States, vol. I: to 1877. ISBN: 0312452926.\nFrederick Douglass, Narrative of the Life of Frederick Douglass: An American Slave, edited by David W. Blight. ISBN: 978-0-312-25737-6.\nHarriet Beecher Stowe, Uncle Tom's Cabin. ISBN: 978-04486440286\nSean Wilentz and Paul Johnson, The Kingdom of Matthias. ISBN: 978-0199892495\nAutobiography of Benjamin Franklin. ISBN: 978-1936594092\nBernard Bailyn, Origin of American Politics. ISBN: 978-0394708652.\nGrading based on:\nMidterm Examination: Take-home essay\t\nFinal Examination: Take-home.\t\nParticipation in weekly discussions",
    "course_description": "Seminars arranged around current issues and controversies in American culture. May be repeated as topic changes.\n.",
    "prerequisites": null,
    "instructors": "Jonathan Prude - Primary Instructor",
    "schedule_location": "TTh 6pm-7:15pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 3814, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 6-7:15p, Instructor: J. Prude, Status: Open",
    "date_accessed": "2024-03-30"
}