{
    "course_code": "ECON 385",
    "course_title": "Special Topics in Economics: Econ Develop.Africa/Mid.East",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(Same as MESAS 370 4 and AFS 389 4)\n(Complete Topic: Discover the Realities of Economic Development in Africa & the Middle East)\n(Explore the issues that shape economic development, from the aftermath of events like the Arab Spring to the Syrian, Sudanese, Afghan and Ukrainian refugee crises. Understand the impact of worldwide economic crises, the intricacies of geopolitics, and the dynamics of coups in sub-Saharan Africa. Delve into the complexities of attracting foreign aid and non-governmental assistance in a rapidly changing world.\nThis course will dissect development theories, policies, and practices, offering a comprehensive examination of the economic landscape. We'll question conventional wisdom and explore new paths towards sustainable economic development. By analyzing social, political, and cultural factors that influence economic behavior, you'll gain a deeper understanding of the underlying dynamics.\nOur course doesn't stop at theory; we bring real-world practitioners into the classroom. You'll have the opportunity to engage with key figures in the field of development and attend optional master classes on topics like financial stability and development standards.)",
    "course_description": "Selected topics in Economics. May be repeated for credit when topic varies.",
    "prerequisites": "This course requires ECON _OX 100 or ECON 101 or ECON_OX 101 or FIN 201 AND ECON 112  or ECON_OX112 or equivalent transfer credit as a prerequisite.",
    "instructors": "Sam Cherribi - Primary Instructor",
    "schedule_location": "Th 4pm-6:45pm in Anthropology Building 303",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ECON_385_2_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: This section is full 4648, Section #: 2, Type: LEC, Campus: ATL, Meets: Th 4-6:45p, Instructor: S. Cherribi, Status: Closed",
    "date_accessed": "2023-10-31"
}