{
    "course_code": "ECON 397R",
    "course_title": "Directed Reading In Economics",
    "credit_hours": "Varies by section",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": null,
    "course_description": "Up to three semester hours credit. For approval, a topic must be selected that is not included in a course to be offered before the student would normally graduate; a faculty adviser from among the full-time faculty must agree to supervise the study program, and a written description of the program must be submitted to and approved by the director of undergraduate studies in the semester preceding the one in which the student intends to participate.",
    "prerequisites": "ECON 101 or ECON_OX 101 or FIN 201 or equivalent transfer credit as a prerequisite.",
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 6102, Section #: 1, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: K. Lanier, Status: Open\nClass Nbr: 6379, Section #: 10, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: S. Banerjee, Status: Open\nClass Nbr: 6382, Section #: 11, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: E. Saltzman, Status: Open\nClass Nbr: 6450, Section #: 12, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: Y. Wang, Status: Open\nClass Nbr: 6492, Section #: 13, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: J. Kim, Status: Open\nClass Nbr: 6494, Section #: 14, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: I. McCarthy, Status: Open\nClass Nbr: 6168, Section #: 2, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: I. McCarthy, Status: Open\nClass Nbr: 6243, Section #: 3, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: Y. Wang, Status: Open\nClass Nbr: 6308, Section #: 4, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: F. Hasin, Status: Open\nClass Nbr: 6354, Section #: 5, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: H. Nguyen, Status: Open\nClass Nbr: 6355, Section #: 6, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: T. Zha, Status: Open\nClass Nbr: 6357, Section #: 7, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: M. Ayar, Status: Open\nClass Nbr: 6358, Section #: 8, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: E. Pesavento, Status: Open\nClass Nbr: 6378, Section #: 9, Type: SUP, Campus: ATL, Meets: Meets Online, Instructor: F. Mandelman, Status: Open",
    "date_accessed": "2024-03-30"
}