{
    "course_code": "PSYC 324",
    "course_title": "Sleep & Dreaming, Brain & Mind",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 32 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": "Science, Nature, Technology",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as NBB 370 4)\n\n\nWhy do humans sleep and dream? How does the brain control these and related states of consciousness? What are the implications of being a \"night owl\" versus a \"morning person\"? Is lucid dreaming a brain state and can you learn to do it? Do animals sleep differently and do they dream like we do? Do classic and more recent theories of dreaming make sense in terms of what we can measure? Does sleep really form memories and regulate our emotions? Does chronic sleep deprivation matter for mind and body? Can you perform complex actions in your sleep without knowing it? This is a survey course presenting a biologically informed approach to sleep and dreaming under both typical and pathological conditions. Format will be primarily lecture, but discussion and active exercises will also be used.\n \nReadings: Selections from academic and general audience books, scientific journals, and online sources.\n \nPrerequisite: Psych 110 or any of the NBB core courses, or equivalent background. QTM 100 recommended.\n \nAssignment/ Exam Details: Several exams and quizzes throughout the semester; sleep log and dream journal projects; one short reflection paper. Class participation also counts.",
    "course_description": "Why and how do humans sleep and dream? This is a survey course presenting a biologically informed approach to sleep and dreaming under both typical and pathological conditions. Format will be primarily lecture, but some discussion and active exercises will also be used.",
    "prerequisites": "(PSYC 110 or PSYC_OX 110 or NBB 201 or ANT 200 or NBB_OX 201 or NBB 301 or BIOL 360) and (QTM 100 or QTM_OX 100) or equivalent transfer credit as prerequisite.",
    "instructors": "Hillary R Rodman - Primary Instructor",
    "schedule_location": "MW 11:20am-12:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 4033, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 11:20a-12:35p, Instructor: Rodman/Moon, Status: Wait List",
    "date_accessed": "2024-03-30"
}