{
    "course_code": "PSYC 385",
    "course_title": "Special Topics in Psychology: Intro.Stat.Analysis for Psyc.",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 78 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Closed",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "Permission required for enrollment.  This class is only/required for students enrolled in PSYC 200W: Laboratory Methods this spring 2021.\n\n\nThere will be small group discussions. Runs 1st half of the semester, 1-credit course provides a review of the major topics covered in QTM 100: Introduction to Statistical Inference with applications to psychological research. Students will learn how to use the statistical software, Statistical Package for Social Sciences (SPSS), to perform data analysis. This course will assist students in applying the statistical knowledge from QTM100 to the psychological questions investigated in PSYC 200W. This course will meet on Fridays from 9:40 am to 10:55 am EST in the first half of the spring semester. Students are responsible for making room in their schedules to accommodate PSYC 385-1 as well as PSYC 200W lecture and lab sections. Because PSYC 385-1 is a permission only class, actual enrollment in PSYC 385-1 will be done administratively (Lorenza Houser) before the end of the spring add/drop/swap period. Only students enrolled in PSYC 200W for spring 2021 will be enrolled in PSYC 385-1. Students enrolled in PSYC 200W for spring 2021 must be enrolled in PSYC 385-1. Students may not drop PSYC 385-1 and still remain enrolled in PSYC 200W for the spring 2021 semester. This course does not count as a depth course or an elective for the undergraduate psychology major.",
    "course_description": "A series of special topics of concern to the discipline of psychology. Content will vary in successive offerings. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Yuk Cheong - Primary Instructor",
    "schedule_location": "F 9:40am-10:55am in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3682, Section #: 1, Type: LEC, Campus: ATL, Meets: F 9:40-10:55a, Instructor: Cheong/Liu, Status: Closed",
    "date_accessed": "2024-03-30"
}