{
    "course_code": "PSYC 473",
    "course_title": "Adv Topics In Abn Psychology: Autism Spectrum Disorders",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "Distance Learning",
    "typically_offered": "Spring",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Permission Required Prior to Enrollment)\n\n\nThis seminar will provide a comprehensive overview of autism spectrum disorders (ASD), including the clinical and epidemiological features of ASD, how to detect, diagnose, and treat the disorder, and etiological factors associated with ASD. The course will follow a translational approach to bridging scientific research and clinical practice. Guest lectures by clinical and research faculty from Emory University and the Marcus Autism Center will range from social neuroscience and genetics, to experimental paradigms for screening and detection, to the neurodevelopment of the disorder throughout the lifespan. Readings will include a collection of articles and chapters on ASD that elucidate the features of autism from both historic and current perspectives, including Nature, Proceedings of the National Academy of Sciences, Journal of Child Psychology and Psychiatry, Journal of Autism and Developmental Disorders, the Handbook of Autism and Pervasive Developmental Disorders, Third Edition, and the Textbook of Autism Spectrum Disorders. In addition to reading assignments, course assignments will include active classroom discussion, critical thinking papers, and other assignments. Students interested in enrolling in this course should have taken at least one of the following prerequisite courses: Child Psychopathology, Abnormal Psychology, Child Development, Cognitive Neuroscience, or related course. Permission from instructors is required.",
    "course_description": "Selected issues in psychopathology theory and research.",
    "prerequisites": null,
    "instructors": "Celine Saulnier - Primary Instructor",
    "schedule_location": "F 1pm-3:55pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 4031, Section #: 1, Type: LEC, Campus: ATL, Meets: F 1-3:55p, Instructor: Team, Status: Closed",
    "date_accessed": "2024-03-30"
}