{
    "course_code": "PSYC 476R",
    "course_title": "Biological Foundations of Behavior: Primate Communication & Langua",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 6Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "Prior completion of PSYC 200W: Laboratory Methods.  Enrollment is limited to Juniors and Seniors only. The origins of language are among the greatest mysteries in human evolution. A comparative approach to finding answers examines the communicative faculties of our closest living relatives, the nonhuman primates. In this seminar course, students will take an in-depth look at findings in primate communication and evaluate their relevance to language evolution. Topics will include the cognition underlying primate communication; the neural mechanisms of vocal production and perception in humans and nonhumans; the implications of language-like phenomena in animal communication, such as word-like external reference and syntax-like call combinations; lessons from research on language-trained apes; the constraints of learning and flexibility in primate calls and gestures; and the somewhat nebulous concepts of meaning, information, and intentionality as applied to communication. Students will also gain first-hand experience with the techniques and analytical software that researchers use to explore these topics.",
    "course_description": "Selected issues in physiological and comparative psychology.",
    "prerequisites": null,
    "instructors": "Jonathan Engelberg - Primary Instructor",
    "schedule_location": "MW 2:40pm-3:55pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 4032, Section #: 2, Type: SEM, Campus: ATL, Meets: MW 2:40-3:55p, Instructor: J. Engelberg, Status: Open",
    "date_accessed": "2024-03-30"
}