{
    "course_code": "PSYC 543",
    "course_title": "Cognitive & Social Development",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Permission Required Prior to Enrollment)\n\n\nThis course is one of two courses in the Developmental Science concentration in the Department of Psychology. The course is a requirement for students within the Developmental Science concentration, but it is also open to graduate students from other concentrations and other Emory departments. Undergraduate students at Emory may also be admitted with instructor approval.  \n \nThe goal of this course is to provide students with a solid conceptual foundation related to classic and current issues with the literatures of cognitive and social development. In this course, we examine the origins and development of cognition and social behavior. There is an emphasis on how scientific theory and different experimental approaches are used to study cognitive and social development in human and non-human animals. Topics include how children learn to reason about the physical world and how the social and physical environment influence the development of behavior. Also covered are: language, attachment, face processing, numeracy, theory of mind, and biological mechanisms of behavior/cognition. Major areas of focus in this course are ontogenetic and phylogenetic origins, individual differences, as well as change and continuity over time. This course covers development from infancy to adolescence.",
    "course_description": "This course is offered in Developmental Science and is designed to be cross cutting and will be taught by faculty formerly identified with different programs. It is designed explicitly to integrate cognitive and developmental topics, providing a course that will be ideally suited for clinical science students seeking licensure.",
    "prerequisites": null,
    "instructors": "Stella Lourenco - Primary Instructor",
    "schedule_location": "W 11:20am-2:15pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 4035, Section #: 1, Type: LEC, Campus: ATL, Meets: W 11:20a-2:15p, Instructor: Lourenco/Kelly, Status: Closed",
    "date_accessed": "2024-03-30"
}