{
    "course_code": "ES 697",
    "course_title": "Moral Leadership in Context",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 18",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-05-15 through 2024-05-24",
    "class_notes": "(Atlanta Travel Seminar: This course will meet in person starting in Atlanta beginning on Saturday evening, May 18, and will conclude on Friday evening, May 24. Students should plan to be available during the days on these days, as they would be with a travel seminar. We will not be scheduled to meet back-to-back for the full day on each of those days, but the schedule will be full and meetings will take place throughout the metro Atlanta area.  There will be an information session via Zoom for interested students in March (time announced via the Candler student listserv).There will be a pre-course meeting (required) on Friday, April 19, 12-1 pm (zoom) - or at another time to be scheduled with the instructor if student is not available at that time.  Students will be expected to do some work prior to the trip/seminar, but that will be handled asynchronously.  Contact Dr. Letitia Campbell for additional information)",
    "course_description": "Through required pre-reading, lectures, field visits with local moral leaders, seminar discussions and guest presentations participants in this international, U.S. or local (Atlanta) travel seminar will attempt to understand how some people are able through their modes of being and acting to elevate and transform others and produce desired outcomes. We begin with the proposition that moral leaders are women and men who act with imagination and integrity for the common good. This includes clergy and many other vocations and leadership roles. We will explore how leaders with integrity, imagination, courage and virtue come into being in the context, what moral leaders there do habitually and skillfully, and the outcomes they intend, enable and achieve. We will also investigate what leaders in the seminar context can teach and model for leaders and communities.",
    "prerequisites": null,
    "instructors": "Letitia Campbell - Primary Instructor",
    "schedule_location": null,
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ES_697_1_A24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2164, Section #: 1, Type: SEM, Campus: ATL, Meets: Does Not Meet, Instructor: L. Campbell, Status: Open",
    "date_accessed": "2024-03-29"
}