{
    "course_code": "TATT 605PSYC",
    "course_title": "Teaching Assistantship",
    "credit_hours": "2",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Varies by section",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Varies by section",
    "course_description": "The nature of a teaching assistantship varies from department to department. The defining characteristic of this position across all departments and programs is a controlled, carefully monitored initial teaching opportunity. A teaching assistant may be responsible for 10 to 12 hours per week of discussion or laboratory supervision.",
    "prerequisites": "TATT 600 or equivalent transfer credit as prerequisite.",
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 2935, Section #: 1, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: T. Medina, Status: Open\nClass Nbr: 2957, Section #: 10, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Barber, Status: Open\nClass Nbr: 2959, Section #: 11, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: D. Ren, Status: Open\nClass Nbr: 2961, Section #: 12, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Dugan, Status: Open\nClass Nbr: 2965, Section #: 13, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: S. Hamann, Status: Open\nClass Nbr: 2967, Section #: 14, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: B. Yamasaki, Status: Open\nClass Nbr: 2970, Section #: 15, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: H. Gouzoules, Status: Open\nClass Nbr: 2973, Section #: 16, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: H. Rodman, Status: Open\nClass Nbr: 2976, Section #: 17, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: B. Wilson, Status: Open\nClass Nbr: 2979, Section #: 18, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: J. Manns, Status: Open\nClass Nbr: 2980, Section #: 19, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: G. Berns, Status: Open\nClass Nbr: 2937, Section #: 2, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: D. Edwards, Status: Open\nClass Nbr: 5625, Section #: 20, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: P. Kragel, Status: Open\nClass Nbr: 6489, Section #: 21, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: E. Walker, Status: Open\nClass Nbr: 6490, Section #: 22, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: S. Lourenco, Status: Open\nClass Nbr: 6491, Section #: 23, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: E. Johnson, Status: Open\nClass Nbr: This section is full 2938, Section #: 3, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: P. Moon, Status: Closed\nClass Nbr: 2945, Section #: 4, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: T. Medina, Status: Open\nClass Nbr: 2947, Section #: 5, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: S. Botto, Status: Open\nClass Nbr: 2949, Section #: 6, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: E. Respress, Status: Open\nClass Nbr: 2951, Section #: 7, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: A. Tasimi, Status: Open\nClass Nbr: 2953, Section #: 8, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: E. Kim, Status: Open\nClass Nbr: 2955, Section #: 9, Type: LEC, Campus: ATL, Meets: Does Not Meet, Instructor: A. Cohen, Status: Open",
    "date_accessed": "2024-03-30"
}