{
    "course_code": "FREN 471",
    "course_title": "Topics in French Thought: Civ.: Unconscious Impacts",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 11Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Content: Slips of the tongue, phobias, anxieties: what Freud identified as the \"unconscious\" makes its presence felt through various disruptions that conscious thought does not know how to explain to itself. To understand why the unconscious is formed and how it works is the task that Freud set for psychoanalytic thought. Such exploration led to a radical rethinking of sexuality and of the very notion of the 'self.' As we shall see, psychoanalysis extends and redefines the notion of 'sexuality' as it traces its impact on mental life. It also unsettles the conception of the self as a unified and monolithic construct to propose instead a dynamic conception of subjectivity as well as complex accounts of its formation.  \nThe course is 100% online, divided in synchronous (Zoom) classes and asynchronous required work: typically, 2 synchronous sessions followed by 1 asynchronous required work. Sometimes, however, we will have only one Zoom session followed by one asynchronous assignment. Zoom 'live' sessions will therefore meet, from 1:00PM to 2:15PM, at times on Monday, or Wednesday, or both.  \nReadings may include texts by Freud, Laplanche, Lacan, Dolto, Winnicott, and Pontalis. Texts will be available either electronically or through PEP archives (which can be accessed via Emory University library).",
    "course_description": "Taught in English, this course examines major French and Francophone intellectual developments, theoretical paradigms and critical methodologies.",
    "prerequisites": "FREN 310, FREN 314 and two 300 level FREN courses, or equivalent transfer credit as prerequisite.",
    "instructors": "Claire Nouvet - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 3036, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: C. Nouvet, Status: Open",
    "date_accessed": "2024-03-30"
}