{
    "course_code": "MESAS 190",
    "course_title": "Freshmen Seminar in MESAS: Introduction to Modern India",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "This course explores the image of 21st century India through mediums such as scholarly texts and films on the respective topics and is focused on the depicted reality vs. the historical reality. This course examines the Indian culture, society and history, and explores how concepts such as gender, caste, religion, and nation change over time. Many major themes in contemporary South Asia: such as the rise of (neo) nationalism, social hierarchies, the relationship between the politics and the corruption, and the role of religion; must be understood with reference to the turbulent years which shaped modern day India. We explore some of the major political, social, religious, and cultural developments within early modern, colonial, and postcolonial South Asia. Students are exposed to various sources (texts and videos) and learn how to read and evaluate primary and secondary texts, how to weigh evidence, and how to formulate a coherent historical argument.",
    "course_description": "Exclusively for first-year students. Seminar provides introduction to various historical, religious, cultural, and linguistic aspects of the Middle East and South Asia. Topics vary.",
    "prerequisites": null,
    "instructors": "Brajesh Samarth - Primary Instructor",
    "schedule_location": "TTh 4pm-5:15pm in New Psyc Bldg 225 (36 Eagle Ro",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 4811, Section #: 4, Type: SEM, Campus: ATL, Meets: TTh 4-5:15p, Instructor: B. Samarth, Status: Closed",
    "date_accessed": "2024-03-30"
}