{
    "course_code": "MESAS 270",
    "course_title": "Special Topics MESAS-200 Level: Religious Art of South Asia",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 4 / Seats Avail: 3Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Same as REL 270 11, ARTHIST 289 )\nThis course satisfies the new Religion major requirement:- Region, Theme.\nThis course takes an immersive approach to the study of the religious art of South Asia, ca. 2500 BCE to the present day. Course units will focus on the paintings, sculptures, and architecture of India, Pakistan, Nepal, and Tibet. We will examine Jain, Buddhist, Hindu, and Muslim religious art, asking how these material objects relate to religious texts and practices. While loosely chronological, the course is also structured around the contents of the Asian Collection at the Carlos Museum. Most weeks, we will spend one class meeting at the Carlos Museum. These class meetings, along with the readings and writing assignments, will also allow us to address a host of questions pertinent to the study of religion and art in general: What is art? How can art be understood as 'secular' or 'religious'? How can religious imagery be used to construct national identities, to sell a product, or to teach a philosophical doctrine? By examining the different ways in which various communities have used visual and material culture throughout a period of nearly 5,000 years, we can see more clearly the contingency of 'religion' and 'art' through specific contexts.",
    "course_description": "Special topics in Middle Eastern and South Asian Studies, at the 200 level; may be repeated when content varies.",
    "prerequisites": null,
    "instructors": "Aditya Chaturvedi - Primary Instructor",
    "schedule_location": "MWF 1pm-1:50pm in Tarbutton Hall 218",
    "course_resources": null,
    "sections": "Class Nbr: 5709, Section #: 2, Type: LEC, Campus: ATL, Meets: MWF 1-1:50p, Instructor: A. Chaturvedi, Status: Open",
    "date_accessed": "2024-03-30"
}