{
    "course_code": "THEA 385",
    "course_title": "Special Topics: Literature & Other Disciplines",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 3",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(Same as CPLT 333 1, ENG 389 1, PHIL 385 5)\nLiterary and cultural history brims with powerful, mythical female figures: Goddesses and sorceresses, plotting queens and evil stepmothers and femmes fatales. Turning away from this parade of overwhelming archetypes, this course will focus instead on representations of female power exercised by more ordinary women, drawing on ethics, aesthetics, psychoanalysis, and theories of performance to explore how feminine action and agency have been represented in theatre and film in diverse historical, linguistic, and cultural contexts.\n\n\nFrom Aristophanes Lysistrata, who persuaded Spartan and Athenian women to withhold their favors in order to stop the Peloponnesian War, to Brecht's Mother Courage wheeling and dealing to keep herself and her family afloat during The Thirty Years War, from Ibsen's Nora closing the door on her bourgeois existence to Garance claiming her freedom to love whom she wishes, these less exalted heroines have been depicted struggling both within and against the constraints of societal and cultural expectations. As those constraints loosened in the modern world and women gained new political, social, familial and sexual rights, theatre and performance also provided new artistic opportunities for reflection. Experimenting with gender roles and historical legacies, women writers represented new possibilities and life choices in plays that both reflect on and criticize the interlocking histories of racism and injustice, inherited gender roles, and myths and expectations about feminine power, desire, and identity. We will explore these evolving literary and cultural practices via a wide historical range of modes of representing and performing femininity in theatre and film.\n\n\nReadings may include: Aristophanes, Benjamin, Brecht, Butler, Carne, Case, Churchill, Dolan, Euripides, Freud, Ibsen, Kennedy, Lang, Nietzsche, Riviere, Rose.",
    "course_description": "Individual courses designed to introduce students to special topics in theater.",
    "prerequisites": null,
    "instructors": "Elizabeth Goodstein - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Callaway Center S105",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_THEA_385_4_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 5069, Section #: 4, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: E. Goodstein, Status: Open",
    "date_accessed": "2024-03-31"
}