{
    "course_code": "AAS 285",
    "course_title": "Special Topics in African American Studies: We Wear the Mask: Festival",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 15Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "HSC w/Race & Ethnicity Req.",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "(Same as AFS 270 3)\nTitle: We Wear the Mask: Festival, Carnival & Masquerade\n\n\nIn acts of mourning and in times of celebration, in solemn rites of passage and in elaborate performance, we decorate our faces and adorn our bodies. This course offers a comparative study of Black Atlantic masquerade traditions in initiation ceremonies, street festivals, carnivals, and funerary rites. Employing a material culture approach, we explore particularly \"festive\" sites such as the sacred city of Ilé-Ifè, Nigeria, which hosts festivals nearly 360 days of the year, a Caribbean carnival-capital in Jacmel, Haiti, and New Orleans traditions of Mardi Gras Indians and jazz funerals. Students will gain concrete skills in visual art analysis, becoming versed in art history, religion, anthropology, and museum studies. Ultimately, students will gain familiarity with numerous Africana parades, masquerades, funerals, and carnivals, and analyze the role of masks and art implements in private ritual ceremonies as well as public festivals.",
    "course_description": "Wide range of topics pertinent to the African American experience.",
    "prerequisites": null,
    "instructors": "Kyrah Malika Daniels - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in Tarbutton Hall 105",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_AAS_285_2_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3125, Section #: 2, Type: LEC, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: K. Daniels, Status: Open",
    "date_accessed": "2024-03-28"
}