{
    "course_code": "AAS 701",
    "course_title": "Proseminar in African American Studies",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 8 / Seats Avail: 8",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "This course is only open to African American Studies students.\nThis first-term introductory course is designed as a methods seminar in which students will have common readings for the first 3-4 weeks and the final 3-4 weeks of the Fall term. The common readings and facilitated discussions will focus on the origins of African American Studies as an interdisciplinary field and issues related to professionalization including research ethics, peer review and the publication process, and scholarly integrity, among other topics. For the rest of the course, AAS graduate faculty will introduce first-year students to research methods and approaches or theoretical models deployed in their own published research. Ph.D. students will read two articles or book chapters by each invited AAS graduate faculty as well as two to three articles or book chapters by other scholars whose work influenced the research methods and approaches of the invited faculty on a weekly basis. In this way, first-year students will be exposed to several research approaches within specific disciplines in the humanities, social sciences, and the arts represented by participating AAS graduate faculty.",
    "course_description": "The proseminar is a first-term introductory course designed as a methods seminar for new AAS PhD students. AAS PhD students only.",
    "prerequisites": null,
    "instructors": "Walter Rucker - Primary Instructor",
    "schedule_location": "M 2pm-5pm in Candler Library 212",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_AAS_701_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 4159, Section #: 1, Type: SEM, Campus: ATL, Meets: M 2-5p, Instructor: W. Rucker, Status: Open",
    "date_accessed": "2024-03-28"
}