{
    "course_code": "AAS 585R",
    "course_title": "Topics in African American Studies: Health Equity & Public Health",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 9 / Seats Avail: 8",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "AAS 585R, Health Equity & Public Health, is a graduate level examination of the multidisciplinary field of Public Health with a particular focus on health inequities in the United States. Undergraduates may also enroll. The class explores the history of US public health, key concepts and theories, research methods and intervention approaches. It clarifies what distinguishes public health from other health sciences, such as medicine.\nRates of death and disease vary across populations due to a variety of factors. The course examines the evidence linking specific risk factors to physical and mental health outcomes across diverse populations in the US. Public health is both an academic discipline and an applied profession. The class explores the implications of this. \nCritiques of Public Health often come from outside the field. In this course, however, students will read current and historical debates within the field to articulate the strengths and limitations from an insider's perspective.",
    "course_description": "A graduate seminar exploring a range of topics.",
    "prerequisites": null,
    "instructors": "Chandra Ford - Primary Instructor",
    "schedule_location": "Th 2pm-5pm in Candler Library 212",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_AAS_585R_2_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 4426, Section #: 2, Type: SEM, Campus: ATL, Meets: Th 2-5p, Instructor: C. Ford, Status: Open",
    "date_accessed": "2024-03-28"
}