{
    "course_code": "ENGRD 220W",
    "course_title": "Rhetorical Studies",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Continuing Writing Requirement",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "How does advertising work? Why do I react so strongly to one politician while the other one leaves me flat? How come my professor and I seem to never understand each other? Why is there such controversy over a particular issue? These questions are all questions which bring you into the realm of rhetoric. This class will give you a good basic understanding of rhetoric and why it matters in your life: both in thinking and acting.\nThis course is a trip. We'll travel back in time and across a good deal of geographical space to Ancient Greece and Rome, where democracy begat rhetoric (at least in one version of the story). By seeing rhetoric then, we'll gain a clearer vision of what it might become in our own lives and time. New perspectives and new language picked up on the journey will help us to become savvy about our own attempts, within our own rhetorical situations, to inform, impress, persuade, and enact purposes and values. We should also become better able to imagine what sort of person we need to become to have such influence, what skills to hone, what knowledge to gain, what thought processes to acquire as habits, and what kind of character to form. We'll talk about Greece, pop culture, advertising, drama, and you'll get lots of practice in thinking about persuasion and its role in culture. Textbooks will be provided by the professor.",
    "course_description": "Introduction to rhetoric and rhetorical analysis. While learning rhetorical tactics of Ancient Greece and Rome, students will apply that learning to their academic and vocational goals. Practice in writing and speaking, grounded in ethics, are central to the course.",
    "prerequisites": null,
    "instructors": "Joonna Trapp - Primary Instructor",
    "schedule_location": "TTh 4pm-5:15pm in Callaway Center N203",
    "course_resources": null,
    "sections": "Class Nbr: 4135, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 4-5:15p, Instructor: J. Trapp, Status: Open",
    "date_accessed": "2024-03-30"
}