{
    "course_code": "HLTH 330",
    "course_title": "Health Behind Locked Doors",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 19 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(In this course, we will focus on the physical and mental health concerns that are associated with two different types of institutions: disability-related residential institutions and prisons and jails. This consideration includes the health concerns that lead to institutionalization/incarceration and those that emerge because of this experience. Students will learn about how various factors influence these experiences and concerns including Historical factors, Socio-political, Infrastructural, Biological, and Attitudinal factors. We will pay particular attention to how race influences and intersects with these factors and situations. Students will learn about specific diseases and conditions along the way. Further, students will learn to discuss and represent these issues in ways that combine the above factors and translate them into an easily accessible format as well as critically analyze the ways these experiences are represented by others.)",
    "course_description": "In this class, we will focus on health concerns associated with two types of institutions: disability related residential institutions and prisons and jails. We will look at health concerns that both lead to institutionalization/incarceration and those that emerge because of this experience.",
    "prerequisites": null,
    "instructors": "Jennifer Sarrett - Primary Instructor",
    "schedule_location": "W 2:40pm-3:55pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 3131, Section #: 1, Type: LEC, Campus: ATL, Meets: W 2:40-3:55p, Instructor: J. Sarrett, Status: Open",
    "date_accessed": "2024-03-30"
}