{
    "course_code": "HLTH 210",
    "course_title": "Predictive Health and Society",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 95 / Seats Avail: 6Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as ANT 231 1)\n(Health impacts virtually every societal element - from medicine to law; economics to faith. It is every individual's concern, and a topic of consequence in the decisions we make regardless of what professional field we pursue. This course introduces students to the efforts seeking to define health and move the practice of medicine from a reactive, disease-focused system to a proactive health-focused one. Students will have the opportunity to engage in this shift in thinking through the course emphasis on the interconnections between mind, body and spirit. Students will gain a better understanding of healthy human function as well as diet, exercise, behavioral motivation and interpersonal interactions. Multidisciplinary topics include the perspectives of business, law, ethics, humanities, engineering, nursing, religion, public and global health, as well as the sciences.)",
    "course_description": "This course introduces the evidence base for the science of health and emphasizes STEM educational translations to the population, clinic and individual levels. Innovative efforts are needed to drive changes in health care from a reactive, disease-focused system to a proactive health-focused one.",
    "prerequisites": null,
    "instructors": "Michelle Lampl - Primary Instructor",
    "schedule_location": "Th 1pm-2:15pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 3067, Section #: 1, Type: LEC, Campus: ATL, Meets: Th 1-2:15p, Instructor: M. Lampl, Status: Open",
    "date_accessed": "2024-03-30"
}