{
    "course_code": "HLTH 331",
    "course_title": "Disability & Bioethics",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 30 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(This course uses case studies to explore bioethical issues related to disability: including end of life decision-making, prenatal diagnoses, bio- and neuro-technologies, right to life, and significant disability. Traditional biomedical and bioethical perspectives of this issues will be presented as well as those from the disability studies literature, an approach that aims to ensure civil and human rights are protected and aims to increase the visibility and tolerance of difference in our communities. Students will first master the foundational theories of bioethics, disability, and disability studies in order to fully understand the perspectives that are brought to course topics. Students will also be considering the role the media and legal precedents have in these issues. Throughout the semester, students will be thinking and writing about current news items that relate to the body, technology, and disability. In this way, students will develop a critical eye for these issues in the media and learn to apply the theoretical and practical backgrounds of bioethics and disability studies to the most contemporary concerns of the fields. In order to ensure the course's topics are relevant to contemporary concerns, the course will have a section on Neuroethics and Neurodiversity, the branch of both fields that focus on the mind, psychiatry, and intellectual disability.)",
    "course_description": "This course explores bioethical issues related to disability. Focuses on foundational theories of bioethics, disability, and disability studies and apply these to contemporary concerns. Examines traditional biomedical and bioethical perspectives, as well as those from disability studies literature.",
    "prerequisites": null,
    "instructors": "Jennifer Sarrett - Primary Instructor",
    "schedule_location": "W 11:20am-12:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 3919, Section #: 1, Type: SEM, Campus: ATL, Meets: W 11:20a-12:35p, Instructor: J. Sarrett, Status: Open",
    "date_accessed": "2024-03-30"
}