{
    "course_code": "HLTH 385",
    "course_title": "Special Topics: Human Health: When Bodies Don't Matter",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 8 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Same as WGS 385 3)\n(Why are some deaths 'expected'? Why, during COVID, are there are at least five Black deaths for every white one? Why is Springfield, MA the #1 'Asthma capital' in the U.S.? Why do babies born to Black women in the United States die at more than double the rate of babies born to white women? And, perhaps paradoxically, how is white identity politics producing catastrophic health outcomes for Trump supporters? Racism is a public health issue. But how, exactly, does race come to matter for health? How do we theorize the processes and structures which condition Black, Brown, and even some white life as proximate to debility and death? This interdisciplinary seminar examines the relationships among disease, health, and social inequality in the U.S. A range of topics will be covered, including: concepts of health & disease; U.S. health disparities; the social, economic, and political factors affecting mortality, morbidity, and quality of life; understandings of human difference, and the ways they are used to explain or justify disparities; the embodiment of inequality; state-sanctioned and structural violence; the commodification of human bodies, and the health effects of neoliberal economic policies; and health equity and justice.)",
    "course_description": "Seminar of lecture series of topics in human health. May be repeated for credit when topic varies. Credit varies from one to four hours.",
    "prerequisites": null,
    "instructors": "Katrina Karkazis - Primary Instructor",
    "schedule_location": "M 4:20pm-5:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 4850, Section #: 8, Type: LEC, Campus: ATL, Meets: M 4:20-5:35p, Instructor: K. Karkazis, Status: Wait List",
    "date_accessed": "2024-03-30"
}