{
    "course_code": "HLTH 385",
    "course_title": "Special Topics: Human Health: Double burden of Malnutrition",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 4Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(Malnutrition is 'bad' nutrition, due either to excesses or deficiencies. Historically, obesity was a problem exclusive to high-income countries and undernutrition was a problem exclusive to low- and middle-income countries. With the growing global obesity epidemic, diet-related non-communicable diseases are increasingly important causes of morbidity and mortality in low-and middle-income countries. These countries have a health infrastructure developed to address undernutrition; which remains a public health problem, while simultaneously having to contend with the growing challenge of obesity-related health problems. In this course, we will cover the history and evolution of nutrition problems in high-, middle- and low-income countries, as well as the interventions designed to improve them. We will compare the prevalence of the double burden of malnutrition in high-, middle- and low-income countries. We will critique interventions that improve one type of malnutrition while inadvertently contributing to another kind of malnutrition. And, we will examine options for reducing both types of malnutrition simultaneously.)",
    "course_description": "Seminar of lecture series of topics in human health. May be repeated for credit when topic varies. Credit varies from one to four hours.",
    "prerequisites": null,
    "instructors": "Helena Pachon - Primary Instructor",
    "schedule_location": "T 9:40am-10:55am in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 3092, Section #: 6, Type: LEC, Campus: ATL, Meets: T 9:40-10:55a, Instructor: H. Pachon, Status: Open",
    "date_accessed": "2024-03-30"
}