{
    "course_code": "PHIL 385W",
    "course_title": "Special Topics in Philosophy: Intro to Postcolonial Theory",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 2 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Same as CPLT 389W-1 & ENG 389W-2\n\n\n\"Introduction to Postcolonial Theory\" | Postcolonial theory is an interdisciplinary field of scholarly study that addresses the relations between race, ethnicity, culture, and power after the global decline of European colonialism over the course of the nineteenth and twentieth centuries. As its name suggests, postcolonial theory is indebted both to anticolonial thought and to poststructuralist theory. Although some knowledge of either anticolonial thought or poststructuralist theory would be welcome, it is not required for this course.\n\n\nIn this course, we will read selected texts by the postcolonial scholars Edward W. Said, Gayatri Chakravorty Spivak, Homi K. Bhabha, Ranajit Guha, Partha Chatterjee, V.Y. Mudimbe, Kwame Anthony Appiah, Trinh T. Minh-ha, Chandra Talpade Mohanty, Stuart Hall, Arjun Appadurai, Paul Gilroy, Kobena Mercer, Cornel West, bell hooks, Gloria Anzaldúa, Coco Fusco, Lisa Lowe, Rey Chow, Dipesh Chakrabarty, Pheng Cheah, and Achille Mbembe. Although our class discussions will be based on our assigned reading, we may also draw from literature, art, film, and music from outside our course in addressing the issues of colonialism, race, gender, language, culture, and representation.\n\n\nFour (4) response papers #1 (2-3 pp. each, 40% total)\nLong essay (8-10 pp., 40%)\nAttendance and participation (20%)\n\n\nAll required readings will be made available in electronic format on Course Reserves.",
    "course_description": "Selected topics and problems in philosophy. Content will vary in successive offerings of this course. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Sean Meighoo - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in Callaway Center S104",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 4579, Section #: 2, Type: LEC, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: S. Meighoo, Status: Closed",
    "date_accessed": "2024-03-30"
}