{
    "course_code": "PHIL 385",
    "course_title": "Special Topics in Philosophy: Women and the Law",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 3 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Same as WGS 358 1, CPLT 389 6, AAS 385 8)\n\"Women and the Law\": historically, politically, and socio-culturally, these two formations have a long-standing relationship with one another. They shape one another even insofar as the latter has also historically enervated the former's rights and possibilities. Similarly, the two terms, \"woman\" and \"law,\" are often contested terrains in their respective meanings, interpretations, and their roles in culture, society, and the unconscious. These moments are even more intensified in the ways they have been racialized and stand within a longer racial history of terror (colonialism, slavery, mass incarceration). To this extent, the course begins by examining the racial construction of gender and how the law becomes a tool of racial, ethnic, sexual, and gender repression and oppression. It will explore cases in slave law to broaden its view on constitutional and statute law as well as other concepts of laws (e.g. psychic, notions of sexual difference, aesthetic, language). Throughout, attention will be given to film and media representations of law, gender, and race to consider our course explorations. The course centers black feminist thought and critical race theory as its main analytic lens and will examine how these two intellectual and political traditions remain critical in our contemporary landscape.",
    "course_description": "Selected topics and problems in philosophy. Content will vary in successive offerings of this course. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Linette Park - Primary Instructor",
    "schedule_location": "MW 4pm-5:15pm in Candler Library 123",
    "course_resources": null,
    "sections": "Class Nbr: 6619, Section #: 7, Type: LEC, Campus: ATL, Meets: MW 4-5:15p, Instructor: L. Park, Status: Wait List",
    "date_accessed": "2024-03-30"
}