{
    "course_code": "ENG 214W",
    "course_title": "Global Literature In English",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Topic: Postcolonial Literature and the Idea of Home)\n(What is \"home\"? Do you think of it as a place, a people, a memory? How do you relate your sense of identity to the space you call home? How does your sense of belonging interact with the world at large, influencing and determining how you inhabit other spaces? What happens when you don't feel welcome anymore or anywhere?\nIn this course, we will explore how writers from formerly colonized spaces across South Asia, Africa and the Caribbean tackle these questions in the wake of formal independence. We will interrogate how postcolonial writers construct and inflect the notion of home to reflect on issues such as identity, violence, language, education, nationalism, globalization, immigration, and the environment.\nWe will read fiction, non-fiction, and poetry from the 20th and 21st centuries to examine the haunting legacies of imperialism and their unsettling effects on postcolonial representations of \"home\". Assignments will include weekly blog posts, presentations, and critical essays. Texts may include works by Sa'adat Hasan Manto, Tsitsi Dangarembga, Amitav Ghosh, Jamaica Kincaid, Frantz Fanon etc.)",
    "course_description": "An exploration of Anglophone literatures from around the world. Regional focus and selection of texts will vary but may include works by Achebe, Cliff, Friel, Head, Lamming, Rushdie, Silko, Soyinka, Tan, and/or Walcott.",
    "prerequisites": null,
    "instructors": "Ishanika Sharma - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Anthropology Building 105",
    "course_resources": null,
    "sections": "Class Nbr: 3151, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: I. Sharma, Status: Open",
    "date_accessed": "2024-03-30"
}