{
    "course_code": "ENG 190",
    "course_title": "Freshman Seminar:English: Poetry in Crisis",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Freshmen Seminar - Limited to First Year Students Only)\n(This freshman seminar focuses on the role of poetry in a time of crisis.  It springs from a 2020 lockdown initiative to share Black and Pandemic Poetry chosen by students and faculty in the Emory English department.  Using these poems as a springboard and unofficial anthology for the class, we will discuss the role of poetry in our contemporary moment.  Poetry has always been a site of consolation, but also of protest. In this time of great unrest and uncertainty, what can we ask of a poem? Do we turn to poetry as a source of consolation or warning? Does it inspire anger or hope? In what ways do familiar lines take on new resonance in our current crises? No previous knowledge of poetry is required but students are expected to read widely and to explore many different kinds of poems.)",
    "course_description": "Every semester. Freshmen only. Through readings on variable topics, frequent writing assignments, and in-class discussions, the seminar emphasizes reasoned discourse and intellectual community. Does not satisfy first-year writing requirement.",
    "prerequisites": null,
    "instructors": "Geraldine Higgins - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Anthropology Building 107",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3057, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 1-2:15p, Instructor: G. Higgins, Status: Wait List",
    "date_accessed": "2024-03-30"
}