{
    "course_code": "ENG 290W",
    "course_title": "Topics in Literary History: Afro-Surrealism&Afro Pessimism",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Same as AAS 285W 1)\n(Complete Topic - Marvelous Terror: Afro-Surrealism & Afro Pessimism)\n(How do we imagine new worlds in the midst of racial-colonial terror? Worlds that forge new timelines, new marvels, and new opportunities to escape the clutches of antiblack violence? Or is escape futile in relation to our present reality, a strange opposition between Humanness and Blackness that coheres the world as we know it? This course explores how the enterprises of Afro-surrealism and Afro-pessimism respond to or generate this line of inquiry. Tracing their historical emergence and revival in popular culture, from Franz Fanon and Frank Wilderson III to Get Out and Black Mirror, we will encounter key debates in Black Studies enriched by AP/AS. Students will practice applying critical theory to literary, visual, and performance analysis; connecting the role of the psyche to artistic creation and consumption; and writing across expressive mediums. The course also serves as a general introduction to surrealism, namely its early European proponents and relevant psychoanalytic concepts (e.g. object relations, unheimlich, automatism) as well as to AP. Key themes include weirdness, the occult, time, humanism, fantasy worlds, enslavement, and terrorism. Figures may include Basquiat, Childish Gambino, the Césaires, Beyoncé, Toni Morrison, Calvin Warren, and Colson Whitehead)",
    "course_description": "Long historical surveys of national, regional, or ethnic traditions; or of genres or subgenres. Examples: History of African Literature, History of Latinx Literature, History of Science Fiction, History of the Sonnet, History of Southern U.S. Literature, History of Drama.",
    "prerequisites": null,
    "instructors": "Brenton Boyd - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in Candler Library 101",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 4718, Section #: 3, Type: LEC, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: B. Boyd, Status: Wait List",
    "date_accessed": "2024-03-30"
}