{
    "course_code": "ENG 256W",
    "course_title": "British Literature Since 1660",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 16Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Topic:  British Literature 1660-1930: Liberty and Subjection)\n(This course aims to not only inform students of major works in British literature from the Restoration period to the early twentieth century but also traces the historical development of liberal subject along with scientific discoveries, political and social revolutions, and imperial and colonial expansion. We will discuss the conflict between liberty and subjection in works by Mary Astell, Jonathan Swift, Mary Wollstonecraft, John Keats, Mary Shelley, J. S. Mill, Elizabeth Barrett Browning, Alfred Tennyson, John Ruskin, Charles Darwin, George Bernard Shaw, Virginia Woolf, Rebecca West, Wilfred Owen, and T. S. Eliot. Students are expected to produce weekly reading response journals, three short close-reading pieces, and one multimodal adaptation. Through close reading and critical analysis, students will learn how to interpret literary works within specific contexts and how to associate literature studies with larger social concerns.)",
    "course_description": "Readings in English literature written from 1660 to the early twentieth century, with attention to cultural and historical backgrounds.",
    "prerequisites": null,
    "instructors": "Ruixue Zhang - Primary Instructor",
    "schedule_location": "MW 8:30am-9:45am in Callaway Center S109",
    "course_resources": null,
    "sections": "Class Nbr: 3712, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 8:30-9:45a, Instructor: R. Zhang, Status: Open",
    "date_accessed": "2024-03-30"
}