{
    "course_code": "ENG 290W",
    "course_title": "Topics in Literary History: Black Women's Lifewriting",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Complete Topic: The Rhetorical Tradition of Black Women's Lifewriting) \n(Black writers across the African Diaspora have long embraced the autobiographical impulse as a means of writing themselves, and their communities, into the pages of history. Moving beyond the limitation of mere nonfiction, this course focuses on the literary expanse of lifewriting, considering how Black writers narrativization of Black life in multiple genres functions as an aesthetic choice and rhetorical method. Moreover, we will unpack how Black women specifically have used lifewriting in essays, memoirs, drama, and poetry, to offer a multiplicity of voices which narrate both loud spectacles of violence as well as quiet and quotidian moments of radical resistance. This course will survey the tradition of Black women's lifewriting, from the late 19th century through today, focusing on themes of fugitivity, mobility, exile, and homecoming. We will look at texts from writers like Harriet Jacobs, Zora Neale Hurston, June Jordan, Jesmyn Ward, and more.)",
    "course_description": "Long historical surveys of national, regional, or ethnic traditions; or of genres or subgenres. Examples: History of African Literature, History of Latinx Literature, History of Science Fiction, History of the Sonnet, History of Southern U.S. Literature, History of Drama.",
    "prerequisites": null,
    "instructors": "Ariel Lawrence - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in 1462 Clifton Rd 123",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3150, Section #: 2, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: A. Lawrence, Status: Wait List",
    "date_accessed": "2024-03-30"
}