{
    "course_code": "ENG 359W",
    "course_title": "Studies in African American Literature: 1900 to Present: Black Women's Speculative Fict",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 12Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "HAPW w/Race & Ethnicity Req.",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Complete Topic: Black Women's Speculative Fiction)\nIn this course we will be reading three major authors: Octavia Butler, Nalo Hopkinson and N.K. Jemisin, in greater depth to discuss how their texts approach the very real threats to human existence in hypothetical futures. Along the way we will look at how they reinvent race, explore notions of the post-human, and provoke questions of belonging all the while focused on women and girls' sociopolitical agency. All three authors understand women of color to be central to combating the dangers of hierarchical systems that favor one type of human being over another, yet do so in compellingly different ways. Even if you love speculative fiction, do not take this class unless you can read between 200-250 pages of fiction per week (most speculative fiction novels by these women are long). There will be weekly writing assignments, with class participation playing a key part in your final grade. There will also be one midterm of 5-7 pages (1250-1750 words) and one final paper of 10-12 pages (2500-3000 words). Finally, there will be fun.",
    "course_description": "A topics course dealing with major traditions and issues in African American literature from 1900 to the present. Possible topics include passing and miscegenation, black novels since 1950, Afrofuturism, and black theater.",
    "prerequisites": null,
    "instructors": "Michelle Wright - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Callaway Center S109",
    "course_resources": null,
    "sections": "Class Nbr: 4851, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: M. Wright, Status: Open",
    "date_accessed": "2024-03-30"
}