{
    "course_code": "ENG 330W",
    "course_title": "Romanticism",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 10Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "Reading a wide array of texts drawing on lyric poetry, literary manifestos, slave narratives, plays, and personal letters, this course addresses romantic era writing with attention to themes of freedom, imagination, and autobiography. The romantic era roughly from the 1780's through the 1830's--was a time of highly charged debates about the role of literature in an increasingly modern society; the texts we will read explore different ways in which key writers of the time addressed the role of literature amidst the pressures of both economic and political upheaval. We will consider how these debates transformed the very language of literature and who and what counted as literary subjects. Figures an earlier literature might not have recognized as having a place in a supposedly elevated literary discourse enter romantic literature both as objects of representation and as the subjects of their own self-representation. And literature \"itself\" makes a radical claim for its own creative and sustaining powers.",
    "course_description": "Selected works of Romantic literature with an emphasis on poetry, including poets such as Smith, Blake, Wordsworth, Coleridge, Byron, Shelley, and Keats, as well as selections from prose writers such as Hazlitt and DeQuincey.",
    "prerequisites": null,
    "instructors": "Deborah Elise White - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in Callaway Center S105",
    "course_resources": null,
    "sections": "Class Nbr: 3146, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: D. White, Status: Open",
    "date_accessed": "2024-03-30"
}