{
    "course_code": "ENG 370W",
    "course_title": "Introduction to Digital Humanities",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "Across the university, data science is changing how we think about knowledge. Can it change how we think about literature, too? Scholars have begun gathering data to better understand how white supremacy reproduces itself in the publishing industry in the United States. Data on which poets win which prizes and who serves on the prize committees shows how important interpersonal relationships have been to the history of poetic prestige. Bestseller lists tell us a lot about how popularity has changed over time. AI has made rapid advances in the last few years to the point where creative writers are collaborating with it to compose their stories.\nAI, data, the internet are already changing how writers write. In this course, students might read Instagram poets and Twitter fiction alongside new 'internet' novels by Patricia Lockwood and Lauren Oyler. \nNo experience with computer programming or data science necessary.",
    "course_description": "Digital humanities involves the use of computational methods in humanistic research, and it analyzes the socio-cultural implications of digital technologies. This course introduces the field's central methods and debates about their use, culminating in a final project guided by the instructor.",
    "prerequisites": null,
    "instructors": "Dan Sinykin - Primary Instructor",
    "schedule_location": "MW 4pm-5:15pm in Candler Library 101",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3118, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 4-5:15p, Instructor: D. Sinykin, Status: Wait List",
    "date_accessed": "2024-03-30"
}