{
    "course_code": "ENG 389W",
    "course_title": "Special Topics:Literature: Youth Literature & WNDB",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Complete Topic: Youth Literature & The We Need Diverse Books Movement)\n(The long-running fight for increased diversity in children's literature entered a new chapter in 2014 with the emergence of We Need Diverse Books (WNDB). #WeNeedDiverseBooks launched as a Twitter campaign in response to an all-white BookCon panel of 30 youth literature authors. WNDB quickly developed into a non-profit organization and powerful social movement. In her highly influential 1990 work, Rudine Sims Bishop contends that children need books to serve as \"windows,\" \"mirrors,\" and \"sliding glass doors.\" Uma Krishnaswami adds \"prisms\" to that list. Christopher Myers adds \"maps.\" How do diverse children's and young adult books enable readers to see themselves, empathize with others, see their intersectional realities in a fresh light, and map the course of their futures? This question will guide our course. We will focus primarily on recent youth literature by US-based writers directly involved with WNDB. We will read texts by many authors, likely including Kelly Yang, Cynthia Leitich Smith, Nic Stone, Elizabeth Acevedo, Walter Dean Myers, Jacqueline Woodson, and Mike Jung. While we will read several literary titles together, students will have opportunities to select titles independently based on their own interests, too. We will also enter broader conversations about youth literature and diversity in literary/cultural studies scholarship, the publishing industry, public libraries, K-12 schools, and communities.)",
    "course_description": "Literary topics vary. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Mandy Suhr-Sytsma - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in New Psyc Bldg 220 (36 Eagle Ro",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3133, Section #: 4, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: M. Suhr-Sytsma, Status: Wait List",
    "date_accessed": "2024-03-30"
}