{
    "course_code": "ENG 388W",
    "course_title": "Topics in Lit. & Environment: Ecopoetry in the Anthropocene",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 2Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "Topic: Ecopoetry in the Anthropocene; \nNature poetry is as old as poetry itself, but recent decades of changing scientific understanding have brought ecology and human planetary impacts to the center of poetic consciousness. In this Anthropocene present, when one species has become the dominant force of environmental change, \"nature\" takes on new meanings and so does the poetry it evokes. We will explore how some of today's most creative poetic thinkers are finding voice and vision in the natural world.  Our discussions will concentrate on late 20th and early 21st-century poets, primarily from the U.S. but also England and Australia, including A.R. Ammons, Wendell Berry, Camille Dungy, Forrest Gander, Jorie Graham, Joy Harjo, Robert Hass, Jane Hirshfield, Denise Levertov, Alice Oswald, Adrienne Rich, Ed Roberson, Pattiann Rogers, Gary Snyder, and Charles Wright.\nRequirements: Participation, regular response papers (two of which can be poems replying to poems), an oral report, two tutorial meetings during the term, and two longer essays.",
    "course_description": "A study of literary works of various genres and other imaginative writing about the relation of humans to the non-human world. Approaches may focus on particular genres, periods, or themes (e.g.,\necofiction, ecopoetry, literature of climate change, multispecies writing, animal ethics, etc.).",
    "prerequisites": null,
    "instructors": "John Sitter - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in Callaway Center S105",
    "course_resources": null,
    "sections": "Class Nbr: 3120, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: J. Sitter, Status: Open",
    "date_accessed": "2024-03-30"
}