{
    "course_code": "ENG 389W",
    "course_title": "Special Topics:Literature: 20th Century American Poetry",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 20Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "If, as Robert Lowell claimed, A poem is an event, not the record of an event, it follows that we ought to be able to construct a history in poems and then examine each item in the sequence as a thing that happened. Twentieth Century American Poetry will try to do just that to discover what kinds of things happened, and didn't happen in American poetry published between the Spanish-American War and 9/11. We will do close readings of poems by approximately fifty writers in chronological order. We will take up each ambiguous verbal artifact in the sequence to try to understand what it is, how it bodies forth meanings, and whether and how it constitutes itself as continuous with (related to?) or distinct from past poems. Some of our thinking will be informed by close looking at drafts and correspondence held in Emory's Stuart A. Rose Manuscript and Rare Book Library. A visit with the Vega String Quartet will help us hear the sounds of the 20th century. Every week students will write specific, detailed, and accurate examinations of texts encountered, and these will be revised into a final portfolio of polished writing.",
    "course_description": "Literary topics vary. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Daniel Bosch - Primary Instructor",
    "schedule_location": "TTh 8:30am-9:45am in Ignatius Few Building_131",
    "course_resources": null,
    "sections": "Class Nbr: 3021, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 8:30-9:45a, Instructor: D. Bosch, Status: Open",
    "date_accessed": "2024-03-30"
}