{
    "course_code": "ENG 389W",
    "course_title": "Special Topics:Literature: Lit.of the American Jazz Age",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 22Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "Content: It was an age of miracles, it was an age of art, it was an age of excess, and it was an age of satire, F. Scott Fitzgerald wrote in his 1931 retrospective, Echoes of the Jazz Age. In this course we will examine the writing of the American 1920s in the context of the art, publishing, music, film, fads, and fashion of the decade--the objective to develop a deeper understanding of its most distinctive achievements in literature, its legacies, and the worlds in which American writers lived at the time.\nTexts: No electronics in class. Hard copies of the texts are available through the Emory bookstore; through used book sellers and often in very inexpensive copies; and in most libraries. Fitzgerald, This Side of Paradise, Flappers and Philosophers; Hemingway, Men Without Women; Nella Larsen, Complete Fiction of Nella Larsen; Anita Loos, Gentlemen Prefer Blondes and Gentlemen Marry Brunettes; Faulkner, The Sound and the Fury; Jean Toomer, Cane; Langston Hughes, The Weary Blues; Edna Ferber, Show Boat. Shorter readings tba.\nWork: Papers, midterm; independent research; final paper. Attendance policy.",
    "course_description": "Literary topics vary. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Barbara Ladd - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in Callaway Center S109",
    "course_resources": null,
    "sections": "Class Nbr: 3095, Section #: 2, Type: LEC, Campus: ATL, Meets: TTh 1-2:15p, Instructor: B. Ladd, Status: Open",
    "date_accessed": "2024-03-30"
}