{
    "course_code": "ENG 388W",
    "course_title": "Topics in Lit. & Environment: Climate Fiction and Empire",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 12Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Same as ENVS 385W 1)\nWe all experience climate change. But it affects us unequally. As a large and still growing body of research shows, the worst impacts of climate change cut across racial, ethnic, gendered, class, and geographic axes. Global empire, colonialism, settler colonialism, and capitalism laid the foundations for these inequitable distributions. How do the twin histories of empire and climate change shape recent literature, and how does literature respond in turn? In this class, we will read multiethnic, Indigenous, and postcolonial authors' Jesmyn Ward, Amitav Ghosh, Cherie Dimaline, Alexis Wright, and Hanya Yanagihara whose work explores climate change's past, present, and possible futures. We will also likely read a selection of stories, poetry, and film, while supplementing them with critical texts. In this continuing writing course, assignments will emphasize community engaged and public facing writing. For example, there will be opportunities to pursue climate change communication projects with the Office of Sustainability Initiatives and Emory Climate Talks. The course will be of special interest to students looking for practical experience as climate communicators.",
    "course_description": "A study of literary works of various genres and other imaginative writing about the relation of humans to the non-human world. Approaches may focus on particular genres, periods, or themes (e.g.,\necofiction, ecopoetry, literature of climate change, multispecies writing, animal ethics, etc.).",
    "prerequisites": null,
    "instructors": "Mitch Murray - Primary Instructor",
    "schedule_location": "TTh 4pm-5:15pm in Callaway Center S109",
    "course_resources": null,
    "sections": "Class Nbr: 3711, Section #: 3, Type: LEC, Campus: ATL, Meets: TTh 4-5:15p, Instructor: M. Murray, Status: Open",
    "date_accessed": "2024-03-30"
}