{
    "course_code": "ENG 495RW",
    "course_title": "Honors Thesis",
    "credit_hours": "Varies by section",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Varies by section",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Continuing Writing Requirement",
    "permission": "Department Consent Required",
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": null,
    "course_description": "Every semester. Credit, variable; may be repeated for a maximum of eight hours of credit. Prerequisite: approval of adviser and the director of undergraduate studies. Open to students writing honors theses.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: This section is full 5270, Section #: 1, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Yates-Richard, Status: Closed\nClass Nbr: This section is full 6415, Section #: 10, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: P. Kelleher, Status: Closed\nClass Nbr: This section is full 6434, Section #: 11, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. Bahri, Status: Closed\nClass Nbr: 5868, Section #: 2, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: E. Davenport, Status: Open\nClass Nbr: This section is full 5869, Section #: 3, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: L. Otis, Status: Closed\nClass Nbr: This section is full 5864, Section #: 4, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Yates-Richard, Status: Closed\nClass Nbr: This section is full 5865, Section #: 5, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: E. Kanesaka, Status: Closed\nClass Nbr: This section is full 5885, Section #: 6, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: S. Higinbotham, Status: Closed\nClass Nbr: This section is full 5944, Section #: 7, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: B. Ladd, Status: Closed\nClass Nbr: This section is full 6377, Section #: 8, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: E. Kanesaka, Status: Closed\nClass Nbr: This section is full 6402, Section #: 9, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: P. Cahill, Status: Closed",
    "date_accessed": "2024-03-30"
}