{
    "course_code": "ENG 489",
    "course_title": "Special Topic Adv. Study: English: True Crime",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 2Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "This course will cover the history of the true crime genre, including its current explosion of popularity. Sources will include print literature, documentary film and television, and podcasts. We will explore multiple aspects of the genre: its conventions, its pleasures, the moral dilemmas it poses for its fans, its participation in the criminal justice system and carceral culture, its relation to historical norms and stereotypes about race, gender, sexuality, region, social class, and religion.\nContent warning: Many of the texts we will study are about murder and sexual violence and include explicit details like autopsy reports, crime scene photos, witness accounts, and confessions. We will encounter misogyny, homophobia, transphobia, racism, class contempt, and other forms of bigotry. There will be situations of betrayal, family strife, violence inflicted on children, substance abuse, mental illness, and injustice that may be disturbing to you. Please consider carefully if you are able to engage with this kind of material for a full semester.\nThis is a combined senior and graduate seminar. Graduate students will have additional readings and guidelines for projects.\nRequirements: Three short papers and a longer research paper, which may take the form of a podcast script.\nTexts (tentative): In Cold Blood, I'll Be Gone in the Dark, Serial, Atlanta's Missing and Murdered, Evidence of Things Not Seen, Buried Truths, The Fall Line, True Crime Obsessed, In The Dark",
    "course_description": "Intensive study of specific literary topics, e.g., questions of form or history, or concentrations on one or more authors or literary movements. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Catherine Nickerson - Primary Instructor",
    "schedule_location": "Th 1pm-3:45pm in Callaway Center N203",
    "course_resources": null,
    "sections": "Class Nbr: 4883, Section #: 1, Type: SEM, Campus: ATL, Meets: Th 1-3:45p, Instructor: C. Nickerson, Status: Open",
    "date_accessed": "2024-03-30"
}