{
    "course_code": "ENG 489W",
    "course_title": "Special Top Adv Study:English: Very Contemporary Literature",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 10Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "Course Description: \nHas the novel , as a literary form, changed in some fundamental way in recent years? This is the question we will investigate in this course. Developments such as the popular emergence of the genre of autofiction (autobiographical fiction) and the ubiquity of social media have threatened to erode whatever distinction previously stood between fiction and nonfiction. So, at least, argues scholar Timothy Bewes, who goes yet further, arguing not only that we live in an age of postfiction, but that we are living in through an irreparable split, a disconnection, between the novel and the world. We will put his argument to the test, reading his book alongside four acclaimed and very recent novels. Students will practice the craft of close reading as a genre of argumentation in dialogue with Bewes through the novels at hand, expanding their arguments for a midterm and final essay.",
    "course_description": "Intensive study of specific literary topics, e.g., questions of form or history, or concentrations on one or more authors or literary movements. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Dan Sinykin - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in Callaway Center S102",
    "course_resources": null,
    "sections": "Class Nbr: 6323, Section #: 4, Type: SEM, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: D. Sinykin, Status: Open",
    "date_accessed": "2024-03-30"
}