{
    "course_code": "ENG 789",
    "course_title": "Special Topics In Literature: Literature and Justice: Writer",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 3 / Seats Avail: 3",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Same as CPLT 751R 2, FREN 780 3)\n\"Literature & Justice: Writers on Trial\" | This course will ask; Why are literary writers repetitively put on trial, and how in turn do they put on trial culture and society? What is the role of art and literature as (willing or unwilling) legal actors, and as political performers in the struggles over ethics and the struggles over meaning?\nThe course will focus on exemplary historical cases of conflicts between literature and law and of encounters between poetry, vulnerability, laughter, cry, desire, justice and injustice, comedy and tragedy, courage, language, silence, beauty. \nPARTICULARS: 2 short papers, one mid -term and another at the end of the semester; regular attendance and participation in class discussions; oral (brief) presentations when assigned.\nAdvanced undergraduates who are recommended by their Professors may be considered for the course. Please email Dr. Shoshana Felman (sfelman@emory.edu) directly & CC Kathy Ly-Nguyen (klynguy@emory.edu).\n\n\nPlato, The Trial and Death of Socrates (Apology, Crito, Paedo); Gustave Flaubert, Madame Bovary; Three Tales; Charles Baudelaire, Flowers of Evil; The Essence of Laughter; Emile Zola, J'accuse; Oscar Wilde,The Picture of Dorian Gray; Lady Windermere's Fan; The Ballad of Reading Gaol.\n\n\nPARTICULARS: 2 short papers, one mid -term and another at the end of the semester; regular attendance and participation in class discussions; oral (brief) presentations when assigned.\n\n\nAdvanced undergraduates who are recommended by their Professors may be considered for the course. Please email Dr. Shoshana Felman (sfelman@emory.edu) directly & CC Kathy Ly-Nguyen (klynguy@emory.edu).",
    "course_description": "Various topics, such as theoretical, generic, or cultural studies of literature.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 5057, Section #: 5, Type: SEM, Campus: ATL, Meets: Does Not Meet, Instructor: Staff, Status: Open",
    "date_accessed": "2024-03-30"
}