{
    "course_code": "NBB 370W",
    "course_title": "Special Topics in NBB: Neuro Science Writing",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 0Waitlist Total: 28",
    "waitlist_total": ": 28",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Continuing Communication(*)",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "NBB 370 W  (Neuro) Science-Writing:\nMany fascinating neuroscience concepts can be difficult for non-scientists to understand given challenges with depth of content and technical language. Sometimes, rifts in understanding between the neuroscience community and the lay public can be benign, but in many situations, the gaps in knowledge can lead to consequences for public, societal, cultural, and governmental/policy-based realms. High rates of misinformation and disinformation also create problematic barriers that compromise public understanding of neuroscience concepts, treatments, research, and stories. With these challenges in mind, this Calderwood Seminar in Public Writing course allows students to explore popular and/or sensational neuro-relevant topics while developing responsible, ethically minded, public-facing, science communication skills. Using a workshop-style approach to develop critical thinking and practical public-facing writing and communication skills, each student will begin by proposing their own popular neuroscience topic (e.g., consciousness, addiction, neurodivergence) to write on as their \"beat\". Throughout the semester, each student will create a portfolio of written pieces via various assignments based in science writing/editing, such as in educational outreach, journalism, and policy/advocacy. These assignments are designed to range in scale (e.g., social media posts",
    "course_description": "Study of variable topics of special interest in neuroscience and behavioral biology. May be repeated for credit when topics vary.",
    "prerequisites": null,
    "instructors": "J. Alex Grizzell - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in 1462 Clifton Rd 100A",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_NBB_370W_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: This section is full 5244, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: J. Grizzell, Status: Wait List",
    "date_accessed": "2023-10-31"
}