{
    "course_code": "HLTH 340",
    "course_title": "Food, Health, and Society",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 90 / Seats Avail: 71Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Same as ANT 349 1, BIOL 340 1)\nHuman health is intrinsically linked to dietary practices. Plants, in particular, may be used both as medicine and food, and it can often be difficult to draw a line between the two groups: food may be used as medicine and vice versa. The lens of ethnopharmacology can be used to gain an integrated biocultural perspective on foods, encompassing not only the substantive (or physical) qualities, but also the intangible (symbolic). In this course, we will explore the ways that human groups identify, collect, create, and transform foods, how they shape those into dietary behaviors, and how this influences human health. The pharmacological properties of foods will be examined and we will use case studies of dietary complexes, such as the Mediterranean diet, in order to better understand the food-medicine continuum as a determinant of health and well-being. Lastly, we will examine trends in the industrialization of food, and the resulting health impact of modern food practices.",
    "course_description": "Human health is intrinsically linked to dietary practices. The pharmacological properties of foods will be examined and case studies of dietary complexes will be examined in order to better understand the food-medicine continuum as a determinant of health and well-being.",
    "prerequisites": null,
    "instructors": "Cassandra Quave - Primary Instructor",
    "schedule_location": "T 8:30am-9:45am in Anthropology Building 303",
    "course_resources": null,
    "sections": "Class Nbr: 2855, Section #: 1, Type: LEC, Campus: ATL, Meets: T 8:30-9:45a, Instructor: C. Quave, Status: Open",
    "date_accessed": "2024-03-30"
}