{
    "course_code": "HLTH 350R",
    "course_title": "Core Issues in Global Health: Global Nutrition ProgramDesign",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 24 / Seats Avail: 20Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "Once nutritional problems for a population are identified, interventions are designed to address those problems.  How do you design public health programs so they are effective and sustainable?  In this course, we will explore four major steps in program design:  planning, implementation, monitoring and evaluation.  We will use food fortification (the addition of micronutrients to foods while they are being processed) as a model intervention.  Specifically, we will break down each of the program-design steps into further tasks, such as advocacy and legislation-formulation (for planning), training program implementers and government inspectors (for implementation), triangulating government- and non-government sources of information (for monitoring) and capitalizing on existing data or data-collection systems (for evaluation).  We will also discuss how to build program sustainability into every step of program design.  We will explore successes and failures with fortification program planning, implementation, monitoring and evaluation in low-, middle- and high-income countries, to draw out lessons learned for any nutrition program in any country setting.  The course instructor has spent the past nine years providing technical assistance on food fortification to stakeholders in Central and Southern America, Europe, the Middle East, Asia, the Pacific and Africa.",
    "course_description": "This course emphasizes core issues in global health, explores the identification of global health priorities, the nature of global health organizations and the challenges to finding and implementing solutions. The focus changes with the instructor",
    "prerequisites": "ANT205 or HLTH250 or equivalent transfer credit as prerequisite.",
    "instructors": "Helena Pachon - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Tarbutton Hall 105",
    "course_resources": null,
    "sections": "Class Nbr: 2232, Section #: 2, Type: SEM, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: H. Pachon, Status: Open",
    "date_accessed": "2024-03-30"
}