{
    "course_code": "HLTH 385W",
    "course_title": "Special Topics: Human Health: Health Writing and Narratives",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 14 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Continuing Writing Requirement",
    "permission": "Department Consent Required",
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "Permission required prior to enrollment.\nWriting clearly about health and medicine is an essential skill - for aspiring scientists, policymakers, science communicators, and physicians and health professionals, as well as for future journalists planning to work in any medium. Writing well requires learning to identify new developments, conduct an interview, craft an argument, and organize a narrative, while translating the jargon of science and medicine into the language of the everyday. This class will teach journalism's norms and standards - speed, thoroughness, accuracy, novelty and evidentiary rigor - in order to learn how to write about health and science for a popular audience. Students will read current scientific papers and reports, and compare them to newspaper and magazine stories, and online videos and multimedia, to assess accuracy, completeness, style, and storytelling strategies. Assignments will include writing short and long pieces in a range of genres. (Prerequisite: HLTH 210 or HLTH 250)",
    "course_description": "Seminar of lecture series of topics in human health. May be repeated for credit when topic varies. Credit varies from one to five hours.",
    "prerequisites": null,
    "instructors": "Maryn McKenna - Primary Instructor",
    "schedule_location": "W 2:30pm-5:15pm in Callaway Center S101",
    "course_resources": null,
    "sections": "Class Nbr: 2528, Section #: 1, Type: LEC, Campus: ATL, Meets: W 2:30-5:15p, Instructor: M. McKenna, Status: Open",
    "date_accessed": "2024-03-30"
}