{
    "course_code": "ENG 210W",
    "course_title": "Topics in Literature: Major Authors: Charles Dickens",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 25Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities and Arts with Cont.Communication(*)",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "Title: Charles Dickens\n\n\nThis course invites you to spend the semester curled up with the novels of the Victorian era's most beloved author, Charles Dickens. Dickens's stories--of urban realism and gothic mystery, of malicious villains and bumbling eccentrics, of dysfunctional families and communities of care, of social injustice and political renewal, of tragic criminality and comic satire--were bestsellers in their own time and remain immensely popular today as they continue to spawn countless film and television adaptations. We will dive deeply into three of Dickens's novels: Bleak House, A Tale of Two Cities, and Great Expectations. We will read these novels as Dickens's original readers did, in serial parts, one breathless episode and suspenseful cliffhanger at a time. As we read, we will explore the novels' biographical conditions, historical contexts, formal and aesthetic features, and thematic implications. Along the way, we'll explore critical and theoretical perspectives that will help us ask good questions about race, empire, gender, sexuality, and class.\nPlease note: As a course on Victorian novels, our reading load will be substantial (100 pages of Victorian prose for Tuesdays; 50 pages for Thursdays; with reading quizzes). If you wish to add this course after the first two classes have occurred, you must first contact the instructor to discuss missed work.",
    "course_description": "An introduction to one or more major authors in English literature, with an emphasis on literary merit and its determination, canon formation, literary movements, and reading strategies.",
    "prerequisites": null,
    "instructors": "Emma Davenport - Primary Instructor",
    "schedule_location": "TTh 8:30am-9:45am in Callaway Center S109",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ENG_210W_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2864, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 8:30-9:45a, Instructor: E. Davenport, Status: Open",
    "date_accessed": "2024-03-28"
}