{
    "course_code": "ENG 214W",
    "course_title": "Global Literature In English",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 20Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "Humanities and Arts with Cont.Communication(*)",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "Topic: Greening Black and Brown\n\n\nA writer, an economist, a filmmaker, and a scientist walk into a coffee shop. They each have a story to tell about climate change. This is where our course will begin \nWhile the filmmaker offers a short documentary, the scientist holds up a lab report. The writer scribbles down a quick thriller plot, the economist throws a news piece into the mix. What makes each of their contributions a \"story\" and why are race and the natural environment important factors here? We live in a time of vast global change, across both natural and political landscapes. Though we might like to think that destruction of the environment is a present-day phenomenon, we can't disregard the connections, between harm done to Nature and processes of colonialism, that have existed across historical eras. Racialized populations have often borne the brunt of exploitative practices under regimes of power, and their homelands, most at risk of despoilation.\nDrawing on narratology, ecocriticism, critical race theory, and gender studies, we will examine 20th- and 21st-century representations of identity and spacemaking in works of global literature. The syllabus will include fiction by Jamaica Kincaid, Julia Alvarez, Zakes Mda, and Chinua Achebe. Most readings will feature Africa and the Caribbean region. Assignments will comprise weekly discussion posts and two key projects: a fun multimodal presentation from a course reading alongside an academic research essay.",
    "course_description": "An exploration of Anglophone literatures from around the world. Regional focus and selection of texts will vary but may include works by Achebe, Cliff, Friel, Head, Lamming, Rushdie, Silko, Soyinka, Tan, and/or Walcott.",
    "prerequisites": null,
    "instructors": "Apala Bhowmick - Primary Instructor",
    "schedule_location": "MW 4pm-5:15pm in Callaway Center N118",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ENG_214W_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2865, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 4-5:15p, Instructor: A. Bhowmick, Status: Open",
    "date_accessed": "2024-03-28"
}