{
    "course_code": "ENG 290W",
    "course_title": "Topics in Literary History: Multi-ethnic American Lit.",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 25Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities and Arts with Cont.Communication(*)",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "This course will investigate the literary and cultural significance of texts composed by, and often focusing on, those with hyphenate ethnic American identities' that is, texts by and about Latinx-Americans, African-Americans, Jewish-Americans, Asian-Americans, Native-Americans, and the many other hyphenate identities which put ethnic and national categories into a complicated relationship. Our major questions will include (but are not limited to): How have ethnic American authors used literature and its affordances to question, examine, and express their senses of \"Americanness\"? How have literature and media played a role in developing and contesting our understandings of various multiethnic identities? And how have literature and media illuminated and engaged with the pressures that come with writing in the United States as an ethnic American? Course texts will largely come from the post-World War II era and will include novels, short stories, poems, memoirs, essays, films, and television episodes.",
    "course_description": "Long historical surveys of national, regional, or ethnic traditions; or of genres or subgenres. Examples: History of African Literature, History of Latinx Literature, History of Science Fiction, History of the Sonnet, History of Southern U.S. Literature, History of Drama.",
    "prerequisites": null,
    "instructors": "Aaron Colton - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in Callaway Center S105",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ENG_290W_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2876, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: A. Colton, Status: Open",
    "date_accessed": "2024-03-28"
}