{
    "course_code": "ENG 270W",
    "course_title": "Indigenous Literature Before 1850",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 25Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "Humanities & Arts with C.Comm/Race & Ethnicity(*)",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "This course offers a hemispheric overview of Indigenous literatures in the Americas before 1850, with attention to visual, oral, pictographic, and alphabetic Indigenous writings produced before and after European invasions, as well as these literatures historical, political, and cultural contexts. Students will read and discuss Indigenous creation stories, Wampum Belts, Mesoamerican codices, Andean Quipus, and works by Indigenous authors such as William Apes, Handsome Lake, and Samson Occom. The class can be thought of as a journey that through the critical analysis of diverse literary texts, will reveal to the student the incredible diversity of Indigenous peoples and their societies, the complications and challenges that arose after European invasions, divergent spiritual and religious worldviews, the indigenuity (Wildcat) of adaptations, and the persistence of Indigenous peoples and their respective cultures in different geopolitical and historical contexts.",
    "course_description": "Study of Indigenous literatures before 1850, with attention to visual, oral, pictographic, and alphabetic writings produced before and after European invasions. Includes historical, political, and cultural contexts.",
    "prerequisites": null,
    "instructors": "Emil' Keme - Primary Instructor",
    "schedule_location": "TTh 8:30am-9:45am in Callaway Center S105",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ENG_270W_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2870, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 8:30-9:45a, Instructor: E. Keme, Status: Open",
    "date_accessed": "2024-03-28"
}