{
    "course_code": "ENG 280W",
    "course_title": "Law and Literature",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 40 / Seats Avail: 40Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "Humanities and Arts with Cont.Communication(*)",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "What can literature teach us about the law, and what can the law teach us about literature? Within these broad queries lurk questions about the nature of justice, punishment, human psychology, institutional structures, cultural norms, and disciplinary methodology. In this course, we will consider the productive and limiting aspects of positing law and literature as opposing or complementary forces. Our legal texts will comprise some of the stickiest judicial opinions in Anglo-American law, centered around themes of bodily autonomy in the contexts of race, gender, and sexual orientation. Our literary texts will include genres that might surprise you, among them a contemporary allegorical fantasy and a novel that combines historical fiction with magical realism. In the course of creating our own, original judicial opinions, literary criticism, and creative adaptations, we will learn how to analyze and respond to case law as lawyers do, how to close-read and persuasively defend an argument as literary scholars do, and how to critically think and converse as informed and engaged citizens do.\nPlease note: If you wish to add this course after the first two classes have occurred, you must first contact the instructor to discuss missed work.",
    "course_description": "An introduction to literary and legal forms of interpretation, with consideration of the relationship between these two discourses. Emphasis on close reading, critical analysis, and argumentative writing.",
    "prerequisites": null,
    "instructors": "Emma Davenport - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Candler Library 114",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ENG_280W_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 4522, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: E. Davenport, Status: Open",
    "date_accessed": "2024-03-28"
}