{
    "course_code": "ENG 359W",
    "course_title": "Studies in African American Literature: 1900 to Present",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 25Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "HAPW w/Race & Ethnicity Req.",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "In this course, we will consider the term \"solidarity,\" commonly taken to mean unity or connection between disparate groups of people with shared interests. We will explore the shared interests (and moments of tension) between Black Americans and other racialized and colonized groups within the US and in Asia, Africa, and Latin America. Reading across the genres of fiction, poetry, memoir, and political theory, we will discuss historical points of solidarity between Black Americans and other marginalized peoples. Potential topics of discussion include: Black internationalism; the relationship between the civil rights movement and movements against colonialism and apartheid; Third World feminism; and student organizing for Black and ethnic studies in American universities. Students will write two 5-7 page close reading essays and one creative final project.",
    "course_description": "A topics course dealing with major traditions and issues in African American literature from 1900 to the present. Possible topics include passing and miscegenation, black novels since 1950, Afrofuturism, and black theater.",
    "prerequisites": null,
    "instructors": "Marina Magloire - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Callaway Center S105",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ENG_359W_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2891, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: M. Magloire, Status: Open",
    "date_accessed": "2024-03-28"
}