{
    "course_code": "ENG 375W",
    "course_title": "Topics Asian Am.Lit.& Culture: Asian American Women Writers",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 25Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Irregularly",
    "requirement_designation": "Continuing Communication with Race & Ethnicity(*)",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "In this course, we will explore the intersections of race, gender, and sexuality through writing by Asian American women. Both marginalized and fetishized within mainstream literary culture, Asian American women's writing has often been expected to provide a window into the \"authentic\" experiences of a group that faces the double jeopardy of racial and gendered discrimination and violence. We will challenge this notion--that the primary value of Asian American women's writing is that it represents experiences of marginalization--to approach our texts as interventions into dominant aesthetic and political discourses. Texts will range from the classic to the contemporary and encompass fiction, poetry, nonfiction, comics, and other media.\nTopics to be discussed will include: intersectionality; the politics of representation; the formation of racial, gendered, and sexual identities; coming-of-age stories; silence and trauma; fashion and beauty; sexual and domestic violence; transnational adoption; mental health; disability justice; abolition feminisms; feminist anthologies and zines.",
    "course_description": "Study of Asian American literature and culture, with a focus on a specific topic, theme, movement, or genre. Students develop a deeper understanding of a specific topic and analyze literature and culture in relation to Asian American history and politics.",
    "prerequisites": null,
    "instructors": "Erica Kanesaka - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in Anthropology Building 105",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ENG_375W_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2895, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 1-2:15p, Instructor: E. Kanesaka, Status: Open",
    "date_accessed": "2024-03-28"
}