{
    "course_code": "ENG 383RW",
    "course_title": "Studies In Women's Fiction: Haunted Houses",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 25Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "This course examines the gothic tradition in British and North American women's fiction of the nineteenth, twentieth, and twenty-first centuries.  The haunted house trope that loosely connects these books has proven a useful metaphor for the challenges women and women writers have faced in the artistic, political, social, and economic realms of this time period. Some of the themes we will encounter include: young women haunted both by the past and by possibilities for the future; hauntings as the product of racial injustice and class antagonism; erasure of writing and strangulation of voice; crimes against individuals and crimes against large groups; fear of the unknown and of the known; assertion of non-white subjectivity in the face of othering.  \n \nThe entire reading list comes with a content advisory: gothic fiction is geared toward inducing anxiety and includes scenes of racism, sexism, homophobia, transphobia, domestic violence, and suicide. We will be moving at a brisk pace, about a novel per week.\n \nRequirements: Three papers, two presentations, daily reading quizzes, participation\nReading list: Austen, Northanger Abbey; Brontë, Jane Eyre; Crafts. The Bondwoman's Narrative; du Maurier, Rebecca; Jackson, We Have Always Lived in the Castle; Morrison, Beloved; Moreno-Garcia, Mexican Gothic; Machado, In the Dream House",
    "course_description": "Selected prose works of British and American women, including authors such as Behn, Austen, Woolf, Lessing, Morrison, and Walker. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Catherine Nickerson - Primary Instructor",
    "schedule_location": "TTh 2:30pm-3:45pm in Callaway Center S109",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ENG_383RW_2_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2897, Section #: 2, Type: LEC, Campus: ATL, Meets: TTh 2:30-3:45p, Instructor: C. Nickerson, Status: Open",
    "date_accessed": "2024-03-28"
}