{
    "course_code": "ENG 389W",
    "course_title": "Special Topics:Literature",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 25Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "How did bananas influence independence movements? What does the plantation economy have to do with modern-day tourism? And what does the term \"third world\" misleadingly imply? Over the course of the long twentieth century, the United States military was invoked on a series of interventions, invasions, and occupations across much of Central America and the Caribbean. With a vested interest in controlling influence over trade throughout the region, the United States government advanced political, economic, and military interests with devastating consequences. This course approaches literary fiction and poetry written by authors of nations that bear the legacies of these U.S. military occupations. Readings will include works by Merle Collins, José Martí, and Edwidge Danticat, and will focus on themes of commodities and consumption, invasion and exile, family and self-making under imperialism. Students will continue to develop the skills necessary to write about literature through a series of creative and analytic assignments that will include regular reading responses, close reading assignments, and a longer term paper.",
    "course_description": "Literary topics vary. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Julian H. Currents - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Rich Building 211",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ENG_389W_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2901, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: J. Currents, Status: Open",
    "date_accessed": "2024-03-28"
}