{
    "course_code": "ENG 482RW",
    "course_title": "Seminar in Fiction:English: Youth/Experience Mod.Brit.Fict",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 15Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "Title: Youth & Experience in Modern British Fiction\n\n\nModernist fiction famously tends to present the world as a place of fragmented or difficult experience, and the history of the first half of the twentieth century is marked both by a sense of perpetual change (social and sexual mores, technological advancement, the end of empire) and the feeling of an irreparable break from the past (the two world wars). In this course, we'll pay close attention to British novels from across the century, examining stories about the transformation of the self within this rapidly transforming world. We will ask: what does the coming-of-age novel look like in an age where, as Yeats put it, \"the centre cannot hold,' and old wisdom may no longer apply? What kinds of knowledge and education are available to its youthful protagonists? How do the experiences of love and passion, disappointment and displacement, contribute to developmental narratives? What is the relationship between the modern novel and developmental psychology? And what modes of belonging might be achievable in a more pluralistic and diverse nation?\nReadings may include: Hardy, Jude the Obscure; Woolf, Jacob's Room; Forster, A Room With A View; Bowen, The Death of the Heart; Isherwood, Goodbye to Berlin; Spark, The Girls of Slender Means; Carter, The Magic Toyshop; Emecheta, Second-Class Citizen; Ishiguro, Never Let Me Go; Kureishi, The Black Album. This is an interactive, discussion-based seminar; writing requirements include brief Canvas responses and midterm and final essays.",
    "course_description": "Studies in narrative fiction and narrative forms. Readings vary and may focus on one or more authors or on questions of literary art. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Erwin Rosinberg - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in Callaway Center N118",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ENG_482RW_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2904, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 1-2:15p, Instructor: E. Rosinberg, Status: Open",
    "date_accessed": "2024-03-28"
}