{
    "course_code": "ENG 489W",
    "course_title": "Special Top Adv Study:English: Literature and Disability",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 15Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "This seminar will explore how literature has shaped the ways we understand disability¿as both a cultural and political identity and a lived experience. At the same time, by studying literary works from earlier historical periods, we will consider how bodily and cognitive differences were imagined and represented before the formation of disability identity in the twentieth century. For example, what does Shakespeare¿s famous depiction of Hamlet¿s ¿madness¿ tell us about contemporary conversations regarding mental health today? What does Mary Shelley¿s depiction of ¿deformity¿ and ¿monstrosity¿ in Frankenstein tell us about contemporary conversations regarding bodily ¿norms¿? Disability, in the past and present, intersects with many other aspects of human experience; accordingly, our discussions will pay close attention to how ¿bodymind¿ differences are in dialogue with representations of gender, sexuality, race, class, and more.             \nTexts:\nWe will study a variety of works, including Shakespeare¿s Richard III and Hamlet, Daniel Defoe¿s A Journal of the Plague Year, Olaudah Equiano¿s Interesting Narrative, Mary Shelley¿s Frankenstein, Jane Austen¿s Persuasion, and Charles Dickens¿s A Christmas Carol. We also will engage with a range of scholars working in the field of disability studies, including Lennard Davis, Rosemarie Garland-Thomson, Tobin Siebers, Alison Kafer, and Jenifer Barclay.\n\n\nRequirements:\nAttendance and active class participation are required; written work will include weekly Canvas postings, two short essays, and a final research paper",
    "course_description": "Intensive study of specific literary topics, e.g., questions of form or history, or concentrations on one or more authors or literary movements. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Paul Kelleher - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Woodruff Library 214",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ENG_489W_2_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2906, Section #: 2, Type: SEM, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: P. Kelleher, Status: Open",
    "date_accessed": "2024-03-28"
}