{
    "course_code": "ENG 789",
    "course_title": "Special Topics In Literature: Theorizing Blk &Afr. Diasporas",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 12",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "Theorizing Black & African Diasporas\n\n\nAs our knowledge and recognition of Black identities swells across the globe, the vexing question of exactly how we define \"Black\" seems to grow larger and more complex. How and why do we understand indigenous African populations as \"Black\" , when it is an identity invented by white European and U.S. men? How do we historicize a collective such as Black Germans, when each generation often boasts its own individual history and nations of origin? How do we define \"African American\" when some collectives focus on their enslaved ancestry, others their more recent immigration from other parts of the Americas, Europe and/or Africa? In this course we will tackle the issue of definition and representation by looking at how scholars from across the diaspora both frame and pursue these questions. Reading list may include but is not limited to: Katherine McKittrick, Samantha Pinto, Rinaldo Walcott, Barnor Hesse, Fatima El-Tayeb, Peggy Piesche, Isidore Okpewho, Jafari Allen, Brent Edwards, Simon Gikandi, Ruth Simms Hamilton, Angelica Pesarini, and Jean Muteba Rahier.",
    "course_description": "Various topics, such as theoretical, generic, or cultural studies of literature.",
    "prerequisites": null,
    "instructors": "Michelle Wright - Primary Instructor",
    "schedule_location": "M 1pm-3:45pm in Registrar Room Pool",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ENG_789_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3196, Section #: 1, Type: SEM, Campus: ATL, Meets: M 1-3:45p, Instructor: M. Wright, Status: Open",
    "date_accessed": "2024-03-28"
}