{
    "course_code": "ENG 752R",
    "course_title": "Studies In 20th Cent. American Lit",
    "credit_hours": "2-4",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 15",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "Course Title: Readings in Southern Literature\n\n\nReadings in Southern Literature. Advanced study of the 20th century literature of the American South with attention to literary history, southern modernism and beyond, and the global reception of southern literature. We will read, as a group, a selection of texts during the first half of the semester; during the second half of the semester, students will undertake an independent reading and research project, under the guidance of the professor, i.e. through individual meetings (tutorials). This project is a more intensive study of one of the authors we have read (perhaps through reading a second or third work by that author) or an issue or question arising from the material we've read. It will culminate in an introduction to important material on the subject with an annotated bibliography or, if a student is ready to undertake an original argument, a seminar paper. \n \nTexts: tba from among the following: Ellen Glasgow, selections from The Shadowy Third, and Other Stories; James Weldon Johnson, Autobiography of an Ex-Colored Man (the Norton edition, edited by Jacqueline Goldsby; Langston Hughes, The Weary Blues (the book in its entirety); William Faulkner, Absalom, Absalom!; Carson McCullers, The Heart is a Lonely Hunter or The Ballad of the Sad Café and Other Stories; Ralph Ellison, Invisible Man; Flannery O'Connor, Wise Blood; Eudora Welty, The Optimist's Daughter; Toni Morrison, Song of Solomon; Cormac McCarthy, Suttree or Blood Meridian.",
    "course_description": "Readings in key primary texts, critical responses, contextual and/or archival material from the period.  Course may be organized by topic or theoretical approach; or it may focus on the work of one or more key writers of the period (e.g. Eliot, Faulkner, Hughes, Baldwin, Ellison, Morrison, Silko).",
    "prerequisites": null,
    "instructors": "Barbara Ladd - Primary Instructor",
    "schedule_location": "T 10am-12:45pm in Callaway Center C201",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ENG_752R_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3192, Section #: 1, Type: SEM, Campus: ATL, Meets: T 10a-12:45p, Instructor: B. Ladd, Status: Open",
    "date_accessed": "2024-03-28"
}