{
    "course_code": "SPAN_OX 285R",
    "course_title": "Topics: Hispanic Studies: Connecting Communities",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 10",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Blended/Hybrid",
    "typically_offered": "Irregularly",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "This is a hybrid multimodal course consisting of in-person 75-minute sessions held on Mondays, and 75-minute virtual classes conducted on Wednesdays.\nThis course includes 3 field trips, one involving community work, and one visit each to the Atlanta and Oxford campuses\nPREREQUISITE: Spanish 212 or an Official Spanish Placement for a Foundational Spanish Course. Take the online Spanish Placement Exam at https://app.emmersion.ai/registration?shortId=784ad9fdb9\n\n\nTitle: Connecting Communities: Atlanta's Spanish Speakers in Dialogue\nThis course is designed for Oxford and Emory students interested in fostering meaningful connections with each other, as well as with members of the long-established Spanish-speaking community in Atlanta and the surrounding areas. With a strong emphasis on oral language skills, this course explores first-hand the diverse and vibrant Spanish-speaking communities within the region that hail from all corners of the Spanish-speaking world. Throughout the course, students will engage with a broad spectrum of Spanish speakers, including local artists, small business owners, healthcare workers, and animal rights activists to gain valuable insights into their experiences and unique perspectives. These conversations will promote diversity and experiential pedagogy and thus require active participation from all constituents.",
    "course_description": "Intermediate-level studies of the language, discourse, literature, and/or culture of the Spanish-speaking world. May be taught in English or Spanish. Students may take multiple SPAN 285R courses provided that they focus on different topics.",
    "prerequisites": null,
    "instructors": "Cristina Tarazona - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in Humanities Hall 109",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=Oxford%20College%20Bookstore_SPAN_OX_285R_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 4012, Section #: 1, Type: LEC, Campus: OXF, Meets: MW 2:30-3:45p, Instructor: C. Tarazona, Status: Open",
    "date_accessed": "2024-03-29"
}