{
    "course_code": "IDS 290R",
    "course_title": "Interdisciplinary Sidecar: Demystifying Gut Microbiome",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "The gut microbiome is referred to as a sect of holistic medicine, and yet in recent years, research has validated just how essential gut health is. It has been related to improved mental health in line with the gut-brain axis, limited correlation to chronic disease, and greater energy, among other aspects. Gut health also has historical contexts in global cultures, with different diets focusing on gut-healthy plants and meals that display the benefits of increased gut biodiversity in contrast to increasing rates of processed food diets. The demystification of this course is two-fold: one, in recognizing that gut health needs to be recognized with validity beyond being classified as 'holistic', and two, in increasing accessibility to a gut-healthy lifestyle for college students.",
    "course_description": "A side-car course brings together a subset of students from two courses that overlap in methodologies, topics, etc., to create a short interdisciplinary course that runs simultaneously with its two sponsoring courses. One credit, S/U only. Schedule and format arranged by sponsoring professors.",
    "prerequisites": null,
    "instructors": "Arri Eisen - Primary Instructor",
    "schedule_location": "M 2:30pm-3:45pm in Callaway Center S104",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_IDS_290R_2_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 6014, Section #: 2, Type: SEM, Campus: ATL, Meets: M 2:30-3:45p, Instructor: Team, Status: Wait List",
    "date_accessed": "2024-03-30"
}