{
    "course_code": "IDS 220RW",
    "course_title": "ORDER Seminar: What Does it Mean to be Human?",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 19 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Continuing Communication(*)",
    "permission": "Department Consent Required",
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Through an interdisciplinary exploration combining social sciences, sciences, and humanities disciplines and methodologies, we will engage in creative and intellectually rigorous conversation about the human experience, while writing our own stories in the process.\nThis course will progress through separate topical units centered around three core questions:\n1. How do we understand ourselves? We will discuss our thoughts and ideas about what it means to be human and how we can tackle this from an interdisciplinary perspective. Why is it difficult to define what is human? Why do we need to think of humanity as a problem?\n2. Human compared to what? Here we seek to further illustrate what makes humanity unique through a comparative lens. What is a human compared to an animal, a robot, or even, considering our strange relationship to the nation-state, a citizen? In doing this, we will think deeply about how humanity defines itself through and against its own narratives of power and dominance. \n3. Where are we going? In addressing this question, we will attempt to work through some of the largest existential threats to humankind and determine two things: How do different disciplines tackle these issues? and Can these disciplines work together to solve them?",
    "course_description": "On Recent Discoveries by Emory Researchers (ORDER) engages graduate and postdoctoral students to teach their research to undergraduates. Recommended for sophomores; open to others. Refer to Course Atlas for specific topics of a given semester, articulated by the teacher-scholar team.",
    "prerequisites": null,
    "instructors": "Mark Risjord - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in Callaway Center S420",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_IDS_220RW_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 4124, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: M. Risjord, Status: Wait List",
    "date_accessed": "2024-03-30"
}