{
    "course_code": "IDS 385",
    "course_title": "Special Topics: Freedom & Authority",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "In 1952, the Emory University's Institute for the Liberal Arts (ILA) opened and offered its first seminar, entitled Freedom and Authority. \nThe current course, spring 2024, will take up the broad philosophical concepts of the historic first ILA seminar and explore them in dialogue within and between diverse populations who live and constitute the land and places that are Atlanta and Georgia. Specifically, this class will involve undergraduate students at Emory College of Arts and Sciences and incarcerated students at Burruss Correctional (a state prison in Forsythe, Georgia-henceforth: \"Burruss\"). Students at both institutions will discuss common readings focused on freedom and authority among themselves and in exchange with each other. In other words, two sections of this class - one at Emory College, the other at Burruss, will meet and discuss readings in parallel and according to a shared calendar. Students from the two sections will exchange letters about the readings and discussions each class is having. Further, as logistics permit, during the last half of the semester, four or five Emory students at a time will have the opportunity to travel to Burruss and join the class of incarcerated scholars there, to discuss readings that the two groups have been doing in parallel. NOTE: Emory students should be able to devote one Friday afternoon and evening in March or April to travel to and class at Burruss; date tba.",
    "course_description": "Highly focused courses, drawing on multiple disciplines of the humanities and social sciences; may be repeated for credit when topics vary.",
    "prerequisites": null,
    "instructors": "Peter W Wakefield - Primary Instructor",
    "schedule_location": "Th 4pm-6:45pm in Callaway Center S420",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_IDS_385_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 4128, Section #: 1, Type: LEC, Campus: ATL, Meets: Th 4-6:45p, Instructor: P. Wakefield, Status: Wait List",
    "date_accessed": "2024-03-30"
}