{
    "course_code": "IDS 385",
    "course_title": "Special Topics: Intro to Public Humanities",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Public Humanities is an interdisciplinary approach to humanistic scholarship that combines reflection on the history of the humanities, critical university studies, and the practice of community-engaged research and scholarship. This class uses applied, experiential, and hands-on learning to challenge students' understanding of the humanities. \nIn this class, students will explore and reflect on these questions through direct, experience-based learning in one of two local bookstores. Students will work as public humanities practitioners in the context of independent bookstores in Atlanta, GA. Based on students' interests, majors, and skillsets, the class will be divided into two groups that work on projects with Charis Books, the Southeast's oldest queer-feminist bookstore, or Little Shop of Stories, a multicultural children's bookstore in Decatur. Community partners from Charis Books and Little Shop of Stories will collaborate with and supervise students on projects relevant to their current community-based initiatives for social change.  \nThe course involves two weekly time commitments: In-class attendance and participation during seminar and 2 hrs. of weekly project work outside of class with community partners, which fulfills this course's 4-credit commitment.",
    "course_description": "Highly focused courses, drawing on multiple disciplines of the humanities and social sciences; may be repeated for credit when topics vary.",
    "prerequisites": null,
    "instructors": "Rose Deighton - Primary Instructor",
    "schedule_location": "T 4pm-6:45pm in Callaway Center S420",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_IDS_385_2_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 4132, Section #: 2, Type: LEC, Campus: ATL, Meets: T 4-6:45p, Instructor: R. Deighton, Status: Open",
    "date_accessed": "2024-03-30"
}