{
    "course_code": "IDS 385W",
    "course_title": "Special Topics: Observing Crisis",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 19 / Seats Avail: 15",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Continuing Communication(*)",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "To live in the present is to live in a historical moment of extended crisis: from the still unfolding COVID-19 pandemic to the accelerating cataclysm of climate change and myriad and overlapping forms of economic and political violence. The notion of crisis, unlike its colloquial and abundant use may suggest, is not self-referential but rather a deeply contested term that requires mediation and narrativization to obtain political, historical, and cultural specificity. Derived from the Greek verb krinô, to separate, judge, choose, it occupies the very threshold of meaning, knowledge, and critique. As anthropologist Janet Roitman asserts, \"it is not a condition to be observed [but] an observation that produces meaning.\" To designate a particular historical moment, geographic location, or group of people as in/of crisis means to determine what constitutes the norm and what marks its disruption. In this course students learn to think with and about crisis as a critical lens. Embarking from a theoretical consideration of the term and its uses through history, the course proceeds through a curated set of trans-national and trans-historical case studies. Particular emphasis is placed on crisis visuality as a register of perception and interpretation, considering how visual genres of crisis-from data visualizations and photojournalism to the visual arts-articulate, sustain, and circulate different understandings of crisis, and invest them with affective urgency and political meaning.",
    "course_description": "Highly focused courses, drawing on multiple disciplines of the humanities and social sciences; may be repeated for credit when topics vary.",
    "prerequisites": null,
    "instructors": "Julia Tulke - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in Callaway Center S420",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_IDS_385W_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 4126, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 1-2:15p, Instructor: J. Tulke, Status: Open",
    "date_accessed": "2023-10-31"
}