{
    "course_code": "EAS 216W",
    "course_title": "East Asian Calligraphy",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 4 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "Distance Learning",
    "typically_offered": "Summer",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2021-05-17 through 2021-06-04",
    "class_notes": "(Same as CHN 216W 2, ARTHIST 216W 2, ANT 217W 2)\nThis is a Maymester online course. Due to the compressed three-week format, you may not enroll in a Maymester course (May 17- June 4) and a  course in the first session (May 17-June 26). You may enroll in a course during the second session.\n\n\nEmory College Online summer courses have required synchronous/live sessions every week. Students must be available to sign into and virtually attend the course online during those times (noted as the course meeting times- all times listed are local to Atlanta). Each course will also involve significant asynchronous material that you access on your own time in addition to standard amounts of readings and course assignments. Students should plan to spend 15-20 hours/week on this course. Please also be aware that faculty will begin corresponding with students during Week Zero of the course (one week before the official start date of the course), and that some interaction with the course may be required at that time. Students should begin checking the Canvas course site regularly one week prior to the official start of the term.",
    "course_description": "Studies East Asian calligraphy in artistic, cultural, and historical contexts, starting with the immediate aspects of calligraphy as a traditional art form, and then reaching beyond the classically defined discipline to examine its aesthetic values, intellectual metaphors, and moral criteria.",
    "prerequisites": null,
    "instructors": "Hsu-Te Cheng - Primary Instructor",
    "schedule_location": "MTWThF 9:30am-11am in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 1448, Section #: 1, Type: LEC, Campus: ATL, Meets: MTWThF 9:30-11a, Instructor: C. Crowley, Status: Wait List\nClass Nbr: This section is full 1449, Section #: 2, Type: LEC, Campus: ATL, Meets: MTWThF 9:30-11a, Instructor: H. Cheng, Status: Wait List",
    "date_accessed": "2024-03-30"
}