{
    "course_code": "POLS 494",
    "course_title": "Research Topics Seminar in Political Science: Presidential Power",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 13Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "Course Title: Presidential Power\n\n\nIn this course, we will study the dynamics of power surrounding the United States presidency. While the office is often considered one of the most powerful in the world, its occupants often fail to achieve even their most central goals and bitterly complain about the obstacles they face as they navigate the political environment. Throughout the semester, we will consider the aspects of the legal and political environments that both facilitate and inhibit the power presidents can wield. We will do this by considering the power endowed in the presidency by the Constitution, the development and construction of presidential power throughout American history, how presidents deploy the prerogatives of their office to advance their agendas, and the aspects of the political environment (including other institutional actors and the public) that cabin presidential ambitions. In doing so, we will develop a working understanding of the opportunities and constraints that shape presidential action and the ability of presidents to reshape policy and politics.\nThis course fulfills the research requirement for the political science department majors. As such, we will place significant emphasis both in class and in assignments on the development of a research question, identifying relevant literature, designing a study that can credibly contribute to the primary literature, and implementing that design.",
    "course_description": "Research Seminar on selected topics and problems in political science. Class will fulfill the \"research\" requirement for the political science major. May be repeated for credit when the topic varies.",
    "prerequisites": "POLS 208 or POLS_OX 208 or equivalent transfer credit as prerequisite.",
    "instructors": "Alexander Bolton - Primary Instructor",
    "schedule_location": "Th 1pm-3:45pm in Registrar Room Pool",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_POLS_494_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3206, Section #: 1, Type: SEM, Campus: ATL, Meets: Th 1-3:45p, Instructor: Bolton/Kinnard, Status: Open",
    "date_accessed": "2024-03-29"
}