{
    "course_code": "PRS 561D",
    "course_title": "Public Health Advocacy Capstone I",
    "credit_hours": "2",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Closed",
    "instruction_method": "Blended/Hybrid",
    "typically_offered": "Spring",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2023-01-13 through 2023-04-16",
    "class_notes": "EMPH Students Only; Outside permission to enroll in course must be approved by EMPH leadership. EMPH Opening Weekend is January 13-15 and Closing Weekend is April 14-16",
    "course_description": "In this capstone course, students work with a local, state, or national organization to develop materials to promote and/or implement a public policy solution to a current, significant domestic or international public health problem. Students will create a digital portfolio of materials such as drafts of proposed policies, fact sheets, Power Point presentations, You Tube videos, and social media messages for the organization to further the adoption or implementation of a policy solution. The capstone experience is intended to provide the student with experience and skills, including working collaboratively with outside organizations, to ultimately lead the transformation of laws and policies to meet the health challenges of the 21st Century. Students will gain an understanding of the public policy-making process; learn to access tools for identification of evidence-based approaches to public health policy development; practice interaction with community-based and governmental organizations around policy matters; and, refine their skills to synthesize scientific and public health policy information into persuasive written and verbal communications with real-world application.",
    "prerequisites": "HPM 500D and PRS 505D and PRS 535D and PRS 542D and PRS 575D and (PRS 538D or PRS 540D) as prerequisites or special permission required to enroll.",
    "instructors": "Jean O'Connor - Primary Instructor",
    "schedule_location": "F 4pm-7pm in Grace Crum Rollins P39\nSu 8:30am-11:30am in Grace Crum Rollins P39",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2805, Section #: 901, Type: SEM, Campus: ATL, Meets: F 4-7p; Su 8:30-11:30a, Instructor: J. O'Connor, Status: Closed",
    "date_accessed": "2024-03-30"
}