{
    "course_code": "BUS 799R",
    "course_title": "Dissertation",
    "credit_hours": "9",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": null,
    "course_description": "Students who have reached candidacy and are working on dissertation completion are enrolled in this course and supervised by their advisor as they complete their degree requirements.",
    "prerequisites": "This section is reserved for students in the PhD program.",
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: 5945, Section #: 5101, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: T. Yohn, Status: Open\nClass Nbr: 5983, Section #: 5102, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: V. Todri, Status: Open\nClass Nbr: 5984, Section #: 5103, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. Schweidel, Status: Open\nClass Nbr: 5985, Section #: 5104, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: K. Kadous, Status: Open\nClass Nbr: 5986, Section #: 5105, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Busse, Status: Open\nClass Nbr: 5987, Section #: 5106, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Busse, Status: Open\nClass Nbr: 5988, Section #: 5107, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: K. Sedatole, Status: Open\nClass Nbr: 5989, Section #: 5108, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: C. Green, Status: Open\nClass Nbr: 5990, Section #: 5110, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. KC, Status: Open\nClass Nbr: 5991, Section #: 5111, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Swaminathan, Status: Open\nClass Nbr: 5992, Section #: 5112, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Williams, Status: Open\nClass Nbr: 5993, Section #: 5113, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: G. Negro, Status: Open\nClass Nbr: 5994, Section #: 5114, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: A. Bharadwaj, Status: Open\nClass Nbr: 5995, Section #: 5115, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: I. Dichev, Status: Open\nClass Nbr: 5996, Section #: 5116, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: P. Adamopoulos, Status: Open\nClass Nbr: 5997, Section #: 5117, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. Lewis, Status: Open\nClass Nbr: 5998, Section #: 5118, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. McCarthy, Status: Open\nClass Nbr: 5999, Section #: 5119, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: W. Longhofer, Status: Open",
    "date_accessed": "2024-03-30"
}