{
    "course_code": "JS 258",
    "course_title": "Anthropology of the Jews",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 4Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Same as REL 270 8, ANT 258 1)\nThis course satisfies the Religion major requirement:- Theme, Region. \nThis course explores the anthropology of different Jewish communities (i.e. Ethiopian, Hasidic, North American), and the different strategies invoked for writing about them and also asks an ethnographic question about the field of anthropology (in the words of Virginia Dominguez): -Does anthropology have a Jewish problem? What are some of the contested ways in which writing (or not writing) about Jews has helped to shape the whole discipline? How should we be thinking about the ethnography of Jews at this moment of racial reckoning in the United States, what are some of the different ways in which debates about modern Israel have shaped anthropological writing, and is \"anthropology of the Jews\" similar to \"anthropology of Christianity or of Islam?\" No perquisites in Jewish Studies or Anthropology are required! Just a willingness to read, consider and discuss.)",
    "course_description": "Introduction to Jewish populations and cultures within the framework of four fields of general anthropology: biological, archaeological, cultural, and linguistic.",
    "prerequisites": null,
    "instructors": "Don Seeman - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in White Hall 102",
    "course_resources": null,
    "sections": "Class Nbr: 3260, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 10-11:15a, Instructor: D. Seeman, Status: Open",
    "date_accessed": "2024-03-30"
}