{
    "course_code": "JS 190",
    "course_title": "Freshman Seminar: Islamophobia/Antisemitism",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 3 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First Year Seminar",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Same as MESAS 190 1)\n(Freshmen Seminar - Limited to First Year Students Only)\n(Complete Topic - Islamophobia & Antisemitism in US History)\n(Islamophobia and antisemitism have perhaps become more prominent in American discourse than any time in recent memory. Neither are new phenomena in U.S. history, however. Both anti-Jewish and anti-Islamic sentiments have origins that predate the United States' founding. This course examines that long history with a focus on the 20th century, during and after the mass immigrations of Jews, Arabs, and Muslims precipitated periods of heightened anxiety and discrimination. It will explore the way in which conceptions of race and religion shaped antisemitism, anti-Arabism, and Islamophobia in America, conceptions that were fostered and advanced by academics, politicians, and the media. Finally, the course will discuss the interplay between these prejudices and American policy, including foreign policy and domestic issues such as immigration, policing, and government surveillance.)",
    "course_description": "Designed to engage first-year students in aspects of inquiry and research into areas of Jewish religion, culture, history, or language. Topics will vary.",
    "prerequisites": null,
    "instructors": "Geoffrey Levin - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in Callaway Center N118",
    "course_resources": null,
    "sections": "Class Nbr: 5434, Section #: 2, Type: SEM, Campus: ATL, Meets: MW 10-11:15a, Instructor: G. Levin, Status: Wait List",
    "date_accessed": "2024-03-30"
}