{
    "course_code": "JS 190",
    "course_title": "Freshman Seminar: Everyday Life in MedievalEgypt",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 6 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First Year Seminar",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Same as HIST 190 5 and MESAS 190 6)\n(This course asks students to imagine a day in the life of a resident in Cairo, one of the greatest political, cultural, and commercial centers of the High Middle Ages. In the absence of a medieval survival guide, this thought experiment requires that we study what at first glance appear to be a set of basic questions: What do you do for a living? What do you eat and where does your food come from? Who makes the bowls and cooking utensils you need to eat? Do you get married? And divorced? What if you get sick? What do you do if you have a problem that you can't solve alone, or if you have been wronged? It turns out that answering these questions will require a great deal of resourceful, creative, and careful sleuthing using documentary and literary sources as well as material objects. Our class will have both traditional classroom components as well as hands-on experiments with making medieval products. The final project for this course is itself a creative product, one that you make by drawing on your knowledge of everyday life in medieval Egypt. By combining these experiential approaches with intellectual inquiry, we will open up a larger investigation into the nature of the pre-modern world that will inform how we think about our own present and future societies.)\n\n\n(Freshmen Only)\n\n\nTopic title: Everyday Life in Medieval Egypt",
    "course_description": "Designed to engage first-year students in aspects of inquiry and research into areas of Jewish religion, culture, history, or language. Topics will vary.",
    "prerequisites": null,
    "instructors": "Craig Perry - Primary Instructor",
    "schedule_location": "M 2:30pm-5:15pm in Callaway Center N204",
    "course_resources": null,
    "sections": "Class Nbr: 3255, Section #: 1, Type: SEM, Campus: ATL, Meets: M 2:30-5:15p, Instructor: C. Perry, Status: Wait List",
    "date_accessed": "2024-03-30"
}