{
    "course_code": "KRN 285W",
    "course_title": "Special Topics in Korean: Reading Comparatively",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 4 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities & Arts with C.Comm/Race & Ethnicity(*)",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Same as CPLT 201W 1)\nTopic: \"Black Feminism for Hallyu\" | \"Or, The Intertextualities of a Cultural Experience. We will leverage the discipline of Comparative Literature through the intellectual lineage of Black feminism to develop critical foundations for engaging with cultural experiences, both generally and specific to hallyu (or the Korean cultural wave). We will also approach humanities education as a cultural experience and engage diverse texts such as maps, literature, philosophy, music, and academic anthologies.\n\n\nI will introduce students to the key Humanities disciplines of Black feminism, Postcolonial studies, Philosophy (Epistemology, Historiography, Phenomenology), Literary Studies, and Cultural Studies, engaging them through critical geographies and transnational studies. We will practice immersive intertextuality, visual analysis, diverse reading practices (close reading, distant reading, analytical reading, and structural reading), and writing practices (critical / analytical writing, critical reflective writing). Our final project will be a portfolio answering the question: what is my structure for critically engaging cultural experiences in our world?\"\n\n\nCombahee River Collective Statement (1977); bell hooks, Art on my mind: visual politics (1995) and Reel to Real: Race, Sex, and Class at the Movies (1996); eds. Hong & Ferguson, Strange Affinities: The Gender and Sexual Politics of Comparative Racialization (2011); Browne, Dark Matters: On the Surveillance of Blackness (2015); eds. Fujiwara & Roshanravan, Asian American Feminisms and Women of Color Politics (2018);  eds. Lee, Mehta, Ku, Pop Empires: Transnational and Diasporic Flows of India and Korea (2019); Russell, Glitch Feminism (2020)",
    "course_description": "Study of Korean language, literature, society, thought, or culture, alone or in conjunction with other literary or cultural trends. Topics to be announced in advance.",
    "prerequisites": null,
    "instructors": "Jacqui Brown - Primary Instructor",
    "schedule_location": "MWF 11:30am-12:20pm in Tarbutton Hall 105",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 6730, Section #: 1, Type: LEC, Campus: ATL, Meets: MWF 11:30a-12:20p, Instructor: J. Brown, Status: Closed",
    "date_accessed": "2024-03-30"
}