{
    "course_code": "ELSP 517",
    "course_title": "Communication Skills for Advanced Speakers I",
    "credit_hours": "1.5",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 3",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "DESCRIPTION: ELSP 517 is designed to help graduate students further advance their spoken communication skills in English to develop interactive speaking skills in academic and professional settings. These include networking, moving from small talk to`big talk', and participating in and leading seminar-style discussions.  Participants in this course, which combines in-class meetings and online coursework, will  practice communication strategies to participate fully and confidently in the following  speech acts: networking to build connections, shifting from small talk to `big talk', and participating in and leading group discussions.\nCONTACT hboldt@emory.edu for more details.\n* Assessment of current proficiency level may be required; speakers who are not yet advanced are recommended to enroll in ELSP 505",
    "course_description": "Advanced speakers (OPI level 3) can narrate and describe in the past, present, and future time frames in paragraph-length discourse. Although they may have varying degrees of fluency and accuracy, advanced speakers can convey their message without confusion and be understood by listeners not accustomed to ESL speakers. However, they may lack the language to discuss topics extensively, participate in formal and professional conversations, and consistently provide a structured argument in extended discourse. ELSP 517 is designed to improve the communication skills of advanced students.",
    "prerequisites": null,
    "instructors": "Heather P Boldt - Primary Instructor",
    "schedule_location": "M 1pm-2:15pm in North Decatur Bldg 101D",
    "course_resources": null,
    "sections": "Class Nbr: 6093, Section #: 1, Type: LEC, Campus: ATL, Meets: M 1-2:15p, Instructor: H. Boldt, Status: Open",
    "date_accessed": "2024-03-30"
}