{
    "course_code": "ELSP 521",
    "course_title": "Academic Research Article Writing",
    "credit_hours": "2",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 4",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "DESCRIPTION: ELSP 521 is designed to assist scholars in making progress on writing a research article (RA).. Participants will learn about the major sections of research articles in their target publication or discipline as well as the common elements of each section. Students will also learn and apply discipline-specific strategies for writing the common rhetorical moves within each section. With a focus on producing the article, some class time will be devoted to drafting/revising/editing their articles, applying class concepts, exchanging feedback with peers, or working on their article in some other capacity \nCONTACT hboldt@emory.edu for more details.\n* Assessment of current writing level may be required",
    "course_description": "ELSP 521 an intensive analysis of the principles and revision practices of research article writing. Tools such as rhetorical, genre, and corpus analysis may be used to analyze published literature in their own field and then apply conclusions to an original piece of writing. Course content focuses on the central role of rhetorical organization, development of identifying an argument, a research gap, construction of logical arguments, data interpretation, as well other important concepts including reader-oriented writing, style, and tone.",
    "prerequisites": null,
    "instructors": "Grace Song - Primary Instructor",
    "schedule_location": "Th 8:15am-9:50am in North Decatur Bldg 101E",
    "course_resources": null,
    "sections": "Class Nbr: 6092, Section #: 1, Type: LEC, Campus: ATL, Meets: Th 8:15-9:50a, Instructor: G. Song, Status: Open",
    "date_accessed": "2024-03-30"
}