{
    "course_code": "ELSP 520",
    "course_title": "Seminar in Professional Communication",
    "credit_hours": "2",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 2",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "AUDIENCE: International graduate students who speak English as a second or additional language at the level of Advanced High* DESCRIPTION: ELSP 520 is designed to further the academic and professional speaking performance of the students who speak English at advanced high or superior levels, providing an environment for students to practice authentic  professional and academic speaking tasks with self-confidence. Students meet as a group for discussions, presentations, and classroom activities, as well as individually for one-on-one consultations with the instructor to receive individualized feedback and practice self-selected presentations, lectures, and discussions.\nCONTACT hboldt@emory.edu for more details.\n* Assessment of current proficiency level may be required",
    "course_description": "Designed to improve the academic and professional speaking performance of the Advanced and Superior level students (OPI Levels 3.7-4.0)1. ELSP 520 provides an environment in which students practice professional and academic speaking tasks with self-confidence. Students meet as a group for discussions, presentations, and classroom activities, as well as individually for one-on-one consultations with the instructor in which they receive feedback on activities and practice with presentations, lectures, and discussions.",
    "prerequisites": null,
    "instructors": "Peggy Wagner - Primary Instructor",
    "schedule_location": "T 2pm-3:40pm in North Decatur Bldg 101D",
    "course_resources": null,
    "sections": "Class Nbr: 6094, Section #: 1, Type: LEC, Campus: ATL, Meets: T 2-3:40p, Instructor: P. Wagner, Status: Open",
    "date_accessed": "2024-03-30"
}