{
    "course_code": "ENG 310W",
    "course_title": "Medieval & Renaissance Drama",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 24Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "This course is designed to empower students to think about race in the works of anonymous medieval playwrights and in the works of major early modern English dramatists such as Shakespeare, Marlowe, and Webster. Our journey will focus on understanding the formal elements of tragedy, comedy, and cases in which these lines of genre are blurred. Additionally, we will read race as a performance in relation to the emergence of public theatre, including the role of cosmetics in representing the ¿exotic,¿ blackness, and whiteness. We will also discuss the role of gender, sexuality, class, and religion in developing racialized characters, settings, and early modern life. Readings may include medieval cycle plays such as Everyman and renaissance dramas such as The Renegado. A variety of historical sources will provide context for our understanding of these plays. The goal of this course is to help students further develop literary analysis and research skills. Assignments may include occasional Canvas discussion posts and a series of short written assignments (no more than 1-3 pages each) that will build toward the student¿s choice of either a final creative project or a paper.",
    "course_description": "Representative medieval, Elizabethan, and Jacobean plays with some attention to the development of early English drama.",
    "prerequisites": null,
    "instructors": "Jareema Hylton - Primary Instructor",
    "schedule_location": "TTh 4pm-5:15pm in Math & Science Center - W307C",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ENG_310W_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2952, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 4-5:15p, Instructor: J. Hylton, Status: Open",
    "date_accessed": "2023-10-31"
}