{
    "course_code": "ENG 311RW",
    "course_title": "Shakespeare: Shakespeare/Text & Performance",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 17Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Complete Topic: Shakespeare in Text and Performance \n \n2023 is the 400th Anniversary of Shakespeare's First Folio, a text that provided the first publication of many of the dramatist's most prominent creations. This course will examine Shakespeare's plays on page and stage.  We will be watching performances and talking with actors and directors, when possible and will discuss both historic and modern perspectives of the plays. We will also take advantage of the wide range of fascinating podcasts devoted to Shakespearean topics. Regular writing assignments and active involvement in class discussions will be required.  You will be able to use any copies of Shakespeare's texts (library encouraged), so long as they are in Shakespeare's language and include Act, Scene, and Line numbers.  The course welcomes students from all disciplines and encourages them to find connections between their academic and personal interests and this drama. \n \n \nShakespeare on the Page, on the Stage, and in the World, English 150 \n \nThis course, which serves as part of the Voluntary Core Curriculum, looks at Shakespearean drama from a variety of perspectives. The plays exist as printed texts, as performances and adaptations (live and on screen), and as documents and performances in a wide range of settings around the world.  In this class, we will read and view a number of Shakespeare's plays and will interact with arts practitioners to discuss the lasting influence of these works.",
    "course_description": "Selected major plays from the histories, comedies, tragedies, and romances. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Sheila Cavanagh - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in Math & Science Center - W307C",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ENG_311RW_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2108, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 10-11:15a, Instructor: S. Cavanagh, Status: Open",
    "date_accessed": "2023-10-31"
}