{
    "course_code": "ENG 384RW",
    "course_title": "Criticism: Practicing Theory",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 9Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Most of the time, most of us take the world for granted. That is, we don't think about whether things exist or what it all means or how we know something is true. In everyday life, we depend mostly on received opinions and unexamined assumptions. Theoretical reflection aims to help us critically examine the limits of our world¿and to grasp the cultural and historical specificity of our accustomed ways of thinking and seeing. \nIn this class, you will develop your capacity for theoretical awareness by reading classic works on \"styles of thought\" and \"ways of seeing\" and thinking about culture and form, textuality and reading, images and media, politics and sexuality. We'll be particularly interested in the ways modern life and especially modern technology and mass media shape our understanding of the world. And you will practice using these different ways of thinking and seeing as we delve into theories that will challenge your accustomed ways of understanding yourself and the world. Along the way, we'll also examine the ways art and literature open up possibilities of thinking differently about truth, meaning, identity, and modern life.\nReadings may include: Barthes, Berger, Benjamin, Fleck, Foucault, Freud, Harraway, Kant, Kracauer, Lefevbre, Marcus, Marx, Morrison, Plato, Rich, Simmel, Sontag, Williams",
    "course_description": "Prerequisites: two courses in literature or the instructor's consent. The relationship of critical theory to various literary forms. Specific material for analysis will vary in successive offerings of this course. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Elizabeth Goodstein - Primary Instructor",
    "schedule_location": "TTh 4pm-5:15pm in Callaway Center N118",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ENG_384RW_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3556, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 4-5:15p, Instructor: E. Goodstein, Status: Open",
    "date_accessed": "2023-10-31"
}