{
    "course_code": "ENG 385W",
    "course_title": "Methods for Literary Research: On Friendship",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 5 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "(Same as IDS 385 7) \nOver the course of the last century (even the last decade!) social and technological changes have radically reshaped our attitudes toward friendship, renewing our attention not only to its value and complexity, but also to the proliferating ways that friendships can be formed, mediated, strengthened, or undermined. In this class, we will explore friendship by thinking about its relationship to artistic creation, investigating friendship as it helps, hinders, and itself constitutes a form of art. We will read literary texts and films that explore both real and imagined friendships, bringing them into conversation with essays from philosophy, anthropology, and gender and sexuality studies to ask: what distinguishes friendship from other relationships, and how are these distinctions complicated by crossing racial and gendered lines? How have representations of friendship changed with changing understandings of romance and family? Are friendship's attachments based in likeness, or difference? When is friendship erotic - never, sometimes, always? What are the obligations and ethics of friendship? Most importantly, we will explore friendship at its limits: what are the lines - social, emotional, and aesthetic - that friendship can and cannot cross?\n\n\nPossible readings include fiction and poetry by Virginia Woolf, Frank O'Hara, Nella Larsen, Toni Morrison, and Jane Austen, films like Y Tu Mama Tambien and The Odd Couple, and essays by Montaigne, Aristotle, and Emerson.",
    "course_description": "This course introduces students to the methods and materials of academic literary research and criticism. Focusing on a small body of literature and scholarship within one area of study, the course will teach students to engage with secondary sources, including contextual and/or archival material.",
    "prerequisites": null,
    "instructors": "Michelle Taylor - Primary Instructor",
    "schedule_location": "MW 4pm-5:15pm in Emerson Chemistry Bldg. E363",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ENG_385W_3_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 5685, Section #: 3, Type: LEC, Campus: ATL, Meets: MW 4-5:15p, Instructor: M. Taylor, Status: Wait List",
    "date_accessed": "2024-03-30"
}