{
    "course_code": "ENG 368W",
    "course_title": "Literature & Cultural Studies: Cute Studies",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 0Waitlist Total: 30",
    "waitlist_total": ": 30",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "This course critically examines the aesthetics of cuteness in the context of the politics of race, gender, sexuality, disability, and age, with a special focus on the globalization of Japanese kawaii (\"cute\") culture and its impact on Asian diasporas. In its associations with the small, soft, and simple, cuteness is an aesthetic category intimately bound up in differences of power. Over the past few decades, this aesthetic has been freshly emerging as a global phenomenon in relation to new technologies and the spread of Japanese popular culture.\n\n\nIn this course, we will study literary texts and cultural objects that engage the aesthetic to unpack how cuteness commodifies social difference and distills complex political dynamics within seemingly trivial and mundane aspects of everyday life. We will situate its contemporary popularity in longer histories of imperialism and commodity capitalism, as well as cultural conceptions of Asian people, women, children, and animals. No prior knowledge of Japanese language and culture is required. \n \nTopics to be discussed will include: the historical emergence of cuteness and kawaii; childhood innocence and nostalgia; caricature and animation; globalization and soft power; toys and play; pets and domesticated animals; food and eating; Japanophilia; pink as a cute color; cute robots and digital aesthetics; the ties between the cute, cool, campy, sexy, and uncanny; cuteness's uptake in contemporary literature and art; cuteness's potential for healing and care.",
    "course_description": "An introduction to the relationship between literary studies and the study of cultural theory and popular culture.",
    "prerequisites": null,
    "instructors": "Erica Kanesaka - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in Callaway Center S109",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ENG_368W_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: This section is full 2117, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 10-11:15a, Instructor: E. Kanesaka, Status: Wait List",
    "date_accessed": "2023-10-31"
}