{
    "course_code": "ENG 359W",
    "course_title": "Studies in African American Literature: 1900 to Present: Queerness in Black and White",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 3Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "HAPW w/Race & Ethnicity Req.",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Course Description: This course will look at how Black authors in both the U.S. (and a little of the UK) have explored queer identities from the postwar era up to present day. We'll begin in 1950s Paris, with James Baldwin's Giovanni's Room, and then cross the Atlantic to New York City in order to explore Zami, poet Audre Lorde's memoir of growing up lesbian around the same time. We'll delve into what we think might be the first African American lesbian novel, Ann Shockley's Loving Her, before diving into the late, great and sorely-missed Randall Kenan's A Visitation of Spirits. In our last month, we jump the pond to England, reading Bernadine Evaristo's Booker Prize-winning Girl.Woman.Other., which tells a story of Black women, mothers, daughters, lovers, conservative, liberal, lesbian, straight, non-binary, English, American, that spans the 19th to 21st centuries. We'll finish back stateside with a work by the critically-acclaimed author Brandon Taylor (a Booker Prize finalist) who goes where few queer authors dare,the U.S. Midwest!\n\n\nRequirements: We'll be reading six novels over the course of the semester, and you'll have some smaller writing assignments (about 350 words each) to help you reflect on the texts and deepen our class conversations, and give you some space to explore ideas before the midterm (1750 words) and final (2500 words) papers. Classes will be discussion-based, with some brief lectures on the history and culture surrounding each text, and some small-group work.",
    "course_description": "A topics course dealing with major traditions and issues in African American literature from 1900 to the present. Possible topics include passing and miscegenation, black novels since 1950, Afrofuturism, and black theater.",
    "prerequisites": null,
    "instructors": "Michelle Wright - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Rich Building 108",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ENG_359W_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2134, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: M. Wright, Status: Open",
    "date_accessed": "2024-03-30"
}