{
    "course_code": "ENG 370W",
    "course_title": "Introduction to Digital Humanities",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 0Waitlist Total: 8",
    "waitlist_total": ": 8",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Course Description: Large language models¿casually referred to as AI---are changing fast. The development of machine learning models called transformers in 2019 has led to AI that can debug code, write maybe B- college essays, and create new images. Culturally, ethically, and politically, we have, as a society, barely begun to reckon with the sweeping changes these new models are already ushering into practices from creative writing to criminology to healthcare and more. The humanities must be at the center of discussions about the future of AI so that we think holistically about capabilities and consequences. In this course, we will learn the basics about how the new AI works, what risks it brings, and how it¿s already changing the world. We will also look at other digital technologies that are shaping culture in tandem with AI, such as social media. We will learn about how scholars are drawing on computational methods to study literature and culture. And we will read a novel that captures the experience of life when Very Online. No experience with computer programming or data science necessary.",
    "course_description": "Digital humanities involves the use of computational methods in humanistic research, and it analyzes the socio-cultural implications of digital technologies. This course introduces the field's central methods and debates about their use, culminating in a final project guided by the instructor.",
    "prerequisites": null,
    "instructors": "Dan Sinykin - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in Callaway Center S109",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ENG_370W_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: This section is full 2128, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 1-2:15p, Instructor: D. Sinykin, Status: Open",
    "date_accessed": "2023-10-31"
}