{
    "course_code": "ENG 388W",
    "course_title": "Topics in Lit. & Environment: Anthropocene Ecofiction",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 6Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "This course explores environmental fiction since 2015 to understand how the natural world is changing, in fact and imagination, and how some of our best novelists express the meaning of these changes. The novels studied all deal with current environmental issues and portray human impacts on planetary systems. This \"Anthropocene\" aesthetic opens challenges of fictional time and space, characterization, point of view, and the assimilation of important scientific ideas. Subjects include climate instability, extinctions, migrations, global inequalities, intergenerational justice, and other challenging topics. The premises of the course are that cognitive courage trumps denial and that engaged literature is a vital alternative to fatalism. Some of the following novelists will be included: Richard Powers, Lydia Millet, Imbolo Mbue, Kim Stanley Robinson, Carys Bray, Jenny Offill, and T.C. Boyle. Requirements include informed contribution to discussion, four short papers, two group reports, and a major final essay.",
    "course_description": "A study of literary works of various genres and other imaginative writing about the relation of humans to the non-human world. Approaches may focus on particular genres, periods, or themes (e.g.,\necofiction, ecopoetry, literature of climate change, multispecies writing, animal ethics, etc.).",
    "prerequisites": null,
    "instructors": "John Sitter - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in Math & Science Center - W307C",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ENG_388W_2_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2949, Section #: 2, Type: LEC, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: J. Sitter, Status: Open",
    "date_accessed": "2024-03-30"
}