{
    "course_code": "ENG 789",
    "course_title": "Special Topics In Literature: Novel Theory",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 10",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Through readings of literature, literary and cultural theory, and criticism, this course explores novel theory: its history and trajectory, its major figures and concepts, its long-running and recent debates. Our literary readings will be drawn from Britain during the Victorian era (1837-1901), when the novel became the ascendant popular literary form and proliferated among a wide variety of sub-genres. Our theory and criticism will encompass the nineteenth century through the present, focusing on foundational twentieth-century approaches to the genre. Throughout our study, we will evaluate how novels themselves shape their own theories and how, in doing so, they actively create a world they are sometimes thought passively to represent. \nThe aims of this course extend beyond familiarizing you with theories of the novel and with Victorian fiction: this course will equip you with a set of theoretical models, interpretive methods, and practical skills that you will be able to adapt to other historical eras and literary forms. You will be able to carry this analytical toolkit to your future coursework, research, and teaching, enabling you and your students to examine texts with a sensitive, discerning, and creative eye. \nAssessments will include a class presentation, a midterm conference-length paper, and a choice of final project (a seminar-length paper; a syllabus with assignments; or a digital / public humanities project).",
    "course_description": "Various topics, such as theoretical, generic, or cultural studies of literature.",
    "prerequisites": null,
    "instructors": "Emma Davenport - Primary Instructor",
    "schedule_location": "T 1pm-3:45pm in New Psyc Bldg 394 (36 Eagle Ro",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ENG_789_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2627, Section #: 1, Type: SEM, Campus: ATL, Meets: T 1-3:45p, Instructor: E. Davenport, Status: Open",
    "date_accessed": "2024-03-30"
}