{
    "course_code": "ENG 789",
    "course_title": "Special Topics In Literature: Black Women in the Archive",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 4",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "The scholarly narrative around Black women in the archive has often been one of absence, erasure, and silence. Far less attention has been paid to the methodology of writing about and engaging with Black women's presence in the archive. This course uses the archival works of Black women whose collections are currently held by the Rose Library to encourage a robust scholarly engagement with existent archives of Black women's cultural production. We will focus on the archives of many canonical Black artists and thinkers of the twentieth century, including Lucille Clifton, Alice Walker, Louise Thompson Patterson, Bricktop, and Camille Billops. We will also explore lesser-known figures, like organizer Doris Derby and fortune-teller Mamie Wade Avant. Using these archives, we will discuss the politics of remembrance through assignments that ask students to account for both the lacunae and the abundance within Black women's material afterlives. The course will also engage with published works by authors represented in the archive and with Black feminist archival theory by scholars, librarians, and memory workers. Students will present their independent archival research to the class at the end of the semester, and may choose between the format of a conference paper, a work of creative nonfiction, or an annotated bibliography for their written final project.",
    "course_description": "Various topics, such as theoretical, generic, or cultural studies of literature.",
    "prerequisites": null,
    "instructors": "Marina Magloire - Primary Instructor",
    "schedule_location": "Th 1pm-3:45pm in Carlos Hall 211",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ENG_789_5_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3643, Section #: 5, Type: SEM, Campus: ATL, Meets: Th 1-3:45p, Instructor: M. Magloire, Status: Open",
    "date_accessed": "2024-03-30"
}