{
    "course_code": "ENG 475W",
    "course_title": "Seminar Asian Am.Lit.& Culture",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 0Waitlist Total: 15",
    "waitlist_total": ": 15",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Continuing Communication with Race & Ethnicity(*)",
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Transpacific femininities places gender and sexuality at the center of Asian American literature and culture and the geopolitics of the Pacific Rim. Since at least the nineteenth century, femininity has played a critical role in the material and discursive mediation of transpacific relations: from the circulation of feminized Asian commodities and the migration of sex workers, care workers, and other female laborers to the idea of the Orient as the feminine counterpart to the masculinized West.  \nIn this seminar, we will test the parameters of transpacific femininities as an approach for contending with complex networks of relations within and between multiple competing nations and empires. Rather than read literature and culture as representations that grant us access into the \"authentic\" experiences of marginalized women, we will consider modes of interdisciplinary analysis that activate texts and objects as agents in domestic race relations and international politics.\n\n\nThrough fiction, poetry, and popular culture, we will explore topics that include: the possibilities and limitations of transnational feminist and women of color solidarity; assemblage theory and virtual embodiment; aesthetics and commodity culture; the sexual politics of imperialism, militarism, surveillance, and globalization; and activism through technology, performance, memorialization, and care.",
    "course_description": "Advanced study of Asian American literature and culture, with attention to theory and method.Students develop a nuanced understanding of a specific topic, analyze literature and culture in relation to Asian American history and politics, and explore questions of theory and method.",
    "prerequisites": null,
    "instructors": "Erica Kanesaka - Primary Instructor",
    "schedule_location": "M 1pm-3:45pm in Registrar Room Pool",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ENG_475W_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: This section is full 5239, Section #: 1, Type: SEM, Campus: ATL, Meets: M 1-3:45p, Instructor: E. Kanesaka, Status: Wait List",
    "date_accessed": "2023-10-31"
}