{
    "course_code": "ENG 752R",
    "course_title": "Studies In 20th Cent. American Lit: Faulkner",
    "credit_hours": "2-4",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 13",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "Faulkner was an artist (his mother painted), a poet (influenced by French and British poets of the late 19thcentury, among others), a writer of short stories, a novelist, a screenwriter, an essayist, and one of the most widely translated and influential writers of the 20th century, a Nobel Laureate. In this course, we will undertake a study of his work, with attention to his modernism and aesthetic experiments, the social and literary worlds that shaped his work, his global significance and reception, and his continuing interest for readers and writers in the 21st century.  \nTexts: The Sound and the Fury, As I Lay Dying, Light in August, Absalom, Absalom!, The Wild Palms/If I Forget Thee, Jerusalem, and Go Down, Moses. Some texts provided by professor including short stories, William Faulkner: Early Prose and Poetry (ed. Carvel Collins) and New Orleans Sketches (Collins, ed.), We will examine some of his screenplays: Today We Live (1933), To Have and Have Not (1944), and The Big Sleep (1946). This is a seminar, so reading lists will be, to some extent, individualized to reflect the research interests of participants. More details on Canvas. \nWork: short responses to scholarship and criticism; individual and small-group tutorials; in-class writing; 2 major papers; research; presentations.",
    "course_description": "Readings in key primary texts, critical responses, contextual and/or archival material from the period.  Course may be organized by topic or theoretical approach; or it may focus on the work of one or more key writers of the period (e.g. Eliot, Faulkner, Hughes, Baldwin, Ellison, Morrison, Silko).",
    "prerequisites": null,
    "instructors": "Barbara Ladd - Primary Instructor",
    "schedule_location": "TTh 10am-11:30am in Callaway Center C201",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ENG_752R_2_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 5215, Section #: 2, Type: SEM, Campus: ATL, Meets: TTh 10-11:30a, Instructor: B. Ladd, Status: Open",
    "date_accessed": "2023-10-31"
}