{
    "course_code": "ENG 798R",
    "course_title": "Seminar in Pedagogy and Professionalization",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 15",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2024-01-17 through 2024-04-29",
    "class_notes": "The seminar will provide you with multiple opportunities both to reflect on your  own training and professionalization and to prepare  for teaching a literature course in your fifth year.  Drawing on LGS resources,  you will spend time identifying  your  transferable skills  beyond the professoriate; assessing  your professional  goals;  and committing to taking concrete steps that support them. On the pedagogy front, you will focus on course design;  inclusive teaching;  active, student-centered learning tools and techniques; and assessment, including un-grading. You will also prepare and workshop syllabi and teaching statements.",
    "course_description": "The course prepares students for teaching a literature section in the fall or spring of their fifth year. Students will gain experience in preparing documents for fellowship applications and the job market, such as cover letters, curriculum vitae, teaching, diversity statements, writing samples, and interpretations of job and postdoctoral ads. The seminar will also investigate careers beyond academia, in coordination with the LGS Asst. Dean for Prof. Dev and Career Planning, allied PhD pgms, the Alumni Office, the CFDE, and other relevant programming.",
    "prerequisites": null,
    "instructors": "Patricia Cahill - Primary Instructor",
    "schedule_location": "T 10am-12:45pm in Registrar Room Pool",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ENG_798R_1_W24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 2624, Section #: 1, Type: SEM, Campus: ATL, Meets: T 10a-12:45p, Instructor: P. Cahill, Status: Open",
    "date_accessed": "2023-10-31"
}