{
    "course_code": "CPLT 101",
    "course_title": "Rhetorical Composition/Critical Reading",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 16 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Writing Requirement",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "Topic - We Live Where You Vacation: Tourism, Violence, and Paradise\nThis course is divided in two parts. For the first part of the course, students will plan a vacation to a Caribbean island and repurpose the research done to develop a tourism brochure. We will be paying close attention to how the discourse on tourism advertisement cleverly sneaks ideas of paradise into our minds. Our textbook will be The Norton Field Guide to Writing, which will help us define key concepts for our reading and writing practices. For the second part, we will look closely at perspectives of Caribbean artists and writers as the class begins to think critically of tourism. Some of the texts we will be looking at are the book A Small Place by Jamaica Kincaid, the film Life and Dept (2001), and the zine Turistas by Mela Pabón.  Our discussions will be guided by the questions: What makes a tourist? What aspects of tourism are damaging and violent? What's the actual touristic destination? Students will use critical writing as a tool to wrestle through these questions as they write a paper of one of the selected pieces. This course will be thinking and writing intensive and will culminate in the preparation of a portfolio in which you will reflect on the writing you've created during this class.\nA Small Place by Jamaica Kincaid and The Norton Field Guide to Writing (all other course material's will be available through canvas)",
    "course_description": "Instruction in rhetorical composition, critical reading, reflection, and writing as recursive process. Across themed sections, students engage with diverse genres. Courses share some common assignments including research writing and final student-curated portfolio with reflection project.",
    "prerequisites": null,
    "instructors": "Agnes Sastre-Rivera - Primary Instructor",
    "schedule_location": "MWF 10am-10:50am in Atwood Chemistry Bldg. 316",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 1085, Section #: 1, Type: LEC, Campus: ATL, Meets: MWF 10-10:50a, Instructor: A. Sastre-Rivera, Status: Closed",
    "date_accessed": "2024-03-30"
}