{
    "course_code": "CPLT 389",
    "course_title": "Special Topics: Literature: The Regime of the Image",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 7 / Seats Avail: 4",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Same as FILM 385 1)\n\"The Regime of the Image\" | This course will explore some of the conditions and consequences of the fact that there are vastly more images in circulation now than ever before in human history. The film theorist Patricia Pisters has even suggested that we now live in a \"universe of metacinema\". We shall take as our tutor text Thomas Nail's book, Theory of the Image, which provides both a theoretical basis for our study and a history of how specific kinds of images the digital image or the generative image, for example--have been dominant in particular cultures and at particular historical moments. We'll also give special attention to Henri Bergson's theory of the image, which is directly tied to the birth of cinematography, as well as to Gilles Deleuze's two cinema books on the \"movement image\" and the \"time-image\", as well as to Pisters' book on the \"neuro-image\". Finally, depending on the time available and class interest, we will spend some class time on pattern recognition, and how the human brain processes the perception of images and their storage in memory.\n\n\nList of required books: \nThomas Nail, Theory of the Image\nPatricia Pisters, excerpts from The Neuro-Image and The Matrix of Visual Culture\nGilles Deleuze, Cinema 1 and Cinema 2\nHenri Bergson, excerpts from Matter and Memory and Creative Evolution\n\n\nRequirements: Participation in class discussion and no more than 3 unexcused absences from class; two short essays and a mid-term, then a longer final essay.",
    "course_description": "Lively topical or theoretical approaches to a given set of literary texts or problems. May be repeated for credit when subject varies..",
    "prerequisites": null,
    "instructors": "John H Johnston - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Candler Library 114",
    "course_resources": null,
    "sections": "Class Nbr: 6194, Section #: 4, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: J. Johnston, Status: Open",
    "date_accessed": "2024-03-30"
}