{
    "course_code": "CPLT 751R",
    "course_title": "Spec Topics: Comparative Literature: Fictions of Photography",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 9 / Seats Avail: 4",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Same as FREN 775 1)\nSince its invention in 1839, photography has been a source of fascination, reflection, inspiration, and revulsion for many nineteenth and twentieth century thinkers and writers.  Because the medium of photography has the capacity to record images that are not available to the naked eye and to preserve and repeat them indefinitely, photography has given rise to many powerful written reflections about mourning, memory, time, history, fantasy, ghosts, death, and desire.  In this course, we will examine a selection of literary, philosophical, and theoretical texts to help us think about how photographic writing affects our understanding of images, events, the imagination, and history.  Readings may include literary works by: Baudelaire, Balzac, Champfleury, Maupassant, Nadar, Edgar Allan Poe, Frederick Douglass, Rodenbach, Villiers de L'Isle Adam, Proust, Cixous, and Marguerite Duras and philosophical/critical works by Roland Barthes, Walter Benjamin, Susan Sontag, Philippe Lacoue-Labarthe, and Jacques Derrida.",
    "course_description": "This course focuses on a specific body of literary texts, critical approach, or theoretical problem in the area of Comparative Literature.  Students may repeat this course for credit if the subject matter varies.",
    "prerequisites": null,
    "instructors": "Elissa Marder - Primary Instructor",
    "schedule_location": "T 1pm-3:45pm in Callaway Center C202",
    "course_resources": null,
    "sections": "Class Nbr: 1917, Section #: 1, Type: LEC, Campus: ATL, Meets: T 1-3:45p, Instructor: E. Marder, Status: Open",
    "date_accessed": "2024-03-30"
}