{
    "course_code": "GH 536",
    "course_title": "Religion & Health in Context: HIV",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 30 / Seats Avail: 15",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-01-03 through 2023-01-08",
    "class_notes": "Pre-term course held  1/ 3 - 7 from 8:30am - 5:00pm.",
    "course_description": "This course will explore the various ways in which religion has been utilized since the start of the HIV epidemic to make sense of illness, mobilize or hinder productive responses, and impact policies in the global HIV response. These processes of making meaning and responding have played out in different ways across cultures; the course will critically explore a broad spectrum of religious, political, and public health contexts to assess the influences of religion. The readings for the course are designed to introduce the class topic and students are expected to complete assigned readings prior to class. In many instances, class time will include lecture and discussion of readings but at other times, the class sessions will function to develop ideas introduced in the readings more fully. In other words, students should not expect the class sessions merely to fully summarize assigned readings. Written assignments are designed to test not only students' knowledge of the material but also their ability to integrate that knowledge with critical reflection on both theory and public health practice.",
    "prerequisites": null,
    "instructors": "John Blevins - Primary Instructor",
    "schedule_location": "T 8:30am-5pm in R. Randall Rollins Bldg. R102\nW 8:30am-5pm in R. Randall Rollins Bldg. R102\nTh 8:30am-5pm in R. Randall Rollins Bldg. R102\nF 8:30am-5pm in R. Randall Rollins Bldg. R102\nSa 8:30am-5pm in R. Randall Rollins Bldg. R102",
    "course_resources": null,
    "sections": "Class Nbr: 2838, Section #: 1, Type: LEC, Campus: ATL, Meets: TWThFSa 8:30a-5p, Instructor: J. Blevins, Status: Open",
    "date_accessed": "2024-03-30"
}