{
    "course_code": "GH 585",
    "course_title": "Gender-Based Violence in Global Perspective",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 50 / Seats Avail: 14",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-01-09 through 2023-04-24",
    "class_notes": null,
    "course_description": "This course provides an overview of theories, case studies, and interventions related to gender-based violence, with a focus on lower-income settings and populations. Students are exposed to major theories that have advanced an understanding of the multilevel, social-ecological determinants of GBV, and the implications of GBV for adverse health outcomes across the life course, with a focus on sexual and reproductive health. Issues regarding GBV in highly vulnerable populations (including for example conflict-affected, adolescent, LGBTQ populations) are discussed to gain an understanding of GBV as gender justice and social justice issue, more broadly. Promising interventions for the primary and secondary prevention of GBV victimization and perpetration are emphasized with a focus on evidence based on rigorous impact evaluations. Ethical issues in conducting research on GBV are thoroughly addressed, enabling students to conduct their own research following international ethical guidelines. Legal frameworks and grass-roots social movements also are discussed. By the end of the course, students will have developed the ability to evaluate critically and to identify the relationships between theory, evidence, and practice related to gender-based violence in lower-income settings. This course is offered on alternate spring semesters.",
    "prerequisites": null,
    "instructors": "Cari Jo Clark - Primary Instructor",
    "schedule_location": "F 2pm-5pm in R. Randall Rollins Bldg. R100",
    "course_resources": null,
    "sections": "Class Nbr: 2751, Section #: 1, Type: LEC, Campus: ATL, Meets: F 2-5p, Instructor: Team, Status: Open",
    "date_accessed": "2024-03-30"
}