{
    "course_code": "ENGCW 190",
    "course_title": "Freshman Seminar:Creative Writing: Writing in the Garden",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "(Freshmen Seminar - Limited to First Year Students Only)\nComplete course atlas information (including texts and grading) is available on the Creative Writing Program website: https://creativewriting.emory.edu/academics/Fall%202022%20course%20atlas.html\n\n\nThe title of this course names both what we'll study (texts involving gardens) and what we will do ourselves. We will often gather outside, and course requirements will include an hour of work each month in Emory's Educational Gardens. (No prior experience is necessary, and the nature of the work will be adaptable/accessible to all.) We will additionally attend events during Jamaica Kincaid's visit to campus, and make excursions beyond our classroom to explore gardens and their histories. Throughout, you will collect language and compose observations drawn from your reading and experiences in an informal notebook, which you will make use of when completing writing assignments. These assignments will periodically be shared and discussed in class, and you will be expected to offer each other insightful, generative feedback. You will also receive feedback in two individual conferences with Prof. Christle. This feedback will assist you in revising two assignments.",
    "course_description": "Topics/genres vary. Emphasizes writing and reading as elements in intellectual exploration. Does not satisfy first-year writing requirement.",
    "prerequisites": null,
    "instructors": "Heather Christle - Primary Instructor",
    "schedule_location": "T 2:30pm-5:30pm in Emerson Chemistry Bldg. E103",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 1291, Section #: 1, Type: SEM, Campus: ATL, Meets: T 2:30-5:30p, Instructor: H. Christle, Status: Closed",
    "date_accessed": "2024-03-30"
}