{
    "course_code": "SPAN 285",
    "course_title": "Topics: Hispanic Studies: Staged Reading Practice",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 7 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Same as THEA 289 1)\n* This course is taught in Spanish*\n(Complete Topic - Staged reading practice: Bodas de sangre by Federico Garcia Lorca)\n\"Que yo no tengo la culpa, que la culpa es de la tierra.\"  This interdisciplinary, one-credit course is devoted entirely to Federico Garcia Lorca's famous work, Bodas de Sangre, and coincides with the Theater Emory production of Blood Wedding, translated by Langston Hughes. We will study the play in Spanish, and prepare for a dramatic reading of the text, practicing oral skills, theater techniques, play analysis, and the bringing-to-life of a dramatic story. The course culminates in a public staged reading of the play (scripts in hand), including selections of Lorca's poetry and featuring Flamenco music and dance. We will also attend the Theater Emory production of Blood Wedding and place both texts and both languages in conversation with one another.\nPrerequisite: Spanish 212",
    "course_description": "Intermediate-level studies of the language, discourse, literature, and/or culture of the Spanish-speaking world. May be taught in English or Spanish. Students may take multiple SPAN 285 courses provided that they focus on different topics.",
    "prerequisites": null,
    "instructors": "Maria Gonzalez - Primary Instructor",
    "schedule_location": "W 2pm-2:50pm in Rich Building 210",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 5841, Section #: 2, Type: LEC, Campus: ATL, Meets: W 2-2:50p, Instructor: Gonzalez/Owen, Status: Closed",
    "date_accessed": "2024-03-30"
}