{
    "course_code": "SPAN 341",
    "course_title": "Hispanic Utopias/Dystopias",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 9",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Irregularly",
    "requirement_designation": "Intercultural Communication(*)",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Content: Utopia and dystopia represent opposing sides of the same coin. Dissatisfied with the contemporary political and social conditions in which they live, Spanish/Latin American/Latinx authors and filmmakers express their critiques in speculative fictions and activist projects that imagine society differently, inventing alternative realities that are either sunnier or bleaker than their own. Such critiques may look nostalgically to the past; in other instances they are picture a terrifying future. Beginning in the Renaissance, we find many examples of texts that envision a more idyllic world; since the 19th century, ambivalence surrounding the ideas of progress and modernity has given rise to darker, dystopian views. Students will enter the weird cosmographies sometimes comical, sometimes apocalyptic, always thought-provoking of these alternative worlds that give expression to debates over such topics as gender identity and relations, political systems, urbanization, technological innovation, and environmental degradation. In addition to narratives, films, and television we will consider experimental communities (physical and online) and protest movements.\n\n\nEvaluation: Active class participation; short writing assignments based on readings/viewings; final project.\nPrerequisites: At least 1 foundational course for Spanish majors or minors, chosen from 301, 302, 311, 318 or 385. Students wishing to enroll without this prerequisite should consult with the instructor.",
    "course_description": "The concepts of utopia and dystopia represent opposing sides of the same coin. This course examines speculative fictions and activist projects through which Spanish, Latin American and Latinx authors, filmmakers, and artists critique the political and social conditions in which they live.",
    "prerequisites": null,
    "instructors": "Hazel Gold - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in Callaway S501",
    "course_resources": null,
    "sections": "Class Nbr: 3407, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 10-11:15a, Instructor: H. Gold, Status: Open",
    "date_accessed": "2024-03-30"
}