{
    "course_code": "SPAN 311",
    "course_title": "Hispanic Narrative",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 5Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "Intercultural Communication(*)",
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Stories of Latinx Resistance and Accommodation\nThis course introduces students to Latino/a historical, literary, and cultural narratives in the United States from late 19th century to the present, with particular attention to how US economic expansion and imperialist incursion, coupled with both its historical and social influence, have impacted the construction of Latino/Latinx identities in the U.S. Through a gender and racial lens, we will examine the narrative productions' short stories, poetry, novels, performances, and films of Chicano, Dominican, Puerto Rican, Cuban, and Central American authors. This course will expand on how Latinx communities establish forms of resistance and accommodation while embracing and negotiating with new collective and individual identities in relation to Euro-American mainstream and with other immigrant and racialized communities.\n\n\nPREREQUISITE: Spanish 212 or an Official Spanish Placement for a Foundational Course level (Span 300-318). If you haven't taken our online Spanish Placement Exam, please do so at your earliest convenience by going to http://spanport.emory.edu/home/undergraduate/placement/index.html. Be sure to read all instructions carefully as not doing so may delay your results.",
    "course_description": "Introduction and theoretical overview of Hispanic narrative.",
    "prerequisites": null,
    "instructors": "Leda Lozier - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in North Decatur Building 111",
    "course_resources": null,
    "sections": "Class Nbr: 3406, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: L. Lozier, Status: Open",
    "date_accessed": "2024-03-30"
}