{
    "course_code": "SPAN 485",
    "course_title": "Topics in Hispanic Culture: Latin American & Latinx Music",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 10Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Latin American and Latinx Music\nThis interdisciplinary course studies Latin American music from the beginning of the Twentieth century to the present. Around 1900, technologies that reproduced sound disseminated beats more quickly than had been done in the past, via ships transporting goods (including inhumanely enslaved human cargo) between Europe and the Americas. The sonic network was important to the internal processes of nation building that were responsible for rhythms such as the son, the milonga, the tango, or the corrido, as these became associated with the \"living tradition\" responsible for distinct social particularities. In truth, the \"sonic landscapes\" never simply stopped at the borders of the newly created administrative entities, as was evident with the travelling beats of the son within the context of Europe's inter-war fascination with all things African.  \nAs we study both popular as well as \"difficult\" sonic expressions, the course doubles as an alternative Latin American cultural studies survey--focusing on Tango, Rumba, Mambo, Samba, Bossa Nova, Calypso, Mozambique, Nueva Trova, Timba, Rock en Español and Reggaetón, with paired literary readings as well as films that allow us to understand issues relating to reception, analysis, and social or historical context. No knowledge of instrumentation or musical theory is needed for this course.",
    "course_description": "Upper-level research seminar on topics related to the language, discourse, literature, and/or culture of the Hispanic world. Students may take multiple SPAN 485 courses provided that they focus on different topics.",
    "prerequisites": null,
    "instructors": "Jose Quiroga - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Callaway Center S108",
    "course_resources": null,
    "sections": "Class Nbr: 3466, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: J. Quiroga, Status: Open",
    "date_accessed": "2024-03-30"
}