{
    "course_code": "SPAN 485",
    "course_title": "Topics in Hispanic Culture: Feminist Writing in L.America",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 6",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Feminist Writing in Latin America\nThis seminar offers a historical perspective on the feminist movements that currently lead the social scene in Latin America and the Caribbean and that have gathered significant political force. We will focus on the creative capacity of feminism to generate alternative ways of organizing and imagining the world.To do this, we will study literary works, films, examples of the visual arts, historical archives, and the cultural production of different feminist groups. The emphasis on creativity will allow us to understand feminism as an inclusive movement without a predetermined or monolithic political subject. It will also enable us to understand the connection between different forms of marginalization and exploitation within current systems of oppression. Therefore, this course is especially pertinent to contextualize the forms of resistance that counteract the criminalization of immigration, gender violence, extractivism, and the debt economy.\n\n\nSome of the writers, thinkers, artists, and activists that we will study are Juana Manso, Flora Tristán, Luisa Capetillo, Gabriela Mistral, Alfonsina Storni, Gloria Anzaldúa, Rosario Castellanos, Miyó Vestrini, Blanca Varela, Victoria Cruz, Nellie Campobello, Sara Gómez, Aurora Levins Morales, Cristina Rivera Garza, Sueli Carneiro, Sandra Abd'Allah Álvarez Ramírez, Samanta Schweblin, Carolina Caycedo, Claudia Hernández, Nicole Cecilia Delgado, Yolanda Arroyo Pizarro, Rita Indiana Hernández, Carmen María Machado, Verónica Gago, Luci Cavallero, Helena Silvestre, Ariadna Godreau-Aubert, Denise Ferreira da Silva, Gladys Tzul, and Lorena Cabnal.\n\n\nPREREQUISITE: At least one Foundational Course (SPAN 300-318)",
    "course_description": "Upper-level research seminar on topics related to the language, discourse, literature, and/or culture of the Hispanic world. Students may take multiple SPAN 485 courses provided that they focus on different topics.",
    "prerequisites": null,
    "instructors": "Laura Torres-Rodriguez - Primary Instructor",
    "schedule_location": "TTh 4pm-5:15pm in Carlos Hall 212",
    "course_resources": null,
    "sections": "Class Nbr: 6164, Section #: 3, Type: LEC, Campus: ATL, Meets: TTh 4-5:15p, Instructor: L. Torres-Rodriguez, Status: Open",
    "date_accessed": "2024-03-30"
}