{
    "course_code": "SPAN 409",
    "course_title": "Medical Discourse in Latin America",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 4 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "(Same as HTLH 469 1, LACS 409 1, LING 409 1)\n\n\nThis course examines how particular narratives about the body, health, and wellbeing are constructed and circulated in Latin America. Drawing on a number of classic and contemporary texts, we consider both the specificity of local medical narratives and the processes, which increasingly link these systems of knowledge and practice. The course queries how presupposed notions of language, communication, narrative, media, and the like provide implicit foundations for producing and naturalizing notions of health, disease, medicine, and the body and their associated practices and materialities. Topics covered include narrative production; local theories of disease causation and healing efficacy; narratives of embodiment; medicalization; structural violence; the meanings and effects of new medical technologies; and global health.)\nTexts: Provided by instructor.\nPrerequisites: At least one foundational course (SPAN 300- 318) or permission from instructor",
    "course_description": "This course examines how narratives about the body, health, medicine, and well-being are constructed, naturalized, and circulated in Latin America.",
    "prerequisites": null,
    "instructors": "Xochiquetzal Marsilli-Vargas - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in North Decatur Building 109",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3414, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 10-11:15a, Instructor: X. Marsilli-Vargas, Status: Closed",
    "date_accessed": "2024-03-30"
}