{
    "course_code": "SPAN 485",
    "course_title": "Topics in Hispanic Culture: Mass Incarceration in Lat. Am.",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 3Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Complete Topic: Mass Incarceration in Latin America\nThis class examines mass incarceration in Latin America through literature, film, and the social sciences, with special focus on the 20th and 21st centuries.\n\n\nGlobal mass incarceration is one of the most pressing issues of the 21st century. The region of Latin America has seen some of the greatest expansion worldwide, being home to two of the world's countries with the highest rates of incarceration, and some of the most overcrowded prisons. This class investigates the expansion of punitive systems of detention in Latin America in the second half of the 20th century and the beginning of the 21st, and its relationship to the region's colonial and racial history. As a literature and visual studies class, it approaches this investigation through narrative and image. It asks, in part, what role does the written word and the graven (moving) image in the form of novels, print journalism, and movies and television play in that expansion, and what possibilities do they open to challenge it? How do literary and media representations solidify or deconstruct the categories of race, gender, and class that system depends on, and the racist and colonial systems which produce them?\n\n\nWhile not a history or social sciences class, those disciplines play a significant part in the contextualization of the literary and visual works we examine. Meaning, apart from our primary sources, much of what we read will be historical and social sciences work in order to better understand the social and political context that permits, or potentially demands, a racialized system which houses over 10 million people globally. One of our driving questions will be, what does fiction and visual work offer that this `hard data' does not?\n\n\nEven though this is a Spanish language course, we do not exclude indigenous language or Portuguese speaking parts of Latin America from our analysis, hoping to understand this system and resistance to it as translingual, transhemispheric, and transnational.",
    "course_description": "Upper-level research seminar on topics related to the language, discourse, literature, and/or culture of the Hispanic world. Students may take multiple SPAN 485 courses provided that they focus on different topics.",
    "prerequisites": null,
    "instructors": "David Nichols - Primary Instructor",
    "schedule_location": "MW 4pm-5:15pm in Candler Library 122",
    "course_resources": null,
    "sections": "Class Nbr: 3467, Section #: 2, Type: LEC, Campus: ATL, Meets: MW 4-5:15p, Instructor: D. Nichols, Status: Open",
    "date_accessed": "2024-03-30"
}