{
    "course_code": "WGS 585",
    "course_title": "Special Topics: Women, Gender, & Sexuality Studies: Feminism and Deconstruction",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 9 / Seats Avail: 3",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "(What happens when we deconstruct a text, a theory, or an identity? What does it mean to say \"there is no outside-text\" (il n'y a pas de hors-texte)?  What are the critical effects of putting something 'under erasure'?  What is at work in Derrida's infamous neologism différance?  This course in an introduction to the logics and methodology of deconstruction and their implications for feminist and queer readers. The course will begin with close readings of early texts by Derrida (e.g., Of Grammatology, 'Différance', 'Freud and the Scene of Writing') and will examine key hinge terms generated by his deconstructive readings: writing, gram, trace, pharmakon, différance.  The course will then investigate how this work has been taken up by influential feminist and queer readers (e.g., Judith Butler, Penelope Deutscher, Lee Edelman, Barbara Johnson, Vicki Kirby, Gayatri Spivak).  Students will emerge from this course with a proficiency in the methodology of deconstruction and an understanding of the scope of deconstruction's influence on feminist and queer theory.)\nSet readings\nAll reading will be available on Canvas and on Course Reserves in Woodruff Library",
    "course_description": null,
    "prerequisites": null,
    "instructors": "Elizabeth Wilson - Primary Instructor",
    "schedule_location": "M 1pm-4pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 3701, Section #: 2, Type: LEC, Campus: ATL, Meets: M 1-4p, Instructor: E. Wilson, Status: Open",
    "date_accessed": "2024-03-30"
}