{
    "course_code": "POLS 150",
    "course_title": "Foundations of American Democracy",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 30 / Seats Avail: 8",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "Discussion based course on the foundational ideas that underlie American democracy and other major American political debates from the revolutionary era to the present. Readings drawn from classic texts and original documents, speeches and writings of leading American political figures.This course is part of Emory's Voluntary Core Curriculum program.\n\n\nThis class is a study of the basic principles of American political life: democracy, equality, and liberty. Through a close reading of core texts of the American political tradition, we will attempt to see how these ideas took hold in the U.S., what arguments were made on their behalf, and what possible pitfalls there are for a society dedicated to those ideas. The course will proceed entirely through a close reading of primary sources. There will be units on John Locke and the basic principles of liberal democracy, on the ratification debate, on Alexis de Tocqueville's Democracy in America, on race and civil rights, and on the competing visions of progressivism and conservatism. Participation in this course includes attendance at the four Emory Williams Memorial Lectures (for which the fourth credit hour is awarded). This course fulfills a GER requirement and is one of the \"Great Works\" courses in Emory's Voluntary Core Curriculum program. These courses provide a coherent and linked group of courses that address questions traditionally at the center of a liberal arts education. For more information on the Voluntary Core Curriculum program, see http://college.emory.edu/home/academic/voluntary-core-program/.",
    "course_description": "Discussion based course on the foundational ideas that underlie American democracy and other major American political debates from the revolutionary era to the present. Readings drawn from classic texts and original documents, speeches and writings of leading American political figures.This course is part of Emory's Voluntary Core Curriculum program.",
    "prerequisites": null,
    "instructors": "Steve Del Visco - Primary Instructor",
    "schedule_location": "TTh 8:30am-9:45am in Tarbutton Hall 106",
    "course_resources": null,
    "sections": "Class Nbr: 1460, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 8:30-9:45a, Instructor: S. Del Visco, Status: Open",
    "date_accessed": "2024-03-30"
}