{
    "course_code": "POLS 285",
    "course_title": "Spec Topics: Political Science: Israeli-Palestinian Conflict",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "Title: Israeli-Palestinian Conflict. This course covers the history of the Israeli-Palestinian conflict from the 1880s on through today. It will introduce students to early Zionist debates and the late Ottoman context before moving on to discussing violence during the British Mandate period, the rise of the State of Israel, and the reappearance of the Palestinian cause on the world stage after the 1967 war. The course will include sessions that examine previous bouts of violence as well as various attempts at peace, but war and peace will not be the course's only focus; its exploration of Palestinian and Israeli lived experiences will also receive significant attention, from historical times through the present day. \nThe course will use biographical sources to engage students, teaching them about various individuals, stories as a way of shedding light on each stage of the conflict. Every week students will have a \"typical\" reading assignment, such as an academic article or book chapter. But along with it, they will have an assigned source that will highlight the story of an individual that will help illustrate a core aspect of the lesson. Some of these historic and contemporary individuals will be prominent figures, while others will be relatively obscure. In certain weeks the assigned material will be a primary source while in others it may be secondary. While most weeks it will be a reading assignment, in some cases there will be podcasts or videos.",
    "course_description": "Selected topics and problems in political science. Content will vary in successive offerings of this course. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Geoffrey Levin - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in White Hall 110",
    "course_resources": null,
    "sections": "Class Nbr: 2612, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 1-2:15p, Instructor: Levin/Strakhova, Status: Open",
    "date_accessed": "2024-03-30"
}