{
    "course_code": "POLS 369",
    "course_title": "Public Policy Analysis",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 40 / Seats Avail: 25",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "his course provides an overview of public policy analysis and program evaluation; what it is, how to do it, and most important, how to critically assess studies others have done. The course will examine both quantitative and qualitative methods for analyzing public policies; while some statistical material will be covered, emphasis will be placed on discussion of research strategies, designs, and interpretation of results. Illustrations will be drawn from major evaluation studies from a variety of policy areas including domestic violence, maternal and child health, K-12 education, homelessness, preschool education, community and economic development, workforce development, and welfare reform, among others.\nThe course is divided into five modules. Part I provides an overview of the role of policy analysis and program evaluation in public policymaking. Part II focuses on the process of causal inference and presents a variety of evaluation designs that allow the analyst to draw inferences about the causes and effects of public policies. Part III is a synthesis of research design issues covered in Part II and the various stages of the policymaking process. Part IV addresses the political context within which policy analysis and program evaluation takes place through an examination of the utilization of evaluation research by policy makers. In Part V, students will make formal presentations based on their group research projects.",
    "course_description": "Overview of the quantitative and qualitative methodologies employed by analysts in determining whether public programs and policies work. Attention is also given to research utilization and the role of analysis in the policymaking process.",
    "prerequisites": null,
    "instructors": "Michael Rich - Primary Instructor",
    "schedule_location": "TTh 5:30pm-6:45pm in New Psyc Bldg 230 (36 Eagle Ro",
    "course_resources": null,
    "sections": "Class Nbr: 1508, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 5:30-6:45p, Instructor: M. Rich, Status: Open",
    "date_accessed": "2024-03-30"
}