{
    "course_code": "POLS 494W",
    "course_title": "Research Topics Seminar in Political Sciences: Modeling Nonlinear Politics",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 9",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Continuing Writing Requirement",
    "permission": null,
    "dates": "2022-01-11 through 2022-04-25",
    "class_notes": "This cutting edge course is designed to give each student a competitive edge when studying politics and society. The purpose of the course is to enable each student to develop models of politics and society that are unique. This is very different from statistical models that are typically just lines (everyone does those). Only high school algebra is needed for this course in terms of math capability. Students who want to stand out need to think \"outside of the box\" by learning how to develop models that exactly match their theories. The tools provided in the course to do this are very user friendly (drawing boxes and arrows), yet the models are filled with nuance and complexity. Having such skills is exceptionally valuable to potential employers, and these same skills will serve students well in graduate school where original thinking is a must. In the course, students write a research paper that features one of their own models that is developed over the semester.\nThe POLS 208 prerequisite may be waived with the approval of the instructor.",
    "course_description": "Research Seminar on selected topics and problems in political science. Class will fulfill the \"research\" requirement for the political science major. May be repeated for credit when the topic varies.",
    "prerequisites": "POLS 208 or POLS_OX 208 or equivalent transfer credit as prerequisite.",
    "instructors": "Courtney Brown - Primary Instructor",
    "schedule_location": "TTh 4pm-5:15pm in Math & Science Center - N302",
    "course_resources": null,
    "sections": "Class Nbr: 1468, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 4-5:15p, Instructor: C. Brown, Status: Open",
    "date_accessed": "2024-03-30"
}