{
    "course_code": "POLS 556",
    "course_title": "Political Institutions",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 8 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2022-01-10 through 2022-04-25",
    "class_notes": "This course is designed to introduce students to the theoretical problems that institutions address and substantive illustrations of those problems. The class begins with an overview of current approaches to research on institutions and continues with a more detailed focus on specific socials problems institutions are designed to solve, such as delegation, collective action, and preference aggregation. For each theoretical problem, the course will cover substantive applications from across the various subfields in political science. Additional issues, such as institutional change and endogeneity, not covered in detail will be introduced at the end of the course.",
    "course_description": "This course is designed to introduce students to the theoretical problems that institutions address and substantive illustrations of those problems. The class begins with an overview of current approaches to research on institutions and continues with a more detailed focus on specific social problems institutions are designed to solve, such as delegation, collective action, and preference aggregation. For each theoretical problem, the course will cover substantive applications from across the various sub-fields in political science.",
    "prerequisites": null,
    "instructors": "Jennifer Gandhi - Primary Instructor",
    "schedule_location": "T 4pm-6:45pm in Tarbutton Hall 120A",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 1573, Section #: 1, Type: LEC, Campus: ATL, Meets: T 4-6:45p, Instructor: J. Gandhi, Status: Closed",
    "date_accessed": "2024-03-30"
}