{
    "course_code": "QTM 185",
    "course_title": "Applied Topics in QTM: AI/ChatGPT 101&Real-World App.",
    "credit_hours": "2",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 3Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Irregularly",
    "requirement_designation": null,
    "permission": null,
    "dates": "2023-08-23 through 2023-12-05",
    "class_notes": "Welcome to AI/ChatGPT 101 and Real-World applications! As you know, AI is one of the biggest trends and business professionals and companies are trying to figure out how to best leverage it for competitive advantage. This course is designed for students with varying levels of knowledge in Artificial Intelligence (AI). Whether you are a freshman or a senior, this class will take you on a journey through the world of AI, exploring state-of-the-art language models like ChatGPT, and their practical applications in real-world scenarios. Through class discussion, guest lectures, hands-on exercises, and individual / group projects, you will gain an understanding of AI tools, the latest trends/challenges facing the industry, and how to leverage emerging technologies for real-world application. We will also spend time on what AI tools you find useful / interesting, discussing how to determine if AI tools are accurate, and the responsible / ethical side of AI and adjacent spaces like bias in AI. The course aims to challenge advanced students while ensuring that those with little knowledge can grasp the fundamental concepts.",
    "course_description": "Topics course intended for early-career students. Topics allow students to explore the foundations, theory, and methods of data science, and examine the ways in which data driven solutions power industry, government, and the non-profit sector in an applied setting.",
    "prerequisites": null,
    "instructors": "Renee Ducre - Primary Instructor",
    "schedule_location": "Th 4pm-6pm in Math & Science Center - N302",
    "course_resources": null,
    "sections": "Class Nbr: 6614, Section #: 2, Type: SEM, Campus: ATL, Meets: Th 4-6p, Instructor: R. Ducre, Status: Open",
    "date_accessed": "2024-03-30"
}