{
    "course_code": "HIST 190",
    "course_title": "Freshman Seminar: Doctors & Doctoring in US Hist",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "First-Year Seminar",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Freshmen Seminar - Limited to First Year Students Only) This course offers an introduction to the history of medical care in America from colonial times to roughly the present. Focusing around both case studies and general themes, drawing on a variety of materials (encompassing fiction, autobiographies, secondary texts, images, and films) as well as vigorous class discussion, the course will explore both what happened and why the story unfolded as it did. Questions addressed include: How has the basic meaning of health, illness, and medical caregiving changed over time? Who were the caregivers (and why did physicians gain preeminence)? Which constituencies have benefitted from American doctors and doctoring and which have not? The latter portions of the course will give particular attention to issues shaping American medicine today, while striving to understand current issues as part of ongoing historical processes. \nAssessments will be based on thoughtful engagement in weekly discussions and two written assignments of approximately ten pages each.",
    "course_description": "Introduces first-year students to the discipline of history, particularly historical sources and methods; aims to improve critical reading, analytical, and writing skills in small group discussion.",
    "prerequisites": null,
    "instructors": "Jonathan Prude - Primary Instructor",
    "schedule_location": "T 4pm-6:45pm in Bowden Hall 116",
    "course_resources": null,
    "sections": "Class Nbr: 2615, Section #: 1, Type: SEM, Campus: ATL, Meets: T 4-6:45p, Instructor: J. Prude, Status: Open",
    "date_accessed": "2024-03-30"
}