{
    "course_code": "HIST 241W",
    "course_title": "Topics in History and Text: Outsiders in Nazi Germany",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Same as JS 280W 1) This course analyses German society under Nazism, especially Nazi efforts to establish the utopia of a racially, socially, and physically homogenous society. The creation of this people's community was to be achieved by violently excluding people who were deemed deviant from the norms the Nazi Party was propagating. The class examines the interplay between inclusion and exclusion and hence the production of outsiders. Topics in this class include the biologization of politics; the application and radicalization of racial hygiene (eugenics); the history of the autism diagnosis; the regime's ableism; the persecution of homosexuals; and the centrality of antisemitism to all social and political Nazi projects. These topics will be introduced by an overview of the political history and ideology of German culture from the 1920s to 1945. We will analyze written primary sources, film propaganda, and present-day reverberations of this history. This course fulfills the Emory College Continuing Writing Requirement.",
    "course_description": "The course demonstrates how literary, artistic, and/or cinematic texts, when understood in relation to the context of their production, can be used to study selected historical themes.",
    "prerequisites": null,
    "instructors": "Astrid M. Eckert - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in Bowden Hall 323",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2599, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 10-11:15a, Instructor: A. Eckert, Status: Wait List",
    "date_accessed": "2024-03-30"
}