{
    "course_code": "HIST 285",
    "course_title": "Topics: Historical Analysis: Introduction to Public History",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 24 / Seats Avail: 16Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Do you enjoy visiting museums or historic sites? Are you curious about the ways historic documents are collected and preserved in archives? Are you intrigued by recent conversations about the removal or alteration of historical monuments? Are you interested in a potential career in history outside the world of academia? In this course, we will explore all these potential topics of interest through the study of public history, or history outside of the academy. By looking at and engaging broadly with the work of public historians, students will be exposed to a new world of possibilities for a background knowledge in history.  This course will expose students to a wide variety of public historical practices that occur through archival management, preservation, exhibition design, oral history, digital history, grant writing, public programing, and historical site management. By the end of this course, students will be familiar with multiple facets of public history practice as well as key readings, themes, and issues in the field including but not limited to memory, authority, and interpretation. This class will be heavily centered around group work and networking to highlight the collaborative nature of public history practice. Students will also be introduced to a variety of potential career paths in public history and be afforded opportunities to explore topics of personal interest.)",
    "course_description": "An introductory course on the nature and methods of history. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Jessica Locklear - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm in Callaway Center S103",
    "course_resources": null,
    "sections": "Class Nbr: 2602, Section #: 2, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: J. Locklear, Status: Open",
    "date_accessed": "2024-03-30"
}