{
    "course_code": "HIST 285",
    "course_title": "Topics: Historical Analysis: South American Dirty Wars",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 5Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Same as LACS 270 2) During the 1960s and 1970s, a succession of coups d'états in South America initiated long-lasting military dictatorships in Argentina, Bolivia, Brazil, Chile, Ecuador, Peru, and Uruguay. Military governments rose to power, arguing they had defeated a communist threat hovering over the continent and the world. But how can a cross-continental movement of military governments last so long in different countries? \nSouth America had been through authoritarian periods before, but the dictatorships installed new exception regimes in which bureaucracy, authoritarianism, and illegality worked together. Meanwhile, insurgent-left political groups and grassroots movements (Black, LGBT, women, and workers) fought against the military state, trying to overturn its rule. Some used culture as a resistance medium in which the intersection of sounds, images, ideas, and political views led to a new form of understanding art.  \nThrough a wide range of primary sources (testimonies, interviews, political police documents, etc.), secondary sources, including literature, film, music, and art, and essential concepts (gender, race, class, sexuality, power, violence, and resistance) we will construct the military dictatorship's history and understand its present configurations.",
    "course_description": "An introductory course on the nature and methods of history. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Ayssa Yamaguti Norek - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in Callaway Center S105",
    "course_resources": null,
    "sections": "Class Nbr: 3315, Section #: 4, Type: LEC, Campus: ATL, Meets: TTh 1-2:15p, Instructor: A. Yamaguti Norek, Status: Open",
    "date_accessed": "2024-03-30"
}