{
    "course_code": "HIST 338",
    "course_title": "Jews of Eastern Europe",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 13 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Wait List",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "HSC w/Race & Ethnicity Req.",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Same as JS 338 1)\nOn the eve of the Holocaust, a majority of world Jewry lived in Eastern Europe, especially Poland and the USSR. Many of the signature features of modern Jewish life -Hasidism, modern Jewish literature, Yiddish, Zionism, revolutionary socialism - derive from the centuries-long robust Jewish civilization in the East. This course explores the origins, dynamic growth, and near destruction of East European Jewry from the Middle Ages to the Holocaust and the challenges to Jewish life in this region in the post-WWII era. This course will make extensive use of primary documents legal charters, memoirs, communal records, Hasidic tales, short stories, war reportage - to give us the tools to reconstruct this history together. We will also watch films and critically assess the recent Broadway versions of Fiddler on the Roof. This course fulfills the General Education Requirement in History, Society and Cultures; and Race and Ethnicity.\nThere is an optional 1-credit study abroad add-on to this course titled \"Jews of Poland: History and Memory\". In May 2023, we will spend ten days in Krakow and Warsaw, touring the material remains of this history, experiencing post-Soviet Jewish renewal, and investigating how the histories of Nazi occupation and Soviet domination are remembered and memorialized in Poland today. This is an opportunity to travel and engage in critical conversations on genocide, reconciliation, cultural heritage, memorialization, and refugee crises past and present.",
    "course_description": "On the eve of the Holocaust, a majority of world Jewry lived in Eastern Europe (esp.Poland, USSR).This course explores the origins, dynamic growth, and near destruction of East European Jewry from the Middle Ages to the Holocaust and the challenges to Jewish life in this region in the post-WWII era.",
    "prerequisites": null,
    "instructors": "Ellie Schainker - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Bowden Hall 116",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 4820, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 10-11:15a, Instructor: Schainker/Cocking, Status: Wait List",
    "date_accessed": "2024-03-30"
}