{
    "course_code": "HIST 385",
    "course_title": "Spec Topics: History: History of Skiing & Snowsports",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 34 / Seats Avail: 10Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "This course explores the history of snow sports, especially skiing and snowboarding, from the 18th century to today. This class is not only for history majors or athletes, but also for business students, and anyone interested in environmental history, sports history, business history, and the history of gender and race. Students who have never taken a history course and first-year students are welcome. Each student will do a short final research project that will contribute to a website hosted by Emory. \nThe class will look at the creation of skiing in Europe, the expansion of leisure sports after 1960 around the globe, the development of ski schools and ski patrols, environmental issues, avalanche control, the history of the land and the indigenous peoples, snow fashions, and the business of resorts, among others. \nAssignments: Weekly readings and videos, pop quizzes, and a final research project and lead-in assignments for that project. \nReadings: All online. No book purchases required. \nThis course fulfills the following History Major Concentrations:  General Studies in History, United States History; European History; Law, Economics, and Human Rights \nThis course is fulfilling requirements for the Sustainability Minor.",
    "course_description": "Selected topics in history for advanced students. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Judith Miller - Primary Instructor",
    "schedule_location": "TTh 5:30pm-6:45pm in Atwood Chemistry Bldg. 215",
    "course_resources": null,
    "sections": "Class Nbr: 2603, Section #: 3, Type: LEC, Campus: ATL, Meets: TTh 5:30-6:45p, Instructor: J. Miller, Status: Open",
    "date_accessed": "2024-03-30"
}