{
    "course_code": "HIST 385",
    "course_title": "Spec Topics: History: Am.Civil War & Reconstruction",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 24 / Seats Avail: 18Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Same as AMST 385 2)\nIn this course, we will investigate the conflicts that sparked the Civil War in the U.S. and how, or if, these conflicts came to a close after the war. This course will center how different groups of people, particularly those whose roles have traditionally been less prominent in the ways in which histories of the Civil War and Reconstruction have been written, have contributed to the narrative of that history. Their lives and actions will be centered as we ask questions such as: What roles did these groups play in key political, social, and economic developments that shaped the war and the period afterwards? and how does centering their actions shape how we think of these developments? Delving into primary sources representing a diverse range of perspectives, we will examine how categories of gender, race, and class inform the ways in which histories of the U.S. Civil War and Reconstruction have been written and how we understand these histories.",
    "course_description": "Selected topics in history for advanced students. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "J.E. Morgan - Primary Instructor",
    "schedule_location": "MW 2:30pm-3:45pm in Math & Science Center - N306",
    "course_resources": null,
    "sections": "Class Nbr: 2605, Section #: 4, Type: LEC, Campus: ATL, Meets: MW 2:30-3:45p, Instructor: J. Morgan, Status: Open",
    "date_accessed": "2024-03-30"
}