{
    "course_code": "HIST 385",
    "course_title": "Spec Topics: History: History of Tokyo 1590-Present",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 24 / Seats Avail: 11Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Same as EAS 385 1)\n(The Greater Tokyo Metropolitan area is home to 37 million people, more than three times the entire population of the state of Georgia. And yet, four centuries ago Tokyo (at the time called Edo) was a small village devoid of any cultural or political pedigree. Then, in 1590, a powerful samurai lord moved in and set in motion a process that turned the village of Edo into a cultural, economic, and political powerhouse. By the year 1700, Edo was already home to one million people! This class follows the transformation of the village of Edo into the megalopolis of Tokyo by looking at the ways in which urban spaces and traditions were envisioned, appropriated, and assigned meaning(s) over time. Key themes include, but are not limited to, the cityscape as mirror of the transition from the early modern to the modern eras, construction of spaces, escapism and fantasylands, disaster and reconstruction, and architecture as a source of authority. Previous knowledge of Japanese history and Japanese language skills welcome but not required.)",
    "course_description": "Selected topics in history for advanced students. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Laura Nenzi - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Math & Science Center - W301",
    "course_resources": null,
    "sections": "Class Nbr: 2610, Section #: 7, Type: LEC, Campus: ATL, Meets: TTh 10-11:15a, Instructor: Nenzi/Hansen, Status: Open",
    "date_accessed": "2024-03-30"
}