{
    "course_code": "HIST 377W",
    "course_title": "European Intellectual History/1880",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 1Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "Humanities, Arts, Performance with Writing",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "What is the place of human beings in the modern world? In examining the social, political, technological, and aesthetic changes that have been taken to characterize modernity, and various reactions to them, this discussion-driven course will survey many of the most important intellectual and cultural trends of the past century. Beginning with the promise and threat of both science triumphant and Nietzsche's attacks on false certainties, it will move on to explore decadence, vitalism, the cult of violence, modernism, Communism and fascism, existentialism, feminism, the cultural effects of the two world wars, and the many and varied consequences of the turn to language and representation as the fundamental philosophical problem: structuralism, post-structuralism, deconstructionism, and postmodernity generally.\nAssignments include one short essay (4-5 pp.), two short analysis papers (2 pp. each), and a final research paper (10-12 pp.), plus attendance and active participation.",
    "course_description": "A close reading of primary texts. Topics include reactions to positivism, avant-garde culture, flirtations with communism, existentialism, structuralism, feminism, and postmodernism.",
    "prerequisites": null,
    "instructors": "Brian Vick - Primary Instructor",
    "schedule_location": "MW 4pm-5:15pm in Bowden Hall 116",
    "course_resources": null,
    "sections": "Class Nbr: 3300, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 4-5:15p, Instructor: B. Vick, Status: Open",
    "date_accessed": "2024-03-30"
}