{
    "course_code": "HIST 385",
    "course_title": "Spec Topics: History: Native American Environments",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 24 / Seats Avail: 14Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Same as AMST 385 4)\nInvestigating Indigenous environments and societies of a vast continent before partition by international borders, this hemispheric history spans the land's geological origins through the end of the Little Ice Age during the nineteenth century. This interdisciplinary course introduces students to environmental history and Indigenous political ecology by considering how diverse Native American societies and cultures developed with and co-produced dynamic ecosystems in present-day North America. We will interpret Native American sources with careful attention to original instructions for living on the land, traditional ecological knowledge (TEK), adaptations to climate change, Euro-American ecological imperialism, and the ways ecosystems constituted Indigenous legal systems.\nThis interdisciplinary course welcomes history majors as well as beginners from other academic majors. Final grades will be calculated based on participation and a portfolio project rather than high-stakes exams. Students have no out-of-pocket costs to participate in this class. All required texts and media are available through the Emory University Libraries.",
    "course_description": "Selected topics in history for advanced students. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Loren Michael Mortimer - Primary Instructor",
    "schedule_location": "MW 4pm-5:15pm in Math & Science Center - N304",
    "course_resources": null,
    "sections": "Class Nbr: 2608, Section #: 6, Type: LEC, Campus: ATL, Meets: MW 4-5:15p, Instructor: L. Mortimer, Status: Open",
    "date_accessed": "2024-03-30"
}