{
    "course_code": "HIST 385",
    "course_title": "Spec Topics: History: US Women's History 1800-1900",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 24 / Seats Avail: 22Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Same as AMST 385 3, WGS 385 5)\nThis semester, we will discuss how myths relating to women and gender developed in the early U.S. republic to post-Reconstruction. How were ideas such as the dangerous or hysterical woman, the fragile or virtuous woman, the public woman, the gossip, and the nurturer perpetuated and by whom? What broader purposes regarding political, social, cultural, and economic developments during this time did such ideas serve? Topics include laws and customs that prescribed or criminalized women's activities and behavior; practices in medicine and healing; family, marriage, and sexuality; political and economic activities of different groups of women; women's labor in the context of ideas about race and class; and women's lives across divisions of public vs. private. Our discussions will center primary sources to examine the circumstances in which women of different groups appear in connection with these myths, and we will examine evidence that challenges these myths. Throughout the semester, we will consider what women's history is, how it has been written, and ongoing debates around it. Assignments: short essay (20%), midterm (20%), final (25%), final essay/project (25%), presentation (10%).",
    "course_description": "Selected topics in history for advanced students. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "J.E. Morgan - Primary Instructor",
    "schedule_location": "MW 11:30am-12:45pm in Rich Building 108",
    "course_resources": null,
    "sections": "Class Nbr: 2606, Section #: 5, Type: LEC, Campus: ATL, Meets: MW 11:30a-12:45p, Instructor: J. Morgan, Status: Open",
    "date_accessed": "2024-03-30"
}