{
    "course_code": "HIST 396W",
    "course_title": "Special Topics: Cross-listed: Slavery in the Lands of Islam",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 4 / Seats Avail: 4",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Same as MESAS 370W 2 and AFS 389W 1)\n(Slavery existed in most societies and its eradication from the contemporary world is our challenge and responsibility. This course is targeted at examining and understanding the institution of slavery in Islamic societies. It offers strong foundations to discuss slavery in the two main sources of law in Islam: Qur'an and Sunna. Then it offers a survey of the most important aspects of slavery, including the geographical origins of the slave population, their numbers and demographics in Islamic lands, labor conditions, as well as production and reproduction characteristics. Through a thematic examination, the course presents some of the most distinctive types of slavery that existed in different part of Islamic lands: military slavery, harem slavery, eunuchs, etc. Also this course examines debates on the abolition of the institution of slavery; the colonial context in which it emerged and was imposed; and the way Muslim intellectuals adopted abolitionist ideas. By the end of the semester, the focus will be on the diaspora and the structural inequalities inherited from slavery and perpetuated to these days. It will also touch on the contemporary forms of slavery in the lands of Islam.\nThis course is organized in seminar form in which readings are discussed under the guidance of the instructor. Students are required to meet with the instructor individually during office hours to work on their personal research projects and papers.)",
    "course_description": "Selected topics in history for students in non-history originating (cross-listed) courses. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Yacine Daddi Addoun - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in 1462 Clifton Rd 101",
    "course_resources": null,
    "sections": "Class Nbr: 2986, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 10-11:15a, Instructor: Y. Daddi Addoun, Status: Open",
    "date_accessed": "2024-03-30"
}