{
    "course_code": "HIST 412W",
    "course_title": "Music and Politics",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Continuing Writing Requirement",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "This junior-senior colloquium takes a multidisciplinary approach to music and politics. We will look at many genres, from pop music around the world, to music of protest & resistance, to classical music & opera. The music industry, too, will interest us, such as the marketing of artists & genres. We will start with the contemporary world & move back to the 1780s. We will look at artists like Beyoncé, international genres like KPop, American jazz in Berlin, Latin American protest songs, problematic forms like minstrel shows, and at least one lesbian heroine in Italian opera. We will end with Mozart's Marriage of Figaro. Students can choose a wide range of possible research topics from around the world for their final papers. You do not have to be a musician to take this class. You just have to be willing to open your ears, listen, read, and think.\nRequired texts: Materials online; & Kate Turabian, A Manual for Writers of Research Papers, Theses, and Dissertations, 9th Ed. ISBN-10: 022643057X and ISBN-13: 978-0226430577 \nGrading structure: Class discussion, shorts presentations, lead-in assignments to the History Department's writing-requirement research paper.  \nFulfills the following History Concentrations: Women, Gender, and Sexualitys, Law, Economics and Human Rights, Empires, Nations, and Citizenship, United States History, European History, & General Studies in History.",
    "course_description": "Jr/Sr Colloquium. \nThis course is an interdisciplinary exploration of the connections between music and politics since 1750. Students will write independent research papers on topics of their choosing, using professional formats, strong evidence, and polished prose.",
    "prerequisites": null,
    "instructors": "Judith Miller - Primary Instructor",
    "schedule_location": "W 6pm-8:45pm in Bowden Hall 118",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2604, Section #: 1, Type: SEM, Campus: ATL, Meets: W 6-8:45p, Instructor: J. Miller, Status: Wait List",
    "date_accessed": "2024-03-30"
}