{
    "course_code": "HIST 487RW",
    "course_title": "Jr/Sr Colloquium: Europe: Gender/Sexuality Mod.Jew.Hist.",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 6 / Seats Avail: 6Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "Continuing Writing Requirement",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Same as JS 490RW 1) This seminar will explore gender and sexuality in modern Jewish society and culture, and ask how modernity affected marriage, love, education, and family.  In studying the historical constructions of gender and sexualities in modern Jewish culture from the Enlightenment to contemporary times, we will critically reassess the trope of the Jewish family as the bulwark of tradition against the encroachments of modernity.  We will pair our readings in history and literature with films, a fieldtrip, and discussions of current events.  Topics of study include: the Jewish Enlightenment and critiques of arranged marriages; Jewish nationalism and the feminized Jewish man; sexual politics of Hebrew and Yiddish; dybbuks, cross-dressing, and transgendered dreams in Yiddish fiction; constructing Hasidic femininity; and reproductive agency among Haredi women. Animated by the key questions and themes of the course, students will write a final research paper on a related topic of their choosing.",
    "course_description": "All history majors except those who complete the Honors Program must take two colloquia (HIST 487, 488 or 489). Each colloquium treats a special theme by reading, discussion, and writing of papers. Enrollment in each is limited to twelve; non-majors are welcome within space limitations.",
    "prerequisites": null,
    "instructors": "Ellie Schainker - Primary Instructor",
    "schedule_location": "Th 1pm-3:45pm in Bowden Hall 323",
    "course_resources": null,
    "sections": "Class Nbr: 3291, Section #: 2, Type: SEM, Campus: ATL, Meets: Th 1-3:45p, Instructor: E. Schainker, Status: Open",
    "date_accessed": "2024-03-30"
}