{
    "course_code": "HIST 385W",
    "course_title": "Spec Topics: History: Ukraine: History on the Edge",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 9Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall, Spring, and Summer",
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "(Same as REES 375W 1) This course will focus on the long history of the peoples and lands of Ukraine from the founding of Rus in the Viking Age to its Christianization, fragmentation, conquest and the emergence of the Cossack Hetmanate.  Special attention will be giving to the modern era with a focus on the growth of Ukrainian nationalism, the coming of the Revolution, the crushing of Ukraine's first bid for independence followed by famine, genocide and total war.  The post-war era will also figure prominently as Chernobyl, the second independence movement, post-Soviet impoverishment and Russian invasion will all be discussed. Through the vicissitudes of the centuries of independence, fracture, foreign domination, partition and imperial domination, Ukraine developed a unique identity and strong cultural tradition which was multicultural from the early modern period onward.  This class will also give attention to the emergence of a Ukrainian identity, though often contested, into the 21st century.",
    "course_description": "Selected topics in history for advanced students. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Matthew Payne - Primary Instructor",
    "schedule_location": "TTh 1pm-2:15pm in Rich Building 104",
    "course_resources": null,
    "sections": "Class Nbr: 2614, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 1-2:15p, Instructor: M. Payne, Status: Open",
    "date_accessed": "2024-03-30"
}