{
    "course_code": "HIST 489RW",
    "course_title": "Jr/Sr Coll: LatAm&NonWest Wrld: Indigenous Peoples/Empires",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 14 / Seats Avail: 9Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Continuing Writing Requirement",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "Complete topic title:  Indigenous Peoples and Empires in Latin America\nIn this course you will practice the art of researching and writing history by producing a 20-page major research paper based on original sources. There is no single way to write history; historians take diverse approaches, ask different questions, employ distinct methods, and argue passionately over competing interpretations. This course will provide you with tools to develop your own approach while learning about and adhering to the standards of the historical profession. The content of the class focuses on the histories of Indigenous peoples' interactions with European empires in Latin America from the age of first contact to the Age of Revolution. We will read classic and foundational texts as well as new and innovative scholarship that places Native people at the center of complex relationships with diverse actors in the Atlantic World, including Europeans and Africans, while at the same time considering the methods, theoretical frameworks and politics of these histories.",
    "course_description": "All history majors except those who complete the Honors Program must take two colloquia (HIST 487, 488 or 489). Each colloquium treats a special theme by reading, discussion, and writing of papers. Enrollment in each is limited to twelve; non-majors are welcome within space limitations.",
    "prerequisites": null,
    "instructors": "Samantha Billing - Primary Instructor",
    "schedule_location": "T 2:30pm-5:15pm in Rich Building 211",
    "course_resources": null,
    "sections": "Class Nbr: 3325, Section #: 2, Type: SEM, Campus: ATL, Meets: T 2:30-5:15p, Instructor: Yannakakis/Billing, Status: Open",
    "date_accessed": "2024-03-30"
}