{
    "course_code": "HIST 489RW",
    "course_title": "Jr/Sr Coll: LatAm&NonWest Wrld: Japan & the West 1543-1893",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 6Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Continuing Writing Requirement",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "This class examines the encounters between Japan and the West (defined broadly as Europe and North America) in the years between 1543 and 1893. The first date indicates Japan's initial contact with the Portuguese; the second refers to Japan's participation in the Columbian Exposition in Chicago. Tucked between these two moments are many types of encounters: the proselytizing efforts of the Jesuits during the Christian century, the commercial and intellectual exchanges with the Dutch, the encounters with the United States in the 1850s and 1860s, the Meiji era \"Westernization\" project, embassies and other forms of diplomatic and non-diplomatic encounters, the spread of Japonisme in the art circles of nineteenth-century Europe, and more. In the first weeks of the semester the instructor will provide a general overview and a selection of appropriate readings. Each student will then choose a manageable topic and produce an original historical research paper that falls within the thematic and chronological boundaries of the class. Topics may include, but are not limited to: art, food, diplomacy, material culture, religion, the role of Nagasaki, Yokohama, resistance to foreign encroachment, curiosity, identity and the Other, scientific exchanges, the issue of isolation, etc. Previous knowledge of Japanese history and/or Japanese language skills are welcome but not required.",
    "course_description": "All history majors except those who complete the Honors Program must take two colloquia (HIST 487, 488 or 489). Each colloquium treats a special theme by reading, discussion, and writing of papers. Enrollment in each is limited to twelve; non-majors are welcome within space limitations.",
    "prerequisites": null,
    "instructors": "Laura Nenzi - Primary Instructor",
    "schedule_location": "W 1pm-3:45pm in Emerson Chemistry Bldg. E504",
    "course_resources": null,
    "sections": "Class Nbr: 2611, Section #: 1, Type: SEM, Campus: ATL, Meets: W 1-3:45p, Instructor: L. Nenzi, Status: Open",
    "date_accessed": "2024-03-30"
}