{
    "course_code": "HIST 488RW",
    "course_title": "Jr./Sr. Colloquium: U.S.: Racial Violence in Mod.America",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 12 / Seats Avail: 3Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Continuing Writing Requirement",
    "permission": null,
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "Racial violence has shaped Americans' perceptions of themselves and their country's history since settlement. After the Civil War, the end of slavery and struggles over citizenship transformed the scope and the stakes of that violence. From the anti-lynching movement of the earlier twentieth century to the backlash against church bombings in the civil rights era, violence has inspired everyday Americans to join the very campaigns that racial terrorists intended to crush. Indeed, Americans have often cited incidents of racial violence as catalysts for progressive social movements and legislative reform. But racial violence has just as often retarded social progress and discouraged many from admitting or examining this painful part of our nation's history. The readings and discussions in this class will take a broad, comparative approach by examining how violence has affected various racial and ethnic groups. The seminar will also explore how the memory and portrayal of racial violence in historical scholarship and popular media has changed over time. Class time will be devoted not only to discussing assigned readings and designated themes, but also to discussing the best practices of historical research and writing from strategic reading and note-taking to narrative strategy. By the end of the semester, each student will produce a work of original scholarship that engages with the intertwined themes of race and violence in modern America.",
    "course_description": "All history majors except those who complete the Honors Program must take two colloquia (HIST 487, 488 or 489). Each colloquium treats a special theme by reading, discussion, and writing of papers. Enrollment in each is limited to twelve; non-majors are welcome within space limitations.",
    "prerequisites": null,
    "instructors": "Jason Ward - Primary Instructor",
    "schedule_location": "T 1pm-3:45pm in Bowden Hall 323",
    "course_resources": null,
    "sections": "Class Nbr: 3305, Section #: 3, Type: SEM, Campus: ATL, Meets: T 1-3:45p, Instructor: J. Ward, Status: Open",
    "date_accessed": "2024-03-30"
}