{
    "course_code": "HIST 495BW",
    "course_title": "Intro Historical Interpretation II",
    "credit_hours": "1-8",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Varies by section",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Continuing Writing Requirement",
    "permission": "Department Consent Required",
    "dates": "2023-01-10 through 2023-04-24",
    "class_notes": "Varies by section",
    "course_description": "For honors students in history. Addresses historiographical and methodological issues, and offers practical guidance in thesis design and research, with details and emphases at discretion of instructor.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": null,
    "course_resources": null,
    "sections": "Class Nbr: This section is full 3338, Section #: 1, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: P. Allitt, Status: Closed\nClass Nbr: This section is full 5789, Section #: 10, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: M. Payne, Status: Closed\nClass Nbr: This section is full 5790, Section #: 11, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Prude, Status: Closed\nClass Nbr: This section is full 5791, Section #: 12, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: T. Sasson, Status: Closed\nClass Nbr: This section is full 5792, Section #: 13, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: C. Suh, Status: Closed\nClass Nbr: This section is full 5793, Section #: 2, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: S. Ashmore, Status: Closed\nClass Nbr: This section is full 5794, Section #: 3, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: C. Crais, Status: Closed\nClass Nbr: This section is full 5795, Section #: 4, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: D. LaChance, Status: Closed\nClass Nbr: 5796, Section #: 5, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: R. Margariti, Status: Open\nClass Nbr: This section is full 5797, Section #: 6, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Miller, Status: Closed\nClass Nbr: This section is full 5798, Section #: 7, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: J. Ward, Status: Closed\nClass Nbr: This section is full 5799, Section #: 8, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: L. Nenzi, Status: Closed\nClass Nbr: This section is full 5800, Section #: 9, Type: SUP, Campus: ATL, Meets: Does Not Meet, Instructor: C. Patterson, Status: Closed",
    "date_accessed": "2024-03-30"
}