{
    "course_code": "MDP 506",
    "course_title": "Research Methods I",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 5",
    "waitlist_total": null,
    "grading_mode": "Graded",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2021-08-31 through 2021-12-07",
    "class_notes": null,
    "course_description": "Development professionals regularly incorporate different elements of scientific inquiry into their practice. They have also developed new approaches that are specifically adapted to the demands of development planning and practice. While some of these emphasize statistical methods and experimental designs, many development research approaches are grounded in participatory and qualitative research methods that allow for (and aim to elucidate) the multiple interpretations of social reality that make development work in cross-cultural settings so very complicated. These qualitative and participatory research methods are characterized by flexible and adaptive research design; an emphasis on the conceptual and interpretive frameworks of research participants rather than those of the researcher; and continued and strong reflection by the researcher on his or her own influence on the production of data. The first semester of this two-course sequence covers qualitative research design and methods in development work through discussion of different approaches to research, examination of qualitative research studies, and the design of a study and data collection through a group research project. Students consider the role of inquiry in development work and discuss the particular strengths (and weaknesses) of different types of research for development practice. They gain applied skills in qualitative research design, document analysis, stakeholder analysis, visual methods, participant-observation, individual interviewing, focus group interviewing, writing fieldnotes, the evaluation of qualitative research studies, and professional writing. In addition, the course considers a number of thematic issues: ethics in development and research, rigor and validity, researcher subjectivity, power and representation, fieldwork, and the integration of qualitative and quantitative data in development.",
    "prerequisites": null,
    "instructors": "Carrie Furman - Primary Instructor",
    "schedule_location": "T 12:30pm-3:30pm in 1462 Clifton Rd 126",
    "course_resources": null,
    "sections": "Class Nbr: 5373, Section #: 1, Type: LEC, Campus: ATL, Meets: T 12:30-3:30p, Instructor: C. Furman, Status: Open",
    "date_accessed": "2024-03-30"
}