{
    "course_code": "BSHES 560R",
    "course_title": "BSHE Seminar: Addressing Racism as PH Issue",
    "credit_hours": "2",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2021-01-25 through 2021-05-05",
    "class_notes": "BSHES Seminar Topic: Addressing Racism as a Public Health Issue to Promote Health Equity.\nBSHES students have priority until 11/23/20, then non-department students can enroll. This course provides an overview of racism as a driver of health inequities and interventions designed to dismantle racism to promote health equity. Racism causes harm at multiple ecological levels from the individual level (e.g., internalized racism) to the systemic level (e.g., oppressive and unjust policies and practices). This course will introduce students to how racism operates at multiple ecological levels to create and maintain health inequities and proposed interventions (programs and policies) to promote health equity. Through a combination of readings, lectures, exercises, discussions and guest lectures, students will gain an understanding of racism as a public health issue and interventions designed to promote health equity by dismantling racism. Students will develop a comprehensive proposal informed by empirical evidence to promote health equity.",
    "course_description": "Explores and analyzes selected topics in health education and promotion. Topics have included: grant proposal writing, global program planning, health advocacy, and global health education.",
    "prerequisites": null,
    "instructors": "Briana Woods-Jaeger - Primary Instructor",
    "schedule_location": "T 3:15pm-5:05pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 4480, Section #: 1, Type: SEM, Campus: ATL, Meets: T 3:15-5:05p, Instructor: Team, Status: Closed",
    "date_accessed": "2024-03-30"
}