{
    "course_code": "IDS_OX 290R",
    "course_title": "Interdisciplinary Sidecar: The Invention of Nature",
    "credit_hours": "1",
    "seats": "Seats: Maximum Enrollment: 10 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Satisfactory/Unsatisfactory",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": null,
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "The Invention of Nature: Alexander von Humboldt's Perspective on our Modern Conception of Nature.\nENVS 131 introduces students to the scientific study of that natural world, as well as the physical, social, political, and economic causes of environmental problems, and the strategies to mitigate or manage these issues. In German 201, students explore three topics on issues of today in the German-speaking world related to the environment: animals, environmentalism, and renewable energy. The core of both courses comes from the environmental perspective we share today that began with Alexander von Humboldt, one of the first western environmentalists.  Over 200 years ago, von Humboldt warned that humans had the  power to disrupt the delicate balance of nature, a radical concept at the time and yet, still a concept that modern scientists are trying to convince people to be true. The contributions of this side-car course would allow students to gain a historical perspective of where the idea of the interrelatedness of nature came from and how Humboldt's ideas permeate our modern conception of nature.",
    "course_description": "A side-car course brings together a subset of students from two courses that overlap in methodologies, topics, etc., to create a short interdisciplinary course that runs simultaneously with its two sponsoring courses. One credit, S/U only. Schedule and format arranged by sponsoring professors.",
    "prerequisites": null,
    "instructors": "Melissa Hage - Primary Instructor",
    "schedule_location": "W 4pm-4:50pm in Pierce Hall 238",
    "course_resources": null,
    "sections": "Class Nbr: 6016, Section #: 1, Type: SEM, Campus: OXF, Meets: W 4-4:50p, Instructor: Hage/Walter, Status: Open",
    "date_accessed": "2024-03-30"
}