{
    "course_code": "GER 201",
    "course_title": "Intermediate German I",
    "credit_hours": "4",
    "seats": "Seats: Varies by section",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall",
    "requirement_designation": "Humanities, Arts, Language [Foreign Language]",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "Entitled \"Coming of age through the ages,\" German 201 is the first of a two-course sequence that moves students from the focus on personal identity in first-year German to an examination of how young adults have come of age over time in the German-speaking world. Following a thematically-based approach to language instruction, this course explores how different societal factors affected German-speaking youth's coming of age in the 18th and 19th centuries and draws comparisons with comings of age in English language cultures. Specifically, the following themes as they pertain to coming of age will be studied in German 201: - Family (conformity to or rebellion against family order) - Nature (nature as a hindrance or ally for maturation) - Travel (gaining self-knowledge through travel) Through this focus on coming of age in 18th and 19th-century German cultural history, students will build on the foundation established in first-year German and develop further their abilities as readers, writers, and speakers of German. In this course (201) and in its sequel (202), that examines coming of age in the 20th and 21st century German speaking world, students will use supplemental texts and a grammar review textbook to acquire the language necessary to communicate meaningfully about the topic of coming of age.",
    "course_description": "Fall, Summer (Vienna). The first of the two-course sequence (201-202) that explores how different societal factors have affected German-speaking young adults' coming of age and draws comparisons with English language cultures. Continued focus on development of students' German language abilities.",
    "prerequisites": null,
    "instructors": null,
    "schedule_location": "Varies by section",
    "course_resources": null,
    "sections": "Class Nbr: 1047, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 1-2:15p; F 1-1:50p, Instructor: C. Schaumann, Status: Open\nClass Nbr: 3283, Section #: 2, Type: SEM, Campus: ATL, Meets: TTh 11:30a-12:45p; F 11:30a-12:20p, Instructor: P. Buchholz, Status: Open",
    "date_accessed": "2024-03-30"
}