{
    "course_code": "GER 470",
    "course_title": "Topics in German Culture and Civilization: Green Germany",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 18 / Seats Avail: 5",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures",
    "permission": null,
    "dates": "2022-08-24 through 2022-12-06",
    "class_notes": "Course Title: Green Germany.\nClass will meet in Candler Library 216.\n\n\nCourse description: This upper-level course conducted in German examines the history and impact of environmental awareness on German culture, society, and politics. The course consists of three thematic units: \n1.\tDie Natur im deutschen Bewußtsein: an exploration of the roots of German environmental consciousness by examining the portrayal of nature in select texts from the 18th to 20th century; \n2.\tUmweltschutz in der BRD und der DDR: 1950-2010: a chronological exploration of key developments in ecological awareness in both West and East Germany; \n3.\tGlobale und lokale Initiativen gegen den Klimawandel: a contemporary examination of current measures being undertaken to combat climate change, with a focus on both global initiatives (e.g., Paris Accords) and local efforts at the university and in Atlanta.\nFor the third thematic unit, students will engage in weekly synchronous telecollaborative meetings with university students in Bavaria, Germany to discuss and compare local environmental initiatives (not) being undertaken at the respective institutions and municipalities to address climate change and environmental injustice. These practices will also be discussed in terms of their reflection of larger cultural, societal, and political norms. This telecollaborative engagement will culminate in an online project to highlight both eco-friendly features of the respective localities as well as areas in need of environmental attention.\n\n\nTexts: \n-\tRequired course materials will be available via Canvas\n-\tAuf den Punkt Gebracht: Deutscher Lernwortschatz Zur Textarbeit. (2013). Klett Verlag. ISBN 978-3125195677\n-\tStudents should own a good reference grammar book (e.g., Rankin & Wells).\n\n\nAssessment:\nPreparation and participation 25%\nOral presentations 15%\nWriting tasks 35%\nCollaborative curation of online project 25%\n\n\nPrerequisites:  Two German courses numbered 300 or higher or its equivalent or permission of instructor.",
    "course_description": "An interdisciplinary course intended to provide a comprehensive, historically oriented overview of the formative elements, influences, and movements of German culture and civilization. Taught in German.",
    "prerequisites": null,
    "instructors": "Hiram Maxim - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am",
    "course_resources": null,
    "sections": "Class Nbr: 3291, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 10-11:15a, Instructor: H. Maxim, Status: Open",
    "date_accessed": "2024-03-30"
}