{
    "course_code": "ARTHIST 241",
    "course_title": "Northern Renaissance Art",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 30 / Seats Avail: 30Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "Humanities and Arts(*)",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "The course examines innovations in painting, sculpture, and printmaking of the Low Countries and Southern Germany between 1400 and 1600, focusing on masters such as Jan van Eyck, Rogier van der Weyden, Dieric Bouts, Hugo van der Goes, Gerard David, Albrecht Dürer, Matthias Grünewald, Hans Holbein, Hieronymus Bosch, Joachim Patinir, Jan Gossaert, Joos van Cleve, Pieter Aertsen, and Pieter Bruegel.  We shall address the following topics: the development of canons of verisimilar imitation, and specifically of the notion that painting as a mirror of nature, in the new medium of oil-based pigment; the devotional functions of pictorial images, in particular their use as instruments of soul formation and as meditators between corporeal and spiritual sight; the hermeneutics of viewing, that is, the ways in which pictures structure processes of interpretation - heuristic, exegetical, paraphrastic, etc.; the rise of new pictorial genres, such as the so-called world landscape, the market scene, and the peasant festivity; and differences in the manner and meaning of art in the Low Countries and Germany before and after the Reformation.\nArt History major/minor: Division II",
    "course_description": "Innovations in painting and sculpture of Germany and the Low Countries between 1400 and 1600; emphasis on methods of verisimilar imitation, on art as an instrument of soul formation, on the rise of new pictorial genres.",
    "prerequisites": null,
    "instructors": "Walter S Melion - Primary Instructor",
    "schedule_location": "MW 10am-11:15am in Math & Science Center - W301",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ARTHIST_241_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3126, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 10-11:15a, Instructor: W. Melion, Status: Open",
    "date_accessed": "2024-03-28"
}