{
    "course_code": "ARTHIST 266",
    "course_title": "Contemporary Europe and America",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 30 / Seats Avail: 30Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities and Arts(*)",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "\"European and American Art since 1945\"This course provides a critical survey of the major movements, paradigms, and documents of European and American art after World War II. Special attention will be given to crucial problems like the relation of art to politics; art's response to mass media and technologies, consumer culture, and globalization; and the redefinition of artistic means. More broadly, we will study fundamental tools for examining works of art formally, historically, and critically. The course is not intended as a comprehensive survey of art after 1945; rather, it will address the complex set of aesthetic, philosophical, and political motivations that shaped the artistic production of select figures and movements, including Abstract Expressionism, Pop Art, Minimalism, Institution Critique, and Performance Art. \nArt History major/minor: Division III",
    "course_description": "Focused survey of avant-garde developments in the visual arts from 1945 to the present, ranging from painting and sculpture to performance and installation. Emphasis will be placed on the critical concepts and the aesthetic, social, and historical implications of these cultural activities.",
    "prerequisites": null,
    "instructors": "Lisa Lee - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Tarbutton Hall 105",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ARTHIST_266_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3127, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 10-11:15a, Instructor: L. Lee, Status: Open",
    "date_accessed": "2024-03-28"
}