{
    "course_code": "ARTHIST 329",
    "course_title": "Topics: Art of Class Antiquity: Ligorio: Reconstructing Rome",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 15 / Seats Avail: 15Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "(Same as CL 329R 2)\n(Complete Topic - Ligorio: Reconstructing Rome in the Renaissance)\n(Class meets in the Rose Library.)\n\n\nIn 1561, the Renaissance artist, antiquarian and archaeologist, Pirro Ligorio, published his reconstruction of ancient Rome, the Anteiquae Urbis Imago.  Ligorio, one of the leading figures in 16th century Roman humanism, based his reconstruction on a close scrutiny of surviving monuments, like the Colosseum or the Pantheon, but also on evidence from ancient coins, texts and inscriptions.   In addition, Ligorio  had access to much archaeological material that is now lost. Emory owns a very rare edition of Ligorio's map, now housed in the Rose Manuscript, Archives and Rare Book Library.   This course will consider the history and topography of the ancient city and investigate individual monuments featured on the map and compare Ligorio's reconstructions and the evidence he was using with current scholarly assessments. We will also be exploring related materials in the rare book library including Giovanni Battista Piranesi's Le Antichitá Romane.  We will be working closely with ECDS on our digital platform \"Views of Rome\" and students will be developing new entries for or the digitized  map.\nArt History major/minor: Division I",
    "course_description": "Topics could include ancient sanctuaries; early Greece: real and imagined and religious festivals; myth and art in ancient Greece; and Greek architecture. May be repeated for credit when topic changes, up to a maximum of twelve hours.",
    "prerequisites": null,
    "instructors": "Eric Varner - Primary Instructor",
    "schedule_location": "MW 1pm-2:15pm",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ARTHIST_329_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3131, Section #: 1, Type: LEC, Campus: ATL, Meets: MW 1-2:15p, Instructor: E. Varner, Status: Open",
    "date_accessed": "2024-03-28"
}