{
    "course_code": "ARTHIST 369R",
    "course_title": "Spec Stud:19th/20th Cent Art: Problems in French Painting",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 25 / Seats Avail: 25Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "\"Problems in French Painting from Morisot to Matisse\"This course will focus on avant-garde art in Paris through the First World War, with a special focus on the highly influential work of Paul Cezanne, Henri Matisse, and Pablo Picasso. Understanding the avant-garde will require intensive treatment of certain core concerns' key works, moments of decisive change, dominant individuals, collective movements. Our aim will be to understand the violent and seemingly irreversible shift in the nature of art-making we associate with the achievement of Cezanne and the struggle to lay claim to his art, Matisse's place in the avant-garde world, the Cubism of Picasso and Braque and a range of practices around the invention of cubist collage. We will further address artists that inhabit the larger avant-garde of the moment including the work of Pierre Bonnard and Suzanne Valadon.\nArt History major/minor: Division III",
    "course_description": "Possible topics include Post-Impressionism and its consequences; Matisse &amp; Picasso; Art and Politics between the Wars; Dada and Surrealism; the Avant-Garde; Abstract Art; What is Art?; Theories of Modernism. May be repeated for credit when topic changes, up to a maximum of twelve hours.",
    "prerequisites": null,
    "instructors": "Todd S Cronan - Primary Instructor",
    "schedule_location": "TTh 11:30am-12:45pm in Callaway Center C101",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ARTHIST_369R_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3133, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 11:30a-12:45p, Instructor: T. Cronan, Status: Open",
    "date_accessed": "2024-03-28"
}