{
    "course_code": "ARTHIST 282",
    "course_title": "Introduction to African Art & Museums",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 20Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Spring",
    "requirement_designation": "Humanities and Arts(*)",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "(Same as AFS 282 1)\n\n\nIn this course, we will look at and think about objects attributed to artists, patrons, or audiences from the African continent with a focus on works historically linked to West Africa. We will consider what evidence exists to study the objects as well as the trajectories of certain works into collections on or beyond the African continent. We will also think about practicalities and ethics related to the handling and display of objects from Africa in European and North American museums.\nThe course is designed for any student eager to think in careful and nuanced ways about art and knowledge about art within global contexts. It features creative assignments and analytical writing. The course also relies on students' attentive listening, engaged discussion, and mutual respect; it is not a lecture course. The course features a wellness pause and sustained attention to wellbeing. No prior knowledge of the African continent or African arts is necessary; all you need is your curiosity and commitment to completing coursework.\nArt History major/minor: Division III or IV\nArt History major with Museums Concentration: core requirement",
    "course_description": "This course focuses on arts linked to the African continent as well as operations of museums. It examines how objects enter museum collections and what information accompanies objects when they arrive at museums. The course does not require previous study of Africa, African arts, or museums.",
    "prerequisites": null,
    "instructors": "Susan Elizabeth Gagliardi - Primary Instructor",
    "schedule_location": "TTh 4pm-5:15pm in Math & Science Center - N306",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ARTHIST_282_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3130, Section #: 1, Type: LEC, Campus: ATL, Meets: TTh 4-5:15p, Instructor: Gagliardi/Nihinlola, Status: Open",
    "date_accessed": "2024-03-28"
}