{
    "course_code": "ARTHIST 729",
    "course_title": "Seminar: Classical Art/Architect.: Imago Urbis",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 4 / Seats Avail: 4",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "Imago Urbis: Representations of the Eternal City\nThe earliest surviving map of Rome was monumental and made in marble at the beginning of the third century, the first of a rich and varied succession of images of the city that would appear over the following thirteen centuries. The early modern maps of Bufalini, Ligorio, Maggi, Tempesta, Falda and Nolli, to name a few, were made on paper at a large scale and in multiple plates and constitute a precious record of the understanding of the ancient city and the rapid evolution of the modern city that followed. Working with original editions held by the Rose Library, with facsimiles issued by the Vatican Library, and with digital/archaeological reconstructions, this seminar will consider mapmaking in Italy and the changing constructions of the imago urbis. Among the issues we will consider: methods for mapmaking, surveying, tools and technology; ichnographic plans and bird's eye views; the topography and urban development of the city; ancient roads, monuments, and early modern pilgrimage routes; orchestrated viewing: the relationship of maps to guidebooks and to the tradition of the vedute or pictorial city views.",
    "course_description": "Advanced seminar on classical art and/or architecture of the with emphasis on critical texts, methods, and techniques of art historical investigation. For art history majors; open to others with permission from the instructor.",
    "prerequisites": null,
    "instructors": "Sarah C. McPhee - Primary Instructor",
    "schedule_location": "T 10am-12:45pm in Woodruff Library TBA",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ARTHIST_729_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3630, Section #: 1, Type: SEM, Campus: ATL, Meets: T 10a-12:45p, Instructor: Varner/McPhee, Status: Open",
    "date_accessed": "2024-03-28"
}