{
    "course_code": "ARTHIST 485RW",
    "course_title": "Seminar in the Art of the Ancient Americas, Africa, the African Diaspora, Islam and Asia: Greek, Maya, and Moche Pottery",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 8 / Seats Avail: 8Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "(CompleteTopic - Picture Worlds: Greek, Maya, and Moche Pottery)\n\n\nThis seminar focuses on Picture Worlds: Greek, Maya, and Moche Pottery, the exhibition on view at the Carlos Museum in Fall 2024. By juxtaposing Greek, Maya, and Moche traditions, the exhibition invites conversation about the ways in which three unrelated cultures visualized their society, myths, and cosmos through their pottery and used painted ceramic vessels in storytelling and social engagement. The seminar will explore the vessels, their narrative scenes, and the social contexts in which they were made and used. The seminar also will address the complexities of organizing an exhibition involving major international loans and models for collaboration and consultation in exhibition development and execution. For their research projects, students will study individual pieces and questions of historiography, or the modern histories of ancient ceramics.\nThis is an upper-level, writing-intensive seminar designed for students who have some experience with art history, typically having taken courses at the 200 or 300 level.\nArt History major/minor: Division IV",
    "course_description": "Advanced seminar with emphasis on critical texts, methods, and techniques of art historical investigation. For art history majors; open to others with permission from the instructor.",
    "prerequisites": null,
    "instructors": "Megan O'Neil - Primary Instructor",
    "schedule_location": "T 1pm-3:45pm in Registrar Room Pool",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ARTHIST_485RW_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 3138, Section #: 1, Type: SEM, Campus: ATL, Meets: T 1-3:45p, Instructor: M. O'Neil, Status: Open",
    "date_accessed": "2024-03-28"
}