{
    "course_code": "ARTHIST 592",
    "course_title": "Special Studies: Decolonial Pedagogy &Practice",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 1 / Seats Avail: 1",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2024-08-28 through 2024-12-10",
    "class_notes": "(Same as AAS 585R 1 and ENG 789 4)\n(This is a graduate seminar drawing on methodologies from various disciplines to identify and demonstrate decolonial pedagogical practices.  Seminar students will be from Emory University and Clark-Atlanta University, and will meet at various times on both campuses.  A central text for this course is the decolonial symposium hosted by Emory University and co-hosted by Clark-Atlanta University during the same semester, where students will dynamically engage with seminar fellows in art, literature, anthropology, philosophy and Black spiritual work.  Students in this seminar will study seminal texts as well as new decolonial materials presented to them in the form of lectures, working papers, workshops and art exhibits; and as such, students will be expected to meet outside of the listed seminar schedule.  Course work will include creating lesson plans, executing lesson plans by teaching to Emory undergraduates, and refining lesson plans for possible publication.  Students will write and be able to articulate a robust and dynamic pedagogy statement with theoretical foundation and practical application.)\nTo seek permission to enroll, please contact Dr. Yanique via email at tiphanie.yanique@emory.edu.",
    "course_description": "Advanced seminars dealing with various specialized problems in the history of art from antiquity to modern times, such as individual artists, genres (e.g. portraiture, landscape); themes (e.g. theory, iconography); artistic movements and museum studies. May be repeated for credit when topic varies.",
    "prerequisites": null,
    "instructors": "Tiphanie Yanique - Primary Instructor",
    "schedule_location": "W 2:30pm-5:30pm in Candler Library 212",
    "course_resources": "https://emory.bncollege.com/course-material-listing-page?utm_campaign=storeId=65062_langId=-1_courseData=BN%20at%20Emory_ARTHIST_592_1_F24&utm_source=wcs&utm_medium=registration_integration",
    "sections": "Class Nbr: 5337, Section #: 1, Type: LEC, Campus: ATL, Meets: W 2:30-5:30p, Instructor: T. Yanique, Status: Open",
    "date_accessed": "2024-03-28"
}