{
    "course_code": "ARTHIST 335",
    "course_title": "Spec Stud: Ancient Amer. Art History",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 20 / Seats Avail: 6Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "\"Tenochtitlan and the City of Mexico\"This course studies Tenochtitlan, the capital of the Mexica (Aztec) empire, and the transformation of Tenochtitlan into the City of Mexico after the Spanish invasion in the 16th century. We will begin with an examination of Aztec architecture in relation to ritual performances, imperial display, and offerings to deities. We also will examine textual and pictorial depictions of the Spanish invasion, both in Mexica and European sources. In addition, we will study how Tenochtitlan physically changed over time, including the Spaniards, razing of the Great Temple and associated buildings and the transformation of Tenochtitlan's ceremonial center into a Christian space and Spanish viceregal administrative center. Furthermore, we will examine both how Spaniards attempted to erase the Mexica past and how traces of this past remained in or were returned to public view at various moments in time. The timing for this class is intentional, for the year 2021 marks 500 years since the fall of the Mexica empire on August 13, 1521. In addition to studying the art and architecture of Tenochtitlan and the City of Mexico, our class will reflect on this historical event and its ramifications in the world today.",
    "course_description": "Topics include textiles of the Americas; sculpture and museology; Aztec and Inka art; art and shamanism. May be repeated for credit when topic changes, up to a maximum of twelve hours.",
    "prerequisites": null,
    "instructors": "Megan O'Neil - Primary Instructor",
    "schedule_location": "MW 11:20am-12:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 2796, Section #: 1, Type: SEM, Campus: ATL, Meets: MW 11:20a-12:35p, Instructor: O'Neil/Zigomalas, Status: Open",
    "date_accessed": "2024-03-30"
}