{
    "course_code": "ARTHIST 485RW",
    "course_title": "Seminar in the Art of the Ancient Americas, Africa, the African Diaspora, Islam and Asia: Lives Obj. Ancient Mesoamerica",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 7 / Seats Avail: 3Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "Distance Learning",
    "typically_offered": "Fall and Spring",
    "requirement_designation": "History, Society, Cultures with Writing",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "This seminar delves into the material meanings of objects and humans; interactions and experiences with them, exploring the agency of both humans and objects. We explore how humans interact with objects and how objects guide or inspire human experience. We also examine how objects can change, considering possibilities of their life histories as they persist through time and through varying histories of use and reception. The seminar will focus on select cultures in ancient Mesoamerica, but the readings also will address other places in the world in order to offer other theoretical contributions to the seminar's themes. \n \nThis is a combined upper-division undergraduate seminar and graduate seminar. The class will meet weekly for one session and will have asynchronous reading and writing assignments. \nArt History major/minor: Division IV",
    "course_description": "Advanced seminar with emphasis on critical texts, methods, and techniques of art historical investigation. For art history majors; open to others with permission from the instructor.",
    "prerequisites": null,
    "instructors": "Megan O'Neil - Primary Instructor",
    "schedule_location": "M 4:20pm-7:15pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: 2803, Section #: 1, Type: LEC, Campus: ATL, Meets: M 4:20-7:15p, Instructor: M. O'Neil, Status: Open",
    "date_accessed": "2024-03-30"
}