{
    "course_code": "ARTHIST 319R",
    "course_title": "Spec Stud:Ancient Egyptian Art: Ancient Egyptian Hieroglyphs",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 24 / Seats Avail: 0Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "Distance Learning",
    "typically_offered": "Spring",
    "requirement_designation": "Humanities, Arts, Performance",
    "permission": null,
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "Ancient Egyptian hieroglyphs were in use for well over three thousand years, offering the modern observer a unique window into the thoughts of the ancient Egyptians. Hieroglyphic signs often double as elements of iconography in Egyptian art, and many works of sculpture, relief, and painting contain regular inscriptions that can aid in the interpretation and appreciation of the artworks, from brief identifications of people, things, and actions to lengthy narratives or ritual recitations. This course offers an introduction to the hieroglyphic writing system and the Middle Egyptian language in which most inscriptions are composed, drawing on textbook lessons and exercises as well as practical studies of inscribed objects from the Michael C. Carlos Museum.\nArt History major/minor: Division I\nThis course will meet one day synchronously and will have asynchronous assignments.",
    "course_description": "Topics could include the treasures of Tutankhamun; images of women in Egyptian art; and the art of New Kingdom Egypt. May be repeated for credit when topic changes, up to a maximum of twelve hours.",
    "prerequisites": null,
    "instructors": "Rune Nyord - Primary Instructor",
    "schedule_location": "W 2:40pm-3:55pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2795, Section #: 1, Type: LEC, Campus: ATL, Meets: W 2:40-3:55p, Instructor: R. Nyord, Status: Wait List",
    "date_accessed": "2024-03-30"
}