{
    "course_code": "ARTHIST 749R",
    "course_title": "Seminar:Renaissance Art/Archit: Virtues&Vices Art Pre-Mod.Eur.",
    "credit_hours": "3",
    "seats": "Seats: Maximum Enrollment: 4 / Seats Avail: 0",
    "waitlist_total": null,
    "grading_mode": "Student Option",
    "enrollment_status": "Closed",
    "instruction_method": "Distance Learning",
    "typically_offered": null,
    "requirement_designation": null,
    "permission": "Department Consent Required",
    "dates": "2021-01-25 through 2021-05-03",
    "class_notes": "\"Embodiments of the virtues and vices in the art of pre-modern Europe\"Depictions of virtue and vice are among the most sensitive indicators of changing societal values. They also tap the imaginative resources of the painters and sculptors who make them, and of the beholders who are charged in their presence with negotiating the shifting territory between good and bad. Beginning within the tradition of imagery associated with the late antique author Prudentius and his Psychomachia (Battle of the Virtues and Vices), the course will proceed to investigate cycles of the virtues and vices as they appear in other famous instances: the prominent sculptural reliefs in the Gothic cathedrals of Notre-Dame of Paris and Amiens, the great teaching book for nuns known as the Hortus Deliciarum, the richly illuminated manuscripts of the Roman de la Rose, Giotto's innovative frescoes in the Arena Chapel, and Andrea Mantegna's deeply humanist cabinet paintings for Isabella d'Este. Questions of when certain vices came into prominence, why the kinds and numbers of virtues and vices never became fixed, and how male and female personifications operated are central to this course.  Students interested in questions of virtue and vice (and who isn't?) from all disciplines and periods are welcome; while the core readings will largely concern the pre-modern period in Europe, students are encouraged to pursue case studies drawn from their interests.",
    "course_description": "Advanced seminar on Renaissance art and/or architecture with emphasis on critical texts, methods, and techniques of art historical investigation. For art history majors; open to others with permission from the instructor.",
    "prerequisites": null,
    "instructors": "C Jean Campbell - Primary Instructor",
    "schedule_location": "W 9:40am-12:35pm in ONLINE",
    "course_resources": null,
    "sections": "Class Nbr: This section is full 2821, Section #: 1, Type: SEM, Campus: ATL, Meets: W 9:40a-12:35p, Instructor: Campbell/Pastan, Status: Closed",
    "date_accessed": "2024-03-30"
}