{
    "course_code": "LACS 460W",
    "course_title": "Race and Nation in Latin America",
    "credit_hours": "4",
    "seats": "Seats: Maximum Enrollment: 4 / Seats Avail: 3Waitlist Total: 0",
    "waitlist_total": ": 0",
    "grading_mode": "Student Option",
    "enrollment_status": "Open",
    "instruction_method": "In Person",
    "typically_offered": null,
    "requirement_designation": "WRT w/Race & Ethnicity Req.",
    "permission": null,
    "dates": "2021-08-25 through 2021-12-07",
    "class_notes": "(Same as HIST 460W 1)\nThis course focuses on the complexities of race and ethnicity in modern Latin America. These countries secured their independence early in the 19th century, at the same time that modern notions of race emerged and circulated. How did the new states navigate questions of identity? How did race and its links to citizenship change over time? Using specific case studies to guide us, we will examine racial configurations and the persistence of race- and ethnic-based hierarchies. We will pay particular attention to Mexico, Colombia, Brazil, and Argentina, but the course seeks to engage these questions on a region-wide basis. We will identify the importance of African slavery, the legacies of the Spanish colonial caste system, and other influences on modern Latin American understandings of race. We will also track contemporary social movements attempting to challenge and undo common assumptions about color, race, and ethnicity. Fulfilling the writing requirement, the course focuses on developing written expression; a research paper is required.",
    "course_description": "Jr/Sr Colloquium. \nUsing in-depth case studies to guide us, we will unravel puzzles about race, ethnicity, and national identity in Latin America. They revolve around the central question: how have particular configurations of racial and ethnic hierarchy emerged in these countries?",
    "prerequisites": null,
    "instructors": "Thomas Rogers - Primary Instructor",
    "schedule_location": "TTh 10am-11:15am in Callaway Center S104",
    "course_resources": null,
    "sections": "Class Nbr: 4332, Section #: 1, Type: SEM, Campus: ATL, Meets: TTh 10-11:15a, Instructor: T. Rogers, Status: Open",
    "date_accessed": "2024-03-30"
}